{
  "recording_id": "2993979485037",
  "job_id": "a9d9019f-fea7-4bd2-a683-37db26899001",
  "status": "completed",
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID. Enter your participant ID followed by pound. Otherwise, just press pound. You are in the meeting now. There are three participants in the meeting. This meeting is being recorded. Good afternoon. This is Jim. Hi, Jim. Hey, Eric. How are you? I'm doing well. Okay. Thanks for joining me today. I wanted to kind of show you around the PCRM a little bit, talk about some of the new functionality that is included in that. I'm gonna kind of share my screen here in a moment. Okay, meetings being recorded, that's cool. Alright, okay so let me share my screen. And the PCRM product, so a little background of the PCRM. This was originally going to be a redesign of PC Recruiter. So it was originally started a couple of years ago, several years ago now probably, as simply a new interface. And what happened is we were going through and developing and adding and taking suggestions and kind of figuring out what people wanted and needed in the software package. It ended up including quite a lot of CRM functionality. And then we ended up adding a whole new deals pipeline, like a sales pipeline, sales funnel, if you will, and also a simpler sequencing tool, making it a little bit easier to use that way. So we added that into the newly formatted system and beginning of this year it was decided by our ownership team that we were actually going to spin it out as a separate product now right now it's a separate product that shares the same database as PC recruiter so what that means is you could utilize both PC recruiter as you do now along with PCRM real-time updates it's sharing the same everything but it's just a different interface like I said the PCRM products is going to add the deals pipeline, it's going to have some simple sequencing, easier record entry, some a lot of new formatting and new UI. One thing it doesn't quite have but will next week, I saw it yesterday, the Boolean searching wasn't quite up to par in PCRM but it has been worked out and it's going to be released I believe next week. So that's being addressed as well. So to kind of show you a little bit around it, Basically what happens is there's a menu bar down the left side of the screen. So that's going to give you the ability to have larger area on your screen, more information, and rather than a top and a bottom, it's a left and a right. So you're going to have a lot of the same things you're used to. The names, the companies, the positions, roll-ups, schedule, sequences, activities. So a lot of these are the same information, the same buttons, the same tiles, if you will. You'll notice deals workflow is different. So that's a new one that's been added in there. They've added a kind of new support. So they've added a couple of new things here and there. Some of them will look the same, like if you look at schedule, that looks pretty much the same, just kind of made into PCRM. But some of these elements are going to be quite different. But what we've done is we've set up PCRM to be easier to use, easier to pick up for a new user, for someone just starting out using it. And if you get familiar and comfortable with how to use the name screen, going to the company screen and the position screen is going to work the same exact way. So when you're clicking in, you're going to have a search at the top. So if you wanted a search like Jim Lombardo, I could do first, second, hit my search. I can easily search any of my fields. I can click into a more Boolean-y search as well. Or by default, it's going to show when I click into, it's going to show the last 50, I think so, records that I looked at. So I'm to be able to see all that information showing right there. And what we've added in this grid. So what you're saying, the Boolean search, the Boolean search is within PCRM? Is that what you're saying? It will be in the next week or so, next week or two. Okay. Right now. Go ahead. Go ahead. I'll listen. I'll save my questions for the end. So right now, if you want to do a Boolean search, you would do that in the existing PCR 9 because the Boolean search in PCRM they kind of did it but it didn't it was a little off the mark so you have to go into like all content and then that's going to allow you to type in your Boolean so I can do sales and marketing and when I do my search when it returns it they didn't order it so they didn't put the best match up top the person who had the most words up top they didn't show where the words were found anything like that so like I said that has been added so it's in testing now we download it yesterday as a team so that's going to be out soon so this is being improved but this is probably the one big thing that PCRM lacks really that the PCR 9 is going to do everything else that the pipeline is in here and then a lot of the new functionality so if you went here and you went to to like edit you can edit in grid here so you can edit in your columns you can sort columns scroll to the side you can pin specific columns you also could do a lot of actions right from the front screen here to email call send a text, add activities, notes, put them on a roll-up, do a profile submission, you can link them to a position. So you could do a lot of things from the main screen here, then if you click on the actual icon that's going to open up the record, slides in from the right-hand side of the screen, and you're going to have this custom workspace right up top here. That what I can do, I can actually hit my little edit here, and I can actually kind of edit it up here, drag things around if I wish. My Zoom is going to run a little slow so let's get a little clunky here. But what I can do is I can take and move things anywhere I wish on the screen. So I can kind of take entire records, entire blocks of text, kind of move them around. So it's a little bit more configurable there to do. And then what you can also do, something I like, is if you go to details that's going to show every field you have. with this quick search up top so if you wanted to get to your phone fields just type in phone that's going to automatically filter it down show you only phone fields or if you want an email so it's going to let you navigate through the data you have a little bit easier these tabs up top here are all going to be essentially the buttons that are currently on the record and PC recruiter but they're easier to configure maybe I want roll-ups up right at the top I can move it right next to details it's got a real-time slide over there. So a little easier to configure, a little more of a cleaned up interface, that custom workspace kind of gives you the ability to have a landing page with only what you want to see, and then the details is going to be everything else that you need. And that's going to hold the same for the companies, the names, and the position records. So that's going to give you a little bit easier of an interface. No questions so far? Does everything make sense? Pretty reasonable? or any questions. Makes sense. Nope. Very good, very good. So that's kind of like I said, if I go to companies, same basic thing. One thing they've added and improved on is the add record area. So if I want to add records, I can take and drag and drop files right into this upload area. So I could drag three, four, ten, twelve resumes into here. I could drag attachments into here. And what happens is when I drag them in or if I select maybe I want to add a name it's going to process the information into a screen like this so you can look at the add record and I can add a name and I could go through and maybe I can throw in some information and maybe I know I want to add them to a company that's not in my database I can actually go right here add a new company on the fly call it ABC company. I can then go back to Ben. I can link him to a draft company. So I can say I want to link him to the company that I haven't yet created but am doing so right here. Then I might upload an attachment and maybe I want to attach that to Ben's record or alternatively maybe I want to parse it as a separate resume, yet another record. So it's going to let you group add records, link them to one another, attach other documents, attachments to specific records, or parse a large number of resumes all at once. So it gives you a little more flexibility in adding the records. You're still going to have the ability to use the capture tool and the parsing utility is going to be added soon. The CSV parser isn't yet in PCRM, but it's going to be soon. That's next on our development list. So adding that is a little bit simpler. Also some of the screens have been redesigned a little bit. So if you look at the roll-ups, you can look at your roll-up list. You have a little more information here. You have an edit in line. You also have some actions. You can add to them right from here, delete the roll-up list right from here. Cool thing you can also do, I could build a simple sequence on the fly from a roll-up list. So if I went into my bulk test list, If I open up that roll-up list, I have the ability to build a simple sequence on the fly right here. So if you've ever used our sequencing tool in PC Recruiter, which is included in PCRM2, it looks just the same. It's a little clunky because you have to build the sequence first, create all the steps, create all the branches, make sure it works out, make sure everything you have in there is pointing to another step or anything like that. This is going to give you the ability to maybe create a quick sequence on the fly. So it's a little bit easier. Maybe I can say I want to send that form letter out, and my second step is going to be a call, and I want to call the mobile number. So I can save all, and I can save everything on there. Then I can go ahead and activate that sequence straight away. And what will happen when I have a sequence running, I have one running right in here, the sequence is going to kind of act within the roll-up list. It's going to show what step they're at. I can click into that. I have an error here because my email wasn't working. But I can go through and I can see what step they're at. I can move them into a different step. So I can actually work my sequence right through the roll-up list. And it's maybe going to be less steps. So I'm going to be able to kind of work with that. It kind of combines the roll-up list stages and the sequences into one easy-to-use tool. So we've added that in there as well, kind of a simpler sequencing option. Although you do still have the sequencing option, it looks identical to what it used to look like. So same exact sequencing, because when we designed the sequencing, this was already in the works. So that's going to be there on both sides. You're also going to have your analytics. those are going to look just the same too for the same reason. We designed them when we knew we were already working on PCRM so it's look is seamless right there. Now something else we've added unique to PCRM is going to be the deals workflow. Deals workflow is going to give you the ability to build a custom workflow much like a pipeline in this Kanban view right here but you're going to be able to set it up with your own steps in your sales process essentially your sales funnel steps and you're going to be able to go through and create different to deals and each time you create a deal you'll be able to give it a name link it to a specific company record within your system and then you can actually make any contacts who might be linked to that company name you're also going to be able to put in things like close date a projected close date the deals value confidence level you can give different owners you can even throw some cool follow-up tasks on here if you wanted to add maybe a phone call in one week and then an email in two weeks and then another phone call in three weeks or something like that so you can build yourself almost a small to-do list with this specific deal and then as you look at the deal once you have created that I haven't filled all my screen so I'm just gonna hop in here you're gonna be able to have a pipeline for each deal and what's at each step and you'll see if he's just thrown in here like VP of product development maybe I know that for this specific deal it's a specific position at one of my clients that I'm going for I could track I could use the deals pipeline a couple of different ways if I needed to and then as I go through I'm just going through and I can drag and drop from one step to the next and move them right on through that process it's going to track the activity through here and then when I get it all to deal one deal loss whatever from deal one there's going to be an option that will allow you to create a position linked right to that company record once you've developed that business we are also going to soon be releasing an integrated DocuSign so you could send and have DocuSignable contracts sent from here as well so another thing that's coming up pretty soon so the deals pipeline this was phase one releasing the initial deals pipeline you can work through that deals pipeline I can go through here and see there's my specific activities that I want intro email right there and then I also soon we're going to have analytics reporting on these different steps and stages in in here and you have some filters up top if you want to look at only one deal or only one created date or only one owner of the deal or anything like that so essentially we've added almost a position pipeline an interview pipeline but for a sales application so as such this could be used by a recruiter on the sales side of things or it could even be used by anyone selling anything So it may spin it off into a whole separate product separate from PC Recruiter, but with the same, all the PC Recruiter functionality still included, should you wish to use it. Okay. So really the only thing, the main, you know, there's a lot of functionality changes, but the real development would be that deal pipeline, right? That's the big thing. The deal pipeline is the big thing, the new interface, and the simple sequencing. are probably the biggest three things that have been added in here that are not in the PC Recruiter 9 tool. Yeah. How does that sequencing impact you? Well, we just use this every time we have a new job. So it's not really common for us, but yeah, it's really useful in terms of marketing. It helps a lot. Okay. So let me ask you this, Jim. Do you see utility in this, Dee? Yeah, I do. Actually, the new interface really looks really good. Really good. And it's, you know, more user-friendly, in my opinion. Jim, what's the cost of implementing PCRM? Well, what it does, it is $10 more per user per month over what you're paying now. So it just increases all your users by $10. And then there's a one-time $350 setup, which includes the generation of this new link, which is connected back to your same database. So it's sharing your existing database, sharing your usernames, all your preferences, all your data, but you're looking at it under this new interface. And then that also includes four hours training with one of our trainers on the setup and use of predominantly the new features. of the deals, some of the new setup, the new configuration, and everything like that. And then you'll have that four hours training. I think it lasts for six months or so because we're still developing and still adding things to this. So you'd still get the deals pipeline analytics when they're released, the DocuSign integration when it's released, the new searching when it's released. It's included automatically in that. So $3.50 one time and then additional $10 per user per month, and that adds PCRM to your existing database. So if I have, I don't, I've got to look at, talk to my ops team, how many seats we have. I think we have four or five. I really only need maybe one or two seats of PCRM. Would I be able to designate, you know, Daya and I and not the other three or is it mandated that all three go? Well, they all get it. So we kind of like our packages have always been, you can't just have one person upgrade to premium package. You can't have one person only upgrade to PCRM. So everybody's got to do it, but not everybody has to use it. So if you have certain people you don't want in it, don't give them the link, let them not use it. But we still bill $10 for user per month, no matter how many are using it. Okay. All right. And then that just, I think we, with PC Recruiter, I think we have a three-year contract. I think we're a year into it. If I add this, do we just go out the term of the existing contract or do we have to renew for a three-year? I think right now we're renewing for a fresh three-year, but I'll check with ownership, see if they think differently. because three years is a little bit longer of a contract than some of the other customers we have. So let me check on that. Yeah. Check on that. All right. Yeah. Do that. Get back to me. Dan and I will discuss it, and we'll figure out if that's something we want to pull the trigger on. Perfect. I will check on that, and I'll get back to you the next day or two before the end of the week. Sounds great. Jim, appreciate it. Dee, you have anything else? No. Thank you. All right. We'll talk end of the day. Thanks, Jim. I'll look forward to the information. See you. Thank you. Bye now.",
    "duration_in_seconds": 1109.952,
    "duration": 0.31,
    "processing_time": 166.42111945152283
  },
  "metadata": {
    "processed_at": "2025-09-21T21:44:34.443155",
    "processing_time": 403.291462,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}