{
  "recording_id": "2993899748037",
  "job_id": "65b2fae6-0b47-4bad-b860-b1e74fb73ea1",
  "status": "completed",
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Enter your participant ID. You are in the meeting now. You are the first participant. Please stand by. Thank you. Thank you. Thank you. Thank you. Hey, James. Hi, James. How are you? Good. How are you? I'm well. I like your avatar of Phil Collins. That's nice. It does look like Phil Collins. All right. Hold on. It does not look anything like me. I had them redo it, and then I just gave up. You know, I remember that they... I'm going to go on my screen, too, and wave hello. Hi. I remember when they were making those back when we were talking about the money integration, and they never looked a lot like them. This is literally like... So, yeah, because I had two iterations at main sequence, and this is the second of iterations here. So, they've tried four times. They've never gotten close. we probably paid him like 10 grand for that shit yeah that is nuts yeah dude it's the little mini bill running around over here man oh for sure like it sounds looks acts it's amazing it really is like it's it's so funny because i was like god i bet you this was like when bill was in the office every day it's probably what it's like like they didn't grow up he didn't grow up around bill bill was gone from no but he i mean he's like a little it was so funny because like they were here bill was here the other day because i was going to grab a drink with bill after work and so i was up up here in the upstairs office and i go downstairs to like meet them and they're both sitting in the conference room and they're both like somebody mitch said something to both of them, they both go... Like the same exact time. And I'm like, oh my god. Twins. Yes, dude. How's Josh doing over there? I am good. You know, Josh is joshing it up over here. I hear from him every now and then when he needs a reset or gets a password request email, he'll still text me and go, can you send me that? He hasn't moved it yet. Oh, he's working on it. Well, yeah, he's still several things. Even one came through today. Just a warning. Something else is logging in. I'm like, Josh, come on. Yeah. I mean, he's trying to come up with new ideas and stuff. At least he's trying. But I don't know. We'll see how he does. I want to give him another month, and we'll see how it goes. But, yeah, it's a special place over here, man. Oh, good. Yeah. So, yeah, I wanted to know, I wanted to see kind of how you showed people simple sequencing replaced the roll-up stages. Oh, yeah, yeah, definitely. Sub-question, are the roll-up stages still there? I thought they were going to be. No. There's a column that says what the roll-up stage was, I think. Let me check. Do you have the PCRM link? Because I sure don't. Yeah, let me hop into it. And I'm going to just share my screen and kind of show you what I've got and see what's wrong with it. Because I'm sure there is. Sounds good. Yeah, I've been demoing it a whole bunch the last month or so. That's awesome. It's been mixed. Some people have really, really liked it. Some people have been, meh. But those are the people that maybe they don't do a lot of, like, really hiring. They're only recruiters. They don't do a lot of marketing. They're like, I don't do that. so why would I need that? I'm like, well, exactly. Why would you do that? That's the whole point. Yeah. Yeah. But some people really like it. Then you're just like, why are you trying to buy an APS then? Yeah. Dang bad. You see my screen? You see it? Okay. Yes. Yep. Okay. And then I dealt with for Denton and one of the SRA or one of the dimensional search offices. So they're thinking about getting a trial setting up for one of the dimensional search offices. But then when we talked, part of their huge procedure is rollup stages and they're not in here. Yeah, so that's the problem that I had with... Have you talked to them before about it? Yes, I talked to Justin about it and Brian. And I remember I was telling Justin that I wanted to wait until the deals pipeline was done before we moved them over. Because they track their leads using stages as well. So this kind of replaces both of those things. can you go ahead and click into like create a simple sequence oh yeah right there yeah and do i have to like what a great one why it doesn't always show blue when i do it what do you mean like if i go through and i say if an email address let's be this form letter and i save and maybe add another one oh now it does the activate sequence doesn't as long as Yeah, because sometimes it won't go if you forgot to save a window and they never finished creating the little warning that says, hey, you can't activate until you finish all your little windows. I'm sure that's one of the minute details that got lost with me not being there to babysit. So let's just, you can do those two for now and then scroll up a little bit. So some of the things that I'll tell them that helped with replacing stages was the first one is now, even though you created an email step up at the very top there, if you click on the word email, you can actually edit this and you can call it whatever the hell you want. So now you have a naming convention. So if you're just tracking, hey, this is the first email. This is the second email. This is the same thing that you use stages for for a tracking convention. You can do that here. the second thing that you can do that they do denton specifically his team is if you go to add activity where is that right there yeah so this you can actually pick an activity type so if you have you know your first phone call second phone call third phone call activities that you've created and then you can type whatever you want in that activity test or the activity text you could save that now what you've done is you've essentially created an automation or a roll-up stage right and one of the things that i know denton does is every time that they would write a stage it would write an activity with text in it that would say like first phone call so that ad activity was created specifically for denton steam okay it's part of the replacement do that i had didn't never even notice that little pencil up there so that almost makes this a stage but then you don't have to necessarily go and assign it stage one it's when you start whatever x might happen at that stage one it's done so exactly and and you can create a repeatable process now because you have the skip ahead and you have the skip back functionality and the kanban view so you can literally drag and drop people through a process back and forward or if you don't want to use that view if you save the sequence I go ahead and do what you want to do there yeah totally stage two and then I'm gonna save that and then I'm gonna save the six on the famous template mm-hmm and then I give it a name and I'm gonna put stages maybe I'll even call it yes stages that I can show him just kind of for sure and if you want to get really fun you can show them the little notification thing as well if you click on notifications there You can actually get notifications for when the step's actually completed. So if you want to make sure people are making their phone calls and track that, you can have that go to whomever. You can also create stages for errors. What's really nice about a step error is, let's say that you had an automated email that doesn't go out because it got kicked back for whatever reason. You can have an error go to your admin. You can have it go to the rep who sent it. Same thing when a record error. So maybe you try to make a phone call or send an automated SMS and it doesn't go through. You can get an error whenever a record error happens as well. And you can get a notification for both of those. And those notifications were actually specced out to be quite detailed. So you can tell exactly what happened. You can actually click into the notification itself. It takes you to the record and it'll take you to the record within the rollup. And you can fix whatever you need to fix and move forward from there. Oh, that's cool. That's cool. Yeah, that kind of almost replaces the roll-up stages. I just never knew it was there. So that kind of is good. And then the newest thing is if you click the add to pipeline up in the top right. Oh, one of these little guys. Yeah, yeah. Link to pipeline? That one. Yeah, so if you click that, you can actually do manual now. and what's nice about the manual is if you're vetting clients or working leads you can pick which job that they're a good fit for so you'll when if you have it as a manual step whenever you get to this step it'll let you pick the position that you want to link the name record to so you can work them through an entire hiring flow that way you can also work them through an entire lead flow because on the record itself it would have add to deal now so now you can work a lead through this simple sequence process and whenever you're ready to add them to a deals pipeline you can click the add to deal button which is on the name record and add them to a deal yeah okay and then when you're working this what is is there a column in here that I just don't have shown so click back into that yeah click back into a template actually you can go to sequence from template pages Hit activate. Activate. And then do your little setup here that you have to do. And again, this will stay grayed out if you don't set required fields. I just don't think that piece ever got added here. So click on the arrow up in the top right there. And it will tell you which ones. Yeah. So this will work you through the actual activation of the sequence. Oh, I didn't even notice. That arrow's not really easy. I see now, but I never noticed. I was wondering why I couldn't get it to work. So I have to pick what it's going to come from, who would you like, but I don't need anyone. And now I could hit activate. No. Now you can – yeah, you never have to do – you could if you wanted. You could do date and time restrictions, and you could do rate limiters for your emails. You do not have to, though. Okay. Only the first two are required. Yeah, exactly. So now go ahead and hit activate. Is that email going to go out to all those people? Oh, wait. I didn't – do I have to select someone? Did you actually – yeah, what was the – go back. so that we know, go to edit template. Oh, edit template. In the bottom left there, yeah. My first stage was email. All right. Crazy email there. Yeah, that would go to anybody in there once you activate that. You don't have to get to a different roll up. Because it's automatic. I think I have a, like a test roll up in here that is just all internal people who wouldn't really matter. Bulk test. Let's see. Nope, not that one. I thought I had one in here. Oh, PCR sequence test. This should be. Oh, that one's already got a sequence on it. Jim Wise, McKenzie, Salem. Oh, yeah, I can't do that. You know what? Let's. No. I'm just going to pick three people at random, four people at random, and I'm going to add to a roll up. I'm going to copy them. I want to. Can I create a new one here? Yep. Just type the new one. Oh. hopefully unless they didn't add this yet but yeah it should say like not found and then allow you to yep there you go boom okay confirm so i'm going to do that it'd be really nice look at that feature jim look at that feature right there i remember seeing that when when you made it but i haven't used it it would be really cool if it popped me right to it but maybe you want I agree. I don't know. So I would have to check them all or not? No. Okay, I just can go. So now you can just go back into that template, select it, and then just click activate. And now it'll make you do your two, just in case you want to make some changes here. I didn't make it to automatically activate any of the sequences, just because I think that was a really dangerous feature that we had in the past, where it would just automatically activate everything. Yay. All right. Now you can close out of that. And then one of the sad things that I couldn't get them to do from programming is you will have to like go to like companies and go back to names or something like that. And then you'll be able to see. Now you have this new sequence. Yeah. And the automatic emails go out. And then once they go out, that would say, you know, whatever the next step is going to be. But if you switch it to the Kanban view. Right there. And this is looking at that roll-up list, but only my stages and my... Yeah. Hit refresh on here. Why is it not showing? Is it bugged? Is there a refresh? Or do I just right-click? You can just refresh the whole page, yeah. It won't log you out or anything. I hope not. Where even is refresh? Oh, reload? Yeah. Let's see what happens with that. There we go. There it is. All right, cool. This is way better. So, yeah. So there's two ways you can interact with these. Oh, there you go. See? So you can open the error there. You can look at it in a way. You want. Or in an error. Yeah, yeah. Or in an error. Can I click that open error once? I see where it says open error. I got it. Error sending email from, yeah, it's that top one. I'm going to say the error sending from Jim Lombardo. You're having some weird send email thing. The second one, error sending from Jim Lombardo. Get out of here. Oh, this one there? Okay, yeah. Okay, for error. So you can do like mark as there over on the bottom right, and then just like retry all. Retry all or something. Or whatever. But that's how you would fix it. There, see, it's trying to send it again. All right. I hate that this takes you to advanced sequencing. What a terrible flaw in the system. Click back on your other tab. All right. So anyway, this view, if it was working properly, you could drag and drop and drag and drop all the functionality here that's different is that it's using the skip ahead and skip back function but it's doing it every time you drag and drop so i could so if you want to drag somebody stages i could go anywhere in there you could jump all all around so then uh if you want to sell it as replacing stages the way that i do it is go back to that grid view. And essentially the last activity tells you whatever your last action was there, right? So PLA follow-up, the thing to the right, tells you what your last activity was, which if you have stages already, right, if you had stages, it would tell you whatever the last thing that happened was, which is like, you know, it sent an email or whatever. But what you can then do is click on that box like under Sequencer. Yep. Give that a clicky click. So yeah, there's something wrong with your email, but essentially what you could then do is if you click on the little, there's like a little pop open arrow in the top right, I think maybe. Yeah, but since it's aired out, this would open up that sequence. This would open up that sequence window that you get in advanced sequencing and you can perform whatever the action is in there. So if it's a phone call, you can make a phone call if it's whatever And you can kind of, and so then once you complete that one and move to the next one, your last activity would be whatever the first activity that you did was, right? So, like, that's how you keep track of it. And then you can literally jump back and forward within a sequence forever. So you never have to complete a sequence. Okay, yeah. Groovy. That is, yeah, I'll get my email working and give it another try. Yeah, yeah, give it a shot whenever you're, and if you run into any issues, just let me know. but that was essentially how I was selling it as like replacing stages because it's a process workflow. You can track it. You can track a lead all the way through to a deal. You can track a candidate all the way through to a placement by using all three of the features. It tells you if you name them whatever you want to name them. You can add activities. It does all the same stuff, literally all the same stuff that you can do with stages. The only thing you don't get is the pretty icon that goes with it that you could customize. but who needs that who needs that at all that is good thank you for that um yeah nobody really knows how to use it that well and like and sometimes bless his heart trying to get nick to do a demo it's click click click click click click click and it's he's so bad at it he's terrible at it like terrible i was like dude i come on i told i told bill if he fires nick he can hire me back but that's the only way i'm coming back bill was worried that nick might go nick is he's he's in over his head he's oh big time he doesn't know what he's doing totally and he i don't even know what he's doing i don't either i was just i yelled i yeah he was like looking around in a spec today so i emailed him and i'm like nick you have no reason to go into specs i still work product for pcr i'm still looking at specs please make sure you're calling customers. Thank you. We've been getting complaints that support's not being answered. Training tickets aren't going. It was a dimensional search office. I've been in there for five days. I'm like, Nick, can you get this guy moving? He goes into dimensional search training on the 7th. Well, I'm busy interviewing and I'm doing some other things, so it's going to be a while. I said, it can't be a while. You've got to do it. That's his main job. I'm like, you've got to do this. He assigned it, but it's like, Dude, come on. Come on, man. Yeah, dude, I told Steve that, too. I said, Steve, you have to have a talk with him because he's, like, way out of lane right now and customers are getting ignored. And I said, the last thing that you want to do with that company right now is ignore your customers. That's, like, job one. And, like, we know that the phone's not being answered, so hop on the phone and answer the phone. That's job one. Right, exactly. Don't worry about making a new process for this. What we've got is working fine right now. Well, that's, like, I guess JT was doing, like, one-on-ones with the devs and Amy. and I'm like, there's 10 people at the company. Why are you doing one-on-ones? The process right now is to sell shit and make shit work. That's the whole process. There's not a lot to it. He's trying to micromanage a team of four people. It's like, that's a third of the company. Just do your work. We're not big enough for that. Yeah, just go do work. No, yeah. The AI search, Bill asked me to ask you a question about that AI search. did we have oh were we going to improve it what were we thinking about because the ai search falls flat in the demo like it does not demo well because it's just terrible like even show me names in cleveland you get a like it just kind of throws some shit back but you can't do anything it's terrible so we're fixed on that what we need to do it's on the schedule um so we're getting the import thing in for the ds office first and then this is being attacked now that being said i had them add a new feature i don't know if they've gone live with it yet but it's a candidate ai search where you can just type in like a job description or paste a job description and it returns back the 10 top candidates for you and you can just add them to a list yeah so that's kind of like the auto match type thing yes exactly that can then be added to a position or a deal or roll up list or anything like that. So the reason I had them do that was just as like kind of a quick fix to probably one of the main searches that people are trying to run in PCR so that we don't have to show the AI search until the search is fixed. We can show that as our cool AI feature. It's this AI shit. This needs to be dropped down into the grid. It should not be up in the general search like this. It needs to be specific to the type of search you're running. It's yeah. Because I know about the, that match, they're putting it in the position screen. and it's in development but not quite ready yet. We yesterday had a demo of the – were you on the – I don't think you were on yesterday. John showed us the new searching with the search all and the keywords and the highlights are being worked on. They're not done yet. But it actually shows you where the word was found and puts most matches at the top, kind of like what we said two years ago. We finally did it. That's what I said I wanted to do. Yeah. And I also made them put the zip code radius search back in. So that should come with that search improvement update. We saw that too. I think out next week, I think. All right, good. They're staying on schedule then. I'm managing only about an hour a day of their work, so I've been very nervous of what they're actually working on because I can't keep my eye on them 24 hours a day. But I try to spend about an hour a day with them, so I'm glad they're still sticking with the... Oh, Cain just messaged me. By the way, he got the filters working. Nice. There we go. They're working on it because it looked good. We had the maybe 20 minute demo. He showed it. It looks good and it's going to be ready soon. So it was looking good. Yeah. This AI needs more. No, that's trash. That needs to go with the overall search improvements. That was slated to come up after the import because Bill was really insistent upon getting that import in there. And at least we got search before that import because search is more important. But the import will help too. Yeah, I agree. So, yeah, good. I mean, I think we're still good. I'm hoping that, so the spec is finished for the import. It should take them hopefully only a month or two to design or to develop now that I've realized how fast they can actually work. And how much they're dragging their fucking feet. Why? Dude, they had to have, Oh, we're going to go out of business if we don't do our jobs. Yeah, guys move your asses. Like that was literally the, probably the motivation. But, um, so once that's done, which I would hope by the end of summer, that'll be done, we can start on the search improvements. That's good. It's looking all right, and people are reacting pretty well to PCRM overall. That's awesome to hear. As long as people are buying, and we're staying pretty profitable from what I've been going through with Bill, I think that amazingly, this could actually probably be saved. Hey, man, you could have fooled me three months ago. I'm back to doing about 20 a month, which is what I used to do back in the day, which is good, but it also is what we were doing just among three to four salespeople. We were each doing five to seven a month. So we're not doing any more, but it's building. It needed to be a lean model. You know what I mean? That's what I was telling Bill. I said, don't hire too many people too fast. This could be a blessing in disguise. You know what I mean? Whenever Jim gets to the point that he's so overwhelmed he can't handle making other sales, then start thinking about bringing on a part-time sales guy. but I was like, don't hire another full-time sales rep that cuts Jim's, you know, incentive in half. Yeah. Yeah. It was bloated. So cool, man. I'm glad to hear it. Cool. Well, thank you very much. He'll give me 150K. I'll come back, Jim. We'll hang out. For sure. Oh, you should go to Food Trick Friday. It was last Friday we went. It's in July. I had COVID. That's why my lawn looks like shit, by the way. Yeah, I got COVID on Wednesday, last Wednesday, not this Wednesday, but the Wednesday before. I got that new strain where it feels like you like swallow glass. It's so bad, man. Oh, I've had COVID twice. This one was like horrible. It was one of those things where like you see in the movies where people can't like sleep because of whatever medical stuff. And they're like just tossing and turning. That was me for like three days, like because I couldn't swallow or anything. I'd read about it but I had to like spit in a cup dude yeah I had to literally spit in a cup because I couldn't swallow it was terrible so my lawn looks like shit because I haven't been able to go outside and mow and now it's been like 90 degrees every day and I'm like now I look like the asshole neighbor because my lawn's dying and you're that guy I'm that guy right now so if you know any landscapers who can do a one-time mow for me for really cheap hit me up because I'm not going to be able to get out there this week. I bet you my son would do it for probably $20 or $30. He's looking to make money. I'm sure he would do it. I'll send him your way if he's available. He's going to the Indians game tonight, but I'll send him your way. He wants to make some money, and he's planting flowers for a neighbor across the street. He's looking for something. I'll send him your way. Yeah, yeah. Send him my way. I'd be happy to hire him. He's learned how to use our lawnmower, which is the electric one. He's kind of getting used to it. Oh, perfect. I'll send them. Awesome. Yeah, man, that would be great. I'd be happy to pay them. Awesome. Fantastic. All right. We'll see you around, James. Cool, man. Thanks. See you later. Bye-bye. Bye-bye. Goodbye.",
    "duration_in_seconds": 1725.768,
    "duration": 0.48,
    "processing_time": 174.36408352851868
  },
  "metadata": {
    "processed_at": "2025-09-21T21:42:46.999710",
    "processing_time": 297.069859,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}