{
  "recording_id": "2994287327037",
  "job_id": "4640144b-29ea-45a7-8eda-2acaf497f1ba",
  "status": "completed",
  "transcription": {
    "text": " oh you Thank you for calling SearchMax. If you know your party's extension, you may dial it at any time. For the operator, press 0. For the dial-by-name directory, press 9. Hello? Hi, Adam. It's Robin Mantoni from Main Sequence. How are you? Good, Robin. How are you? Good. I had a message to give you a call. What can I help you with? Is my card not on file with you guys? Well, let's see. Let me make sure. I've got to note that this is a billing issue. Okay. So here's what, yeah. So we used to have, we did, but we moved to a new billing system. So the new billing system requires that you kind of put in the details again. Do you mind, like, forwarding me the email with, like, the stuff on it? Yeah. Hold on one second. And here's what I'm going to do because one of them got a late fee. I'm going to take that off. Hold on one second. I'm going to do that. So what's probably best that I do for you is send you an invite to what's called a customer billing portal with this Biller Genie site that we're now using. Okay. In there, you can set up your card on file. You can view your invoices. So I'm going to send it now to Adam. Search Max Inc. Yeah. Hold on one second. Adam at MRISearchMax.com, right? That one works too. Yep. Okay. That's the one that we have for – oops, I might be sending this to you twice. Okay. That's fine. That is the email we have with your billing. So when you get that invite, you'll want to go into it, but you'll want to create the account first. But make sure you use Adam at MRISearchMax.com. You got it. You should do the sign-up. Okay? You got it. And then you'll just have to put, like, so the vault area is where you can manage your card payment. And then the invoice area is where you can view invoices. You got it. Okay. and if you ever run into any issues just give me a call back alrighty thank you nice to meet you",
    "duration_in_seconds": 190.224,
    "duration": 0.05,
    "processing_time": 15.597159624099731
  },
  "metadata": {
    "processed_at": "2025-09-21T21:44:34.831485",
    "processing_time": 396.974784,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}