{
  "recording_id": "2994882032037",
  "job_id": "2e09f4e7-e3ca-42f5-9974-3029d87843de",
  "status": "completed",
  "transcription": {
    "text": " Welcome to Zoom. Enter your participant ID. You are in the meeting now. You are the first participant. Please stand by. I'm going to go ahead and start the recording. I'm going to go ahead and start the recording. I'm going to go ahead and start the recording. I'm going to go ahead and start the recording. I'm going to go ahead and start the recording. I'm going to go ahead and start the recording. I'm going to go ahead and start the recording. I'm going to go ahead and start the recording. I'm going to go ahead and start the recording. I'm going to go ahead and start the recording. I'm going to go ahead and start the recording. I'm going to go ahead and start the recording. I'm going to go ahead and start the recording. All right. Hey Jim, can you hear me? I sure can. Awesome. How you doing? I'm well. How are you doing? I'm pretty good. Can you do 3 p.m. for... I actually can't. I have a training at 3 p.m. today. Okay. I'm free at 2 and I'm free at 4 I'll try for it because I have a demo at 2, maybe I'll propose to her at 4 okay and then tomorrow, I'm pretty open tomorrow outside of 1 to 3 cool, I'll give her a couple options there, perfect okay hey guys, how's it going, can you hear me? yes, yeah, Damien, how are you? good, good, how's it going? Pretty well, pretty well, pretty well. So I wanted to introduce you to Jason. Jason is going to be your trainer here at PC Recruiter. Okay. So what we want to do today is he's going to have a few questions for you just about some of the specifics you want to cover in the training, how you're going to use the system, a few integrations you want to do. You being dimensional search, we know that you're going to be looking for RingCentral setup, the higher easy setup so some of the stuff we kind of know and then at the conclusion of today's call he's going to get a couple of hours on the schedule with you before your training class on the 7th as quickly as we can match schedules for the to you and I would be one if you needed to add users down the line or drop users or anything like that that comes right to me or if there's anything you need that you don't know who to ask to get that to me and then I can kind of help you out or get you to someone who can. So without further ado, I'm going to turn everything over to Jason to just run through the questions and then get the first session or two on the calendar for you. Awesome. Thank you. Cool. Hi, Damian. I'm Jason. Like Jim said, I'm your PCR trainer. And the questions I have today are just going to kind of help shape what our training sessions are going to look like. So the first question I have is going to be, what type of recruiting are you planning on doing? Like permanent placement, contract placement? What's your goal there? Honestly, all of them. I'm still, you know, trying to get into the market. So I'm looking to do, like, anything that I can get my hands on, to be honest. It'll be healthcare. Nursing specifically is going to be my target market. But if I get anything else, I'll definitely be able to. Perfect. Okay, cool. Have you worked as a recruiter before? Yes, I have. For six years, I was a healthcare recruiter for the Army. Oh, nice. Okay. So, within the next 12 months, are you anticipating adding any additional users? No, not at this time. No, I'm not anticipating that. Okay, cool. If you do ever run into a situation where you want to add users, like Jim said, just shoot him an email and he'll help you with all of that. Okay. I'm going to answer myself. So you were a recruiter before. Were you using a CRM or an ATS system before? And if so, which one was it? Yeah, so we've used – we have a bunch. So we have Recruiter Zone, which is basically our lead generating lead maintaining system. I've used Practice Match for positions. And it's also basically you can track your attempts, you can track your leads, your clients, every single one there. And then we have our applicant processing system as well. So I did everything from start to finish. So finding events, finding the clients, finding the prospects, and then processing and then integrating into the organization. So I've done from start to finish, what I call from start to finish at least. Okay, awesome. Um, okay. So the way we can, um, we have three different levels of training speed that we can go at. Um, so you're going to have a total of 10 hours. Each training session is one hour long and we can either do three, two or one training session per week. Um, dimensional searches recommendation before your first training class is going to be trying to get at least two under your belt. Um, so what kind of speed are you thinking three, two or one a week? honestly i'm a hands-on person so i can do all the training in the world but i don't like actually do the work i won't like you know retain everything so right um i would say whatever you recommend going um once we start um like i'm pretty familiar with loading leads uh you know building excel sheets having to reformat those excel sheets to load them into our system um you know so i'm i'm pretty familiar with some of the processes it's just a different system right so That's really the biggest thing, understanding the system, how it talks. And it looks like from the initial training I did, it looks like you guys have a really good software to where you can send emails, you can send emails from times and all that fun stuff. So I've never done it that way. I've done it where I've actually sat there and pulled a list and emailed whomever I need an email. And the follow-up, I just go into my email and see what I sent and then reply to that email. So, you know, y'all is a lot more robust. I feel like it'll be a little bit smoother for the process. Yeah. So what I'm thinking, if you're more of a hands-on person, why don't we try and do two trainings a week? That way we can give some time in between each training session for you to really dive in and kind of work on the things that we had talked about previously. What I found sometimes with three trainings a week is it's a little bit of a flood of information. Okay. So I think maybe doing two a week, that'll make sure you're getting that minimum in before your training class. and if we ever want to pick up the pace we absolutely can this isn't locked in stone we can always change it um but i'm thinking starting at two and then we'll pick up pace um if you feel like you need to um okay uh if you're gonna answer myself okay um what what operating system are you using a windows a mac mac perfect um and what browser are you currently using uh i am using Firefox. Firefox, okay. Yeah, I got it. I just started using Mac, so I'm getting used to it. I didn't want to buy another computer. I'm like, at no point. So, with Mac computers, probably the best browser we could use is going to be the Chrome browser. So, go ahead and get that installed. The main reason we're going to use that is there's an extension that's available in Chrome that's going to make your life a lot easier. So, I just want to make sure you can leverage that as much as possible. And who is your email provider? Microsoft, Gmail? Microsoft. Okay. Okay. And usually with dimensional search clients at this phase of things, there is an intention to have a website, but it is not complete yet. Would you say that's true with you? That is correct. It's not complete yet. Okay. Okay, cool. And this last one is just kind of going to give me a scope on how we want to handle things through a training session and what specific things to focus on. In terms of communication with candidates and potential clients, how do you feel about an automated approach versus a manual approach, like sending out bulk emails, having emails automatically send because you perform an action in the system? like how do you feel about that kind of stuff i feel comfortable i think i would like to do that as well um like i said i saw some of the training um online one of the it literally showed like six different steps within six different you know emails within x amount of weeks and all that fun stuff so definitely i would be interested in doing that we do have a template that kind of walks us through that but yes i would definitely be interested in that okay awesome um i think that is everything I need at this point. Do you have any specific questions for me? No, no specific questions. Like I said, I'm a hands-on person. So once I get to do the work and, you know, once I get my list and get to start working, I'll probably have some questions at that point. Yeah. As of right now, I don't have any questions to be honest. Okay, cool. So let's, how I like to schedule my training sessions is to choose specific days at specific times and just schedule all of those sessions from that point um you can always move them like if you have something come up we can always move something oh hold on i can't i can hear for a second uh jason okay um so what i was saying yeah i can hear you can you hear me jim can you hear me yeah i can hear you okay i can hear you jim i can't hear jason i lost him i don't know if you can hear him oh yeah i hear him just you guys hear me all right i hear you now jason okay cool um so how i like to handle my training sessions is I like to choose specific days at specific times. So for example, we would say Tuesday, Thursday, every day at 4 p.m. we meet on those days at those times. It's flexible. If you need to move something, we absolutely can. Just give me a heads up if we need to move it. But is there any specific days or specific times that work best for you? So as of right now, my schedule is pretty open. It's really for comfort surf. so um yeah so like what does your schedule look like as of right now for like for example i know you want to do like a specific day if we wanted to do something what's today thursday i want to do something tomorrow um and then for next week i know it's like a holiday i'm not sure if you work all week we can do like maybe a monday and wednesday um every week after that maybe okay um yeah let's throw a first one on for friday and then you and i can meet on let's say mondays and wednesdays at unless you think monday and wednesday next week would be enough for me to get started for next week or excuse me for the second yeah that getting three sessions in would absolutely be enough for that first dimensional search training um it's mainly foundational stuff um so yeah let's throw on for friday um do a one-off on friday so what about the earlier the better for me on that on tomorrow okay um would the earliest i could do would be 12 p.m eastern does that work for you well oh gosh oh unfortunately it won't okay i'm on a baseball tournament all weekend. I'm actually here right now with my son. What would work for you? 8 o'clock, 9 o'clock? What time zone are you in, actually? I didn't even ask. I'm in Eastern. What time zone are you in? Me too, Eastern. Okay. 8 o'clock, 9 o'clock, 10 would be the latest if it's going to be an hour session. If not, I can go to next week. It's fine. Um, let me, let me follow up with you specifically on that. I have to check on, um, but we'll definitely, we'll throw down for, uh, when Monday and Wednesday, um, Monday, Monday and Wednesday. How would, um, 12 PM Eastern work then? Well, that's your favorite time, ain't it? Yeah. Yeah. Oh man. Um, yeah, that's fine. Um, 12 o'clock works. Okay. Um, is do you have a preference for it to be earlier is that kind of where we're going i am an early bird if i can start at five in the morning i'll start at five in the morning okay um why don't we say let's do let does 10 a.m would that be would that be any better okay oh yeah yeah for sure for sure let's throw on for 10 a.m um okay perfect cool uh okay i think that is everything I need. I'll follow up with you on Friday. There's just something I have to check on. And we'll schedule for Monday, Wednesday, going forward at 10 a.m. Eastern. Jim, do you have any questions, any concerns? No, I don't have anything at all. Just look forward to getting set up and running. Awesome, awesome. Y'all are the best. Thank you so much for the help. For sure. And getting y'all set up. Yeah, absolutely. Cool. Thank you, David. Have a good one. okay oh jason i did have one question one follow-up question i'm sorry um will you be sending me the calendar invite or um just so i can kind of put it on my calendar or how yeah yeah um i'm going to send over an invite also one more thing sorry my bad um before that first training session just to mentally prepare you for it it is going to be a little more administrative leaning um it's connect it's creating users it's connecting your email getting ring central set up it's a lot of admin stuff but the second session is going to dive into actual like force material and all of that stuff. Okay. Sounds good. Hopefully I didn't get too ahead already. I'm sure it'll be fine. There's not a lot in PCR that can't be undone. Okay. Okay, cool. Then I will see you definitely on Monday, potentially tomorrow. Okay. Perfect. Awesome. All right. We'll see you. Thank you so much. Have a great one. Bye. Bye. Thank you. Bye-bye. You too. Bye. Bye.",
    "duration_in_seconds": 915.048,
    "duration": 0.25,
    "processing_time": 312.4415521621704
  },
  "metadata": {
    "processed_at": "2025-09-21T21:49:48.275594",
    "processing_time": 702.95351,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}