{
  "recording_id": "2994343183037",
  "job_id": "38208ca0-7610-4afc-be70-50a21e03823d",
  "status": "completed",
  "transcription": {
    "text": " Good afternoon, this is Deb. Hey, Deb, it's Jim with PC Recruiter. How are you? Good, how are you? I am pretty well. I wanted to give you a call. I got your voicemail yesterday. First of all, I wanted to make sure your issue had been addressed. It looked like Robin reached out, but I wanted to make sure everything was well. Yeah, Robin reached out, and I talked with Garrett and managed to get that solved. But it's just getting very frustrating. And Garrett, I guess, mentioned that you've had some attrition. I heard that Sean is gone, which is very sad because you look great. Sean was fantastic. I was sad to see him go. But, yeah, we've had some people have left. We've had some people switch doing different things. So there has been some changes, and I think they're a little shorthanded them the support team I think they're looking to hire someone new to supplement so that is why that's been happening a little bit I not not every time but you were just hitting bad times yeah it's just crazy it's like I've all week it's like whatever I call I call it different times you know I'll try calling a couple tips I'll wait like a you know a half hour in between calls and stuff and not getting callbacks I've left voicemails and they'll get callbacks from that I go on to the chat and it takes you know they say oh there was usually responds in six minutes and half hour later I'm still waiting for a chat you know it's just it's getting very frustrating when you have an issue with PCR and you know the one time that I tried calling it was an issue that I was having with one of my reports and I finally figured it out on my own and that but it was a report that I was doing for a client and you know you expect to be able to get a hold of somebody in support when you need the support and not have to wait you know a a half hour, 45 minutes to get a response back. So I think it's time to get you involved in this because, you know, I don't know if you're aware that those are timeframes that it's taking for support to get back. Sure. Yeah. I was, I've been hearing it and we're, we're working to turn it around. But thanks for letting me know. And if there's anything you need, pop me a quick call. I'm, I'm buried too. So I'm trying my best to get back to people and we're trying to turn it around. Okay. Sounds good. So, yeah, I think I've got everything. I think I need to go and look and see. I think we're paying for too many licenses again. I don't think I've removed people out of my databases that left. So I've got to go and check that. Yeah, if you do just pop me an email, we can adjust those that day, whenever you're ready. Yeah, yeah. I don't know. I don't see the invoices and I don't know where to find the invoices to see what we are and aren't paying for. It looks like you're at 16 users now is what we show, so 16 user names. Okay. I know there's only 15 in our office, but then we also have one for a legacy group person, so that probably is right. Okay. Well, if you come across any further changes, just put me an email and let me know. I can help with that. All right. I will do that. So, yeah, putting things into the, I don't know how much they're getting addressed, you know, things that need to be, you know, in the forum, you know, for, like, feature requests and stuff like that. It's just, you know, there's some things that it's getting kind of frustrating the more, the busier that I'm getting, it seems like it's taking me longer and longer to get stuff done because the programs are just not doing the biggest thing. And it's kind of sad that they're making me do a feature request on this because I think this is something that's more than just put it into a form and see how many people like it to make a decision on this something being done is the capability to switch between databases. And that without having to log out and either that or getting the login URL on the same page as the login information like it used to be because now it's like a separate window so you first you know when you log out you have to click the URL well and then get to the login page and then put your stuff in and you know it's just make it make it easier to you know it's like I use the same password for all databases so why do I even have to log out yeah it's like why can't I just switch between my databases, you know. Well, yeah. If you think about that, pop that to me in an email. I'll bring it up to a meeting next time we have one. Yeah, I put it on a feature request in the form and that. But, yeah, I'll see if I can find it and pop that over to you. Because, you know, and I mean, all my people that are in my office that work in multiple databases, too, say the same thing. It's like it's so frustrating when we have to log out of one database and then we have to do all these clicks to get back into it and that. So, you know, it's just, you know, and just even be able to, you know, when you're searching for a company name, you know, for the tracking, you know, just being able to hit enter. But no, instead I have to type and then I have to go and get my mouse and go down to the search button to actually do the search. You know, it's just that takes time, you know. and when you're busy. Absolutely. Yeah, I'll see if they can fix or maybe add. But pop me an email. That way I'll get it because I can't, I don't even know where the feature request things go. So I can't go get them real easily. But if you pop me an email and share it with the team here, I want to see what they think. All right. Sounds good. All right. Well, you have a great day, and I hope you're keeping cool in the crazy heat we're having. Trying to, yep. You're getting what we get the next day. So I know you're just as bad as we are here. Oh, for sure. We're trying. All right. Well, keep cool and enjoy the rest of your summer. And I'll pop that email over to you either later today or first thing in the morning. Okay. Fantastic. All right. I'll keep an eye out for it. Sounds good. Thanks for calling back. Appreciate it. No problem. Thank you. Bye-bye. Bye-bye.",
    "duration_in_seconds": 384.912,
    "duration": 0.11,
    "processing_time": 42.22053909301758
  },
  "metadata": {
    "processed_at": "2025-09-21T21:44:36.212013",
    "processing_time": 393.49481,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}