{
  "recording_id": "2994231315037",
  "job_id": "d4d3b3f8-171a-4aa8-a17d-1af3ad8eaac8",
  "status": "completed",
  "transcription": {
    "text": " Hello? Hi, this is Robin Mentoni with Main Sequence. I just called you. I don't know if you picked up because I apparently don't know how to use a wireless headset without trampling on it. I'm just connecting it. That's okay. How are you doing? I'm pretty good. I need a wireless one. Yeah, this headset is way too long. I keep dragging it whenever I move my chair. I got you. So, yes, I do need to change your card, right? Yes, for my PPL recruiter. Okay. Let me look up, because we did change billing systems. And with the new one, it's actually better if you do it, because then you could delete the original card and everything. So let me just make sure. Let's see. Jonas Shields. Have you been in the new customer, like, billing portal at all yet? I don't believe so. just on the databases. Okay, all right. So what I'm going to do, I'm going to use Shields. I have your company name here. If it's okay with you, I'd like to send you a link to our customer billing portal and I'll walk you through shields executive talent okay that's how we have you shields executive here we go and it's bank on b7 at gmail.com right is that the email that you want to use that's my personal email and i've got a work email now set up oh okay start you yeah let me let me change that now it'll actually be better to do that now because when you create the billing account, it'll be with whatever we have it set up as. So what is the work email now? Okay, so the work email is Jonas, J-O-N-A-S. Okay. At Skyview, S-K-Y-V-I-E-W, search.com. Jonas at Skyviewsearch.com. And it's Shields Executive Talent, right? Okay. All right, I'm going to update this. Okay, now what I want to do, right now you have auto pay on, but it's in 4601. So what I'm going to do is send you an invitation. Okay, you should be getting an email from billing at mainsequence.net. got it okay in that email there should be like a create an account or sign up it's worded differently by sending it this way okay yeah so you're gonna yeah you're gonna need to create this billing account with this email address you just gave me let me know when you get that it'll actually send you an email to confirm just to verify that you're you. All right. Okay. So please confirm your email. Let's get back into that. And what's nice about this is if you ever want to change your car, you just go into the site to do it. Okay. Also, you can always go in and do your invoices, things like that. Okay. All right. I'm in now. Okay. So once you're in, you're going to go over to the vault. And there you can manage your payment methods. So you can put in your new card details and sign that up for auto pay. and then once you have that new card entered, then you should be able to take out the card that you had before. Okay. Add new card. Excuse me. Okay. So I selected my new card. And I guess I need to put this USB in again. Okay. All right. So I put in everything. And then I think there's – I don't know if you have to save it first, but then you should be able to turn on auto-pay? No. It said it entered the card, then it was asking for an amount, which there's no outstanding invoice right now for an amount. It had asked for the CDV code, and I put that in and clicked pay invoice, and then it says there are no selected invoices. and it looks like it reported back to my old card but i dropped down again can we do a screen share because i know i've done i just don't go in there that often to kind of talk to her but i'm pretty sure if i see it i could figure it out so the system's a little bit new so i have to see it a few times apparently um okay so i'm going to do meet and then i'll send this invite to the same address new meeting start an instant okay add others okay we're getting an email in just a moment you know come for me rabbit main sequence. Okay. Doing cool. Okay. Okay. Okay. I want to join this call. I thought I hit that. Okay. There we go. Oh, I'm going to mute here. Okay. So, I'm going to mute here. Okay. So, I'm going to mute here. Okay. So, I'm going to mute here. Okay. So, I'm going to mute here. Okay. So, I'm going to mute here. Okay. So, I'm going to mute here. Okay. So, I'm going to mute here. Okay, so at the bottom of the meeting window, mm-hmm I'm going to have you click share and then it'll go over to it's called entire screen why is my computer so slow today hold on one second I'm kind of stuck in my thing here there it goes okay all right so you're going to click the share screen and then go over to entire screen and then go over to a new let's see do we do it okay I think we're line there. Okay, let me, everything is ready, close out of there. Okay, so what I have you do is go over to the tab that you were in doing the billing. This will be one of the tabs up at the top. Okay, so in the vault, there are no selected, okay, add new car. Which that's the new one. Okay. Click that one. Why isn't it saying hold on one second. Let me see if I do this right. what if it shows it what shows when you go to the other one it should be in this vault area you're not in invoices you're in vault right oh that could be yeah yeah go to vault okay this is where we need to be so vault is where invoices is going to show your invoices if you want to pay one and then vault is where you could set up cards so let's make sure we've got the right if you're it says payment method make sure that's the right one that you want. Yep that is. Okay so save and now that that's saved now you can accept it by name should match the name on the selected payment method. Okay so I guess type your name in there. Okay hit accept and then accept it must be the name is name on the selected payment method. How does your card list your name? So it has Jonas I. Shields at the top, and then it says Shields Executive Talent below that. Maybe it needs to have both? Hmm. Okay. Well, we'll have to see on that one. Okay. So see where the card that you don't want, let's try deleting that one first of all. Over at the left more? The one that you don't want? Oh, yeah. Let's get rid of that row. This is something that I wouldn't be able to do for you. So the 2533, that's the one you want to keep, right? Correct. Okay. So hit delete on there. Okay. And then this one, due date. And then where it says payment method, let's try that again. auto pay on due date with payment method. Let's see what happens here when you hit save. Don't miss iShields. Okay, let me see this. Where exactly? Let me look at this anyway. The name should match the name on the selected payment method. I wonder if it needs the company portion too then. I can add it. Let's see. It's actually a little abbreviated, but that's what it says on the card. Okay. Let's try this. Hmm. Okay, let me see what it's showing on my side. Oh, maybe this is it. Because I put in Jonah Shields when I entered that, maybe. Maybe it needs to be. Yeah, maybe try that then. Okay, so let's try Save again. And maybe just doing that portion. I'll be interested. I'm not really sure if it's wanting what you did there or what's actually on the card. Oh, okay. That was it. Okay. So it really wants how we have it set up or how you did it there. Okay. So save. So that should – let me just make sure on my side. It takes a moment to sync. 4601. I think you're good. Okay. All right. Perfect. Yeah. So your invoices will show you like anything that's open if you ever want to see anything. And then like history, profiles, like your information. But I think you're all set now. Okay. Perfect. All right. Thank you so much for your help, Robin. I appreciate it. You are welcome. Have a great week. All right. You too. Bye-bye. All right. Thanks. Bye. Thank you.",
    "duration_in_seconds": 828.216,
    "duration": 0.23,
    "processing_time": 82.53513550758362
  },
  "metadata": {
    "processed_at": "2025-09-21T21:44:34.706861",
    "processing_time": 398.202759,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}