{
  "recording_id": "2994136454037",
  "job_id": "0bfb30ab-f16a-4e8b-a0e5-3e6e879f9306",
  "status": "completed",
  "transcription": {
    "text": " Thank you for calling Namesquence Technology. This is Garrett. May I help you? Hi. This is Kay Rogan. I'm calling from the Rogan Group. We're PC recruiter users. And I have a quick question. I don't know if anyone else, like your other clients, are having the same issue, but everyone in my office seems to be having issues with PCR being really slow. like every everything like when you're just like looking anything up or trying to like just now I just like saved something and it's just the bottom is just went blank and now it just came on so I would say it's like 30 to 40 seconds before like anything happens like the icons don't come up for a little it's like a delay I guess yeah is this the Rogan group or the TRG legal database? I think he's having problems too. I think it's both the TRG database and the Rogan Group database. Yeah. All right. I'm going to log into the Rogan Group on my end and see if it's slow to load here. If it's slow to load on my end, that would mean that it's a server issue on our side. Okay. Let's see. And that's actually going pretty fast here. So it's more of a local issue. Are you all sharing the same internet connection? No, actually the person who uses the TRG legal the most is in a different location. So I think he was having issues too. Okay, I'm going to log in under TRG Legal here, test that as well. All right. There we go. Yeah, I'm performing searches, jump in between records. It's all happening quickly on that. So you think it would be more an Internet issue for us? Yeah, I would recommend either restarting the router, your Internet router, or if you do have like a virus protection software that has web protection. if there's any way to you know turn that off the web protection part that usually speeds up PCR kind of as a session based website I wonder if I okay so I should probably check with our technology company because it just started this like yes today's only Tuesday or today's Wednesday yeah I think it just started yesterday that it was happening so maybe they made some changes to the virus protection? Okay. Yes. Okay. If there's a setting in there for, yeah, web protection, if you could toggle that off anyway in your virus scanning software, that usually speeds things up. Otherwise, yeah, try maybe restarting the router. It could help as well. Okay. Okay. All right. So do you think it's us? Okay. All right. Let me see what I can come up with. I appreciate that. Thank you. No problem. Reach out if you need anything else. We will. Thanks. Bye-bye. Bye.",
    "duration_in_seconds": 211.608,
    "duration": 0.06,
    "processing_time": 64.40716528892517
  },
  "metadata": {
    "processed_at": "2025-09-21T21:44:34.579093",
    "processing_time": 400.696343,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}