{
  "recording_id": "2995683396037",
  "job_id": "f84d43da-e2e4-4e43-a1ff-5354e054accf",
  "status": "completed",
  "transcription": {
    "text": " Good afternoon, Main Sequence. Hey, Jim. Mason here. Hey, Mason. How are you? I was just writing you an email. Good, good. Yeah. Looking forward to this. Okay, invoice I've got in front of me, and I'm paying as we do this call. so Duplo kits is a high priority for us for sure and what's going on what are you ending up with or how are they being entered so I'm getting one of my team to kind of create a summary of the issue which I'll share with you guys I think she said she's going to have it tomorrow but high level we do a lot of legal recruiting and so we have a legal database that we're constantly doing big exports from into PCR and it's creating duplicate records like all over the place and then we also have lots of when we had our ZoomInfo seat, we'd be doing exports. And, oh, I think what it often would do is it would create a new company. We're exporting the candidate, and then it creates a new company record also, I think, when we were entering the candidate. Awesome. Okay. And it sounds like the biggest thing that I gleaned from that so far, I'm looking forward to getting the whole explanation, but it sounds like you need to utilize the duplicate detection piece in the import tool. There's some different tricks that you can do with it. You can kind of dictate what constitutes a duplicate. I don't know if they have LinkedIn addresses in the import or cell phones or IDs or something other identifiable, but I can provide that to the trainers and they can better help to identify and prevent those duplicates from happening. And then they can also kind of help show how to clean up duplicates you might already have. that's a little bit more tedious because it's nothing you can do en masse because you kind of have to go through each one and merge them but they might be able to offer some tricks on how to help and stop it from here forward okay good in the in terms of your professional services team there's the trainers um i was when you were mentioning that you know we wouldn't be able to do this duplicates thing in mass you know that i'm wondering if there is some sort of like middleware or like ETL software, more of a technical hack that might be possible. And so I'm wondering how deep technically are those trainers? Do you have in-house staff that would be aware of outside-of-the-box data migration matters, or is that something that I might want to start thinking about if I bring in an outside specialist to help us with that? Well, we do have people on staff who do the data conversions, and they might be able to bring in, like Mike, who kind of goes through data conversions, he might be able to offer some assistance. I would say, if you know of anyone, keep it in mind, but I want to have them take a look at it first, just to make sure they can identify the problem, address the problem, then we'll talk about how to fix what has happened. They might be able to programmatically figure it out or something. They might have more to offer. I don't know. Yeah. Okay, yeah. We'll start talking to PCR as a first step. We'll go from there. Perfect, perfect. And then anytime, whenever you're ready to add users to do that, just pop me a quick email that says, I want to add X amount of users. Here's their name and email addresses. I put in a ticket, then they up the billing for that many users, and then what happens is since their names and email addresses are in that ticket, that gets sent over to the support team, who will reach out usually with an email to each new user and kind of say, hey, do you need help setting it up, installing Capture, installing the launcher, any questions, anything like that. And then same, if you need to drop any users, send me an email. I will then put in a ticket to drop a user, and it will just drop the users off that day. So you can go up or down as many times as you need as often as you like. Yeah, that's fantastic. We have in the past just added the users from our admin screen, but I noticed it doesn't automatically trigger to adjust the billing. and every once in a while we get these emails like, hey, how many users are you at now? Yeah, it doesn't. What we've done, we've always wanted to keep it flexible so that you didn't need to get a hold of us in order to add the user, but we like to kind of honor system, send us an email saying, hey, I added the user. So we didn't want to shut it down and lock it up. So you could still add it any time. Just pop us a quick email because they do kind of every month or two, they'll kind of pull a report of how many people are having more log-ins than they're paying for. Those are the emails that you've seen in the past. But, yeah, just pop in a quick email when you add it, but we give you the ability to add it so you don't have to wait on us. Yeah, it's nice to have that flexibility. But like you say, start by letting you know that way, then that initiates the onboarding process for that new user. It's not just a password and login that they get. Absolutely. Absolutely. Yep. So how soon can we do this meeting to discuss the duplicates? I probably could even get a ticket in today since it's an existing issue. I can put a ticket in today. As soon as I get the information outlining the details of what it is, I can add that to the ticket, hopefully get someone in touch to start looking into it and see what's going on. So I'll have the summary of the issue tomorrow. I'll send that to you so you can put the ticket in and also maybe just get, you know, mark it as urgent or whatever we can do to get out of fire. For sure, for sure. I may even put the ticket in today, and they may even have an initial kind of, here, try this, try that, and then I'll add additional information once I get it from you tomorrow to help qualify it and provide more information about it. and like you say it might be as simple as just considering the duplicates check to say here is the data point that you want to check maybe it's the LinkedIn profile or the something right okay good I'm trying to pay this invoice but it I I didn't know PCR was so anti-Canada. Oh, no. Because I can't put in my – well, maybe if I change the country, then it might prompt me to enter the province as opposed to the state. That must be it. I haven't heard of any problems because we've got plenty of customers up in Canada, so I haven't heard of any issues. Yeah, I think I just had to change the country to Canada, so I think we're good here. Groovy. Awesome. Very well. Okay, good. So I think that's it then. I'll pay this shortly. Tomorrow I'll send you the duplicates problem and then we'll talk more next week. Perfect. Sounds good. Sounds good. Good. Yeah, and then in the meantime I might send you a list of the new seats that you want to have. Yeah, whenever you're ready to do that, just pop it over and I can get that in queue working as well. It might be good too when we talk to the trainer just to review the security settings and to have a conversation about security with PCR. Sure. Now that we're kind of scaling, I want to make sure we're locked down as much as possible. For example, I noticed on the settings we can restrict logins to just certain IP addresses. Which might be a good solution so people don't share their login with someone. So yeah. Yeah. I'm sure you have some training so they can cover that as well when they get the training for the everything. Awesome. Okay. Well, thanks. For sure. We'll talk to you soon. Okay. Cheers. Bye. Bye.",
    "duration_in_seconds": 514.08,
    "duration": 0.14,
    "processing_time": 49.999032735824585
  },
  "metadata": {
    "processed_at": "2025-09-21T21:46:57.709994",
    "processing_time": 511.995613,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}