{
  "recording_id": "2995309545037",
  "job_id": "404c7e23-40be-4e34-9440-8b44b06c4b57",
  "status": "completed",
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is Garrett. How may I help you? Hi, Garrett. This is Ellen Burke with WorldBridge Partners. How's it going? And I am calling with a problem with PCR, which I cannot figure out. I sent a resume to a client who has always received things from me, and she did not get the resume. so I copied my activity and re-sent it and she got it. Then I sent a second resume and she hasn't received it. So I wanted to just double check and make sure that the problem wasn't on PCR's side. Okay, yeah, I'll take a look. Which database are you in? Valencia. Even though that's not where I am. Got it, Valencia. Okay, and what's your username? Eberk or LNB. Eberk, I think. Oh, LNB. Yeah, LNB was the right one. Perfect. All right, let me check your email connection real quick. Okay, that's in good shape. All right. So let me pull up the... Because when I copied the activity and then re-sent the resume through PCR, she got it. So when you say you're copying the activity, you mean you go to the name record, you pull up the activity... Oh, yeah, because I have a cover letter that goes with the resume. So I copied that and re-sent the resume, and she got it. Okay. Then about five minutes later, ten minutes later, I sent a new resume with a cover letter, and she has not received it. Okay. What is the person's name that you're sending to? Helene, H-E-L-A-I-N-E, Tepperman, T-E-P-E-R-M-A-N. Okay. All right. So let me just take a look at those activities. 26. Got it. Okay. Can you see the last one I sent? Wait. Oh, yeah, yeah. So there's one at 916 a.m. and then one at 919 a.m. that was sent. Right. Four minutes later. Okay. She did not receive that. I just checked now. Almost 10 o'clock here. Okay. Let me check your outgoing mail. Oh, wait. We don't have that. I'm not sure. All right. Let me actually create a name record for myself in the database and then try sending myself something similar from your username. so I'll put myself under main sequence email address Okay, and then we'll just go to email. You only have one email address to send from. That's good. Okay, PCR support test. Do you want me to try to send you a resume? Yeah, you could do that. So I got the email right away in my inbox with no resume attached. That's an email. Oh, no resume attached. Yeah, let's try one with a resume now. So if you look in your database for me, I'm G-A-R-R-E-T-T, the first name, and last name K-O-M, as in Michael, Y-A-T-I. Komadi. Okay. I'm going to send you this resume. Okay. One that didn't go through. Okay. All right. Email. Oh. Can you just give me your email? Sure. It's G-K-O-M, as in Michael, Y-A-T, as in Tom, I. It's at gcomiotti at mainsequence.net. Okay. Cover letter here. Send. Okay. cover letter here. Okay. And I'll just go back to my inbox here. Okay, cool. Yeah, I got that with a resume attached for William. Okay, yeah, it seems to be working inside of PCR. Things are sending out. I'm not exactly sure. Possibly she might, I don't know if it went to her spam folder for any reason. Oh, okay. Yeah, I'm not sure. It seems like the connection is functioning. and you're definitely following all the right steps because you got the resume sent to me. No problem. So that works. Yeah, I'm not sure. Maybe just try sending it again and see if it was just a glitch or a fluke on the receiving end. Maybe their mailbox was full or congested or something. Okay, so there's nothing on our end Right, yeah, PCR looks like it's set up correctly for your username to send Okay Alright Alright, I'll try again I'll call you if there's a problem Yeah, if this still keeps happening, just let us know We can take a look again But yeah, you should be in good shape since I got that stuff right away. Yeah, what would... Okay. All right. I can also check here your opt-out list to see if anybody... No, yes. So nobody from the at Bernstein.com emails, nobody's unsubscribed or anything. So that wouldn't be an issue. No. No, I've sent, and, okay. All right. Resume of, I'm going to say second try. HelaineTeperman at Bernstein.com. Yeah. Okay. All right. I'll just tell her we checked on our end. Okay. Yeah. And, yeah, definitely check the spelling of the email or whatever that might contribute. Oh, good. Okay. You got the Helaine.Teperman. Okay. All right. Because it populates automatically. I don't have to spell. Oh, good. okay all right um yeah i guess it could be if yeah if that keeps occurring just let us know um just give us another call back okay okay all righty have a great rest of your day thanks so much garrett appreciate it thanks",
    "duration_in_seconds": 541.584,
    "duration": 0.15,
    "processing_time": 38.31341218948364
  },
  "metadata": {
    "processed_at": "2025-09-21T21:44:40.734886",
    "processing_time": 385.348667,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}