{
  "recording_id": "2995260606037",
  "job_id": "c66cd3c7-c4d3-4a9b-868c-6e8af43994ba",
  "status": "completed",
  "transcription": {
    "text": " Thank you for calling Main Sequence. Hi. Can you hear me? Yeah. Okay. Sorry. Cut out for a second. My name is Parker Trepton. We are a account through you guys. We are looking to end our contract with you guys. So, I'm not really sure who I would talk to about that or if I need transferred somewhere if that's something that you'd be able to do. Let me see. Your agreement first. Hold on one second. Yeah, yeah. It's the Nexus group. Is that right? Yes. Okay. So, I'm going to go ahead and get started. I'm going to go ahead and get started. Okay. So, I'm going to go ahead and get started. Okay. So, I'm going to go ahead and get started. Okay. So, I'm going to go ahead and get started. Okay. So, I'm going to go ahead and get started. Okay. So, I'm going to go ahead and get started. Okay. So, I'm going to go ahead and get started. Okay. So, I'm going to go ahead and get started. Okay. Okay, so make sure I had it right up here. Yeah, I should see like Dave Trepton, Karen Trepton, Parker Trepton on there. So your agreement is it automatically renews on the 29th of April each year. Okay. and what we do is we do require 30 days notice. Automatic renewal. Yeah, so it's April 29th of each year. So you're, so it, yeah, so it automatically renews every year. So you're, you're under contract until April 29th of, I guess, 2026. of 2026 yeah it automatically renews April 29th each year oh April I'm thinking August so there's no way we can get out of this there's an early termination if you have 80% of the remaining time right what's the point of that is there anyone we can talk to that's It seems kind of insane. I would have to escalate it. I can't go over a contract. Yeah. I'm not allowed to. Now, your name is Parker? Yeah. Okay. What is the best number to reach you and email address? Yeah. Here, I'll just give you my personal cell. It's 262- Actually, I have two records for you. What do you use for your work? Is it the parker.t at nexusgrp.com? Okay. Let me see. Okay. And then your cell phone is what number? It's 262-312-4848. And question for you, because the contract signer looks like is... Is Dave. Yeah, probably. Yeah. So if he needs to be on the phone, that's totally fine. Yeah. Okay. from him. Okay. So what I'm going to do is I'm going to reach out to Bill Kubitschek. He would be really the only person to kind of override that. Like, he would have to go for him. But I will ask him to reach out to you if that would be okay. Yeah, no, it'd be great. Should I just have Dave present? We're just a small family business so we just decided to switch from PCR to a new system is all. So, yeah, Dave is obviously the one telling me to do this stuff. Yeah, it's under contract. So, I mean, it is, that's what the contract is. It's not up until April. Well, what time or day do you think that man would be able to reach out? I don't know. I'm going to email him right now with your details and have him reach out to you. Okay. Okay. Awesome. And then his name is Bill Kubitschek. Bill. Okay. Awesome. Okay. All righty. Thank you very much. Yeah, thank you. All righty. Bye. Bye.",
    "duration_in_seconds": 270.576,
    "duration": 0.08,
    "processing_time": 34.31395602226257
  },
  "metadata": {
    "processed_at": "2025-09-21T21:44:40.606274",
    "processing_time": 386.540304,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}