{
  "recording_id": "2995486780037",
  "job_id": "9c67828b-fb53-46d4-a2a7-2ac8812da4fe",
  "status": "completed",
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Enter your participant ID followed by pound. You are in the meeting now. There is one other participant in the meeting. Good afternoon, this is Jim. Hey, Jim. Sandy Bishop. How are you doing? I'm well, Sandy. How are you? Good. Good. Hey, can you do me a favor? Yeah, what's that? Remind me what the focus of this version of PCR is about. Sure. I forgot. Okay, yeah. The PCRM, that's kind of the new product, the new version that we have of PCRecruiter. And it is primarily a CRM package. so it's going to include all of the same stuff you have, or rather right now most of the same stuff as PC Recruiter itself has, but it's also going to add CRM functionality. So it's going to add a sales pipeline, and it's also going to add a simpler sequencing tool, all in a new UI, a new format of the system there. So when you say sequencing tool, you're talking about a hiring process? Yeah, yeah. Well, yes. So the sequencing within PC Recruiter, that's available now. And I don't know if you have it. Do you know if you have the premium package with the sequencing of PC Recruiter? I think I do. I'm able to post sendouts. Is that what you're talking about? Let me take a look. Oh, no. No, you don't have it, actually. so the sequencing piece it's part of our premium package and what it does it is going to be like a drip campaigns piece so it's going to give you the capacity to mass communicate with people in an email you can set it up so that an email is sent out and then if they reply maybe a second email goes out or if they don't reply in a certain amount of days a different email would go out or maybe they're added to your call list or something like that it's really for mass communication and automated communication through calls, texts, SMS, and the like. So that's what that'll do. Got it. Okay. I'm with you. So you don't have that. You don't have that right now. So that's something that would be new to you anyway. No. Between you and I, when that first came out, my reaction was it was kind of overkill. My clients would go nuts if I started sending those amount of contact, those amount of emails or whatever. Yeah. A lot of people do feel that way. Yeah. Go ahead. Okay. So, yeah, a lot of people don't use it for that reason. So the sequencing is included in, it's available in the version of PC Recruiter you have now, but it's also included in the new PCRM package. Got it. Got it. So reasons you might consider. So that's, Jim, that's something I should take a closer look at, in my opinion. Okay. Go ahead. Don't let me interrupt. Oh, no. Reasons that you might want to consider the new PCRM piece is if you do a lot of marketing. You track potential clients, potential deals, agreements, because the new PCRM gives you the ability to track where a person is in your trying to earn their business, basically. So you can track whether they're a prospect or if they are ready to go, if you've sent an agreement, if they've signed the agreement, if they're on hold, whatever. and we're also going to be releasing soon a DocuSign integration so you can actually send agreements out of PC Recruiter and kind of have them signed and uploaded directly into the system as well. Really? Okay. So that's going to be out soon. That's in kind of phase two of the PCRM product. Yep. So that's the biggest thing it's going to do. It's like a sales funnel almost is added and the sequencing is still there so you'd get that because in order to go with the PCRM package, you have to be on the premium package of PC Recruiter anyway because the premium features are built into PCRM. Yep, I'm with you. Okay, so it is something, and it's going to look totally different. So it is going to be a totally new interface, different to use. Some people like it better. Some people like the old look better. so that's really your case really yeah yeah I hear you okay so question I don't want to get too far ahead of myself but what's the new package cost I pay I pay $50 a month now for web hosted okay and let's see you're with MRI right Yes, right. Okay. So it would be kind of two upgrades in one. So if you went with the new package, you'd also have to upgrade to the premium. So the first thing you'd have to do is go from 50 per month to 75 per month. That would get you in the premium version of PCR 9, plus the PCR M is another 10. So it would take you to 85 per user per month. Actually, I think it's 84 is the proper MRI pricing that we have. It's $84. They discounted it just a little bit off of the $125 it normally is. So it would be $84. So you'd go about $34. And then there's a $500 setup, which includes adding the new features. It includes six hours of training. It includes the new version as well as upgrading your existing version. Okay. That doesn't sound outrageous. No. So I'm curious. I want to know more. Sure. You want me to share my screen and kind of show you around a little bit? Yeah, sure. Sure, yeah. I will do that here. So I'm going to share the screen here. Let me just make sure I've got a database open, which I think I do. Let's see. I just want to make sure I'm into my correct demo database. I am. Okay, so let me share my screen here. You should momentarily be looking at the sign-in screen for, actually I'm already signed into PCRM. Okay, and what happens? In this version we've kind of redesigned the whole user interface and it was originally going to be a replacement to PCR 9, like a replacement just a new interface but in designing and adding so much functionality that included the so much CRM functionality ownership decided to roll it off into its own separate product so it is a separate product that runs off the same database so you'll see over here on the left side of the screen those are kind of all of the buttons that you're used to within PC recruiter still have names, companies, positions, roll-ups, schedule, a lot of the same things. Okay and a lot of them even like the schedule for example looks almost the same. So some of these screens are going to look kind of the same but some are going to look a little different, a little more up-to-date. If for example I went into my name search, it's going to show me the last 50 or so names I've looked at here. So that's going to be how my search results are displayed. I can click edit and I can edit in line so I can change first names edit information change cell phone whatnot I also have a quick action over here where I can send them an email or I can add an activity or a note put them on a roll-up list I could do a lot of things right from this front screen and what we've also done is rather than going with a top and bottom setup like the current PC recruiter if I were to click on Terry's record for example it's going to slide in from the right-hand side of the screen and you're going to have the same record that you know okay I'm even going to full screen this out here to pop it up here so you are going to have the ability to configure a custom workspace which is the first thing you see here so if I want to edit that and want to shrink it up a little bit so let's shrink this up so this can oops but I can where are you hitting edit oh where is that I'm not seeing it Oh a little pencil it goes away when I hit it but I'll go over here into details back in a workspace there's a little pencil actually right in there it disappeared because I have all my edit options up here now okay okay God so let me go ahead and see if I can Okay. So I've just said, I see it. Yep. So that you can change module. You can change things. I can show the resume right there. I can show different fields. I can show my pipeline. so you have your workspace is essentially a blank canvas that you can add whatever information you wish and then you're going to have a lot of these elements of reviews are still your same things you're used to your activities your notes your attachments resume all of the same features you have on the name menu in PCRecruiter but you're going to have them now in a tab format and I could even slide them around if I went into this little drop-down and maybe I wanted attachments to show right up next to roll-ups I can do that it'll just snap right over there so it's a little more interactive reactive straight away another cool thing i like about it is the details that's going to show every field you have on that person and there's a search at the top so if you want to get to their phone number fields you can just type in phone it's going to instantly filter down and show you only phone number fields so you have a lot of different things you can do with that okay a lot of your actions are still up at the top here you can delete or add an activity copy to clipboard map their address link them to a position all of them so same terminology but a little bit different format here but what's cool is the companies work the same way you're still going to have the same primary list you're still going to have the ability to edit in line you're still going to have a number of actions right from the front screen and then if you go into any one of these company records they're going to slide in they have a customizable workspace and then you're also going to have your details, your notes, all of your other company buttons. So that's essentially just a redesigned user interface for that. Now, something we have added, the deals pipeline, the deals workflow is something totally different. So if I go into deals workflow right here, that's going to show me my deals pipeline. So here I have like qualified, contacted, needs assessment, contract sent, contract signed. So I can essentially put different company records as cards into this process, and I'm going to be able to move them through a deals process. I believe you can customize the steps if you wish. But what it's going to do, it's going to allow you to keep track of where everybody stands. These are maybe all companies that I'm working with. So I've got Melton, I've got Multimail, Bank One. Maybe I even want to put in a specific position, like this VP of product development that I put in there. it's maybe a specific position I'm trying to get the ability to recruit for. So you can kind of put your deals in here and just drag and drop them one step to the next, much like your pipeline in PC Recruiter. A lot of times people wanted to have a sales pipeline for marketing purposes, and this could eventually even be spun off as a separate product for anyone selling anything. you could even just like I said anyone selling anything could use this not even for recruiting just to track their sales and their contact a true CRM okay is this at all similar to a product like Salesforce yes yeah very similar like sales tracking tracking contacts and emails and follow-ups but also tracking where they are in your sales process and the like yeah this is kind of a little bit Salesforcey if you will Got it. Okay. I like that. I like it. And then we also added these, the sequences, they're available now in your existing version. And if you upgraded, you'd have them in the old and the new version of PC Recruiter, either one. But the sequences are going to let you build an automated template. So maybe I have a business development sequence that I want to put in here and I want to look at my branches. And in here I can say that in my specific sequence, my first step is a quick, simple email. If the email is opened, it's going to move to the next step, which is add them to my list so I can go into LinkedIn and send a connection request. But if no interaction occurs in three days, I move to step three and send another email. It's a different email. so I can actually set up an automated process so that if one thing happens, then it will automatically push them to the next step, and then depending on what happens, it will go to the next step. And you can kind of build these long step-by-step processes here. And some people use this only for email. They'll have send an email, wait five days, send an email. If they open it, they get email A. If they don't open it in nine days, they get email B. You could do something like that. Is there a way to also set up calling that way? You can. It doesn't auto-call, but what it does that's cool, like you'll see if I have one of these, I don't know if this one has a specific call step, but if I go through to this one, I think it does. So this one says that my first step is going to be send bizdev letter one, and then if no direction occurs, move to the next step, which is going to be a call. What that does is if they don't interact with my letter in X amount of days, it's going to add them to my call step. And I have my own to-do list here showing a list of calls right there. So these are the people I know that have opened my email or rather, excuse me, have not opened my email in two to three days or whatever I chose. And I can go in and I can hit that. That's going to open up their record, give you a little couple fields, activity summary. Here, you can even place a script in here for the call if you wish. And if you had RingCenter, you could even click to dial the phone number. If you had a phone number there, it would click to dial. And then maybe I'd say left message. I've got RingCenter. Cool. Yeah, that's nice because it will allow you to click to dial. And I can say maybe I did, and I can say, oh, left message. That will just toggle right to the next person. Click to dial, read my script, go through, no answer. And depending on what I pick as my result code, That's going to dictate what happens next. If it keeps them on my call list, or maybe it sends them another email, or maybe it sends them a text using RingCentral, you could do that too. So is this dial cell email RingCentral, is that set to a cell phone or a fork phone, or you can do either? I think by default it's going to go to cell phone, but in the setup, I think you can go through in the template and you can choose what field you want. So if I go to call, let's edit this step and see what it does. Oh no, it doesn't have one. So I think it does default to cell phone. That's the one to dial. Okay, because that's what I use anymore. Yeah, that's what most people do. Okay. Yep. Okay. So this piece, this would actually be in both versions of PC Recruiter, the sequencing piece. So would the analytics report. Mm-hmm. And this is another piece of the premium that it looks exactly the same in PCRM as it does in your existing database, just you don't have it yet. But this is going to allow you to, maybe if you sent a bulk email, you're going to be able to go ahead and see that you've got a report here showing all my opens, all my clicks, all my replies. I can even scroll down a little bit and see who clicked when. I can see what's going on right there. Really? Yeah, see, I don't see that now. I have to manually tabulate who came back. Yeah, because you're on enterprise. The premium package does this, and I'll show you how it looks kind of in your current version. I'm going to log into the exact same database I'm showing you in PCRM, but I'm going to go into PCR9, our existing PC recruiter here. Okay. If I go into here, I can go into my analytics. It's the exact same screen. It's going to show my metrics. I'm going to be able to look at my email campaigns. So the exact same screens would also appear in your existing PC Recruiter. You can click and see opens and clicks and unsubscribes and all of this. So it's very easy to work with. Sequencing, same thing. So if it takes four days for people to respond to my email blast, you don't keep collecting all that time, presumably. You can see that. You can see how long it took them. You can see when they opened it, when they last opened it, how many times they opened it, all of that. So you do have quite a bit of functionality that would be added to both versions of PC Recruiter, but the beauty of adding the PCR app. So you could also just upgrade the premium if you didn't want the PCRM and that new feature and the deals pipeline. And you could add sequencing and the analytics to your existing PC recruiter. But for $10 more, actually $9 for you since you're MRI, it would get you the PCRM too. So you'd be able to go in there and kind of work with them there very easily. Jim, when I send an email blast and people reply via email, are those email results, returns put into activities automatically? They are. They are. If you have it set up to record emails, you'd be able to see any email you exchange. Kind of like if I go into my database. Whoops. Let me get into my database here. I actually use PC Twitter. Because right now I don't have that. Yeah. Yeah. So if I go into your record, I can look at activities, and I can see every email that I received from you, that I sent to you. I can see everything showing right up there. So I've got email received right there. So that's going to be recorded on that thing. That's something that we can set up for you now. We can set up for you then. And those emails do show up in the activities. Either if they're a sequence or a campaign or individual, they're all going to be shown. Got it. Okay. Okay. Yeah, I like what I'm seeing so far. Yeah, it gives you some different options and some more things there. And the new interface here also, like the roll-up lists, are a little bit different. So I can go into my roll-up list, open them up, they slide in from the side, they have a little more interactive menu, and then I could also go into a specific record right from the roll-up list there if I needed to. So I'm going to be able to very easily work with that too. Okay. Okay. And I can use my back buttons and go through there. Another cool feature we've added in the PCRM is the simple sequencing. You can actually build a sequence right on the fly. So you can give it a quick name. You can pick maybe your first steps in email, your second steps of call. They actually added this piece here to be a simpler version of the sequencing, the sequencing I showed you. it's a little involved to set it up sometimes. So what they did was they added this ability to build a simple sequence so that if you wanted to reach out to these people with an email and then a call, in a minute and a half you could create, okay, email, this form letter, to this email address field, next step, two days later, call, add to my list, go, and you could actually launch the sequence right from here. So there's kind of a simpler secondary sequencing piece that's also included in here too. Okay. And then one other thing I always like to show is the add screen. So if you were adding records, parsing resumes, importing attachments, entering company records, anything like that, if you go up to the add screen up here, we now have, it's been redesigned a little bit, so there's this big empty box right here where you can drag and drop files into the system, or you can upload files, or maybe I want to go to name, I want to add a name. So I could go through here and I could put in some information here. Maybe I'm going to add Bruce Jones. And maybe I'm thinking, oh, wait, he works for Aramark. I want to add that company. I can actually go here, add a new company too, right from the screen here. And I can go through Aramark. And then what I can do is toggle back up to Bruce. And I can go down here and I can link him to a draft record. so I can actually link it to a company that I'm in the process of creating at the same time as I'm creating his record. So whereas now in PC Recruiter, if you don't have the company, you have to back out, add the company first, then go back in, then add him and link him to it. And so it makes adding records a little easier. And you can also, maybe if you hit Upload Attachment here, you uploaded another document into that area there. That document, you could then just click on it and say, I want to attach it to Bruce Jones' record. So if I went through here and I uploaded maybe this document right here and I opened it, that's going to open. I could go to that and I can go through here. I can say I can remove it or I can go through and I can say, oh, let's see, record. and I can pick what record I want to add it to and I can kind of pick my records that I've put in there. So I can kind of link it to a draft record too. I can link it to Bruce Jones. So I all in one swoop have created a company, created a name and linked it to the company, uploaded an attachment and linked it to the name that's then going to be linked to the company. And I could just hit add records. All those records are created at once. so the ad record is quite beefier than it used to be making data entry a little bit easier there what about keyword search codes where are those those are going to be well are you using the notes or the keywords area in a name record there I use keywords okay so every every record I have has a sales title the products they sell and so on do you go into like the keywords area here where you have these lists okay still going to work so if i go into this version here i can go into terry that's actually the same record and i'm still going to have a keywords area i can actually drag maybe i want to right here next to activities so if i go into keywords there they all are and i can add Okay. I can go through my different, there's my user-defined code. So I can add, apply, and I can search on them too. So that's going to allow you to still search on there just as easily. If you wanted to add a little bit of a keyword search, I think you just go into, let's see, keywords. And you can say Boolean, and I can put in the keyword I need. Let's see if you hit the little drop-down, if it's in there. No. No. So you just search your line. So if you just say sales and PLC, that's all you need? Yep, and it's going to show you. PLC being a product? It'll search that keywords area. The new version being released next week is actually going to have another column added next to first name that shows where the word was found. So I could click and view it in there. The initial version they didn't put as beefy of a Boolean search in it. so they're adding that now so that's going to be better right now that's a little easier to use still in the standard PC Recruiter the PCR9 better for Boolean searching now for about another couple weeks but the Boolean searching is coming to the PCRM product I saw a demo of the finished product on Tuesday of this week the development team took me through it showed me what it looked like it's really good they said they're just working out a couple other kinks and it should be out next week or the week after because it's a holiday week next week. So within the next couple weeks, that's going to be in here too, and you'd have that. Got it. Got it. Anything else you're going to show me? That is all I generally would show him here. Any questions? We're taking them as we go, but any other questions at all? No, actually, I like it. there's a lot here obviously and it would it would almost require me using it for a week to get used to it I'm sure you know but I like it I like it I think it's a good version yeah let's do it what I can do I can email you over paperwork to upgrade to add it get it all done. And let me just make sure that I have your correct information in here. I think I do. Let me go in here and just make sure. So I have you are called the Bishop Group now, correct? Right up there. Yes. Yes. And is it still 3553 Westchester Pike, Suite 314? No. No. I didn't think so. Usually my addresses in here are pretty old. So what is your new street address? Well, I work out of my home. You want that address? Sure. Yeah, whatever. is best associated with your company all right um 856 milmar road m-i-l-m-a-r r-o-a-d newtown square so it's new town city what's your zip i'm gonna see if the phone one nine 19073. 19073. If I hit save, most of the time it'll get it. Newtown Square. Perfect. It did. Awesome. And now you're still one user? I'm still what? Still just one user? It's just you? Yes. Okay. Yep. Perfect. Perfect. So what I can do, I can put together the paperwork for you to review, and it'll come in a DocuSignable type format. It's actually PandaDoc, just a different brand like DocuSign. And if you're ready to go, just sign that, send it on back to me. It'll come back to me as you sign it. I'll countersign it. Then we'll get you an invoice for the setup and get your monthly move to the 84 and then get you in queue to have it turned on and added and get the training underway and get everything started. Jim, when would that all happen probably? Assume I signed it tomorrow. If you signed it tomorrow, invoice went out tomorrow. If it was paid tomorrow, maybe by Tuesday, Wednesday, we would have everything set up. They'll have to upgrade your existing database to the premium package, so they would do that too. But it takes a few days. Maybe by mid-next week to this time next week. That's fine. That's fine. I just didn't want to have to do it tomorrow. Oh, no. No, no. If you just sign tomorrow and the invoice can be sent, then it's our job. So it's in our court for a little while while we get everything installed and turned on and configured and everything like that. By the way, I appreciate you showing me all this. It looks good. My pleasure. My pleasure. Thanks for reaching out. I've got so many people reaching out to me. I know it took me a little bit to get back, but I appreciate you taking the time. Not a problem. Thanks for your time. Take care. Thank you, sir. All right. We'll talk to you soon. Bye now. Have a great day. Bye-bye. You too. Bye. Thank you.",
    "duration_in_seconds": 1769.256,
    "duration": 0.49,
    "processing_time": 237.34752988815308
  },
  "metadata": {
    "processed_at": "2025-09-21T21:49:48.539225",
    "processing_time": 691.875257,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}