{
  "recording_id": "2995009890037",
  "job_id": "aac1e453-a551-4b66-ba07-35f05eda28c6",
  "status": "completed",
  "transcription": {
    "text": " Brian Henson. Good morning, Brian. Jim with PC Recruiter. How are you? Jim, how are you? I am well. I got your voicemail. I want to give you a holler back. Yeah, man. How's life? You're, uh, I think you're going to die working for PC Recruiter, aren't you? I don't spend a long, long time. Twice a year. Yeah. How are things going? Doing all right. All right. Doing all right. How about you? Yeah, good. Busy. It's picking up. So it's a rough couple years, 23 and 24, but, you know, starting to pick up in tech. So this is where I'm focused. And so that's good news. But anyway, I was curious how things are going with PCR, and I get hit up every other day on other ATSs and just haven't seen a lot of news and stuff about PCR lately and was just curious how things are going. Going pretty good. We're moving along. We have updated the 9 interface to match a little bit more of our new product, PCRM, which I don't know if you've heard of. The PCRM is a CRM product is essentially what it is, and it runs on the same database as PC Recruiter. So it's going to share the same database, but it's a totally new and different interface that includes a sales pipeline, better sequencing, a lot different of a look and feel there. but it's going to include almost everything that 9 has. So it's going to have the pipeline, job tracking, job posting, kind of everything you know and love about the existing PC Recruiter, but with some added CRM functionality. So it gives some additional functions there. So how do I not know about that? Do you guys not communicate to your existing customer base? Well, it only has very recently been released, if you will, because it was originally started as an update to our existing platform and then added some different CRM functionalities. And early this month, we decided to roll it out as a separate product here. But we're still working some kinks out of some of the areas. Like the one thing that a lot of our existing customers haven't heard about it is because the keyword Boolean searching is not in there yet. So that's still having to be added. So I saw it, yes, two days ago. I saw it, and they're going to be putting it in next week, I believe. So that's why we haven't really shouted it from the rooftops. because there's Boolean searching is lacking in there right now. Got it. But if you're doing like sales tracking, something like that, that you need a sales pipeline, it's going to be a real helpful piece. Or if you just want to take a look at the interface and kind of see what it looks like, maybe you'll find you like it a little better. Okay. I mean, does it do anything different other than when you say sales pipeline, what do you mean? So you know how you have the interview pipeline. You can create your different steps and drag and drop through. like that Kanban view. We've added that as a custom deals pipeline. So you could have like contract sent, contract received, needs review, follow up call. You can create different steps and processes in that. There's going to be integrated DocuSign with the system too, so you could send a DocuSign and we'll agree that right out of the system and that would be integrated there directly too. So that's being added very soon. And then just the general look and feel. It's opposed to a top and bottom type setup. It's a left and right type setup. The buttons go down the left-hand side of the screen. And then we've added easier kind of navigation. We've added a whole new workflow screen that you can kind of, I don't know what they call it, kind of a landing page for the name record where you can design just what you want to see on the landing page, and then you can go to all your other tabs for additional information. So it's a little more convenient. Did you want me to take a look at it in a couple of weeks maybe once the searching is done? Yeah, sure, sure. Okay. Yeah, I'd be interested to take a look. I haven't, and then what's happening with the whole sequencing engine? Are you, has that gone well? I've not, I still haven't utilized the sequencing yet, but I was curious about it. Going pretty well. A lot of people like that. And what we've also added, the sequencing, the nice part about it is when it was designed for 9, we already knew we were working on an M. So it's the exact same screens, exact same look and feel as it is right now in the new product. But we've added a simpler sequencing. So another new feature we've added in the CRM is a simpler sequencing, so you can actually go into a roll-up list and on the fly build a sequence right then and there. Pick a few steps and hit go, start it right there, and then you can track it through the roll-up list. You don't need to go into the sequencing area. So give them additional options there too. Now, is that all part of the system or is that an additional premium or how does that work? Additional upgrade right now. So what it is, it is $10 more per user per month for what you're paying now. And then a one-time setup of $350, which includes the creation of that new link and also four hours training. So training on the device there. And it would share your existing database so you could still log into the old version if you want. you could use both kind of gravitate for whichever one you like better so are you you're only looking at like um you know to have the sequencing piece only another 10 bucks a month is that what you're saying well let me see well let's see what you've got right now you have oh so you don't have you don't even have the sequencing piece so no i don't have the sequence You need to be on premium. So yours, you'd have to upgrade to premium, which is $20 a month. If you added PCRM, that would be $30 a month. So since you run the enterprise package, yeah. So you could upgrade to premium today if you wanted, and that would have the sequencing, email campaigns, analytics reporting. That's $20 a user a month. Okay. Because the PCRM automatically kind of includes that in its base package. You have to be premium in order to even get it. So you'd have to go, you'd be $30 bucks more per user per month. So you'd be a little bit more. Got it. Got it. Okay, and then is there a cost to that? Meaning like is there a setup cost to that or is it all? Usually, so if you were going to go upgrade to premium, that's $250 set up. and an additional $20 per user per month. And then the PCRM will be $3.50, set up additional $10 per user per month. If you did them both at once, I'd probably roll the $2.50 and $3.50 into five, just for easy math, and still give you the included training there. So for $30 a month, does that, for the, I guess, the newer, does that give me more than what I get for just the premium? Yeah, that would give you the whole PCRM package, the new interface, the deals pipeline, the simple sequencing. And I would even throw the AI suite in there, too. So we have the AI suite, the content generators, and there's a search they're working on, too. There's even an auto match they're coming. They're working on that. When you put a position in, you can hit a button on that position, and it'll go through your database and find it 20 or 30 best matching candidates. So we're working on an AI automatic search, too, as part of PCRM. Got it. Okay. Was that something that you can demo for me? Yeah, I could do it. This week I'm pretty booked up, and next week with the holiday, did you maybe want to get something that week after the 4th of July, that week of the 7th? Would that work for you? And then I might even have a search to show you. Yeah, I'm assuming you're out next week? Half the week. I'll be in Monday through Wednesday, I think. Okay, I got it. Yeah, so that's fine. Yeah, we can look at it the following week, whatever works. So if you have some time next week, then let me know. But otherwise, we can shoot for the following week. No problem at all. Okay. Well, I was going to say, why don't we pull something for, like, Monday the 7th? Maybe 10 a.m.? Yeah. Yeah, I can do Monday the 7th. Yeah, I've got to call it. Yeah, I'm good there. So, yeah, send me an invite for 10 o'clock. I'll send you an invite for 10 on the 7th, and we can speak then. And I should have even more to show you then, and we can take a look at everything there. Perfect, man. Sounds great. I look forward to it, Jim. All right. Take care. See you, man. Bye-bye.",
    "duration_in_seconds": 526.536,
    "duration": 0.15,
    "processing_time": 90.3461639881134
  },
  "metadata": {
    "processed_at": "2025-09-21T21:46:55.787423",
    "processing_time": 527.566313,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}