{
  "recording_id": "2996425124036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:11:24.940704Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:11:24",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Enter your participant ID followed by pound. You are in the meeting now. There is one other participant in the meeting. Good morning. This is Jim. Hey, this is JP. How are you? I am well, JP. How are you doing today? Doing good. All right. So I want to take you in here and show you a little bit around PCRM and also the sequencing piece of PC Recruiter. Initially, did you have any questions or have any preference on which one we look at first? So, I, you know, we use PCR, just the standard version of it. And I spoke briefly with your colleague yesterday. You know, we're going, we're looking at SourceWale. and I saw that you guys, it looks like you guys have some like sequencing and outreach stuff that's built into PCR. So I started like poking around with PCRM and like, I'm not exactly sure what it is. So like, it may make sense to just kind of start from the beginning and explain to me what they, what they both are. For sure. Okay. Yeah. Yeah. Yeah. So, Let me kind of start with the sequencing because that was brought out before PCRM was released. So the sequencing was a piece that was added to our premium package after you bought the premium package. So you had the premium package. Notably, what it included at the time was email campaigns and the analytics reporting. But what we found is when people were using the campaigns, they could see clicks and opens and replies and all that. wanted to be able to do something with a click or an open or a reply or whatever. So we worked on and built the sequencing piece of PCRecruiter which essentially does very much what SourceWhale does in their sequencing piece but it's built into your PCRecruiter database. So it's not a separate product, there's no export, there's nothing like that and everything is handled inside a PCRecruiter in one area. So what the sequencing does, it gives you the ability to build sequences out within PCRecruiter and you can say usually they'll start with an email and then based on what happens with that email you can say if they reply to it maybe that adds them to a call list as it to a little task list I have within the sequencing screen that I can go ahead and and call or maybe it sends another email and then maybe if they don't acknowledge the email in three days it sends yet another email or something like that so that was set up and added on so it It was something, it wasn't any upgrade in price over what you have now as far as monthly costs. It was like a one-time $250 to set it up and install it. It includes a couple of hours training. And when you have the sequencing, I'm going to show it to you in the current version of PC Recruiter. It actually adds just an additional button at the top of the screen for sequencing up there. And when you click that sequencing, it actually opens a whole new tab. So the sequencing is kind of a whole new area of PC Recruiter, and it's going to have initially your task list showing what you have as far as calls or LinkedIn tasks or items to schedule or anything like that. But then it's also going to have the area where you can go build your templates. And these templates are what I was just talking about where you are able to set up a bunch of different branches within your sequence. So your first one is going to be an email is sent. It's this specific form letter. and then if the email is replied to that's your condition then they're done the sequence is completed but if no interaction occurs within three days you could make it two days one day nine days whatever that continues to the next step which is add them to a call list okay so then for the call you have a number of different conditions that you can mark when you make that call you can select out of a drop down I'll show you where that works but you can mark it connected That means they've completed the sequence left message continues to the next step. That's a second email So no answer would be the next step as well so you can kind of work through this process as many steps as you wish and Some people will set up merely a drip campaign. That is only email campaigns Email pause three days email if they answer it they get another if they don't they get yet another so It might be only emails or it could include things like calls LinkedIn related items it just puts it on a task list it doesn't do it automatically also SMS if you have ring central so I can do some different things within that and the sequence runs on a roll-up list so if you happen to have a roll-up list in your system that has a sequence running on it like my second one does you'll see that little sequence icon is showing there's one running there and there's one running on that one too so that lets me know there's a sequence running on that roll-up list and what's cool is that if If I added someone to the roll-up list right now, they would start that sequence right at the beginning. Or if I added that sequence to this June 13th roll-up list, everyone on that list would start the sequence as soon as I enabled it on that list. So it's kind of a nice mass communication tool there. And then you also have your task list where you have a drop-down of all the different sequences you might have running. And in this one I have running, there was 209 people in the sequence. let's say that if my condition was when they open the email then I want to add in my call list I have 20 people on my call list now some I've called and added a condition they've moved through but I can go into the first one I can see a little synopsis of their record their activities you can even do something cool like throw a call script in here and if you have ring central you can click the dollar mobile number just by clicking that button right below the call script. That'll allow you to click the dial right there. And then maybe I say I left message. That marks that person, moves into the next step, pulls up the next person. I can say for him, I left message again, next person. So it's just going to move me right on through my process there as I'm working through this particular step. And then if I had like a LinkedIn step, I always like to show that because it doesn't automatically do it on LinkedIn. But if you go, just like on the phone record, you're going to open up that person's record. Since I have his LinkedIn page, I can click right to view his LinkedIn profile, and I'm going to send a connection request. So I click to it, get into LinkedIn, do what I need to do, then mark it accomplished, complete or remove, whatever, and then I can move him on through. Now, on that step, can it prompt you to, like, put a note in with the connection request? You could. You could put a little right up here, like where I had that call script. I could put a script of that email right there that I could just copy right out of here, then hit view profile, go and paste it into there. So you could pre-populate a script in there or an email that you would just copy out of there and use. Okay. Okay. And then some other, like schedule, that just puts the people that I want to schedule with, and I can just go ahead and pick my date and pick my time and everything right from there, update that meeting, then I can go ahead and complete that. So I can schedule a meeting with those individuals as well. So it has a few different things that it can do, but what's nice about it is everything's done within the same database. database. So if I happen to go to Mike Podesto and I want to get to his record, I can pop it up on a brand new tab here. I can see his record. Any activities done in the sequence are also going to appear right in the PC Recruiter activities. So at the call stage, I put no answer. That was a sequence activity. So I'm going to be able to see that there along with all the emails as well. So that's what the sequencing does. It's going to beef up your mass communication ability. It's going to be a nice way to set up automations via email, also include calls, texts, etc. So that was added into PCRecruiter. That's available in both versions. What the PCRM is, PCRM was originally conceived as a redesigned UI for PCRecruiter a couple of years ago when they started. But what ended up happening is they added so much CRM functionality to it, and they added predominantly really this huge deals pipeline that the ownership team decided early this year to roll it out as their own as its own separate product so PCRM is now its own separate product it's going to share the existing database that you have but it's just going to be a different portal that you can log in from it is an entirely different UI but it's the same data just a different UI and it it has the sequencing it adds the deals pipeline so you can actually put like companies through a sales funnel if you will and drag and drop them through so you could do that it also adds a simpler version of the sequence so the simple sequence you can go ahead and build a sequence right on the fly out of a roll-up list so if you're looking at the pcrm let me hop into it here you'll see menus down the left-hand side of the screen but it's still a lot of the same stuff names companies positions schedule sequences and like the sequences the analytics those screens are identical if i go to sequences in pcrm it looks exactly the same because it was designed when pcrm was already in development but some of the things like if you look at names i'm going to be looking at the last names there's mike pedesto who i was just looking at in the other one and i can go into his record i can see that that I have a little customizable workspace here, or all of this details. I can look at activities. So it's a little bit of a different view and a little bit of different workings. It adds some cool things like you can actually edit inline here. So you can edit fields right in the menu in the grid. There's some actions here so you can actually email, call, text them right from the main search results screen here. I could add an activity and note, put them on a roll-up. So it works a little bit different, gives you some more convenient things. The deals pipeline is notably a difference. So here what I can do is I can, rather than have names in an interview pipeline, here I have companies in a sales pipeline. So I'm able to just kind of move them through my different process. I can give probabilities and I can assign them values and I can make them like a feeling hot, cool, warm. So I can do that too. So it gives you a whole ability to track deals. So that's a CRM product. And eventually, this could be something that even a non-recruiter would use just to sell anything. So some different things there. And then the simple sequencing is also different. So what we've done, we're looking at the exact same roll-up lists. If I go into this different list here, I could actually build a sequence on the fly right here. It makes it a little easier. So I just say I want to put an email, automatic, go to the email address, it's going to be this form letter, save, done, I can just activate it right now. So it's a little simpler than going into our full sequencing and building it, testing it, putting all your steps, your conditions, everything like that. This might be a good way to just build it in under a minute, hit it, and let it go. And what's nice about it too is if I look at my roll-up list, I have simple sequence running in this list of names, I can see that I have what step they're at. Step one, simple sequence, an email was sent. And I can click there and I can see the email was sent, the date it happened, and I can kind of track them through that process there as well. Okay. So you see it's a different format, more up and down as opposed to left to right, a little more configurable. if I look at Kerry's record something I like about it is if I go into details and I want to get his phone number field I can just type in phone it's going to instant search filter down all my fields and I get only the phone fields so I have some nice ways of navigating the system a little bit better okay so sequencing you could really have either way you could add it to your existing version if you didn't feel you really needed or wanted a sales funnel or the simpler sequencing or the new interface you could do that it doesn't increase your monthly at all it's just 250 to set it up that includes installation a couple hours training if you wanted to add the PCR M piece it would include the sequencing the PCR M piece would be 350 to set it up that includes four hours training but that does include or increase your ten bucks per user per month so we're taking ten dollars more than what okay how per user per month so a little extra, but you do have that whole new interface, need a little more training on the use of that. And you could still use the existing PC Recruiter or PCRM or a combination of both. Or maybe some users use one, some use the other. And maybe everybody eventually starts using PCRM once they get familiar with it and they like it. I use PC Recruiter in my day-to-day life, and I use both versions right now, mostly because I've used the regular PC Recruiter for 10 years. So I'm very used to it. I work real quick in it. But some things I like better in the PCRM piece. there. Any other questions or anything I can show you or anything else I can? So as far as like setting up sequences and things like that, do you guys, like is there any like I don't know like AI like source whale has that like kind of helps you like word the the sequencing like what you're communicating with people we do have an AI piece that's part of the PCRM upgrade it's also something I can get you in the rate the existing PC recruiter if you wish it's an email content generator. So when you go to like an email screen in PC Recruiter, you can tell it casual tone, it's an introductory email, and then you can kind of banter back and forth, mention the sales job, see when you're available, something like that. So you can kind of, it'll help you to generate emails, kind of like a chat GPT type thing. So we do have that AI suite. And there's also some content generators that will generate a candidate summary for you. So like if I happen to have a candidate record I was looking at, and I could generate a summary, let's go to Mike here and see what I have. I don't have a lot of info on him, but if I go to summary, I can hit the AI generator and it'll generate a summary based on information it has in his resume and or fields. Okay. So we'll kind of throw a little summary in there. And then likewise, if I go in and I want to work on an email, I just go to any email, create any email, send screen, hit the same thing this little AI button and I can say casual tone new job opportunity and then it's going to generate something and I can say mention the sales job and it'll put some different verbiage together then you can regenerate it or click to use the text and you would just save that as a form letter so you could do something like that we do include that so that AI is part of the PCRM I would include it in your nine if you upgraded to add the sequencing has thrown the AI as part of that too okay yeah so it's just something we kind of built and like I said I think it does the vast majority of what the source whale does only it's contained in PC recruiters so it's one less product to pay for no additional monthlies and it's included in your data here so you don't have to um push or send or sync or anything like that okay so sequencing is included in what we have it's included Well, it's not included in your existing database, but to add it doesn't upgrade your package. There's just a one-time $250 setup to add it. Okay. I'm kind of confused because whenever I was talking to the gentleman yesterday, what was his name again? Brian. Brian. Yeah, when I was talking to Brian, I thought he said it was going to be 25 bucks a month per user to upgrade the sequencing. Well, it shouldn't, but let me see what kind of pricing you have, what kind of package you have. Are you affiliated with any of MRI, NPA, SRA, any of our partner companies? No, we just have our own small storage firm. So you're there. You're $72 for – yeah, I think maybe he thought you didn't have premium, in which case it would have been like – that's like a $20 upgrade. So that's like $20 per user per month. And AI could be charged sometimes an additional $5. So maybe that's what he was thinking. but when I looked at your screen, you already have the premium. So you don't need to upgrade a premium. You just need the sequencing piece added. But most people, it would have been 20 to 25 per user. For you to add the sequencing, it wouldn't because you're already on premium. He just likely didn't know that. So do I not need, since I'm not using sequencing, do I not need to be on premium? Well, do you use the analytics reporting or the email campaigns? No. Okay. Then you wouldn't need to be. The contract time sheets, that's also part of the premium package? I guess you wouldn't if you don't use it. Yeah, we're just permanent placement. So, yeah, there's no, like, contracting or time sheets or any of that stuff that we need. Yeah, I guess technically you wouldn't need to be. Yeah, the analytics, like, how much extra? am I paying to be on premium? Well, it's not your discounted pricing and you're actually paying less than the list price for it. You worked with Ryan Wilson, used to wildly discount things very often. And so you pay $72 per user per month, maybe 75 since you pay annually, they kind of show a little discount in here. Normally for the premium based package on a one-year agreement is 115. so you're quite discounted okay just because you work for trying and I got you back back at 22 before sequencing was around and it looks like your original agreement probably was for 75 per user per month I'm gonna guess Oh 80 80 is what you're paying so you're paying 80 per user per month but they list it in our thing is 72 because you pay annually so they kind of calculate it out that way gotcha but your list price is 80 per user so this would actually to add sequencing wouldn't increase you at all it would put you at an even 90 if you were to add the pcrm okay so basically 10 bucks a user a month that would have pcrm or sequencing is no additional monthly Okay. Okay. But with the sequencing, I'd have to pay to turn it on. Yeah, just a one time. Okay. Okay. Now, I know that I'm asking you to kind of help me compare with a competitor. or I get the feeling you know what you have, the sequencing and SourceWale and their outreach that they have as well. Do you know how well the sequencing that you have, how well that compares to how SourceWale does their stuff? I don't know everything about SourceWale, but from what I've heard, our sequencing and SourceWhale's sequencing campaigns do almost all the same thing there's a little bit more that SourceWhale does and it's something specific like I had a customer once who used SourceWhale and I don't think he looked at our sequencing but didn't come back from it and I think it was something like SourceWhale lets you build a little character in your email and it'll do something, I don't even remember what it was it was a couple years ago there's some real advanced stuff that they do that our sequencing doesn't do because all they do is sequencing and ours is a piece of a much bigger product and we do many other things but nothing all the basics 90 to 95 percent of the basics are going to be covered in our sequencing um i wish i could remember specifically what that was it was a quirky little thing that was just a cutesy thing it wasn't a functionality thing he really liked it though like it put his photo at the bottom and they could do something and it would I don't remember what it was yes so there's some real advanced QC things they do but all the base functionality is going to be the same we do actually we partner with them we actually they have a click to dial like an auto dialer and we work with it so we work with you know source of a lot of dollars so we we partner with them some but yeah a lot really depends on just what you're looking for. And it's a lot, a lot of people like just to keep the data all in one area and not have to pay another company and worry about your data being in another company's area, another company's system, whatnot. Yeah. I mean, cause what they charge, you know, they, they've kind of changed the way that they, cause they have, they have other products now, like they have a whole host of other things, you know, like they have like different contact tools that you can send email or send text messages and calls right out of SourceWale or PCR using their dialer. And it, like, it will basically record those calls and put a transcript into the system so that you don't have to worry about, like, taking notes or anything like that. So, you know, it does have some of that functionality, but it's expensive. I mean, you know, that ends up being, by the time you add it all up, it's almost three grand a user for a year. So, like, it's pretty expensive. So, it does some different stuff, but you have to pay for it. Yeah, yeah, you can definitely, like, you can start with, you know, doing, you know, you can just, like, you can have it generate a sequence, like, an entire sequence for you. Like you can say, you know, what you want to do and kind of the tone and how many steps. And it will generate an entire sequence with the words for the emails and the messages already in it. You know, like you'll click one button and it'll open someone's LinkedIn page, open the connect button, And then you just have to paste your message into the introduction and then hit connect with the person. Like, it automatically does some of that stuff. So, yeah. So, I don't know. The other issue that I've had is, like, I know that, like, whenever I try to send emails, like, if I try to send form emails out of PCR, like, a lot of times, like, those seem to be getting hung up in, like, spam filters and stuff. So, you know, it's kind of. An easy way around that is. We've had an issue with it. Have you ever used anything like SendGrid or MailGun or one of those? you can actually use a SendGrid alias to send it through their servers. I don't know how they do it, but they always get through. Can you hang on one second? Yeah. Hello? Hey, what's going on? Okay. Okay. Hey, can I call you back in like 15 minutes. I'm just finishing up a call. I saw. Yes. Let me call you back in like 15 minutes. Alright. Sounds good. Bye. Sorry about that. I have a cousin who just had a baby and we're helping watch the kids they already have. Oh, wow. Just making sure everything's okay. That's fun. That's fun. No worries. So something that might help. You were saying? I was going to say something that would help with that. For sending bulk emails, I already use Constant Contact for that. I'm not sending bulk emails out of PCR. It's like the one-off. off. Like if I, you know, basically like what would be the initial stage of a sequence, like if I see a company that's looking to hire somebody, like I have an email template in PCR that I can just go in and click introductory email. But whenever I send that email, for some reason they seem to be getting hung up in and spam filters even the individuals yeah even the individuals and i'm i i went like down an entire rabbit hole a few months ago trying to figure it out and i never never really did like i you know went through and made sure that We had all of our DKIM records figured out and, you know, all of that stuff looked good. Google hosts our regular email and we send and receive messages through Outlook. We don't use like the web interface for email. So we're like using Outlook for it. And it just, it created, it seems to be creating a bunch of issues. So like that's one of the things that's a little bit concerning about this is that like I've probably sent out 700 or 800 intro emails through PCR as one-off emails over a year's time. I don't think I've ever gotten a response to any of them. It's almost like people just aren't getting the emails. That's also one of the concerns that I have because I think that SourceWale does, I think, you know, whenever you send emails through them, I think they also run them through their own servers as well. That's how they do their, like you can do analytics. Like you can see like, you know, who's opened your emails, how many times they've opened them, things like that. Yeah, I think you're right. Yeah, that might be a benefit to them because it gets you out of your existing mail. so yeah that i don't know what else is really to be helped there um yeah yeah like i said like i when matt mueller worked for you guys like i used to deal with matt a lot and you know he and i went through like 15 different things trying to get our deliverability rate fixed and it just it never actually got fixed. It just seemed like it was just a constant battle. I like the fact that you guys have... It seems like you guys are 60% of what Swarovski Whale is, quite honestly. The percent that you guys are is the percent that we're most interested in. I just don't know. I don't know if it's worth giving them a shot to see how it works and see if we get better deliverability or just you know use what we're basically already paying for and see if that works i i i may end up doing a combination of the two like i may end up just having you guys turn on sequencing for the other people because i'm not going to pay for all of us to use source whale until i use it for a while to see how i like it so like I may end up still having having you turn it on and do that sure yeah I just it's just that 250 and then you're on and you can use it anytime you want maybe you use it some of the time and give it try source we'll see if that works better but it's not any monthly commitment so that's good yeah so okay And if we add the PCRM and the sequencing, we wouldn't have to pay anything other than just the setup. But if we did PCRM and sequencing, would I have to pay extra $10 a month per user? Yep, that would be $3.50 setup and then $10 more per user per month. So would we have to pay two setups and the $10 a month? No. Would you have to pay to set both of them up? No, you would pay the $250 for only sequencing, $350 for PCRM, which would include the sequencing. Gotcha. Okay. Okay. Well, I'm going to give that some thought and see. I mean, who knows? I may even be able to, you know, use SourceWell to help create campaigns. And then if we decide to do sequencing, I can use their tools to create a sequence and then just basically copy the steps directly into PCR. Sure. Would be my guess. well let's see take some time think about what you want to do and then maybe i'll touch base about a week if i haven't heard just to check in if i don't hear from you you can well that sounds good i certainly appreciate your your time and uh appreciate you explaining this stuff to me i definitely understand it better than i did now so prior to the call so very well well anything else you need just let me know if you run into any questions, let me know. We'll talk soon. All right. Sounds good. I appreciate it. Very well. Thank you, sir. All right, Jim. Have a great day. Bye now.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 479.544088,
    "salad_processing_time": 91.07904195785522,
    "overall_processing_time": 479.544088,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "job_id": "858e0ce9-0c31-41f5-8778-ab0f2c23b2a5",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 6
      }
    ],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/2996425124036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}