{
  "recording_id": "2996083714037",
  "job_id": "9b5aabff-72ff-440e-bba3-9c61d47bb974",
  "status": "completed",
  "transcription": {
    "text": " This is Kathy. Hey, what's up? Hey, how's it going? Oh, okay. Trying to get all these steps and that screwed up, and I'm realizing something's not screwing up. Yeah, so that's the thing. So I want to make sure that we don't get ourselves in the same boat. Right. And so I'd much rather show you how to do it right than... Yeah, because I'm afraid, like, if I uncheck that box, Is it going to charge their card now? Because I have another one here that I'm looking at, Integra Partners. Yeah. No, if you leave the box checked, if you leave it checked, then it's going to charge it. So you have to uncheck the box because you don't want it to charge anything. You want it to apply the credit. So you can do it from within the invoice, or you can do it through receive payment. But you want to make sure it's a zero payment. And it's got the credit amount checked at the bottom. And then it only has that amount in the invoice amount. So if it has the full amount for the invoice, you want to override it. Okay. So uncheck process credit card, right? Yes. Yes. Okay. All right. I was just wanting to make sure that that's not going to lead to the other issues. Like remember how like some people like their card wasn't? Okay, so we're not doing... Yeah, you're just in this one. You're not in the recurring, right? You're in this one invoice that you want accredited. So you're in an invoice that you dated $725, and so you're going to apply that credit. How much is the credit? $300, is that it? $300, yeah. Okay, so you'll say $300 on the invoice, and it'll have $300 in the credit, and it'll say depositing zero. Right? At the top, on the top right. Oh, amount received. I took everything out as far as the top. I unchecked the amount. I put amount received zero. I checked the invoice, checked the credit memo. So it says amount to apply 300, amount to credit 975. No, no, no, no, no. So, yeah, you want it to say 300 on the invoice line. So it should say invoice is $1,275 and the payment is $300. I don't want to make – you know what? Can I – do you have a moment? Let me do it. Can I do a screen share? Yeah. Yeah. Yeah, the mailing. Okay. Hold on one second. Let me go to – because I want to learn because you never know. Okay. But if this isn't going to be your normal duty either, then, you know, I don't know if you want to spend a whole bunch of time learning things that you don't need. Well, okay. So here's the thing. I'm like, ooh, I think I've done that wrong thinking that it would just, like, come off the next one. So I looked up what I at least have done, and there are, I think there are four credit memos that are not applied. Oh, okay. That I might have done. Okay. So the one for an entire group. Could you send me the link? Okay. All right, let's see. I'm going to do that right now. Yeah. Because then I can walk you through them, and then you'll have a better understanding of it. New meeting, start an instance. Yeah, because sometimes there were people, like, that were on sales receipt, and Liz had done like a user change on the recurring, but then their invoice was created based on what they were last invoiced, not what Liz had already adjusted in recurring. So there were some adjustments that needed to be done. Usually when we were switching ones, we went by the recurring, but we could have made a mistake, yeah. Yeah, there were definitely a few where it was just like, oh, no, I see. Yeah, it's in the recurring, but it was in the recurring sales receipt, but like the amount was done based on whatever their last sales receipt was. And this was one of those, I think. So they overpaid for one of their, or two of their months. So that's what the credit is. Okay. So you should, oh, did you get it? Did you get it? Oh, there you are. Hi. Hi. I am not showing camera. You're not showing camera. I love that. I got to turn my other speaker off. Oh, here we just mute these. Yeah. Okay. Is that okay? Yeah. So do you, so I have Integra. Share your screen. Share your screen. Okay. Let me show mine. Share your screen with me. All right. So you already did the one. So I will do this one. Let me drag it over. I thought you were doing Integra, right? Yeah. Where we're going Integra. Yeah. okay so here's Integra this is their now new invoice and then this is their credit okay so show me uh show me the invoice because it was the in so the invoice goes down to $12.75 and then it has a $300 credit right right um actually click on click on the little gear icon you see the gear icon on the right where it says action on the note I'm sorry just too high down versus account amount status action oh that one lines receive yeah yeah okay and say a balance they balance on there and save huh so that will show you like what's the balances so you'll see that you don't have a payment applied there still says 1275 so click on the invoice and I'll just show you how you can do it when you're in there. So click on the invoice. And then up at the top, it says receive payment. I'm like pointing like you can see me, you know? Oh, I know. So, so yeah. So unselect the process card. Do that first and foremost. Okay. Yeah. And then, and then what we're going to do is, I'd usually change the date to today, because I don't want it I want to be careful that doesn't create the invoice first and then see the applied payment so where's this payment date at the top I'll usually put today's date in there see we're above the credit card okay yeah so just put on today's date in there and then you're going to go over versus invoice at 1275 under payment down below and then right there and change that to 300 so just I'll highlight it yep and 300 and then it should update where now the payment at the top sees his payment received at the top is zero so amount received we want it to be zero in that box on the right do you see that up a little bit yeah right there so now it says zero and we want it to be zero we didn't get any more money and we're applying the credit So the credit is 300, the credit memo is 300, and then down below it says amount to apply, and then it has amount of credit zero. So now we can save it. And right now it's going to an old KeyBank checking. That's fine. It's going to be a zero deposit. So that's totally fine. So go ahead and say save or save and close, either one. and then when you go when it goes back in since it's just saved you'll have to exit out of this since it wasn't yeah and then when it goes back to the invoice you'll see it now says balance due 975 came and applied 300 and you can see that in the bottom too okay when you go down scroll down the bottom you'll be able to see it there too yep and you can just close out of the invoice now or save and close yep and when you go back to the listing there you'll see it tells you that the balance is 975 it's been partially paid so then then you'll notice it scroll down a little bit you notice that your $300 credit now doesn't have a balance of zero then applied okay now there are other ones that you would did before that I went back behind you and I applied so you'll have to ask and see if I caught them all or not. Yeah, maybe just anything as a refund or something. So you don't need to be in that black menu. Just go back to where you are. You were in the right place. You were searching and you were looking for it. You were in the right place. You were in the right place. Here's the other one I was thinking. So that one's now applied. Okay. So here are three other ones I apparently did wrong. Okay. Okay, good. Then let's go to Russian company and we'll check on that one. Can I do, oh, just up here. Yeah. Oh, wait, I have to go back to Integra. Oh, wait, no, I don't, right? I don't need to skip it because I just, I already have it. I already did the invoice. Well, let's look. Go back to recurring entry. Look at the recurring entry. and it says next date 725. Yes. I always do that before I leave this screen. When I recreate it, I always switch that before I leave the screen. And now Russian company is right underneath. It's the first one in that viewed, recently viewed. Okay. So this one, what do I have to do? So that has, yep. So you're going to go to the recurring transactions where you were and you're going to right click on there and say use. Oh, okay. I was going to the other one saying duplicate, but okay. Use. Yeah, no, use. Yeah. And then you're going to change the date to 7-1 because that's when the next one occurs. Okay. Should have made note of that. Fix that date. Okay. Mm-hmm. and then we shouldn't need to do anything else. We'll just – is this the right amount then for going forward, the $103,500? Let me make sure. Okay, so what you can do is if you go to your web browser where it says Invoice at the very top, go back to the QuickBooks. Go back to the QuickBooks and right-click on that. I want to look and see it because I want to see it. There is something that I covered before. I'm trying to show you how to open a second tab so you can go back and look at the customers if you had notes. No, I'm not looking there. I'm looking at what's on their thing. OK. They're now supposed to be at seven users. It's at nine now. Hold on one second. So just change it to seven. That changed on six to two. Hold on one second. You didn't have to go out and all that. You could go back and forth, back and forth. I could have helped you to. I'm trying to make sure that the amounts are right. So on 6-2, they were supposed to go from 9 to 7. Is that why I have a credit? Let me see. Hold on one second. I remember what I was doing these for. They were supposed to go to nine. What is my line item here? They were at nine, and you said they were supposed to go to seven. That's what you gave them. Okay. So they actually only went down one. So they went down one user. So it should be eight, right? So the recurring invoice wasn't changed to eight. Oh, I know why, because they went before 8 to 9. Oh, okay. I think I know what it was. They had already gone. Liz had bumped them up. Now the next one should be over here, should be. Why is that now 9? Why is that saying 9? Because you haven't changed it. That's the recurring. You have to edit. You have to be right where you were and you got to change it. I know. Okay. I get that. I'm just saying. I'm just trying to make sure because there's some customers that go up and down and up and down. And I got to make sure that there's not another request because, trust me, I think it's like fellow and associates. They'll, like, change their users almost, like, every week. So I'm just trying to. There's a couple like that. I just want to make sure this is like whatever the last request is, removing users. Okay. Okay. Can we change to seven? Okay. Yeah, this one has to go to seven. It went up and down. So they changed it again? They went down one more because they went down to eight. And now they're down. So this one. Okay. So don't change. No, don't change anything there. Yes. Just change that for the template. This is the recurring. Right. So just save that for the template. And close it. Yes. Yes. Okay. So they're not recurring. That's good. Okay. You got to change. Yeah. Say use. Yep. And change the date. I'm going to make this 7-1. okay mm-hmm that will update all by itself yep that will that will change when you change the date and then we're going to so just on the word says save and close just do the drop-down and say just save okay so say where we stay in it okay then yep and then at the top says receive payment and you're a click on that. Yeah. Undo. Yes. And then. So scroll down so you can see, I don't know if you can see below where I can see, but see where it's 115. You want 115 on the invoice line, on the invoice line. Oh, over here. That's right. Okay. That one. Uh-huh. Kind of have it like too many spots. I think it'd be easier. And then go ahead and. Yeah. And then change the date. Change the date to today so that it applies it really before the next one gets created. Okay. Yeah. And then you can save and close. Save and close. Okay. So that apply payment. Save. So just don't save and close. Okay. And then you can just say save and close here, or close, yeah. Let's go that way, okay. And then what else do you have to do on that screen before you leave it? Yeah. Yep. And then you see that that's been changed. You might want to also put in your notes that the users changed the 7 for the July or something like that. If that's not clear, but in the notes section. Not the invoice, but the... I don't know if I want to do it there or I just need it. here I think I would just do it here you want internal note or you want now I want to go to the customer that's that's a standard that's a standard note to the customer right so if you want something else you're a change it there yeah Overcharge, previous overcharge. For one user credit, something like that. Okay. And that says 4-1-1-5 instead of a dollar sign, 1-1-5. And this one only, yeah? You don't need that to be applied to everything. Okay. Okay. All right. So then, okay, we got that. And then we've got that pushed back to eight. Okay. And then my other two, Nemes. What was this for? Credit for fourth user dropped from 625 invoice. Okay. So did you want to check to see that they're still less? Because they're recurring invoice, I believe, is the same amount as this invoice, 20860, right? So no change in the recurring invoice. You gave them a credit, but you didn't change the ongoing bill, the ongoing invoice. Oh, what the hell is going on here? I'm worried I got undoing this. Okay. So this is going to go 7-2. And I should be at three users now. Right? None of this changes? None of that changes. Just say. Yeah, you can – I don't know how all that got in there. So, yeah. Yeah, see that one that says manage? Click that manage again so that goes away. And 7-2 is the right date for the next invoice. Is that right? Yeah. And – So go receive payment. And you changed the – you probably should save it first. I did. Did you, did you, okay. So you said save already? Mm-hmm. And I got received payment. Yep. let's just say zero right yeah this and i'm good right yep i'm saving close Good. That will be seven, too. One last one, right? Yeah. Okay. And then, okay, so just to make sure. Recurring should be three. Okay, change it on me again. Okay, that's re-users. Okay. Okay. Okay, so then the other one. I'm going to share on this one too. That would have been this probably. users okay he went to four users and then he needed a credit because he overpaid on before okay so this next one is supposed to be 715 I'm going to use right mm-hmm mm-hmm Do all that. Save. Mm-hmm. Receive payment. Take off the manage. Okay. Receive payment. uncheck. I'll do the date while I'm here. 6-26. Put this 198 here. Mm-hmm. You hit tab. It'll put in the zeros if it's just even zeros. Okay. That goes up. Yep. That seems good, right? Yep. So save. So just save and close. All right. We'll do that. Do that. Go here. Go there. All right. So if there's any unapplied, they're not for me. Okay. All right. Thank you. Thank you. Thank you. Have a good night. You too. Thanks. Bye. Thanks. Bye-bye.",
    "duration_in_seconds": 1558.44,
    "duration": 0.43,
    "processing_time": 119.39023041725159
  },
  "metadata": {
    "processed_at": "2025-09-21T21:49:50.078418",
    "processing_time": 674.916959,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}