{
  "recording_id": "2996529215036",
  "job_id": "c18857e9-5324-447b-9266-dd68f5d65e09",
  "status": "completed",
  "transcription": {
    "text": " Thank you for calling Main Sequence. This is Robin. Hi, Robin. How are you? I'm good. How are you? I'm good. Probably just as good as you are, but no better. Class. I wanted to check with you to get the total amount refunded on Lincoln and Creed, because I have to take it off of my numbers this month, because they're a refund within the 90 days. How much did we refund, or when did we do it? What do we do for refund? I don't know. Do we refund? That's my thing. I don't know. And I don't want to give back money if we don't need to. Yeah, we do. And is their ticket even in? I know their ticket was in. Because they did absolutely quit because they had deal breakers and they were absolutely quitting. And I think they should be a full refund. like the other one we still have to hear from Bill because that's that DS and they did take some training and whatnot Lincoln and Creed did no training did not okay Lincoln and Creed hold on one second let me see let me look up them what's going on yeah one of them was like yeah one we're still waiting for Bill but Lincoln and Creed was a non Oh, canceled and refunded So they got everything back Yeah, that one they got everything back Lincoln and Creed On a 6-11 Yeah, on 6-11 they got a refund Groovy That is good to know Because now I'll pull that off Because that has to come off of this month Because you can't get paid on You can't get paid on money that isn't there So that makes sense That is good And then the other one that That bts search that guy we haven't decided on his refund yet because that's the one we were emailing about a couple days ago they're a dimensional search he took a few hours training bill thinks maybe half but we've got to get a final so once once that refund happens let me know and then well i have yeah i need to know if we are refunding and if so how much so and i can't refund so i have to go to kathy to do it okay so i just need to know what you guys are giving back because i don't know a setup fee like hey you started and that is non-refundable it doesn't really say it's not clear like on how it's worded in the contract what would be refunded if they click they cancel 90 days it's kind of murky it is yeah i wish it was black and white because what we've done in the past like i said we've always taken into account how many hours of training they got roughly billed those at 95 an hour subtracted that from the setup and then refunded back any unused setup. Now, the monthlies don't get refunded at all unless they prepay. Yeah, they haven't paid any monthly yet. But they haven't paid any, so that's fine. Right. It's just the initial $800. How much do you guys want to give that back? Because there is the setup, like the McKenzie time, and then there's training. But it's not itemized to say what's what, to kind of go with how it's worded in the contract. You know what I mean? I might maybe think $250 for the McKenzie time plus $95 per hour, plus $95, plus $95. So that would be about $440. Also not credit back the $50 because that was for the first month that he did have access. So $440 minus $750. So that would be about a $310 refund. That would be what I would say. I'm going to suggest that to Bill, and he'll probably be cool with that because it's not a full, but it's about half. That sounds fair, doesn't it? Yeah, I guess so. Yeah, because it's also weird. Like, you know, how many hours did they get versus used? I mean, what are we considering? It's kind of, yeah, it's kind of murky. Because if you did it, if it was like 10 hours at $95 per hour, that's $9.50. That's more than even the setup fee. You know what I mean? So that's where. Now you could say 10 at 80, which would be 800, but then you're not doing any kind of set up fee charge or monthly charge. Yeah. So we've got to keep the 50 for the first month. We've got to keep two hours training. And I would say keep 250 for the McKenzie time. So that would map out to about 300 bucks back for him, which I think is reasonable. I'm going to tell that to Bill. Okay. Just let me know, and then I'll have Cassie, and then we'll go from there. For sure. I can't refund it. For sure. No, that's all good. And that other one, we've just got to wait for whatever Bill wants to do on that cancellation with the lady whose contract we don't have. Right. I don't. Yeah. I mean, if she goes, oh, well, show me a contract and we're going to. Yeah, I don't know. Yeah, I don't know why we don't have it, but we don't. So I don't know. We'll wait to see what he says. OK. All righty. OK. Thank you, Robin. Thanks. Bye. Bye.",
    "duration_in_seconds": 303.912,
    "duration": 0.08,
    "processing_time": 31.56757688522339
  },
  "metadata": {
    "processed_at": "2025-09-21T21:47:01.166251",
    "processing_time": 500.946248,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}