{
  "recording_id": "2996403343036",
  "job_id": "92f7f04a-862e-40b2-ade0-76997b18c9a0",
  "status": "completed",
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is Garrett. How may I help you? Hey, Garrett. I am calling for help with an issue with email connection. I think I actually spoke with you yesterday. I'm trying to revamp an old computer that hasn't been used in a while, and I'm sure it's just a setting with some emails. Okay. What's your name and what company are you with? Okay, it's Kim McCurry, and I'm with VDC Recruiting Group. Okay. But it's for Ryan McBrien. Okay. Got it. Okay, so I'm just going to log in under Ryan here. Yeah, do you know Ryan's username for PCR? Should be R. McBride. Okay. I guess that is somewhere in the profile, isn't it? That works. Yeah, R. McBride. Okay. Okay. Let me check the email connection. Testing. Okay, yeah, it doesn't look like the email is connected to Office, so we'll have to reconnect that. If you – let's see. So are you currently signed in as R. McBride? Uh-huh, correct. Go to System in the main menu at the top center. Mm-hmm. and then go to email setup on the left okay and email alias on the right you know this list and then in the bottom I may be in the wrong spot hold on okay go back cuz I'm already click on email oh oh here so if you just want to go to your main PCR screen and then up in the main menu you'll see system at the top center. Okay. And then the left is email setup and on the right email alias list. Okay. Then in the bottom frame click the pencil icon to edit the email alias. Okay. And then your it looks like Office 365 is your provider so you'll just want to click on sign in with Microsoft and connect to Microsoft that way. Okay, I think maybe it's something in, a window popped up and then it disappeared. Okay. And then does it have the correct email address in the from and reply to fields, or did it switch to a different one? No, it is the correct one. Okay. It should be good then. And hit test connection down at the bottom. Okay. Is green lettering anywhere in there? Yes, status might be green. Status. Uh-huh. Awesome. Okay. You can close the test. And I'm noticing one other thing here. At the bottom left, it says delay between emails. Switch that to 3,000 rather than just three. And then hit save. And you should be in good shape to send out from PCR. That's right. Okay, super. All right. Awesome. Anything else you've been having trouble with? Not before, but. as I progress things about when it pops up so sure okay y'all are so helpful that's awesome yeah happy to help anytime y'all are good yeah I appreciate it alright have a great rest of your day alright Garrett you too bye bye bye",
    "duration_in_seconds": 273.384,
    "duration": 0.08,
    "processing_time": 31.114659547805786
  },
  "metadata": {
    "processed_at": "2025-09-21T21:46:59.857011",
    "processing_time": 503.353092,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}