{
  "recording_id": "2996557142036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:11:31.038541Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:11:31",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your participant ID. You are in the meeting now. You are the first participant. Please stand by. Hey, Jim. Hello. How are you, Tiffany? How are you? I'm good. How are you? I'm pretty well. Pretty well. Thanks for joining me this morning. Is it just you joining today? It's just me today. All right. All right. So I guess what we're going to take a look at today is the premium features, notably the sequencing, kind of some of the newer stuff that you don't have with PC Recruiter. Is that correct? Yeah. So I have a marketing person now, and I wanted to have her look into PCR and dig into it to get some emails going where we can send those out to people. And so when we called, it turned out I don't have the premium, I guess, to be able to do that. Mm-hmm. Yeah. So I guess sequencing is part of that or something. And so that's where I'm just I'm not sure. Okay. Yeah. So we do have – you have – right now, you have the Enterprise Package. And in the Enterprise Package, you do have the ability to send bulk emails. But they're just that. It's an older technology to send bulk emails. But the newer version that will allow you to send bulk emails, email campaigns actually, not only allows you to pull like reports so you can see when you sent the campaign, you can see who opened, who replied, how many times they opened it, what they clicked. With that, you're going to be able to see the information, but then moreover, you're also going to be able to set up sequences so that you are able to say, send an email to everyone on this list, and then if they open it, add them to my call list. But if they don't acknowledge it in three days or five days, send them this second email, and then maybe if they don't acknowledge that, take them off the list, or maybe if they do, add them to my call list, maybe send them a text through RingCentral or something like that. So you do have a lot of automation that you could set up if you wanted to within within PC Recruiter. OK, so that where I pay. Go ahead. So I was going to say, let me show you around a little bit. You currently don't have that package. So you have the enterprise package of PC Recruiter. So it looks like I'm going to pull up your actual paperwork here to see what's going on there. So we have the ability to send bulk emails. It just doesn't track anything or give you any information. You just hit send and it goes out to cyberspace and you never know anything about it. Yeah. Yeah. You just kind of send it home. You don't see if they open it or see how many times or anything like that. So does this work even with like, So if we send it to a client list, I mean, it's the same whether whoever we're sending it to, if they opened it, and when you said, are you saying they respond, are you just saying that we sent something that would ask a question or whatever? Yeah, so what you can do, you can see. So let me show you, actually. Let me share my screen here. Okay, great. So I'll kind of just play it. And one question real fast. When we get this option, do I pay per person, or is it something I pay for that is just part of then the package that I pay for with PCR? It's per person. Upgrade the package, but you have to upgrade everyone. You can't keep other people out of it, so it would kind of – it includes several things, but it would be an upgrade for the whole package. It would be $20 more per user per month and a one-time 500 setup. The 500 setup includes turning on all the new features and six hours training. okay okay so to kind of show you around a bit so if you're sending a bulk email let me see i've got a girl that i may want to add to this call one second if you don't mind not at all let me see if i can get a hold of her real fast because she you know if i needed to add her as a user, I could, and then she could probably, you know, okay, give me one second. I'm sorry. Sure, no problem. I don't have her phone on my phone for some reason. Okay, one second. Hey, are you available by chance right now for 30 minutes? Okay. Can I add you into a Zoom? I'll send you the invite or hat, Jim, but I'm on the phone with PCR, and he was going to kind of show me their sequencing with PCR, where like if we send out an email and then someone replies or opens it, it shows us and then we can create some kind of campaign. And so, okay, all right, I'll have him send you the invite. Thank you, bye. Okay, can you send this to your invite you sent me or I guess I can just forward it, right? So, yeah, you could just forward it. It'll come through, and you can just click the button and join right in. Yeah, let me just do that real fast. Thanks. For sure. I'll just send her the invite. her name's Christine and she's kind of been doing her marketing and she'll understand a lot more of this than you know I mean I will understand it but you know what I mean sure sure yeah Thank you. Give her some new ideas and everything. Yeah. Okay, she should be here in a second. Thank you. Thank you. Do you have birds or is that in your backyard? That is in the backyard. I've got the windows open. It's quite across the room, but they're loud birds. Right. Where do you live? Cleveland, Ohio. Oh, okay. So then you're not sweating up there yet. It's been pretty, it's been in the 90s and very humid lately. I think today, what, it's about 84 now. So it's been pretty warm. Yeah. That's the way Houston's always hot, so. We're not sweating like Houston's sweating. Yeah, this is uncommon for us to be this hot this soon. Right. Normally it's a little bit cooler. Well, I don't know what she's doing. I thought she was going to, she said she was going to hop right on. So I don't know. Well, what we can do. I guess we can just continue on. I'm sorry. We'll continue on, but I'll record it. And then I'll send you the recording afterwards. And then she can join as she joins, but we can share the recording as well. So let me just. Do you have like where you have to add her anywhere? like if she's here now you're connecting audio okay I think she's in yep she's coming in I'm recording it anyway so I'll send it over to you after we're done oh great okay that sounds great I'm here all right thank you Christine okay so so uh what we're going to take a look at and welcome Christine so what we're going to take a look at is a little bit of the email campaigns and sequencing options available within PC Recruiter right now So right now in the version of PC Recruiter, and I was talking with Tiffany about what you all have right now, you can send bulk emails. So you have the ability to send bulk emails. They're personalized, blind carbon copied. It's going to track that the email was sent in the candidate's record or the person's record. but you don't have any way to know if they opened it or if they replied. You'll get the reply, but you don't know how many times they opened it or anything like that. The email campaigns piece is going to give you some expanded functionality around that. It's also going to give you some expanded functionality around sending the actual email. So starting at the beginning, if I have a roll-up list of individuals and I want to send an email out to them, maybe I want to go to this Boston Co. roll-up list. I've got 20 names on it, and I want to send out a mass email communication. From my roll-up list, I can just hit select all. Go up here, and I would go to the letter option, and that's going to let me send my email campaign. So the email campaign screen that's going to come up, if you did this right now in your database, your screen would look totally different because you don't have the campaigns. But the campaigns is going to let you either create a new campaign or use an existing campaign in your library of campaigns. You'll see I've got a few different ones in here. I'm going to go through and I'm going to put this candidate or no I'm going to put update your contact information with us kind of pull that one. So this is consisting of a form letter. So this is just a form letter that's in the back end of your PC recruiter form letter list. OK, you can change the subject line if you wish. You could also categorize it. BizDev, marketing, whatever. And then some of these unique options you get, you have the ability right here that you can say you're going to send it to this selected set of names. so this roll-up list. By default, you're always going to send to the primary email address field, but if you happen to have like a secondary email or a home email or anything else, you can choose to send to a different field for every record if you want it. Nine times out of ten, you're going to be going to primary email address field there. It's going to come from whoever is currently logged in, but if you wanted, you can set up different aliases. So you can set up a different alias from which you want to send it. A useful item here, if you want to use something like SendGrid to relay, you can set up a SendGrid alias and select to email it through the SendGrid alias right here. That way, it's going to get higher deliverability. You're not risking your existing email address in sending mass email campaigns, but it's going to come from you and the replies are going to come back to you. So it gives you an additional option there. Then another cool thing, by default, it's going to send now, but you have the option to send later. so I can go send later, that's going to let me pick a specific date, or I can go over to advance and I can pick a time and date. So maybe if I want to send it Sunday night at 6 p.m., I can go ahead, queue that up, so I can queue up email campaigns to be sent here, and I can queue up multiple email campaigns, and I'm going to be able to kind of just queue them up to be sent, and they're going to sit there in the email campaign area until that time hits then they are sent so that email campaign is going to be sent it is of course going to create an activity in each person's records if you looked at the activities you would be able to see the activities which show bulk email sent or email campaign sent or whatever it was now also if you go over here into analytics you're going to have the capacity to go into an email campaigns area and get a detailed report of every campaign you sent. And in that detailed campaign report, I can see, for example, the last time I sent the update your contact information with us, I had a 93% open rate. So I can see that 40 out of 43 recipients opened and looked at my email. And from here, I can also see 74% clicked one or more of the links in my email. It could be my LinkedIn page, the link that was in my signature. It could be a link to a job I'm sharing or a link to our website, whatever it might be. So I can see 32 people clicked a link. I could see six people replied, so I did get a few replies. And I can also see bounces and unsubscribes. So bounces would be email out of the office responders. That's going to be a soft bounce. Or a hard bounce is going to be this address doesn't exist any longer. So it's going to track the bounces if I received any as well, or anyone who hit the link at the bottom to unsubscribe. So all that data is created. What's cooler is you can scroll down here and I can look at all my opens. I can see who opened it, how many times, when they last did. So I can see that Ryan opened it a bunch of times. Or I can go into clicks. Actually, I can do it up here too. And I can see what these individual people clicked. He clicked the profile to update his information with me three times. He clicked my website once and he clicked my LinkedIn address three times. so I can see he's clicked several times so he's someone that has clicked several times he might be really interested so I can see all of my clicks how many times what they clicked all that data is very easily visible so you can see the email campaigns piece is going to allow you a little bit more of insight into how your email campaign is going and what's happening and what's working and what's If not, what we also have included... Can we... Sorry. No, sure. Go ahead. Go ahead. I was just going to ask if we can design... If there's customization options for the email campaigns. Oh, yeah. Yeah. When you design your email, your form letters that are going to be part of the campaign, you go back in the system and you go into letter. Okay. And if I go in there, I can do name letters and you can put in different letters, different logos. you can go through it like if I wanted to edit that so I can make this obviously mine are just text I think but you could put logos in there make it a nice-looking email campaign piece there this is mine's just a pretty standard couple so maybe there's a logo maybe you put a signature or anything like that so yeah you can work with that to make that look really nice okay and then what you can also do to build on top of that you can actually utilize our sequencing with NPC Recruiter. That is going to give you a whole other element up at the top called sequencing. And what you can do there is you can build campaigns, drip campaigns and the like. So I could go up into sequencing. And when you add the sequencing, you actually get a couple of templates. I think these two come included. So you have like a business element template. So that is going to consist of branches. And my first branch is going to be send this form letter automatically. And then based on what happens, I can say if the email is replied to, they're done with the sequence. But I could say if no interaction occurs within three days or maybe four days or eight days continue to the next step which is add them to my call list and then i can go ahead and when i go through my call list when i make that call i can then mark it connected left message no answer remove from sequence and when i design my sequence as i do right here i'm able to say what each of these options will do so if i select left message it'll continue to the next step which is a second email so i could build this automated sequence that It started out with the ability just to create a drip campaign. Send an email, pause five days, send an email, pause six days, send one more. Or maybe you want to send an email based on what they do. If they open it, they get email A. If they don't open it within six days, they get email B. So you could do something like that. Or you could also build it out like I have here that would include a call or maybe a text if you have to be using RingCentral. So you can kind of build your own templates here. And then what happens is you assign it to a roll-up list. So you go ahead and apply this template to a roll-up list, and everyone on that list is going to get that first email and start in the template. And anyone added to that list after the fact would start the template immediately as soon as they're added. So you would have the ability to kind of keep people adding to the template as you go. So if in the instance that you have something like a call list here, so I've got my first email goes out, the second step is call. Anything like that is going to happen in your task list, which was the first thing that happened when I opened my sequencing area. And this is going to show me all the different sequences I might have running. And if I go into any one of these sequences, I can see I started with 209 people. No emails. They've all been sent. but 24 of these people maybe opened my email and thus I've chosen to have them added to my call list so I know that Eve opened my email so I can click right into her name I can give her a call and say hey if I know to show up my email wanted to follow up maybe you want to write a script in there you can build a script as part of the kit of a part of the sequence here so I have a whole script to read you'll see where it's kind of grayed out because I don't have a mobile number for her if I did that would say click to dial her mobile number and that would click through the ring central integration it will allow you to dial her number so I could click to dial read my script say left message that'll move me right out of the next person click to dial read my script I can say no answer move on the next person and I can just kind of move on through my call list and it gives me a little bit of his information off his name record his most recent few activities and I've got of course my script and my click to dial and then my results so that's going to kind of go take them into the next step whatever that step might be and so you might have calls emails and SMS those happen automatically but things like calls or LinkedIn related items those are something you must do I can see I've got a couple LinkedIn items here if I click in they're going to be I have to send a connection request to these two people so let's go to Mike I can actually click right to his LinkedIn profile because I brought him in using my PC recruiter capture tool click right into that list go right to his thing I can send him the the connection to invite and then I'm going to be able to go through once I do that go back into the sequence go ahead mark complete done that'll move you the next person so that'll let me dial click right to his LinkedIn page and do whatever it is I needed to do from there okay so I have a nice kind of automated but combined with some manual activities to kind of run through a sequence within the system and the sequences of course are going to give you some metrics and results too so you can look and see kind of what's been going on with the sequence I think comparable metrics pulls up a little quicker usually but it'll show you kind of when your opens are happening and when your stage moves are happening and timing about everything Something's going wrong with my database. It doesn't normally take this long. Let me try a different way. I can go over back here and do analytics. That also has the sequencing reporting. So if I go to sequences, sequence results, there I can get it. So I can kind of toggle through which ones I might be running. I can look at my candidate reach out. I can see how many people were removed. Let me ask you a question real fast. Every time you do one of these, you have to do it from a rollup list you've created, right? Mm-hmm, yeah. the sequence is assigned to a roll-up, and if I look at the roll-up, you'll see the little sequence icon shows that I have a sequence applied to that roll-up list. Okay. Can you do all contacts just for, you know, reference? Yeah, however you arrived at that roll-up list. So you could do everybody in the database or everybody who is a status of contact or everybody who is a hiring authority or everybody who is a candidate or anything like that. Okay, cool. there okay okay yeah so you have some different reporting options and different things you could do with your sequencing on here not any questions on any of that that is all kind of those three elements are the bulk of what is the premium package it also includes like some timesheet tracking if you're ever doing temp temp contracting but that is what the premium package does It does the timesheet tracking. What does that mean? The other piece that's included in the premium package, there's a timesheet collection piece. So you can actually, if you had contractors working, you could let them log in through your website and submit their hours worked and then push those out to QuickBooks for billing purposes. Or there's an app that they can download that they can submit their hours there. Is there a way to have a supervisor approve those hours? Like, can they send an email out to the supervisor and then it says approve my hours? Yep, there's all the approval process in there. So you have the ability to put in who that supervisor would be, be it that they're a person in your organization or a person at the client organization. And you can set it up so that when they submit the hours, they can click to submit them for approval. That person gets an email. They can either approve or correct or not approve or anything like that. And then once they're fully approved, they'll have a little icon next to them. and then you will show that it'll show that they're ready to be pushed out to QuickBooks okay thanks good enough for sure so so yeah that is going to be our premium package of the PC recruiter as well now we also have a new CRM product that I don't know if you've heard it or heard about the PCRM is a new product we have. It's essentially a different product that shares the same logon to PC Recruiter. It's a different format, but notably something it contains is it contains a sales pipeline and a simpler sequencing tool. So I don't know if that would be of interest to you, but it is something that's available now. So it was going to be a redesign of the PC Recruiter, but it just added some CRM functionality. So we made it a separate product that you can kind of add to share in the database if that was of interest? Yeah, probably not. My team right now, we barely in the last couple of years have really effectively started to use PCR. But since the addition of Christine and her help, this sequencing thing is something that I could partner with Christine to do, because right now myself and one other person would probably be the only person that would use it. So, yeah, I wouldn't be interested in the other database yet, Jim, but thank you. For sure, for sure. Yeah, it's there, but it's constantly being developed. But I think the sequencing is really going to be a big help for what you're looking to do. It's going to help to clean things up, make things go a little more automated, a little simpler than they are. And then I could just add Christine as a user so that she would have access, and then she and I could go in and create different things and monitor them or whatever else. Oh, yeah. Right. Yeah. Absolutely. You could add her as a user, no problem. Okay. Okay. Good. So right now it looks like. All right. Well, thank you. Yeah, you have six users right now. And so you could add users, drop users anytime. So anytime, if you do want to add her, pop me an email. I can get the billing adjusted. You can add the username anytime you're ready and give that to her. And then if you do decide you want to upgrade to the premium, let me know and I can send you over the paperwork to get that done and make that happen. Okay, great. I'm going to talk to Christine and see, just kind of walk through all of it with her, and then I'll be back in touch. Fantastic. And I'll send you over the recording of today's call once it's through to me in about 10 minutes. Okay, thank you very much. And, Christine, thank you for joining. Yeah, no problem. Okay, bye. Bye. Thank you both. Bye-bye. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 482.7576,
    "salad_processing_time": 52.27410078048706,
    "overall_processing_time": 482.7576,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your participant ID.  You are in the meeting now.",
    "job_id": "3d68760d-8c21-43fc-84b5-2ddcea3f6def",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your participant ID.  You are in the meeting now.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "billing",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/2996557142036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}