{
  "recording_id": "2998467750036",
  "job_id": "5aa64a0a-1220-4f53-accd-162e3aa8debd",
  "status": "completed",
  "transcription": {
    "text": " Thank you for calling Main Sequence. This is Robin. Hey, Robin. It's Bob Leavitt with Brandon Becker. Just got a quick question. Out of nowhere, I got a brain fart. I can't figure something out. I'm trying to open up a roll-up list and see the stages of the people, like who I made a second call to, who I didn't call yet. How do I do that? I thought I just opened up the roll-up list. Yeah, you should have your stage column in the list. Hold on. When I open up, I go to roll up, and I see a roll up list, and it has the names and the companies. I click the names, and then the names come up. But all I'm seeing is select the action column, the name of the company, the person's name, but I don't see anything for the stage. Unless you – did you change your layout possibly? I don't know. I don't know. I mean, I don't think so possibly. If you go into, so once you're in a list, if you click configure within the menu at the top right. Wait a minute. So you're talking, is that the little round thing near my picture? No, it would be within the roll-up menu. So like where you would have, like if you were going to select names and link them to a position, send them a form letter, it may not be pinned. So you may need to go to the three-lined icon at the end of that toolbar. Okay, hold on a second. So let me go. I got here. I pull up the roll-up list, and then I got the three things. And what would it be that I'd be looking for set stage? No, it will be called configure in that menu. Yes, I see it, and it is checked. Right, it's the gear wheel. Okay, so click that. Yeah. And then what do you have in your layout? Because it will show you what's on the left. What's on the left is name, first name, last name, title, work phone, email, cell phone, city, last activity, stage and stage description, home email, blah, blah, blah. So stage and stage description are where you see those stages. So it sounds like they're going to be over at the right. So if you close that window. Yeah. You said it was after last activity, I think you said, right? I do see it. I see it. Okay, I got you. Right. But it wasn't what I could physically see. So is there a way I could just move it left or something? Yeah. So if you go back to that configure screen. Yeah. If you want it to appear more like one of the first options, just drag that up to the top. The stage, not the stage description. Stage description is what you see, like what was the label, but the stage is the stage itself. Stage description is just the label that goes along with it. Okay. So let me reload the frame. Got it. Got it. Okay. Yeah, for some reason it was switched over, but now I see it. I have my action and then the stage and then the company name, first name, et cetera. Perfect. Okay, that's it. That's nice and easy. Thanks, Robin. You are welcome.",
    "duration_in_seconds": 216.0,
    "duration": 0.06,
    "processing_time": 21.552729845046997
  },
  "metadata": {
    "processed_at": "2025-09-21T21:49:52.313592",
    "processing_time": 663.3491,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}