{
  "recording_id": "2998794445036",
  "job_id": "f7a8011a-def0-49b0-852c-182b7850b241",
  "status": "completed",
  "transcription": {
    "text": " Thank you for calling Main State. This is Robin. Yes, this is Euglena Davis with PoloCop Recruitment Solutions. And I need some help with the PCR portal on email. Okay. What can I help you with? Well, it's not on my email anymore. And I need to get it back into Outlook. Did you happen to switch to the new Outlook? That could be one reason why. Yeah it could be. Okay so you would have to go into the class like turn that off and make sure you're in the classic version of Outlook. Their newer versions do not like they're web-based or the if you flip to the new they don't support the com add-ins which is basically what the portal add-in is. Sometimes what happens is if you go to your Windows search option if you type Outlook do you see Outlook and then classic within parentheses so say that again what do I need to do so if you go to your windows search option at the bottom left of your computer not in Outlook yeah I want to make sure you have the like the correct app pulled up so if you just type Outlook do you see Outlook and then within parentheses classic hang on let me get to the let me get to where you're talking about so outlook well when I did the Windows search I mean it just opened up my outlook you didn't say anything about classic or whatever okay let's do a screen share let's see what's going on here okay okay let's see now do you have never ring central or would you prefer to use Google meet I don't care whatever works for you you have ring central or no we do have ring central yeah okay let's do that then if you open up your ring central app and go to the video and then select join I'll give you a meeting ID video it's going to get one of yes once we so once you open up your ring central app if you go to video click join it's going to ask you for a meeting ID okay so the meeting ID is zero five zero three nine four eight one zero join auto by computer I know you don't need to do that since we're on the phone Okay. Okay, so once you're in the meeting, which you are now, and you hit share at the bottom of your screen. You'll want to make sure you're in the entire screen section and then select your with screen to show. You're gonna actually have to click on it. Okay, I hit share but it's not doing anything did you click on which screen to show like under entire screen I don't see where it says which which one to share so in that pop-up window okay pop-up window says choose how to join audio Oh continue without audio there. Okay. Share. Yeah, then when you hit share, it's going to ask, you want to make sure you're under entire screen. Click on the screen to show. Okay, I see screen one, I see screen two. Yeah, so it's whatever one you want me to watch. Okay. So right now I see your RingCentral. So you can minimize this window. Don't close it. Just minimize. Okay. And then I see your desktop folder. Let's go to your window search option and just type the word Outlook. Let me just see what shows up there when you type that. Are you typing in a different window? I'm in the one where you see desktop with a bunch of folders. If you can type it over here at the bottom of this search option. Okay, now just type the word Outlook. No, go back to your search. just type the word outlook in okay doesn't say classic okay all right let's open that outlook app that you do have then let me see what it looks like there and so this is just we're not going to be in here this is trying to switch your browser and everything if you can go back to go back over to outlook for me Okay. I'm looking at the Outlook. Can you drag it on top of this screen then? It might be on your other monitor. Okay, hang on. Okay, so here's your PCR portal right there. Okay, so it looks like you're logged out. Can you do me a favor? Can you click where it says options? See with the green wrench icon? Within that ribbon? Yep, click right there. Okay, so I think what's going on, you have the portal, it's just outdated so it hasn't been able to connect. There are some changes where you just got to make sure you're on the most recent update. So let's do this. Let's take save and close. and then go to file and select exit. Then do what? I'm sorry. You're going to hit save and close. Like you're going to close Outlook. Okay. I'm going to have you close Outlook completely. So if you go to file and select exit. I've got a screen open that says logging into CJ WASH. Okay, does it let you exit out of there? I can't exit out. Okay, I'm going to ask for remote control here. Let's see if I can kind of force this to close. Okay, if you can approve, perfect. Okay, I'm going to go here. Okay, so I'm going to take over your screen here. Yes, manager. And maybe this part won't let me. Can you click where it says Microsoft Outlook under apps? Click on that and then select end task. When I click on the one, where is it? Oh, there at the top? No, just click, does it let you click Microsoft app? Okay, there we go. Okay. Okay, so that's closing. Okay, perfect. All right, so here's what I'm going to do. I'm going to exit out of here. Can you exit the task manager screen? Okay, let's try this then. Hold on one second. Ah, PC recruiter. My hands are in the wrong spot. Hold on one second. Okay. Hold on. I'm looking at one screen and then... I think on my other monitor. So you were on, I forgot what it was, something lower 5. I'm going to put you on this version 530. And that should get us past your issues. It'll be a little slow at first once we get back into Outlook because any of the activities that you did have that it couldn't write, those are still queued up. So those are going to have to process. So I guess that explains why I couldn't inhale a resume. Yeah, like basically wasn't connected at all. Okay, so you're going to see a screen that RingCentral does not share to me for security. is probably saying, do you want this app to make changes to your device? If you can hit yes there for me. And I believe actually these next steps, I'm going to have to talk you through them, have you do them. I'm hitting up here. There's only some things I can take over on your computer. I accept the terms. Okay. You have to switch it to I accept and then next. And then next again. and then install and then it may take a moment then it jumps in pretty quickly no yours went pretty quick okay okay hit finish okay let's go back to your Outlook now. And if it does happen to be opening up on the other screen if you can drag it on top. There we go, now it's on the same screen it looks like. Is it open on your other screen? Oh, there it goes. It is. Okay. So now you're connected. It was saying logged out before. Okay. So now we should be good. I'm just going to – so see here this activity queue? Uh-huh. It's been disconnected for a while. So this number is going to climb and drop and climb and drop as it's finding but also writing activities. So while it's doing all that, it might be a little bit slower. I'm just going to come over here and double check some things. Make sure things are working. Do you mind if I turn off this social connector add-in? Most people do not use that in their Outlook, and it actually kind of slows things down. What is it? I haven't even figured it out, to be honest. So I don't think it's anything missing. It's almost 10 years old. And then do you use OneNote in your Outlook? No, I don't. Okay. So by turning off these two, it just makes things run a little bit faster. Okay. Okay, I just want to see if it pops up. Is that popping up on your screen? There we go. Perfect. Okay. All right. You should be good. It just might be a little slow for a bit, and this is processing. Okay. All right. Thank you. You should be all set. Actually, you know what? Let me just check something here just while I'm here just to make sure. I I'm going to visit the store. I'm going to get you a new charger. I mentioned I had that in my old file. I found it in the mail. There's something. I forget what it is. It's a sale in the mail. Can I approach you? This is my CD. Can I get you a new charger? Can I get you a new charger? I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I think you're going to be good going forward now. Okay. Thank you so much, Robin. I appreciate it. You are welcome. Have a great week. Thanks. You too. Bye-bye. Bye-bye. Bye.",
    "duration_in_seconds": 925.272,
    "duration": 0.26,
    "processing_time": 86.76308345794678
  },
  "metadata": {
    "processed_at": "2025-09-21T21:49:54.274442",
    "processing_time": 657.458496,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}