{
  "recording_id": "2998953103036",
  "job_id": "9828dcf5-697f-4f66-8173-caf8ac9bd8fc",
  "status": "completed",
  "transcription": {
    "text": " Good morning, NGT. This is Claire. How may I help you? Hi, Claire. Is Beverly Conn available? And may I ask who's calling? Certainly. It's Jim with PC Recruiter. I'm returning her call. Okay. Hang on one second. Let me see. Sure. Hello? Hello. Is this Beverly? It is, yes. Beverly, it's Jim with PC Recruiter. I'm returning your call. How are you? Good. How are you? I am well. I wanted to give you a quick call, see if we couldn't coordinate a demo of PC Recruiter maybe next week, I think you said was best. if we could just get something on the calendar. This is a short week for us. For sure. For sure. Well, what if we did maybe, what is it, Tuesday the 8th? Could you do something that time, maybe mid-morning, like 10.30, 11 o'clock? Let me just look. Tuesday the 8th. I have to just confer with three or four other people. So what time were you thinking of? I was thinking maybe like 10.30 Eastern, if that would work. And why don't I email you that, and then you could kind of confirm if that works or if you need to counter a time. Okay. I think we usually have a recruiter's meeting at 8.30, so if you could do it at 10 o'clock, that might be better. Sure. Sure. Why don't you send that to me? I gave you my email. Did I not? Yes. Okay. So why don't you send that, and then I'll share it with the other people. Is this like a Teams call or a Zoom call? A Zoom call. Should I set up a Zoom call and include that dial-in information? We don't dial in. Can't we just click onto it? Oh, yeah. Oh, yeah. Click onto the Zoom. Yeah. I dial in myself, but yeah, everybody else just clicks. All right. And then how long is the demo? Usually 40 minutes or so, sometimes a little shorter, sometimes a little longer, but usually 40 minutes is the sweet spot. Okay. All right. And should we be asking you questions before we start the demo or after? I usually take questions ahead of time and talk about what are the main things you're looking for, and then I take questions during and kind of answer and let the demo go fluid. But tell me, because everybody is going to ask me how much time on their schedules they should allot. I wouldn't go beyond 40 minutes to be candid with you. Sure. Yeah, let's block 40 minutes max. And what we'll do is we'll kind of gain initial questions, and then I'll save a little time at the end if there's any questions we didn't cover during the demo. Okay. And do you want – you were referred to me by Steve Morris. I don't know if you know him. I've heard of him, yeah. We just joined a group called NPA Worldwide, and a lot of their members use your product. They certainly do, for sure. And we have been using Bullhorn since 2010. Okay. Are you looking to convert that data? Yeah. We're looking to convert it. We find that they're really, as they've grown, they were acquired. The founder of the company was a friend of ours. But since they've been acquired, they're really looking at more organizations that have a lot of people, a big group. And we're small. We're five people. Yeah, I've noticed that, too. They don't really talk to anyone, usually much below five. So I have noticed that. Well, we've been a loyal client, and we have to make a decision by at least the 1st of August. And I've asked some of the people that I have known for years that have been at NPA what they use, and then NPA sent me a list of the different ATS systems and a good number of their numbers use your system. Okay, certainly, certainly. Yeah, I'd be happy to show you around and kind of give you that demo. We'll allow about 40 minutes. We can show you everything about us. Great, okay. So you send me the time, then I'll run by everybody else, and then I can, you know, once they agree, if you want, I can give you everyone's email so that they can have it on their calendar. Yeah. I'll email that to you. And then once I hear back, then I'll reply everyone with the Zoom and everybody's address once we confirm. You're a good man. Thank you. Fantastic. Thanks. I look forward to it. Okay. You too. Bye. Bye now.",
    "duration_in_seconds": 290.52,
    "duration": 0.08,
    "processing_time": 28.486167669296265
  },
  "metadata": {
    "processed_at": "2025-09-21T21:49:56.726668",
    "processing_time": 654.872372,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}