{
  "recording_id": "2998458973036",
  "job_id": "33982213-a136-4051-9d53-444e66be3f94",
  "status": "completed",
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is Garrett. How may I help you? Hi, Garrett. This is Stacy calling from Connect with Search Group. How are you? Good. How are you? Good. Okay. So we signed up for this thing called Zoom. You guys are integrated with it. You know, everything's fine. But when I go to log in, it's not letting me log in through PCR, through Zoom, through whatever. Okay. Yeah, so it's the Zoom phone connection integration? No, Zoom Info. Oh, Zoom Info. Okay. Yeah. Let's see. So you're inside of PC Recruiter, and then you're trying to log into the Zoom Info Enhance. It's like the Enhance with Zoom Info? Right. Yeah, Enrich with Zoom Info. Step one, authenticate. and then I type in my username and password through Zoom info and I go log in and it says invalid name and or password, which I know it's right because I'm logged into Zoom. Okay, I see. And I've done the whitelist. I've done, you know, everything I thought I was supposed to do, so I don't know what I'm missing here. All right. So do you know if you have a ZoomInfo Pro, Advanced, Elite, or Talent OS? Okay, your Talent OS. Talent. Got it. And have you contacted your ZoomInfo representative to turn on ZoomInfo Enterprise API? What is that? So the feature requires something called ZoomInfo Enterprise API, and it can be enabled on your ZoomInfo account if you talk to your ZoomInfo representative. So basically the API is a way for PCR to talk to ZoomInfo, but that just has to be enabled on your account. All right, all that. Because I have... All right, so Talent OS post-complete. I mean, that's what I have is the Talent OS. But here's the thing. I've been exporting lists from my Zoom to PCR for the past two days. Yeah, that is the integration that Zoom Info built. And that one works where you can connect that way. this integration that we've built, you know, it requires that you have Zoom Info Enterprise API turned on. So it's like one direction, you won't need it. The other direction, you will need it. It just depends on, you know, who built the integration. Zoom Info Enterprise, what was it again? Yeah, Zoom Info Enterprise API. And this can be turned on for the Talent OS version of Zoom Intro. Okay. Because when I went through and I can think, because I guess I thought it was all good and we were using it just fine. Yeah, so that was the integration. That was the integration. I did the Zoom Info IP. I did the whitelist in PCR. Yeah. All of those steps are related to the Zoom Info integration that they built, where you can export from Zoom Info to PCR. The integration that you're looking at now, the Enrich, is a different integration that we've built from PCR to Zoom Info. So it's going to need different configuration. They're two separate programs in a way. Okay. So I got to contact them and tell them to do the enterprise API? Yeah, tell them to turn on Zoom. Yeah. In order for me to use the Zoom. Okay. In order to use the Enrich. Yeah. Okay. And there might be a cost involved with that. I'm not exactly sure what the pricing is to turn on Zoom Info Enterprise API, but your Zoom Info rep will know all those details. Okay. Okay. Okay. Okay. So I have like, I have a Zoom info rep, and then I have a Zoom info help person. And the, okay, so the other question I have while I have you on the phone. So when we were originally like looking at this and all this other stuff, they suggested, somebody somewhere suggested, and I don't know, maybe it was when I was on a call with Nick and Drew and the guy that lives in Hawaii. we were all chatting and they you know they're the ones who told me about zoom and they said you know i could create like zoom phone number zoom email in my pcr like mapping wise oh right right so i i don't know who i need to talk to about like is that a common thing is that a not common thing like what do you guys suggest like what's the best practice like you know those type of thing. Yeah, absolutely. So some people who use the ZoomInfo integration, instead of mapping the phone number right to the cell phone field or email right to the primary email address field, they'll create custom fields to hold that data, naming it what you just suggested, like ZoomInfo phone number, ZoomInfo email address. Right. So you could go to your database, create a custom field, name it whatever you want, and then reconfigure your Zoom Info integration to map to those new custom fields. All right. How do I do that? So I can help you with the custom field creation part. Let me pull up my testing. No, I know how to do custom field creation part. I haven't done that because, you know what I mean? I know how to do that. Oh, good. What I'm asking is how do I tell when I'm exporting a list into a roll-up, you know, in a PCR, how do I map it where it's going to put the phone number and the email into the new custom field? Or is that a Zoom question? Yes, I was just going to say that's more for Zoom, just because it's an integration they built. We don't really have access to that program or integration they built. So they would probably be able to help you with the mapping part of it. Okay. All right. I will... I guess I'll just contact them. Yeah, I try to call you guys like four times on Friday. Nobody answers the phone. Okay. Yeah, we might... No, we might have been on other calls. We have a very small support team last week. And then, yeah. So hopefully somebody will reach back out to you if you left any voicemails. No, I don't. I don't leave voicemails. OK, I don't leave voicemails. So I was just like, you know, and it was like random times. I was just like, ah, you know, I was just wondering what kind of what was going on. Yeah, we were kind of working with the skeleton crew, but yeah, let us know if you have any other questions after talking to Zoom. If anything else comes up, let us know. All right. I appreciate it. Thank you. Have a good one. Bye.",
    "duration_in_seconds": 499.104,
    "duration": 0.14,
    "processing_time": 41.06383943557739
  },
  "metadata": {
    "processed_at": "2025-09-21T21:49:51.264914",
    "processing_time": 664.770447,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}