{
  "recording_id": "2998703417036",
  "job_id": "bed387fc-980c-4919-9d2b-5900440855dd",
  "status": "completed",
  "transcription": {
    "text": " Thank you for calling Main Sequence. This is Robin. Hey, Robin. This is Chuck Draper. I have management recruiters of Quakertown or CDP Solutions. How are you doing? I'm good. How are you? Good. I had a new computer a little while back at the beginning of the year, and I've got PC Recruiter set up on it. I cannot, for some reason, download, like when I'm in a profile for, like, a candidate, I'm unable to open up attachments. Oh, attachments. Okay. Yeah, so I'm assuming I'm misdownloading something. Yeah, probably Java Launcher. And I assume you're on Windows computer? I am, correct. Okay. If you go to your Windows search area, can you type, like, the word app and see if you have apps and features? A-P-P, like app? Yeah. We'll try it that way. And hit enter? Yes. Okay, let's see here. Do you see app and features? Do I see app and feature? Mm-hmm. I see an app there, but it brings me to a home. I mean, if I... I don't... Yeah, different windows. It's worded differently. Let's do this. Let's do a screen share. Okay. Where... Where do I go? What site? Let's see. Let me do that this way. And is it cdraper at mri-cdpsolutions.com? Is that your email? Yeah, it is. But I use a different email address than that now. Oh, okay. I think that will still come through to me. I think that's still a pre-existing domain or email address. What's your preferred email? Because I'm just going to send you an email. It's cdraper at CDP, so CharlieDavidPaulSearch, S-E-A-R-C-H.com. Let me send this over to you. I presume you're sending an email. Did you say anything yet or not yet? Yeah, to be honest, Ray. Let's see. I reloaded. There's nothing in here. I have my junk mail. Oh, it's at my meeting link? Oh, that's not good. All right. Just click on this, I guess, to help protect. Okay. Is it a joint call? Is that what I'm clicking on right here? There should be a link. Let me try moving this into my inbox. Maybe that'll work and I can get to it another way. Did it come through? It did not. There should be a link. Well, my Outlook won't let me open it up. I'll try. Robin is inviting you to join a video call. Yeah, it's at meet.google.com. Okay. Or do you have RingCentral? Continue without microphone and camera. Okay, there you go. Yeah, continue without audio since we're already on the phone. Okay. You don't need that. Ready to join. Ask to join? Okay, ask to join. Okay. There we go. It's letting you in now. Okay. so what I'm going to have you do is at the bottom of your meeting screen there's a share screen option it's a square with an arrow in it okay choose what to share at the meeting you're going to go over to entire screen and then they'll give you like a preview if you have more than one monitor pick which one you want to share okay I have more than that but on this particular take their one no just okay perfect all right so let's do this I'm type in the word add down at the bottom left in the windows search we're going to try that one add or app add but it's going we're going to try that one okay okay and all right let's just type system then it depends what version of Windows you have what's the best way to get there okay go to like system just settings under apps try that one okay click apps over at the left and go to install the apps and the shit usually it's going to list alphabetically okay let's go down to where the J's would be. And let's see if you have Java. Okay, so don't have Java. And then let's go down where the P's would be. And let's see if you have Peace Recruiter Launcher. Okay, so we don't have those. Okay, so here's what I'm going to have you do. I'm going to have you exit out of here. Okay. Okay. All right. So I'm going to have you open up a browser tab. So you just kind of like just do a new tab. Okay. And first thing we're going to do is go to java.com. You probably have an issue with like parsing resumes, opening attachments, alarms. By getting these apps, it's going to fix a couple other things. Perfect. Hit enter. And then see where it says download Java for desktops? Click on that. and then you're going to get the same prompt again unfortunately click that one download Java on desktop right here version yep perfect okay so that's showing at the top right it's downloading right now once that's done you're going to click on it and it'll ask you if you want to make changes to your device you're gonna hit yes I'm so sorry about that okay here you're gonna hit install Okay. Okay. Here we're going to hit close. And then we can close this tab. Close it out totally? Yeah. Go ahead and close that one. Okay. And then let's go over to see how you got your PC recruiter and then you got your PCR mail. You're going to need to log in anyway. So let's go ahead and close that PCR mail tab and then go over the PCR one and then your reload option over at the just kind of like left of the URL. It's the circle with the arrow. This guy right here. Yes. Go and click that and hit reload. But don't log in yet. Okay. So the next thing that we're going to install is what's called the Peace Recruiter Launcher. I know if you look when you click like add resume it's the launcher that actually opens up that screen in Java it also what makes like opening attachments work so where it says launcher install click windows it's way down the bottom left there yep okay that's now downloading yep and you're kind of similar what we just did you're gonna just gonna say yes for about changes to the device here we're going to hit next I accept and then next typical and then install finish okay so the first time that you log in after doing this we're going to get a couple extra prompts I'm going to talk you through those so that you don't get them. Hit login. Here we're going to want to say always allow. That's basically a Chrome browser wanting to know is it okay to open the launcher. Yep and then here you're going to hit allow as well. Okay, and that's just because you're a... Is it okay? MRI network, yes. That part we don't need. Okay. All right, and when I give it a try opening attachment now, you should be good. Let's see. Oh, okay. There it goes. All right, cool. Thank you. All right. You are welcome. Anything else? No, that's great. Thank you for sending me out. Have a good rest of your day. You too. Thank you. Bye.",
    "duration_in_seconds": 680.544,
    "duration": 0.19,
    "processing_time": 49.619680404663086
  },
  "metadata": {
    "processed_at": "2025-09-21T21:49:54.128745",
    "processing_time": 658.644506,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}