{
  "recording_id": "2998686649036",
  "job_id": "5a33a648-65c0-44b4-bd1c-5009252ec238",
  "status": "completed",
  "transcription": {
    "text": " Thank you for calling Main Sequence. This is Robin. Hi, Robin. I have a quick question for you. We have stages that were set up a long time ago for roll-up lists, and a new recruiter wants to add some new stages. Is that possible, or is it set? What is your name and company? Sure. Tom Henderson and its Moraine Group. Okay. So there's only like a set list of, I'm sorry, set number of roll-up stages. And it depends, like each user could have like their own, but if they're like a shared setup, then like it's more like based on the spot. But there is global roll-up stage setups. I don't know if you're using those or. It's hard to say. I don't know. It was set up so long ago and I've never really messed around with the stages. so we kind of have a set group that everybody gets. Okay. And I was just seeing if I could add new icons and new – she wants the specific marketing ones versus call ones. Yeah, I would then provide the option called Rollup Global List Stage Setups. I can send you a link to information on that and how to set it up. And then that way you can have like a separate configuration, which is why we did the global and then that was anybody creates a list and picks that set up they would get that set of icons and then you don't have to worry about is it copied over to other users and things like that okay you find instructions for those and i will get those over to you and if i wanted to like in the set list that we have if i wanted to go in and change them just what they say they are. Like number one is, you know, first phone call. I just go into the roll-up and go into configure and then stage it. It depends on the list. If it was like, like you'll notice when, like over at the very far right, when you're looking at the list, once you start using global stages setup, if it doesn't have like a description for it, then that means it's a per user, which would mean if you were to modify yours, you would then have to copy your stages over to other users. Where this global stage setup, it really can be basically like a template name that you apply to the list. And then it doesn't matter which user, you don't have to worry about them being copied. Okay. So that's kind of what's nice about this global stage setup. Okay. If I make a global stage one and just say call it marketing, when the person wants to use it they go to they create their roll-up or they go to a roll-up that they're using and then how do they pick which one they want so once this is like set up and then it has the option of being on when they're creating the list they'll see an option just at the top where you name it just to the right of that they could pick what template what i do recommend with the global stage stuff is whatever setup you feel that you would use the most keep that as default and then because that's when it'll pick up by first and then if you want like a second one like marketing you know like if you want a separate one for recruiting but you'd be doing a recruiting list more often than marketing I would do your setup under the default for your recruiting kind of actions and then you have a separate setup called marketing that you could flip to when you need to use that one okay and then what is your email address Tom at Shepard SG, and it's S-H-E-P-H-E-R-D SG. Now, you can't really flip. If you have any icons already assigned on that list, you can't flip it because then they don't really match up. Okay. And when you do the global custom one, is there a limitation to how many you can make? Yes. It's got the same kind of setup that you would have on the per user. It's just that you can have different setups. Okay. Okay. Was it 17, 18, something like that? Or was it 19? There's still the set number. It's just you can just go in. But what's nice is if you think you need like 60, you split over three setups. And so it's a lot easier that way. You don't have to worry about setting things over. yeah no it makes sense I just don't know if I'll have to figure it out what's the best way to do it rename old ones or make a new global one because I don't know if you rename existing ones if anybody has that icon it'll get selected yeah it's just they're really like a set like that spot has a set code in the back end you're just how do I label it so if you had anybody in a roll-up where you selected that one already, it's just going to be relabeled. You're not adding to it. Yeah. Okay. Okay. Yeah, it makes sense. Okay. I really appreciate the help. All right. Thank you so much. Well, have a great week. Thank you. You too. Bye. Bye. Bye.",
    "duration_in_seconds": 331.128,
    "duration": 0.09,
    "processing_time": 38.07839632034302
  },
  "metadata": {
    "processed_at": "2025-09-21T21:49:52.695762",
    "processing_time": 659.882205,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}