{
  "recording_id": "2998688791036",
  "job_id": "58ab83e3-dac5-41c7-85a7-b850c3c87794",
  "status": "completed",
  "transcription": {
    "text": " Hi, you've reached Sean Reeves. Sorry I missed your call. Please leave your name and number in a detailed message, and I'll call you back as soon as possible. Thanks. Talk to you soon. Good morning, Sean. Jim Lombardo with PC Recruiter. Wanted to give you a quick call just to follow up with you. Just checking in. I'm working on getting the data transfer underway for Custom Concrete. I have your request here. I've entered the ticket to have that database created. I they had a whole process we had to go through filling out some forms and we just finished that up this morning so we are ready to move the data so a couple points about that process I will put in the ticket to have the new database created then you will have to move the databases from your existing database those two roll-up lists you mentioned over to the new database that's going to be the data that's going to be transferred if you have any specific questions I'm going to share your email with one of our tech support one of our more technical guys, see if you can provide more answers on that. But what's going to happen, once you move that data over, then we'll need a second sign off from you that, yes, the data in the custom concrete database is, in fact, what you want to move and release to them. And we can put in a separate ticket for that. So first take us in to create the database. We need you to populate the database. We can help with that. And then we can get it done once you have another sign off. Give me a call when you get a moment. Happy to help with this. 440-856-0314. 440-856-0314. I am Monday through Wednesday of this week, and then for the holiday Thursday and Friday. We'll talk to you soon. Sean, thanks. Bye-bye.",
    "duration_in_seconds": 92.376,
    "duration": 0.03,
    "processing_time": 11.29432463645935
  },
  "metadata": {
    "processed_at": "2025-09-21T21:49:53.999814",
    "processing_time": 659.942184,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}