{
  "recording_id": "2998930435036",
  "job_id": "a72ca445-dd69-4245-8cd3-a84770ab17c4",
  "status": "completed",
  "transcription": {
    "text": " Hello, it's Eric. Good morning, Eric. Jim with PC Recruiter. Return to your call from Friday. How are you? Hey. Good, Jim. How have you been? I'm well. I'm well. Good. So I don't know if you listened to the whole message, But basically what's happening is we have an office that's in Florida, and the plan is for them to spin off into their own business, their own separate business. So just trying to – and timing's probably mid to late September, early October, somewhere in that timeframe, so probably three months out or so. So just trying to get an idea or a plan going forward as to what's options as far as the database and getting them up and running on their own. Okay, probably. I would say a month ahead of that time, we'll want to start to get paperwork sent over, see if there's going to be, I would assume there's going to be a new signer, a new payer, everything like that. Yes. So we'll create that new account, new company name and everything. we will then are they taking a specific database under your drop down or are they taking a copy of your main database so that would be the uh the option they they probably uh get a copy of one of the databases right so we we mainly use two we use one called health care and then the other one called the fault still so uh it would be most likely uh so that'd be a question also i mean And we're assuming, or Tim Sonner and I are assuming, that they would just get a copy of the whole database. I don't know. Is it even possible to do less than that? Like if they only wanted contacts or names or company records that are tied to specific users, is that possible, or is it all or nothing? Well, it's up to you. Either is possible. So we could take, say, a copy of healthcare. We could just, with your sign-off, of course, take the exact copy, plop it down on their new URL. Or if you wanted, if you or they came to the agreement that they only wanted data entered by these users or in this timeframe or whatever, what we do is we create a separate database under your current ASP URL. Then you would use roll-up list to copy any data that they want into that database. So then we would just pluck that one over, copy it over to theirs so they can run some of the data. So that's up to you. We can discuss that down the line. Okay. Okay. So you're saying about a month or so out, start the conversation or at least come back to you guys with what we want to do. Yeah, I would say maybe a second week of August just to give us enough time to talk about, get paperwork, signers, figure out how many users, which database. We can get the link created, and then we can pick a date when that transition is going to happen, and we're going to copy everything over and move them on over. Okay. Sounds good. Okay. Perfect. And I'll put you down. I'm going to throw you on my calendar like second week of August if I haven't heard. Just touch base. But yeah, just reach out and we can kind of start discussions then and get that going. Perfect. Sounds good. Thanks, Jim. All right. No problem, Eric. All right. Take care. Bye-bye. Bye now.",
    "duration_in_seconds": 203.904,
    "duration": 0.06,
    "processing_time": 24.14369225502014
  },
  "metadata": {
    "processed_at": "2025-09-21T21:49:56.586913",
    "processing_time": 655.88454,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}