{
  "recording_id": "2998524525036",
  "job_id": "4948fd73-c86e-4f1d-9695-d3a7f5ffabfa",
  "status": "completed",
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is Garrett. How may I help you? Hi, Garrett. This is Amy Roch with Edna Rice Executive Recruiters. You actually had left me a message this morning following up on a voicemail from Friday. Yeah. How's it going? Are you still having issues with PCR? Yes. Actually, I just have a question, and I need help on a search. So we have a, what I thought was a, what's it called, a custom field called current company under company information. And I need to search that current company. But for some reason, when I go to advanced, it's not under the custom fields. Oh, okay. Let me take a look. Which database are you in? Edna Rice Final? The Final. Okay, perfect. And what's your username? A-R-O-C-H. Perfect. All right, so jump into a name search. Oh, wait, is it company search? Are you looking for name records with this custom field or companies? No, names. Names, that's what I thought. Okay. Name, custom field, I'm looking for company. It's actually current company. So if I look up under the predefined field, if I look up company, then that brings up a company name. That brings up where at the top where it says candidate default, or that's if they're assigned to a company. But we don't have most of our candidates assigned to a company. We have them all under candidate default. So we had created this current company where we type in where they're working, and I can't find that field. I can't find that. Oh, I know what happens. So your searching has been customized to only show specific fields for your username. And I can show you how to adjust that. So just go to start by going to name in the main menu of VCR. And then at the top right, go to the customize action button. It's a gear icon in the top frame. Like where it says basic search? Wait, what? Top right, yeah. So basic search on that same line that it says basic search all the way to the right. There's a gear icon. It might not on the right. It's on the left right next to it, but that's fine. Okay, so then under where it says selected fields, I need to find the custom, like under available fields, I need to find our custom field. Exactly. And then you can add it to your selected fields. You also have the option of clearing out all of the selected fields so that it's empty. And that would make any field available to you when searching, like in those dropdowns in advanced search. Where is the current company? Can I just type current company at the top and it'll come up? Yeah. There it is, current company. I don't know that I want all of those in there. okay yeah I think that's probably better to have it like that okay and then the next question is I obviously have to push save so I'm doing what I'm trying to find is all the companies and I know I need to make a roll up to do this that all the people that have a specific company and then and I might need to call you back once I have this roll up made and then I'm going to have to do a like a mass change because all of our people that say Kansas City Southern need to change to CPKC because the name of the company changed. Okay, but it's only bringing when I do that it's only bringing up five pages worth and I know there's more people that are under there that are Kansas City Southern than five pages worth. Maybe not. I would think there would be more than five pages worth. I could perform the same search and see if I get the same results. So you're doing the current company one? Yeah, I did custom fields, current company, like, which is what I want, right? Should I put the Kansas City Southern with the percentage maybe? I don't know if that'll make sense. Maybe. That means if you put the percent before, it means it contains these terms rather than starts with these terms. So if there might be a word in front of Kansas City. Yeah, like there's, that's Kansas construction contract for Kansas City Southern. I don't know if we want that person to change or not. Like there's the Kansas City Southern, so that's we want Canadian Pacific Kansas City Southern. So that's CPKC. That's the same thing. So then that still only brought up six pages, so maybe there really aren't as many as I thought there were. Canadian Pacific, Kansas City, Southern. So see, some of these are already changed. Okay, so let me just, since you're already on the phone, let me just go ahead. I guess I can change the ones that are already Canadian, Pacific, Kansas City. They told me to change it to CBKC, so I'm going to do that. Let me make it. I need to make it a roll-up to do it, right? Yeah, so you'll have to select all and add to roll-up. I don't do this very often. Yeah, here we go. I was like, where is it? I need to create a roll-up. And can I do two different mass changes? Like, I also want to take out all their – well, the problem is I need to know if the email address is right. Is it Kansas City Southern email address? Because if they have a Kansas City Southern email address, we also want to take that out. So I'm probably going to have to go through and see all of those. Okay. So, yeah, you might want to see. Because, like, if their work email address is Kansas City Southern, like the KC Southern, like this one has CPKCR, which is probably the right one. So I don't want to do a mass change with those. I'm going to have to look through those because some of them are going to be right and some of them aren't. Yeah, I was thinking that through my head as I said it. Okay. So now I have all of them in a roll-up. So now what do I do? All right. So then you open that roll-up list. you select all and or actually, so we're going to change, what is it? The current company from Kansas City Southern. Okay. And this isn't going to be their actual company. It's just the current company? It's just in the current company in that custom field, not the actual company they're assigned to. All right. So in that case, you would go to system in the main menu up at the top. Hold on. I'm just scrolling through to be sure there's not anyone that I don't want. Hold on. Okay. Just really quick because I'm like, before I make this thing, let me make sure. Yeah. It says former. Let me look at this guy really quick. Okay. How do I take a guy out of a roll-up? You just check the box to the left of their name, and then in your action menu... Oh, yeah. I've got to unselect them all first. Hold on. uncheck all. Okay. Go back to him. Hold on. In the action menu, do remove from rollup. Yep. Remove from rollup is the small x. Where is it? Oh, there it is. Okay. There he is. Okay. Oh, let me be sure. I'm almost there. let's see, was it I'll take this guy out too, probably sorry, I should have done this before I called you but I couldn't find them so I couldn't do it before I caught you right yeah not a problem okay let's take this guy this guy I was very surprised on Friday that I called two different times and y'all didn't answer. I don't think I've ever had that happen. Yeah, we're kind of working with a skeleton crew right now. I was going to say, y'all must have been super busy. Yeah, we're definitely getting a lot of calls in. What happened? American Tire. Okay, I think this guy out. Jeez Louise. At least there'd be this many. I don't think I'm going to leave it because it says it's a contract for them and I don't know if they're going to want that one to be changed. Almost done. I'm on the last page. Okay. All right. So select them all. You said, do I have to select them all or just go to system? Yeah, just go to system. Okay, go to system. And then on the left, look for global change, about halfway down the list. Okay. Then go to change names on the right. And on that pop-up, there'll be a custom on the left. Oh, yeah, okay. And then we're going to, let's see, replace all values is probably the one you want in the global change drop down. Yeah, okay, replace all values. Okay. And then choose your field name that you're changing. So current company. Which I had to scroll to find it, I'm assuming. Yeah, or you can start typing it as well. Just highlight and start typing it. Oh, yeah, there it is, current company. And let me just roll up. I need to find my roll-up, right? Perfect, yep. Do I just click on the name for the roll-up? Yeah, the name number, exactly. Okay. And then your new value is going to be the company name that you want to enter in. What I want it to be, okay. Hold on, let me just verify that that's what they really wanted it to be. CPKC, okay, CPKC, okay. And then just push apply? Exactly, yep. Okay, and it says update complete, so push okay. So now when I go back to that roll-up, are they still going to say Kansas City Southern, or should they all go to CBKC? They should all be at CBKC for that roll-up. I'm just curious. I didn't know if – oh, yeah, they all changed. Cool. Awesome. All right. That's all I needed to know. All right. Well, reach out if you have any other questions. All right. Thank you so much, Garrett. Have a great day. You too. Bye.",
    "duration_in_seconds": 809.352,
    "duration": 0.22,
    "processing_time": 67.01895070075989
  },
  "metadata": {
    "processed_at": "2025-09-21T21:49:52.559931",
    "processing_time": 661.129927,
    "engine": "full",
    "features": {
      "diarization": true,
      "summarization": true,
      "timestamps": true
    }
  }
}