{
  "recording_id": "3000681178036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:13:29.782056Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:13:29",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling me in sequence technology. This is Mackenzie. How can I help you? Hi, Mackenzie. This is Mackenzie. How are you? What's up? I'm doing well. How can I support you? Well, so one of my associates at my company has been working with one of your associates at your company. I believe his name is Garrett. I'm not sure if you're able to get me to Garrett or if I have to kind of like start over the process if he is. So basically what's happening is my work email is connected to my PCR, but when I'm in my work email, like under the Gmail format, when I go to send emails, I'm not able to see any of the emails that I've sent in PCR. I'm only able to see the emails that I've sent underneath when I'm in the Gmail tab underneath my work email. So I'm trying to figure out how I can connect those two. So when I like send out contracts and things like that to our clients, I'm still able to see those in my sent email and I can put them in specific folders so I can keep track of all that information. Very well said, Mackenzie. Give me one second to pull up your account, if that's okay. I need to see like settings you have in place to see how to go about doing that. So what company are you with? Again, Mackenzie, you didn't mention it. I'm with Moraine Group, but we do have multiple mergers. So I'm not sure which merger company name is under y'all. what's the last name? What's your last name? If you don't mind. I think housing super German, but it's F as in Frank. I as an igloo and as a Nancy K as in kite, spell the house, like the house you live in at home and then put it in as a Nancy at the end. Okay. Um, probably just the first four letters should be good enough. And I don't see you in our system. Have you ever called before? No, I haven't. Not with this company. Okay, yeah, I don't see you in here. Okay. So the person that spoke to your associate, his name is Tom Henderson. So maybe you can pull that call with him and see what the notes look like. Sure. Yeah, my goal is to find out the URL you use to log in. But you said Moraine Group, which I know that. Does it say, when you log into PCR, does the URL bar say at the end F underscore MR San Diego? Or does it say MR Rockland County? The first one. MR San Diego. Okay, okay. um all right um then there's like a bunch of databases in the drop down on the login screen which one are you using to log in or tom or whoever oh you might have said that i just use i use the san diego one that's what my login is like that's the database i use is the mr san diego right uh but then like on the login screen there's a drop down where you choose like which database and I don't see a Sandy. Oh, MR San Diego upload. Yeah. Gotcha. Gotcha. Gotcha. And then the username that you use or the person with the issue. It's just McKenzie and all caps. I'm sorry. Minus the a, my parents just did McKenzie. Okay. Not Mackenzie, but it's funny. There's a lot of different spellings for that name. Yeah. I am Mack. They call me Mack. They call you Big Mack? That's what they called me on my soccer team. Oh, my God. Any combination. Any word with Mack. Yep, I've heard it. Yep. Yep, we go by all other things. Mackenzie, Mackenzie, all the things. All right. So let's see. I'm looking at your email. You said there's okay. Yeah. So when you expand the folder list, there's two. Correct. There's personal and Gmail McKenzie. Yeah, I guess. I don't see the back end like you do because I'm not an admin. In my old company, I used to be an admin so I could see all the back end things, but I can't on this end of my screen. um but what i'm assuming is what happened is that the folder in my gmail is labeled as sent and a folder in pcr is labeled as sent mail i don't think they're connecting um based on potentially name differentiation or potentiality of how it's pulling on the back end from those folders it says it's connected in pcr like it says it's like my sent mail is supposed to be going to my sent mail on my Gmail, but it says sent mail instead of sent, which is what it says, like when I actually log into Gmail. So I think there might be some backend coding miscommunication. Okay. Well, let me take a look. Um, cause I would actually probably be one of the people that Garrett needs help from to fix this. So, um, I'm, I'm looking at this and I just, I'm going to have a couple questions. Let me verify one thing. That's fine. And the only reason I even know all of this is because I've worked with PCR for the last three years. I've been with a couple of different companies, but we've always utilized PCR. So I've always been an admin and was able to kind of fix these things, but I'm not really able to do that on my end right now. I see. Okay. Okay. All right. So yeah, I have a clarifying question. And I think I know the answer. I just need to hear like, you say it. Yeah. Could you walk me through how you send like you're saying you part of what you said? Let me look at my notes. when i go yeah all right you just mentioned sending in pcr can you show me how you or like walk me through how you do that like send an email from pcr that you'd expect to see yeah so i already set up a form i set up a form letter in pcr um so from the profile of the person that i'm on i'm clicking form letter i'm selecting my name i'm clicking email and i'm sending that out. But I'm not getting that in my sent box for Gmail. Also, I sent a contract to be signed underneath someone's personal profile where I just clicked the email button, not the form letter, and I created my own email, attached the contract, et cetera, and sent it out through PCR. But I'm not able to see that in my Gmail, so I'm not able to keep track of what I've done with certain clients. Okay. Okay. So I think I might know what's happening. All right. So if you go, if you could indulge me. I had a reset up earlier. I'm sorry. I don't mean to interrupt you, but I know it stopped communicating on the 15th because my two step verification was turned off on my Gmail. I did return that on today, but I know that there's been a problem in the past where we have returned it on and then within eight hours, it stops communicating again. So I guess I'm trying to figure out what bug potentially might be in the system that's preventing that communication and redirecting turnoff and also making sure that the coding on PCR is also attached to the coding in Gmail so that I can see every single email. Like I can see all my emails in PCR. Like I can go underneath settings and access that information, but I want it to connect. So I can like have folders in my Gmail. I'm like, okay, these are the emails that I've sent to this company specifically, et cetera. Can you repeat that last part? You said you can see them in PCR? In PCR, I can see all the emails I've sent, yes. But it's not connecting to my Gmail. So when I sent, like when I click on my sent box in my Gmail, It just shows the emails that I've personally created when I'm under Gmail in the application on my computer. Well, technically, it's not an application. It's on a web tab. But in PCR, I can see all the emails that I've sent in PCR, but it's not connecting into my Gmail, even though those are supposedly connected through PCR. I'm thinking it's a back-end coding problem because the file that these emails are uploading into is not matching the file on the Gmail for the name. In Gmail, it says sent. In PCR, it says sent mail. And I think that's where the disconnect is in the coding. It's not picking up. It's supposed to go into that inbox or sent box, however you want to. Okay. I was kind of confused at first for a good five minutes there, but now I get it. Okay. All right. So I have another question. So, you know what, do you know the difference between an email alias and the like mail server for PCR mail? Yeah. you said your admin so yeah mail server and pcr mail that's like incoming that's like an iMac connection and then the outgoing right sorry the email alias is like from just like sending well I'm logged in as you and I'm looking at your alias it connects into an iMac I get what you're saying yes well I'm on your email alias the part where you'd be sending from for these like when you're on a name from pcr the gmail side from PCR, inside PC Recruiter on a name record, you click form letter button or the email button, those windows pull up like your email aliases, and you can send from your email alias, of which you only have one, so there's really no confusion on which one you'd be using, and I'm looking at it, and it's going through SendGrid. Now, I'm not actually a recruiter, So I don't actually use these tools to like mass email people. So I actually never have used SendGrid and I actually don't know. I'm not actually too sure exactly how it works. So I'm a question. So is your Gmail account set up through SendGrid? Or like. See that part I don't know because I'm not, I'm not an admin, so I can't see the backend, but I know that they had to do something specific with my email. Sorry, excuse me. with my email and two-step verification order for it to connect to PCR somewhere through the process of me starting and then connecting it. It has stopped communicating with PCR for my send. So like if someone responds, like say I send an email to you in PCR, if you respond to it, I get that in my Gmail inbox, but I don't see the email that I sent to them if I go to send. And normally, I was like in my previous company, I was connected through Outlook. And we were, I mean, it was still technically Gmail, but it was through 365, which we don't have access in this company, which I feel I'm not sure if that prevents some of the access. But I know that when I was with my previous company and I utilized that email address in my Outlook, I could view all of my sent emails, even from PCR. like I had access of everything that I sent in one spot. So I'm just trying to figure out how to get that same access. So like if I send a contract to somebody in PCR, I would like to be able to go into my email, hit sent and say, okay, I sent that contract to them. I can pull that into a folder and that's saved for me of like the communication that we've had with that company. I understand the goal. I'm just, I'm trying to make sense of what's happening because... Sorry if I'm not answering your question. No, it's fine. We'll get there. Let me look at something here in your sent folder. So there are emails in your sent folder. These were sent like from based on what you said. If I go to PCR mail, if I go to sent mail and I click on sent folder, sent mail, parentheses sent folder. I see things you've sent today. These are things that you sent from PCR. Right. Right. Okay. And. Yeah, they come from M-F-I-N-K housing at Marine dot com. That's the email in your is that the same email address in your thing here? Yeah. It should be because that's what like set up for like my signature and all of that access okay so all right i'm trying to process what sendgrid does because i don't know what they do and like how it works you know like i don't know how because the reason why i keep saying sendgrid is because in your email alias in the smtp server and port field um it says smtp.sendgrid.net and i know that send the grid and google are not the the same thing and that's a google account you're using right you said that in your gmail you like you're like logging into a gmail so so this is like a gmail account being sent through send grid so it says send grid now branded as twilio send grid as a cloud-based email delivery platform that helps businesses send transactional and marketing emails reliably and at scale sends automated real-time emails marketing campaigns email api and smtp relay deliverability tools and analytics and tracking right okay so so what i'm assuming is they are utilizing a third-party tracking database that allows us to connect our email address to PCR going around about some of the things that you guys don't connect to anymore. Because I'm assuming, like, what I've heard is you guys are having less and less access of other third parties being able to access into PCR. So I'm assuming it's helping with that back end portion. I'm not sure what you meant by that. That's keeping analytics. I'm just trying to... Like, so, I don't know. I just know like, like obviously you have like full access into like LinkedIn and Zoom info and things like that connect to PCR and things like that. But when we do like the two-step verification process, like through Gmail, I know it's like there's an extended process because you have to have, I mean, obviously your database is like, it contains a lot of private information. So you have to have like that accessibility from our access emails or whatever. I'm not sure like I don't code things or anything like that I'm a recruiter but my understanding is like we I don't know I think you have let you tell me you I think I think you have more than I do right I to be honest I hope you don't take this the wrong way but I think you have an over complicated understanding of it okay okay so I'm going to try and okay from from my understanding I'm gonna try and explain it so what I can see right now for your username your email alias is set up through the SMTP server and port SMT v-send grid net that tells me that anything you send from the alias, which is what you described, going to a name record, clicking form letter, send, right? That's using the email alias. So that means that email is going through SendGrid. That's going to SendGrid. So you must have some sort of an account with SendGrid and the email is going to them. And so the email would be in some sort of inbox in the SendGrid realm of things here. And the communication you're looking for is like they're not sending the email over to your Gmail sent folder because they're actually probably sending and spoofing your email, right? They're probably like, this is the email we're going to send. Like they're basically saying like, Hey, we're going to send this for you, but we're going to put like your name on it. And so they're using the email address that you've given them, which is the same email as your Google account. So, so all that being said, is to say that the sent item won't be in your Gmail sent folder. It'll be in some account that you have with SendGrid's sent folder. If you send from Gmail, like if you send an email from Gmail, like from the Gmail UI and it sends and the person receives it and all that's great. And then you see it in your sent folder in the Gmail UI. And then it, or wait, you said that's not happening. It's not copying over. Okay. And I just checked. They said we do have an account with SendGrid. He said that is your outgoing mail. Okay. Was their response when I asked if we have an account with SendGrid. Or wait. Okay. You said something earlier, and I just confused myself. But if you send from Gmail, does that get brought over into the PCR inbox? Let me double check. Like send from actual Gmail and then because if that if that is syncing over, then that tells me that like PCR is doing like what it's supposed to do. right? Because your incoming mail will be set up in the PCR mail section. So if you can send in Gmail. Yeah, my emails are, my emails. Sorry, go ahead. No, go for it. You go for it. You're about to probably say it. I was just saying my emails are in PCR from the ones that I'm sending. But when I go to like Gmail to like where I normally send those messages, I'm just not seeing like the send. I just want to be able to see like the messages I've sent in PCR also connect to my Gmail because I've sent a couple of important emails in PCR that like have contracts attached to them that I would like to be able to have access to. Okay, that's the part that I think is in your SendGrid outbox sent folder, but I think there's actually two issues happening, Okay. Or two things happening here. It's kind of like laying on top of each other, which happens often with email related things because it's very convoluted. um and okay so you you uh you you said you wanted i'm writing this down you wanted to see the emails that you sent from pc recruiter with your email alias parentheses form letters and or compose email from a name record to show up in the sent folder inside the actual gmail sent folder rather than the PCR mail I think that is because you're sending i think this is because you're sending from sendgrid and like they are sending on your behalf and spoofing their email as you um so there would be some sort of thing you'd have to connect between sendgrid and your gmail in order to see that and i don't know if they have that um so i think that's the answer to that one but then i think there's another thing happening where uh sorry i'm trying to process all this uh calculating everything i heard in the call i'm just gonna like read through what he said he said send grid is your outgoing mail but i told the guy that because it is getting copied to your gmail sent mail it should be showing up in your gmail sorry sent mail folder i'm that should be making a copy to your gmail sent mail online right okay right okay so yeah i'm not sure if it's happening because i don't know i have okay so when's the okay if in PCR mail. Can you answer me something in PCR mail in the sent folder? Are any of those mails, like, did you send any of those from Gmail or are these all sent from PCR? And like, when was the last time, when's the last mail that was sent like from Gmail? Like you actually went to Gmail and composed it from Gmail or are these just all you all? Composed from Gmail would be like this morning at 10.06 a.m. would be the last one I composed inside of a Gmail web tab. Can you tell me how to get to where I would see my emails in PCR? I don't think I even have the admin access to do that, if I'm honest. Because normally I would be able to view the whole list after I hit settings. But I see like five tabs here, so I know I don't have full access. For your McKenzie username in PCR, you just go to the PCR mail tab, like open up the top right menu under your silhouette and click the first option in that little menu that says email and that'll open a tab that's PCR mail. Then you go to the expand Gmail McKenzie on the left. and then one when i'm in pcr uh-huh if i click the silhouette at the top right hand corner the little cog wheel oh it says okay okay and then email email yeah okay so then uh from here expand gmail mckenzie on the left there's a little plus icon next to your folder gmail and then underneath that there's another expand that you can see for gmail expand that and then there's sent mail parentheses sent folder can you click on that for me okay um let's see so oh it shows all my emails it shows all my emails in here like even the ones that i've sent from my gmail okay okay okay so the one that i sent from my gmail is at 10 0 6 this morning where it says hire a savvy accountant start with marine the would you happen to be available at 8 a.m that email i sent from gmail so it looks like pcr is recording it but it's not recording into gmail so how do i fix that did i get the contact by gmail support um so yeah so okay great okay so yeah so pcr mail is recording the things you've sent from gmail that tells me that the imap connection is set up making a copy of anything you send from gmail i think the i think the discrepancy here is like the send grid account is not communicating with your gmail account to like to put sent items into your sent folder i think pcr so far what i can tell i think pcr is doing exactly what it should be like i think if if you see everything you've sent from your Gmail inside the sent folder that tells me that, like, if the sent folder in PCR looks exactly like the sent folder in Gmail. PCR is doing its side. I just need to contact SendGrid. Sorry. Again, I'm so sorry for interrupting you. My apologies. It's just the simplest way to put it is, or it's like in a question form, does the sent folder here in PCR look exactly the same as the sent folder in Gmail? No. No, what's missing? The SendGrid. Oh, the SendGrid emails go to this. Oh, okay. Interesting. Yeah, so this looks like all the emails that I've sent, but these are not showing. I had a different understanding of it. Okay, so the SendGrid emails actually do get copied to this folder. Oh, okay. Interesting. Yeah. Oh, that makes sense. The alias is linked to the iMap connection, so that does make sense. Okay, yeah, so I think... Right, so, like, if you see, like, Jim Dyetch, I don't know how to say his last name, Dyetch, or it says, like, an attachment, and then it says next steps, like, I need that in my Gmail account, like, my Gmail account, so I can put it into a folder saying, I've sent them a contract, I'm waiting on a response. yeah and you sent that with your email alias which goes through send grid correct i'm pretty sure yeah yeah that's the i think that's the discrepancy is that the send grid connection needs to like be sending these over to your gmail account sent folder and i don't think i don't think that's happening because pcr does have your other emails there so um i think pcr is successfully making a copy of anything that it finds in the gmail folder the okay so i'll explain why it doesn't work and it looks like it is so when you have an email alias set up um in the email alias there's a imap server drop down do you know what I'm talking about when I say that email alias is like system email setup email alias list and then that's the send grid what what what what platform are you talking inside of sorry inside pc recruiter and you're an email alias you're doing the platform drop down the platforms. I'm not sure what that is. I'm going to system at the top. Yeah. And then email setup and then email list and that will load in the bottom frame and you have your send grid Moraine account there. And if you hit the little pencil icon in the rectangle, it'll open up an edit alias window. And inside this, you'll see two fields of notes that I want to point out. There's the SMTP server and port field, which is pointed at sendgrid.net. So that means anything you send with this alias is going to go through them. But at the same time, right next to that field, it says IMAP server and it says Gmail. Because I don't have admin, when I click on email alias, it says nothing. So when I would normally have admin access, yes, I would see what you're talking about. But when I do this on my end, because I don't have admin access, I see nothing. Oh, you can't see this? I'm logged in as you. I thought you didn't see what I see. You have admin access because you're a backend user. So it's going to show you admin access even if I don't have admin access. I didn't know that we had that. I didn't know that that was happening. I thought I saw exactly what you saw if I logged in as your user. All right. Well, anyway. Because I clicked on, like, email alias list is what I'm assuming you clicked on after you did email setup, email alias list. Yeah. And then you see all the functions. I don't see anything on my end because I don't have that access. You're going to automatically have that access because you're a back-end user. You work with a company. Nothing appears in the bottom frame for you when you click email alias? Yeah, it's because I don't have that access at this company. I know what you're talking about because I used to have this access, but I don't have it here. Okay, well, I was just trying to explain why it looks like it should work but doesn't. It's because this alias has – it's connected to your outgoing. and so whenever pcr like whenever you send an email through pcr it'll just like make a copy of the mail and put it to the sent folder of the connected imap server like regardless of like whatever actual imap connection is like happening because we already know we already have like we sent it so we know we can just put it right there we don't have to like wait for the imap connection to do it um so that's why the ones you are sending are going there but it's yeah so i i still think though that the i'm pretty sure and i can make a ticket and we i have a meeting with the team every tuesday at 3 30 i can bring this up in the meeting and ask but i i'm pretty sure the discrepancy is your send grid account needs to connect with your gmail account and update like there's basically you're going to have two different imap connections to your gmail account one with send grid and another with PCR. So I guess my question, do I need to contact SendGrid in order for me to see those emails or do I just, it's not going to be connected and I'm just going to have to log in to PCR and like pull those emails? I'm not sure if SendGrid gives you like a way to see that stuff. That's like another thing that I don't know about SendGrid because I don't use SendGrid. Right, because you don't work for them. Yeah, like I have a Gmail account, right? And in Gmail, we all know we have like an inbox and all the folders that we see. And if we send, we see it in the send folder because that's Gmail, right? So you're having SendGrid send. So it's like they're sending on behalf of you and they're just like posing as you. They're just like using your email address. So if somebody sends a reply to that email that they're sending, it goes to like your actual email or whatever. So that's the thing that email people like email servers can do that. They can like pose as a different email. Right. They can send as someone else. That's what SendGrid is doing. So, yeah, I'm thinking that SendGrid has your sent emails. And I don't know if they give you an inbox or a sent folder to see like a portal to see whoever you were messaging earlier in this call. You said somebody like messaged you and said something like they seem that they might know or have more info about that. And I would ask them, like, does SendGrid have, like, a, you know, like, a portal I could log into to see the sent folders, you know? And if they do, then, you know, I wouldn't know. You'd have to ask them, like, where that is and how to get into that and then log in and see what you can see and, like, see if the emails that aren't showing up in your Gmail sent folder are in that sent folder. And then that answers your question whether or not that's the case, right? um so that's kind of probably your next steps is like see if that's the case i can still make a ticket in our system and follow up with my team at 3 30 in the meeting and be like hey does anyone know how sendgrid works or has anyone ever logged into sendgrid i don't know if they have a portal to log into but I would really appreciate that. I mean, obviously, I'm sure on our side, we'll reach out to their team, too. But I would honestly appreciate that just so we understand how the back end connection, is it something like where coding needs to be changed so that it's accessible in through every system, such as their system, Gmail, and your system, so I have access to everything on every platform. but I would greatly appreciate if you would ask your team just in case somebody has worked with it before and they potentially know like some workarounds or some way to make it like quicker or easier to be able to access everything on every platform just to make it all in one spot yeah definitely I'll make a ticket under your name I know how to spell your first name. Oh, yeah. Oh, no. I remember. I remember. F-I-N-K House. And then and then as in Nancy. Nope. It is House and then and then as in Nancy. Yes, sir. I know it's very German. It's kind of rememberable. What do you think? Is the K in Mackenzie capitalized? It is. Okay, cool. I'm going to put you in our system. That's okay. Just to report the call. Yeah, of course. In case I have any other technical issues and you guys can at least see that, hey, I'm working with this team. Right. And what's an email that I could reach you at? Anna's in McKenzie and I'm in Kowson. I'm so silly. Marine.com. You've been looking at your email. I was like, I hope you have my email address. Yeah, so that's such a reflex question to ask. Sorry. Okay, I do the same thing with science. No worries. You've been staring at your email for the past 30 minutes. Yeah, okay. All right, cool. I'll make a ticket. I'm going to create your record in our database, move you over to our help desk database, put your ticket in your name. Can you just email me if you do get any update on that end, if possible? Yeah, we'll communicate through the ticket system, which will use your email and send you emails. So yeah, we'll be reaching out. OK, thanks. All right, good luck. Sorry, I went",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 563.362411,
    "salad_processing_time": 164.52350997924805,
    "overall_processing_time": 563.362411,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling me in sequence technology.  This is Mackenzie.  How can I help you? Hi, Mackenzie.",
    "job_id": "7681512c-e776-4be8-a1a1-44e6bda46b2c",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling me in sequence technology.  This is Mackenzie.  How can I help you? Hi, Mackenzie.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3000681178036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}