{
  "recording_id": "3000190498036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:13:11.896184Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:13:11",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hello. Hi, is this Stacy? I'm looking for Stacy. My name's Mackenzie. I'm with PC Recruiter. Hi, Mackenzie. Hi, Stacy. I was told to call you and make sure you're all good. And I don't know what that means. And I'm kind of scared a little bit. And you have my full attention for as long as you need me until you're all good. So what's up? Okay. All right, Mackenzie. So just so you know, I probably did raise a red flag. I reached out to Bill last night because I was like, hey, I called four times on Friday. No answer. Called three times yesterday afternoon. No answer. I'm not leaving a message. I just have general questions. And I reached out to Bill and I said, hey, Bill, you know, like, you know, I don't want to bog down Nick with general questions. I don't. You know what I mean? Like, he's got a bunch of stuff going on. You know, we hit him with new PCRM stuff. You know what I mean? These were general questions like, hey, why isn't my Zoom working on this? You know what I mean? Like, hey, why isn't this, you know, we just had general questions and it was just very frustrating. And I asked Bill, I said, hey, is there somebody else that I can have a direct number for? Like, hey, it's a quick question. Like, it doesn't take a ticket. It doesn't do this. It doesn't do that. Just so you know where that all came from. You know what I mean? Oh, it's fine. I mean, it's chaotic around here lately, but we're trying to right the ship and get back on track. Right, and I get that. Right, and I understand. You know, like some people are on vacation, but, you know, it's still got to operate. It's still got to run. You know what I mean? So, you know, I finally did get a hold of – yesterday morning I did get a hold of somebody, and apparently I need an enterprise API in order to get the Zoom thing to work, and that's on Zoom Zen. And so I've reached out to like six people in Zoom. We signed up for Zoom per year. You guys telling us too, because we wanted that data enrichment. You know what I mean? We wanted to find a way like, how do I get ahold of these candidates? You know what I mean? And now we're trying to integrate, you know, like how I'm going to integrate PCR with Zoom. Okay. And I did create yesterday two things in name records. Like one says Zoom email and one says Zoom phone number. Right. And then now I got a custom field. Yeah, I created the custom field yesterday. Okay. Now I got to figure out like, okay, when I import from Zoom to PCR, how do I map that? Is that for you guys or is that, do I need to talk to Zoom about that? I'm not personally a Zoom user myself. However, I think through tickets that I've seen over time, there's like a UI in Zoom's UI that you can like when you're setting up the integration you can kind of like pick a field to go to or I might be thinking about Zoom Info right? It's like one word? Correct. Zoom Info. Yeah. Let me look at our ticketing system. I'm going to search Zoom Info and see if there's like any breadcrumbs of like screenshots of the UI or something. we've had plenty of people calling about zoom info in the past so there might be like a video or something but as uh as i go it looks in research i'm kind of doing like research now um okay So here, goal one, map new custom fields in Zoom info. All right, we have a goal, one goal. Any other goals today? Well, I'm trying, like, on the back end of Zoom, you know, they have to turn on that enterprise API in order for PCR to talk with Zoom. So I can just hit a button, you know, like enrich via Zoom. I think that's what it's called. So I'm dealing with that with Zoom. Now, once I get that figured out, then I wanted to figure out the mapping part of it because, you know, the information I get from Zoom, okay, I want it to say, okay, this is the cell phone number we had in PCR already. And then when I, you know, do the, you know, update via Zoom or I import a list, it's going to put, like, the phone number that it got from Zoom in the custom field for the email or the phone number. Does that make sense? And the reason I want to do that is because maybe the Zoom stuff isn't right. I don't want it to override my data that I already have. Does that make sense? Yeah, that makes sense. Okay. So once we get, once I get, I'm waiting for Zoom on multiple things. Once I get some of that figured out, like that API thing that's going to talk to each other, then I need to figure out the mapping part. Okay. So that's when I'm going to need to talk to you guys again. You know what I mean? like, okay, they figured out the API part. Now, when I click this button, this is what I want it to do. Do you have a Zoom info account that you can log into and we can poke around in there and see? I just don't know. Well, I'm supposed to be talking to somebody from their integration team as well. I have a ticket out to that. I have like five tickets out to these guys right now. You know what I mean? But I can tell you, I mean, it's just been a wild ride in the past couple of days. I'm not even going to lie. And that's why it was like, hey, I just have this one question and nobody's answering the phone. So you got to understand how frustrated I get. You know, we've been with you guys forever. You know what I mean? So and I've never really had that problem, you know, like, okay, you know what I mean? So anyways, But I do have, like, we imported some roll-ups yesterday. Okay. And it's because, again, with the Zoom, you have, you use it or lose it with their credits by the end of the month. And we didn't know that, so we were scrambling, and then we just imported a whole bunch of shit. So, sorry, excuse the language. But, you know, like we imported so much stuff and then we're like, okay, we don't even know like, you know, where. So now what it's doing is it just put it as email and phone number. So the question, the other question I have is for this roll up, could I do like a global change and where it says email address, move it to like Zoom email address. And then where it says cell phone number, it can move to Zoom cell phone number or something like that. I think so. I think that's an action in the system. Global change is from one field to another, from a predefined field to a custom field. Let me make sure. Let me see if that's a... I think I haven't used the global change actions in a while, but I know they're still there. yeah and then i'm so so you know like we also like i have pcr9 and then i have had pcr 10 or m sorry pcrm and i'm trying to navigate both of them and i have so many questions on pcrm but i better reach out to nick about those so like nick we gotta have a talk like i got too many questions i mean if you know if pcrm is so new and it's it's very impressionable you could you could leave a everlasting mark on pcrm if you can nick of something i mean like it's possible so if you have like a question i mean like based in like uh this is kind of weird or we like you know it could be better like that could we could totally change stuff yeah yeah like i don't i Like I couldn't figure out how to merge two candidates in PCRM. There are a lot of actions that just like aren't brought over yet. Because PCR9 has just like thousands of things it can do. It's kind of wild how robust 9 is. And so with PCRM, like we started like a new, gosh, it's been years now, huh? We've been working on this. We started like a whole new thing. And so we can't, we don't have every action yet. So there might just not be like some, some of the answers to your questions might just be like, we just haven't moved it over yet. Okay. Yeah. Like that might very well be something. Right. Like as I'm using this, like as I'm like toggling between, you know, the two, you know, in my everyday, how I use the system, it is complete. The way I use the system is completely different than the way a recruiter would use the system. You know what I mean? I use the system back end wise. You know, I have meetings with, you know, each one of my employees. Let's go over your stuff. You know, I go to position and I'm all like, where's the drop down for, you know, primary RC? And then I had to create this thing. And so, you know, it's different. I get that it's different. I'm just, you know, that's why I was going to talk to Nick okay am I missing something like or like you said hasn't it hasn't not been brought over yet you know what I mean so yeah um and I've looked at the videos and I was like and I even tried to like search in the videos that he sent over in the training and I was like there's nothing coming up so there's gonna be a lot of questions you know and I get that you know and those you know those will come up with Nick so unfortunately it's so hard to keep like a master list of like things that can do and can't do compared to nine oh i know yeah but i figured it would also take like 13 hours to make the list somebody would have to go oh no yeah exactly so like i'm just keeping like you know like oh this is what i noticed and i'll write it down like i'm gonna i'm keeping a toggle of you know like okay these are the questions that I got to, you know, when we have our call with Nick, because he said, hey, let's set up another call after you guys play with it a little bit. So, you know, your best bet is to prioritize them like, hey, I don't see the merge function and then be like, that's a really high priority. Like, why isn't that there? And then Nick will be like, oh, yeah, you're right. And then, you know, he'll prioritize it to to be like, hey, you know, in our dev meetings will be like, how hard would it be to bring the merge function over? And like that would literally start the chain of events of it being brought over. uh so you know if my my advice is to like whatever you like need to be there like prioritize it um time is limited so like give them like yeah we really want to see like these three things boom boom boom and then we will work on bringing those over probably honestly uh so yeah the yeah there's probably a lot that you'll find that like just isn't over there yet because we have to kind of migrate it to the new software and find its place and see how it will look and run it by the designer and make sure the UI is all like sorted before we, you know. Yeah. And maybe it's there and maybe I'm missing it. Yeah. Some of the things may even already be in development too. Like some, some of the things might be already like, you know, halfway done or whatever. So that could be another thing, which he'll know that too better than I do. So. Right. Okay. So I couldn't really find much on Zoom info in our ticketing system or at least not while juggling talking to you. But I still have at least two goals. I have two things written down what we're trying to solve here. The imported roll ups. Global change. OK, yeah, let's see. Global change. That's what I was looking for. Right. I know how to do a global change on those. I'm just. the other question I have is other users, other PCR users that you guys have that have Zoom, okay, what is like the, what's the protocol for that? Are they creating custom fields like Zoom phones, you know what I mean? Are they not? Is that, you know, am I thinking way out of a box here? Like, you see what I'm saying? Like, you know, I mean, those are just like off the wall questions. Like, am I overthinking this? Am I, you know, do I just go with the flow? Like, you know, tell me. I don't think it's crazy or anything. I think you're just trying to make the most of what you're doing. I think you're very motivated and I am impressed. So I wouldn't, we're probably the ones that need to catch up to you. You know, I'm very fast, fast moving, fast paced. You know what I mean? We, you know, me and me, Tony and Jazz all are blah, blah, blah, blah, we gotta go, we gotta go, you know, so I don't have to do a global change or I can have Jazz do it, whatever. I think I might need to, because it does personal email, it does personal cell, okay? And what I don't want is, well, hold on, now I am overthinking this, because if I bring over their email address, right, it would go in the primary field. And if I'm going to do any type of email blast, then it's going to pull from the primary. So that field needs to be filled in versus having a Zoom email address. Okay. But now, okay, here's the question. So if I bring these over, okay, and I don't delineate the email address and I let it put it in the primary, could it take what if there is something in that field and put it, you know what I mean, like almost create another field? Does that make sense? Or am I, again, overthinking this? I have a couple of clarifying questions on that. Okay. So when you say bring these over, you mean like import or like through the integration of Zoom? So what it is, is like when you're in Zoom, okay, you create a list. It's almost like LinkedIn, like LinkedIn recruiter. You create a list and you're like, okay, there's 550 names right here. Okay. And then I go here and I go export and I go export into PCR into a rollup. Okay. So it's going to take all of these and it's going to export it into a roll-up that I created in PCR. Okay. And then it says, hey, what do you want me to do with the duplicates? And I'm like, nothing. You know what I mean? And then it literally took it. So here's a permanent example. If you pull up my system and you go to roll-ups and you do Hempath, H-E-M-P-A-T-H, 6.30.25. Okay. there's 1320 names in here let me see if I can catch up record URL the config or connects to search group I'm assuming yeah we really don't use config anymore rollups and you said HEM search H-E-M rollout. Hempath. Yeah. Hempath. 630. 25. Done by me. 1,020 names. AC 0808. Sorry. 1,320 names. Okay. I was just like, what are you having a different number today? No, no, no. Sorry, sorry, sorry. Okay. All right. So here's, this is what I did. So I went into Zoom and I said, hey, find these candidates. And it said, okay. And it did. And I imported them into PCR via a roll-up. Okay. So now, perfect example, like some of these are going to have personal email addresses and personal cell phone numbers, you know, all of those type of things. So let's say the second one down, Evan. if he was in our system and if he already had an email address in the email address, like the primary email address, is there a way instead of overriding it that it could put it as email work or something? or should I have it map it where it does zoom email so it won't override it I see okay you see what I'm saying only if it matches or only or or if there's something there only if there's something there yeah only if there's something like if like I see I see okay if this candidate already exists in pcr okay okay yeah if okay all right if candidate being imported from zoom info already exists inside pcr and that candidate record inside PCR has an email address, is there a way for ZoomInfo to put the email parentheses that it has for the record in ZoomInfo? into a different field inside PCR, parentheses other than the primary email, of which there is already a value saved. That's a great question. And these are the things that pop into my head. I'm like, let me call PCR. Okay, yeah, I got to make this. I'm saving this document. Stacey Salome Notes. Did I say your name? Yes, it is. You got it right. Salome. And you know what? You just said Stacey. I'm the only Stacey. I know you guys have a Stacey, too, and I've worked with her, and she's great. Okay. Thank you. Still there, right? okay you there test hello okay yeah i'm here can you hear me now sorry yeah no i could hear you the whole time i um i figured you put me on mute you were doing something no i was like my my arm just hit my microphone and it like unplugged the wire slightly uh and then me plugging it back in like it didn't auto reconnect i had to like reset the audio microphone setting in RingCentral, so it took me a minute. I was, like, talking to you. I was saying we haven't had a Stacey in a long time. She actually left a few years ago. Stacey did? Damn. Yeah. I didn't know Stacey left, too. I mean, I know, like, you know, Chris left and Blair, James Blair left. You know what I mean? Like, they were, like, my contacts. You know what I mean? So, I know, but I... We've had quite the catastrophic event. Yeah, so I can't really say much more than that. Oh, I know. It happens. It happens, and I know you guys are trying to recover. Yeah, that's probably why the phones are so hard to get through because we have less people. But we are bringing people back and hiring people, so we're trying to figure it out. Yep. Okay. That's all good. Um, so do I know the answer to this question? I don't, I don't, but you can find out at least I wrote the question down and cause it's a very complicated and it's like, like, I don't know, having it written down, I'll make it a clearer question. I could, uh, if nothing else, I could open a ticket in our help desk with them and be like, I called Stacy. These are the goals that we came up with and then like the ticket will be the manifestation of this call and we'll work on it from there okay uh so yeah so yeah um okay so now we got a couple things kind of going so i have four things but the third one is kind of like uh you were just kind of spitting weird thoughts like you you're wondering wondering what other customers and how they use zoom info I don't really think that's one. Maybe I'll... Maybe Stacy Wonders. Yeah, I guess it could be. It's just a random question. How do other people interface with Zoom? That's all. I'm not asking like, oh, I need their data. No. I just want to know what are other people doing? You know what I mean? Or what they're saying about Zoom. You know what I mean? Do they have any problems or anything like that. You know what I mean? So, I mean, I just dropped a bunch of money to get this Zoom, and I'm not going to lie. You know? I just, you know, I want to make sure I'm using it to its full potential within PCR, if that makes sense. Okay, so yeah. Stacy wonders about how other users interface with Zoom info integration, such as like are they creating the custom fields to import certain data to or do they just use the predefined fields things like that right right all right that's number three okay number one uh well i guess number one would be i have to switch number two and number one is in chronological order number two would happen first so you imported roll-ups can we do a global change yes the answer is yes that is a uh yeah i see the copy predefined to custom field action that is an action okay there's there's definitely a way so i can take over right all the all the predefined fields to a specific close with you. Right. Cause what we're going to do is because I don't have a lot of this mapped out yet in zoom is I prefer anybody who comes into my system that is not a current company. Okay. And when, and when I say current company, I mean like, you know, we have job orders with them, you know what I mean? We have a signed contract for a bus. Everybody comes over into the company called candidates. So I know how to take this roll-up list and globally change them from whatever company they were to candidates. You know what I mean? So I know how to do that. And then I guess the email address, I'm going to leave it as is until we figure out if I need to move them to the Zoom email. And then I'm going to have to globally change everybody's view to see the Zoom phone and Zoom email. But I want to make sure that that's the right way I do that before I make any of those changes. Does that make sense? But I am waiting on a couple of calls from Zoom in order for integration mapping and things like that. That's when I'm going to be like, hey, guys, this is what they're saying, and then we need to reconvene on that. And to make sure, like, if they get this enhanced API thing or whatever up and running, if there's anything else you guys need to do on your end in order to get this whole thing working. So I think we will reconvene after I talk to them. Like some of these questions are for Zoom, but, you know, integration-wise with you guys. So number one and two are kind of waiting for Zoom. Right. I'm kind of waiting for Zoom. Yeah. noted that. And then you just have general questions of like any other users and how they use it. And then, yeah, the one we just went over number four on my list is, can you have it switch fields? Like, oh, that's full already. Let's put it in this other field. I don't know. That's a great question. That'd be a great... That's a great... Yep. That's a great question. That could be something I go and find out for you and get back to you via like the ticket um is there anything else you wanted to know or right now no um but you know random random stuff pops in our brains so um you know what i mean like jazz had a question about like hey when we do zoom on and we're doing it like you know pcr capture they have like a zoom kind of capture you know that goes into pcr and we wanted to take off some custom fields so she was trying to call yesterday, she finally got a hold of Drew. She just emailed Drew. You know what I mean? So she got her question answered that way. So that's what I'm saying. Some of these things just randomly pop up and it's just like, all right, I just need to talk to somebody like five minutes. You know what I mean? Like, let's work this out. So if you could shoot me an email, okay, put down your contact information. And then if I come up with something with Zoom, with all of this stuff today, then I'll reach out via email. Hey, you got time for a quick chat. You know what I mean? And then we'll talk again. So that's all I'm asking for. Sure. Yeah, I can shoot you an email for contact information of me. And I'll create a ticket under your name in our help desk system. Just going over everything, all these things that we were kind of wondering. And I'll reach out to you via that to give you answers and then you could also respond and shoot back even more questions too. Okay. Well, I appreciate you following up. Sorry that we are hard to get a hold of lately, but at least we got some stuff going on now. Yeah. We got some movement going on and we will work it out. Zoom tickets as well. Hopefully they can text you soon before yeah i have like four of them open right now so yeah so well that'll be fun i'm hoping so too yeah all right what do you guys are you guys just closed on the fourth or what do you guys what is your hours i think we're off thursday and friday and i have to update my email signature to tell you that you've reminded me i just i just i just made a mental note so you're off thursday and Friday. Okay. Yeah. Now we have like a little email signature generator. I have to go update mine. It's just a little pain in the butt, but I got to do it before I email you. I'll do that. Yep. So, okay. So office is closed the third and the fourth. That's fine. Yep. So I know, like I'm not like, you know, well, nobody's answering the phone again. Yeah. I don't know if we put up like an AFK message. Oh, that would be nice. Yeah. Real quick. so like you know I've called PCO you guys are on my speed dial just to give you an example so you know and you hit two for general support and you hit four for technical support do you know if you hit four now it says thank you for calling general support there's no more technical like I don't even know why you guys have four anymore just mental note I wonder if that's It could just be like a fallback. Maybe there's like no one on the tech line is available, so they roll it over to the general line, and then somebody answers there. Maybe something like that. I'm sure that that's probably like a fail-safe, like a rollover to whoever's available type thing. The general support people are way more available than me, the only tech guy who's doing every tech thing. I'm very busy a lot of the times. it's like hard for me to really find time to be on the phone line. So that could be a reason why if you're trying to hit four for technical, you get general. Okay. So sorry about that. I, I am a little bit more available lately. I've kind of got over the initial first like mountain of things of like learn the job, also inherit all these old tickets and also maintain current new things happening. Kind of getting there. so I'll maybe be more available on the phone line going forward and we're also bringing back Tyler I don't know if you remember Tyler I remember Tyler yeah but he'll be back too so to help out so really good yeah awesome all right so um yeah and you know like I'll just you know I can shoot you an email like hey I got a couple of questions let me know when you got a few minutes I don't expect you to drop everything for me I don't you know like hey oh that's preferable couple hours you know what i mean and and i'd rather like like us have that open communication like okay jazz reach out to you know like like just just send them an email you know see what you can you know see what his availability is you know what i mean that's what all i'm asking for is that open line of communication so i you know somebody so i mean like is robin still there yeah yeah robin theore she was moved over to the billing department okay she's normally the person that was answering the phone but she um she's kind of caught up on billing too and she's training someone as well to like help with that so she'll be more on the phones as well again can we kind of both me and robin both had like a similar experience where we kind of changed roles for a bit yeah and yeah we inherited a big mountain of things to do yeah yeah so good deal all right so we'll reconvene today's tuesday so i don't know if it's going to be today or tomorrow you know what i mean but hopefully we'll get some answers soon um on on zoom and then we'll kind of go from there okay all right stacy we'll have a good rest of your day you too thank you very much thank you i'll talk to you soon i'm sure okay all right bye-bye all right take care bye",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 552.192588,
    "salad_processing_time": 59.97126483917236,
    "overall_processing_time": 552.192588,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hello.  Hi, is this Stacy? I'm looking for Stacy.  My name's Mackenzie.",
    "job_id": "128ba94c-99c6-43a4-98f4-3bf8a807ed75",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hello.  Hi, is this Stacy? I'm looking for Stacy.  My name's Mackenzie.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical",
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3000190498036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}