{
  "recording_id": "3001775127036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:14:33.705965Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:14:33",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is Mackenzie. How can I help you? Hi, Mackenzie. This is Melanie. I am calling because I'm having difficulty with PCR linking to my LinkedIn account. I'm sorry, PCR capture. Okay. Sure. What seems to be the issue when you're trying to log in and it doesn't log in? Or is there some other issue going on? I am, I had put it, it's up here on my browser right next to the URL code. So I can see PCR capture and then I click on it. I put my login information in there. And for some reason, you know, everything in here, capture, match, everything looks good. But then when I go into LinkedIn, it's not, I don't see the button, the PCR capture button on the right hand side. like it's supposed to show up. Okay. Interesting. I'm pulling up my capture tool here. So you are logged into the tool. Like when you click on the tool in the browser, it no longer shows you the login screen. It shows you like there's a tab that says capture, a tab that says match. There's a bunch of toggle switches. And then it'll have what your, it says current user at the bottom, current database at the bottom. So it is logged in. Okay. Okay. Yeah. Yeah. Did you change any of the default settings when you installed it for the first time? No, I mean, I put Chrome as my default, but that's the only thing that I did. You said LinkedIn was having the issue. Yeah. I'm on, I'm trying to get it on the LinkedIn over here. So it shows up on the right-hand side. Are all of the toggle switches for LinkedIn turned on to the right and blue? In Capture, yep. And then in Match, same thing. Both LinkedIn and Indeed toggle switches are both on in those as well. Okay. Are you like a LinkedIn recruiter account? Are you paying for like the premium version of LinkedIn? Yes. I have LinkedIn Recruiter. Okay. That could be a reason why. Okay, let me get everything about... I might have to open a ticket for this because the capture tool is something that companies like LinkedIn and Indeed and those websites, they don't really like it. because it's, you know, like, LinkedIn does a lot of work in providing their service and their data, and, like, we're just, like, coming and scraping it, so they frequently change their website. Like, it's honestly, like, an ongoing battle of, like, our developers versus theirs, where our capture tool will work, and then, like, they'll make changes to their website, so our capture tool can no longer, like, find the elements on the page to, like, scrape the data from. And so then our developers have to go back and like re find like where, like what they did. So it could just be that it's been long enough to where like they finally pushed updates and change that again. And I have to look at it. And the problem with this sort of thing is that we don't have a LinkedIn recruiter account to log into. So, um, a lot of times, uh, like it's like, it's like thousands of dollars, right. to get one. And we don't, I mean, I guess we have a decent amount of people using it, but we really don't get the value of like having one. So sometimes we ask for access to the LinkedIn recruiter crowd just so our developer can like log in and see the page and like find the elements that they're looking for. Would you be open to that? If they did need to, like if they did, because I don't know if that's the case right now. I have to do more troubleshooting, but okay that's like all the thoughts that come up with just like what you said so what i want to do now is make sure i have all your information um i have a good description of like the issue and then i i think we i need to go back and like actually try and troubleshoot more with you um to make sure just yeah just to make sure that because like you've said you've done it but i actually see it um yeah so this is my this is my second day of work and my boss she's on teams me here i muted her but um she they all use this pcr capture um in their on their linkedin so this is something new for me so you have to walk me through because i have no idea i have a question but i was using microsoft edge and i put it in chrome do you think that matters I think Chrome is the preferable. Okay. I think we, like, our default mode is in Chrome. Like, everything we do is in Chrome here at MST. So it probably works better in Chrome. It should work in Edge. We support Edge, but Chrome is preferable. I am in Chrome. I do have an error on the top right hand of my screen in Chrome, though. I wonder maybe if that could be the issue. Yeah, there could be a lot of stuff. You said your name was Melanie. What company are you with, Melanie? Susan Graham Consulting. Yes, Susan Graham Consulting. You said it's your second day of work, so you haven't called here before. No. Okay. I'm going to put you in our system just so I can log the call and if you call again we have you Melanie would you like to give a last name Tanner it's T-A-N-N-E-R okay and do you have an email address or your work email address for this new yeah sure it's mtanner at and it's susang I see it on other records here. SusanGConsulting. Cool. All right. Melanie, is that M-E-L-A-N-I-E? I-E. Yes. Yes. Perfect. Melanie Tanner, MTanner, SusanGConsulting.com. All right. So you're in our system now. And then I'm going to pull you up. Okay. so I won't lose you there all right and then yeah all right so would you have a few minutes to hop on like a google meet yeah yep I can do that and like share your screen okay great go to if you would please go to meet.google.com meet.google.com okay and then in like the middle ish of the screen you'll see a like insert code yes insert code and i'll have to hang up with on teams right with her or can i do the same thing no you can leave that open um okay you're just opening a new chrome browser right and yep all right they'll run side by side you might want to there's going to be there's going to be the ring central call or i don't know you're calling from teams or whatever uh and then the Google Meet call. You're just going to want to mute the Google Meet call so you're not like double talking. But anyway, it's going to be 10 letters to enter into the box here. Oh my goodness. Okay, go ahead. It's C-C-P-H-X-N-W-S-O-V. Should be it. Okay. make sure to like mute and turn your camera off and ask to join and I'll allow you into the meeting and then there will be buttons to share your screen and you can show me what's going on okay and you want me to use my take off the microphone and camera right yeah you don't need that okay yeah we're talking over the other other call we don't want to do all that admit okay oh sorry is it working when you're in yep so i see you in the meeting um so now at the bottom of the Google Meet, there should be like a share screen option. Yeah. And then pick your desired screen, click share, and then I would like to just like click through it with you and see everything happening. I might have to take a screenshot or something like that. Yeah, I don't know if I should click, what is it, PCR intercept or LinkedIn? Okay, this one. When you're sharing, when you're sharing, It is nice to kind of just do the entire screen in case we have to leave this window here. I might have to look at something other than just the Chrome browser. Yeah, no, that's fine. You can, yep. Because I can't actually see with this view. I can't actually see like anything like in the top part of the browser. Yeah, I can't see like the extension. How do I do that? How do I make you see all that? I think you're going to have to stop presenting and then represent. And then when you're selecting your screen, there's like tabs in this little window that pops up and you got to go to the entire screen tab instead of the window tab. I think you're on the window. It defaults to the window tab. This says the Chrome tab on here. Yeah. Do you see like different tabs inside that window where it says entire screen. You're going to want to click entire screen and then it'll allow you to share one of your monitors. Okay. Okay, yeah, now I can actually see the extensions you're presenting. That's fine. You could just... That's fine. Show screen anyway. You're going to just navigate away from this tab of the browser real quick because it's showing... Oh my goodness. It's showing infinity screen. Yes. They show a warning for that, probably because it spikes the usage of your computer. You probably want to click off this tab. Just go to another tab. No, no, no. Oh, my goodness. No, you just have to go to another tab. Do the same thing. Okay. Just don't have that one showing on that screen. It's fine for, you know. okay so now what do i put just click over to any other tab click click a tab new tab yeah that click that okay how do i get that out of my way click click on new tab right now the words new tab click them hurry so there's that yeah that one click it click it click it click click right there click can you can you click that tab for me please um i can't hang on let me stick hang on let me stop is there something up on it oh is there there yeah i had a bar on the top of my screen oh oh i couldn't see that bar i'm so sorry i was like what are you doing i couldn't see yeah i couldn't i couldn't click there's i'm i was screen sharing with my boss i couldn't see the top of it all right i'm teasing you i'm sorry um very no that's okay uh so all right no it's okay you can still yell at me that's okay i didn't see the bar that was in your way uh so anyway uh infinity mirror is not a big deal i don't know they they show a warning for it but i've never had like a computer crash or anything for it but anyway um so uh could you show me go to the LinkedIn page and then, you know, show me like capture not working. So, and I see this error up here. I don't know why I'm getting that. And if maybe that's the reason, but when I go up here, I have all my credentials in, and this is what we were just talking about. I have my user ID and Susan Graham. But I don't see anything on that, on this right-hand side over here. This is like me pointing now. um let's just go through a couple things if you don't mind um yeah yeah refresh like click on a new profile and i want to see the page like refresh um so okay so now okay so you just click the profile this is a screen the capture tool should recognize and yeah it's not appearing okay could you uh do you have like a normal version of linkedin this is the recruit is this the recruiting version or no well this isn't yeah this is this is the normal one like i would log in like this is totally normal and then i have um the recruiter version over here which i didn't click on i just oh okay okay on my network going through my my first connections all right can you hang on a sec i'm gonna try this on my end because okay if we're because you're actually using just the normal version of LinkedIn. Okay. So I'm logging into LinkedIn. I have the capture tool and I'm logging in. I'm clicking on a name. I'm actually, actually I'm going to click on the same name you're clicking on. Let me see. Who, who'd you bring up? Brittany. Okay. Oh yeah. P I N. Sure. Okay. We're going to look at the same record because if it works for me and it doesn't work for you, there could be something else happening. Right. Right. And like I said, Did it work for you? It didn't come up for you just now, so now I'm trying it on my end. So I'm searching for Brittany's name. See that. I see her. Click on her. Mm-hmm. you are a first connection with her and it did not appear for you it's not appearing for me either i'm refreshing her screen okay oh it did appear okay can you hit the little uh refresh like next to the url bar it's like a circle arrow that's like yeah not that one no no on the left side, on the left side. Oh, over here. Yeah, okay. Yeah, refresh the page. This should prompt the capture tool to appear, right? It did for me, at least. Oh, it did! It is there. Okay, so... Can you go back to the... Okay, so it works there, but can you go back to the other... Yeah, like, click around on some... I don't know why it wasn't... like registering before. Am I going to have to click refresh for every person? I, you don't normally have to. Oh, I do. I wonder if, um, I wonder if they made a change and like, maybe like if you're, cause if you navigate via like clicking through, clicking through names. Maybe it doesn't trigger something that used to happen before and so only refreshing the page would. prompt it now i don't know i'm gonna i'm gonna see if that's consistent on my end yeah that is something that seems fixable though so i'm gonna see i'm just gonna click around from name to name on my end i think i can actually i think i could recreate this actually so i'm all right so i'm clicking through andrew's name here okay no he he appeared click to update appeared. Somebody who's already in my database, it appeared for me. I'm going to click a new name. No, click to add. That appeared for me. All right, I'm going to go back to you. Can you just click around and just be... Oh, see, click to update open for you too. Yep, I clicked someone else's name and it's the same thing. I have to refresh for them to come up. yeah let's just do a couple like hold on wait pause for a sec give it like you know and then we're just gonna try this a couple times um clicking through names like on this more profiles for you area okay it did not appear for jordan can you click on like jackie there in the bottom right area just her name one and then see yeah let that load and see if that appears because like for me, I can click through these different names and they do appear eventually. It's not for you. Okay. Just keep clicking a couple more names. I just want to see a couple good examples of it not working. And then I could have like a side-by-side comparison. Like it's clearly. Okay. Yeah. None of these came up and then let me click refresh once and see what it It does, yeah. Okay. At least you have a workaround. That's not the intended behavior, and I think you have something unique about your setup. We could investigate that error in the top corner. Okay. Do you want to click on that error and see what expands there? It says new extension added. MacCaffey WebAdvisor. Is that the error? That seems like a notification. Where is the error? I don't see an error. That's a great... Yeah, that's what we were trying to figure out. I was like, well, maybe that's the issue. Oh, click on new extension added MacCaffey WebAdvisor. See what they're trying to tell you there with that. An extension? No, no. The very, very top new extension added, parentheses, McAfee, WebAdvisor. Let's see what they're trying to tell you there. All right. Another program added an extension that may change the Chromework. I don't really need that. Yeah. If you decide that you don't need it, then I think you'd want to click remove from Chrome, if that's the case. Yeah, hang on. I think my computer froze or something. I don't have my mouse. Oh, I see it moving. So remove from Chrome. Yeah, and then also we'll go into, we'll manage it. So top right corner, the three dot menu, where it used to say error, click that again. And then go to, there are the extensions. Yep. Go to manage extensions, please. And then go to the details, if you would, for PCR capture, please. I want to see what version you have. So it's 1.1.9. I want to make sure that matches mine. Do you see down here it says allow files for URLs? Is that something that I should have on? Allow access there? Allow access to file URLs. That is off for me. Okay. Those are all default settings, I believe, yeah. Yeah, so those are off. All my settings look the same as yours. Okay. Which is good. Okay, so you know what? Who knows? Maybe that McAfee... What's the developer mode on the top right-hand corner? Do you have that? Yeah, developer mode, you can turn it on. I mean, it doesn't, I don't think it does anything. I don't know what it does. I think it does, I think it just allows you to, like, see more things that, like, only is relevant to somebody with, like, that technical knowledge, you know? So you might, I don't think it does anything if you turn it on. you just get to see like more technical jargon that a developer would find useful. And yeah. Okay. So you know what? It could be that, that like McAfee is a, whatever, like a protection, you know, like a antivirus type of thing. And if it was saying like there was this extension altering the way Chrome worked, like it could have been blocking it. Do you want to try again? Just go back and click around a couple of names and see if that was it. Yeah. on LinkedIn. I think that's all the way to the left. Yeah. Click through names and more profiles for you, Aria, and see if it loads at this time. I don't know. Maybe it was blocking it. Oh, you're right. All right. Sweet. Click a couple more. Let's make sure. I just want to make sure, you know, do a couple more than just one. being a tester, I learned that you always do things like four times. Yeah, I love that. Get some consistency. It looks like it's coming up, though. Yes, it is. So that error was the problem. It must have been the McAfee web browser extension preventing the pop-up or whatever it is. Yeah, like you said, that's just a security feature, right? Right. Yes. It said the little notification said that one of your some other program like installed it. I don't know what did, but something I had my computer worked on yesterday by one of the technical companies. Like maybe they installed my computer yesterday. It's probably a product, right? They probably installed like an antivirus and it just like auto added that or something, you know. But at least we figured out what it was. That's cool. Now I know. that those little browser extension errors can get in the way of that. I didn't know that. Yeah. No, that was good. That was a good guess. Easy fix, right? Yeah, that's very good. I'll take that as a win. It could have been much worse. I'm glad that it's not the other thing that I'm saying where LinkedIn changed their site. Yeah, I've had a huge issue this whole week with just starting with this computer. Oh, no. Something like this. Populate. Oh, come on, Brittany. What's going on? Maybe I spoke too soon. I don't know. Yeah, okay. If you refresh and it comes up, and then you click another name and it comes up, it's kind of just like maybe just sometimes it could be like a timing thing. I don't know how fast your computer is or how many things you got going on or how many screens you're running or you know like maybe yeah i think if you could always refresh and get it back then that's that's like in air quotes like working you know it's like working as intended like sometimes sometimes just yeah the timing might be off or something or it might like miss the the opportunity to load it and you just refresh and it comes back and that's just kind of the best it can do right now because if it were the other problem i was talking about before Or it wouldn't, like, capture wouldn't work at all. So it does seem to be working. Yeah, that's kind of weird. It kind of fails, like, every other time or something for you. Almost if they're not first connection. Oh, that does actually affect the capture tool. First connection, second connection? Okay. Yeah, because not the little badge as much, but, like, You can see more information on a first connection than you can. So like the capture tool will find more information on a first capture, first connection than it will on a third. Cause like it literally shows more fields to you if you're a first connection or like rather than a third. So you might get like the email address on a first connection, but you might not get it on a third connection or something like that, you know? But yeah, it looks like, it looks like the capture badge is working. It's just, it's kind of finicky on your setup for, I don't know, some reason. Do you have a million programs running or is it just one monitor? Do you have just this one monitor? I have, I just have this monitor and I have a laptop and my laptop only has my email and edge up and teams, but outside of that, but when I click on like this girl, she's a third connection, it pop, it pops up and I don't have to restart it or whatever. But if I put somebody in here like this guy who is a first connection. Oh, now it does. Okay. Yeah. And he's an update. So that's a, those are, those are comparing two different scenarios because it says click to update on the badge. That means that it recognizes as a duplicate in your database. The other one said click to add, which it recognizes as a new name. Cool. Do I need to click to update or no? That's something to do with PCR capture. That's to do with the profile, right? Right. Yeah, it's not like the version of capture. It's click to update this guy that you're on, Nathan, in your database. That's what it means. That's what it means. Yeah, click to update. Oh, click to add. Okay. Right, right. Yeah, I didn't ever look at it from that perspective. That's so confusing now that you say it that way. It's like, should I update capture tools? Like, no. All right, interesting. Yeah, it says click to add, so that's good. Yeah, click to add means Capture doesn't see it in your database already. But yeah, you can't really compare two profiles that say those. You'd have to find two different examples that both say click to add because different code triggers if it recognizes it as a duplicate. Yeah, no, this one it didn't come up for. Okay. here refresh him and see like what it says add or update click add i'm not sure why it doesn't come up for every one of your examples but i i from what i see though it is it is working as like i just don't know i don't know. You have to refresh sometimes. I wonder if it is like a performance thing. Could you right click the bottom bar of Windows and there should be like a task manager option that comes up in the menu? Task manager and go to performance. I'll bring this over to you to my other screen. Yeah. You're on the Processes tab. Can you go down to the Performance tab? Yeah, which one? It should be the next one down on the left. All right, hold on one second. I'm like comparing yours to mine and seeing if the numbers it doesn't like look doesn't look crazy or anything looks all pretty normal uh yeah it looks pretty normal i just uptime is that is that a day or is that a week cpu seconds minutes hours days okay okay um okay your all your computers been on for one day and two hours and two minutes um all right so yeah everything looks fine i just i don't know why i can't really explain why it's not coming up on every click uh but i do see yeah you can close that i do see that uh it is working just for some reason not on every single click I don't know I'm going to click around on mine and see if because it's it was pretty reliable for me I'm clicking through a third I'm on my end I clicked a third connection it came up I click on a zero connection it doesn't even say first second third or anything and that came up second connection that came up for me i wonder do you clear your cache very often of your browser um i've done that before uh i have not done that lately i've done that before with my other company um so wait what do i do i go into history it's going to make me sign into everything then though right yeah I don't know I don't know I don't know how yeah um you don't have to you don't have to clear it but does that even make sense does the capture tool access the cache I think it does I wonder why my old company is in here Bullhorn yeah it's another CRM tool or whatever but yeah all this stuff is in my is that because how is that tied to Chrome with me or is my other company brand new computer brand new company you must have a Gmail profile and yeah Google creates like a profile for you like for your email and for your Gmail and it keeps your it keeps your history tied to your profile rather than the computer you're on interesting yeah that'll do it for like you can you can like Google something on like your phone and then go on like the browser if you're in the same profile it'll the history will be there. This is what you've accessed on this Gmail profile from any device. Yeah. Will that just stay on my old company computer too? If you're signed in as your Melanie Gmail account probably. I signed out of it before I gave it back. That should be fine as long as the password, as long as you don't have the credentials saved in the browser. It should be okay. I'm just deleting these is there a way that I can delete if you don't mind if you're confident you know all your passwords and don't mind logging in I don't really want to sign out of all of that right now. You could just clear it all. I want to get all. Otherwise, you'd have to. Can I clear it by date? Like go, I don't know. I mean, it is sorted by date. Maybe you could. Wait, what are you clearing? I think you're just clearing like the, this is the, this is just like the websites you visited. this wouldn't clear out any sort of saved passwords on this this is browsing if you wanted to I think under advanced it'll have like passwords and stuff right yeah passwords and sign-in data so you can clear out all that other stuff and keep your passwords and sign-in stuff just don't unclick this right yeah don't click that do not don't yeah yeah you can clear all that other stuff and that's fine that's just like what website you visited um yeah i don't know yeah i don't know what's gunking it up but um yeah it seems like it's working you might what's that why are you doing this look now it's bringing me back to august of last year Where do you see this? What do you mean? On my history and my Chrome data. Chrome history. Do you still see that or no? I don't see any where it mentions August. I see deleted Chrome data. Selected data has been removed from Chrome. sync devices your google account may have other forms of browsing history okay got it it's all i see oh okay i'll get out of there i think you just closed the google meet oh uh-oh i don't know that i did did i do that yeah you left the meeting i don't see your screen anymore oh that's probably because yeah now wants me to sign back in here to LinkedIn. Oh, no. Even though I did. It kicked you out for clicking browsing history? What? Yeah, it signed. No, I'm still on LinkedIn. Let me go to my first connections again here. Okay, so it did not sign you out? No, it did, and then it automatically logged me back in. Yeah, it's still not populating unless I click refresh. So it's quick to add, but that's fine. I can work with this right now if I have to refresh for right now. but for people that are not my first connections, it does automatically appear on the right hand side. But for people that are my first connections, I have to refresh. That's weird. That's interesting. Maybe they did change something then. And it wasn't like such a catastrophic change as we thought, but it was like maybe first connections just are like, they changed the format of the page slightly differently. And it like does something weird on first connections. Now that could, that could be it. um can you try one thing too um in in chrome like i don't need to see your screen for this um but in in chrome in the top three uh sorry the top corner the three dot menu where like settings are all those all those things go to actual it says like settings at the near the bottom and go to about chrome on the left and that will update chrome and i just want to make like when you go to the screen does Chrome immediately start updating for you it says Chrome is up-to-date oh it does okay can you tell me the last six numbers that you see yeah seven two zero four nine seven oh interesting mine's different it mine's mine's up to date and mine are different what's the first three numbers do you see one three eight oh okay okay i'm not up to date i have to relaunch to see the new number i guess okay i just updated so maybe if i update my chrome maybe i'll have that problem yeah because yeah being a tester you really just want to like match test environment and so it appears that I was not up to date on my Chrome and you were so I don't know maybe there's something now I'll click around now you said you were clicking on first connections I'll click on a couple first connections here. Yeah. Here's one. Oh, it appeared for me. Is that it for your first connection? Yeah. I'm going to try and find another one. It's not a competition. I'm not trying to gloat. Let's see. It did not show up for my first connection, but I'm going to click on, I don't know, this person. She's a second connection. I did show up for her let me refresh yeah it seems to be working over here too I can't get it to fail I'm not well if I refresh it brings it up but if I just click on somebody it does not appear I'll bring that up in the meeting I can't really say much about why that happens I could kind of bring it up though and see if anyone says anything else we have like a support chat actually I have a tester that tests it I can ask him but at this time, I think it's just, so I don't know, something with your, something with your setup. I don't have Windows 11 either. I can't, I can't say that I also have Windows 11, but I don't think that should matter because it's Chrome really that you're in. It's not, it shouldn't matter what operating system you're in. That's just like a Chrome thing. Yeah, no, I'm, I'm in Chrome. Weird. Maybe, I don't know, let me click here again. I'm just happy I can at least do something with it. Do you think I need to open a ticket for this? No, I think we'll let it go like this right now and see what happens. And then if I need you, Mackenzie, I will, I guess, reach back out. If you're working and you are curious and you want to investigate more or whatever the case may be, I would ask your coworkers if they have the same issue. like hey when you click through these names does it appear and if not and you refresh does it appear you know like and if if other people are having the same issue and it's like a widespread thing then i think maybe it is worth looking into but at this time like i have two examples one works like perfectly which is you know like mine like i i'm honestly like not lying i just i want to get it to break because that that gives me something to do i could like go on and look at it and you know like i it shows that i'm like working so finding stuff is good for me so i'm like trying to find it breaking but i just don't see it breaking so there's one example working fine and then yours which is like working like most of the time and then you also have just the work around of like refreshing the screen so like it appears to be like doing what it's supposed to do so i can't really do much with that but if we have like three or four examples of like this is consistent across multiple people then we can be like okay maybe there is something like worth worth actually spending like resources like investigating you know um because the developers time is like i guess valuable right they're developing code new features and stuff and like it's like oh hey you got to work on this bug so yeah it's kind of that scenario now where it's like i guess yeah we just kind of have to leave it here and i'm sorry that you might have to hit refresh more often than you'd like no that's okay i will i will continue to do that and then if anything else arises um yeah ask around see if it's like a wider spread issue and if it is we can maybe look into it more but it seems to be like working it seems to be working uh fine enough at this time so doable yeah that's all i can really do i'm sorry i can't really do much no that's okay i appreciate your help thanks mckenzie yep um i appreciate it thank you yeah good luck in your new role and everything you're in our system now so if you call in we can find you and note the call so thank you have a good holiday weekend and everything yeah i forgot it's the fourth of july weekend yeah have a good holiday um and thanks for your help i appreciate it yep no problem all right i'll be here if you call again later bye",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 600.879492,
    "salad_processing_time": 80.9669017791748,
    "overall_processing_time": 600.879492,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence Technology.  This is Mackenzie.  How can I help you? Hi, Mackenzie.",
    "job_id": "78301343-c6e2-403e-b4e1-6fc01c49fd52",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence Technology.  This is Mackenzie.  How can I help you? Hi, Mackenzie.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3001775127036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}