{
  "recording_id": "3002850035036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:19:50.470512Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:19:50",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is McKenzie. How can I help you? Hey, McKenzie. How are you doing? This is Brian Binke with the Birmingham Group. All right. How's it going? It's going okay, but I think I have an issue with someone that just left our company. You can probably help me out on it. What I'd like you to do, I want you to reproduce what I have. and it's going to be by going into activities on our system. Okay, let me pull it up. I need to know the – oh, you did say Brian B. with Birmingham Group. Sorry, let me pull it up. Let me pull it up. I didn't catch the spelling of the last name. B-I-N-K-E. Okay, great. Thank you. Birmingham group, okay. I'm going to the URL here. There is a bunch of databases in the dropdown. Which one are you logging into? MR Birmingham. MR Birmingham, okay. And the username that you use? JV, and let me give you the date range. Oh, sorry. So this is good. What is your username, Brian? Oh, I'm sorry. I thought you want hers. B-E-B. Or just, yeah, any username, I guess. B-E-B. Okay. Log in and go to activities. The activity search, right? Yeah, we want name activity search. Name activity search. Great. Okay. Activities, name. Okay, I'm looking at the activity search. Let's go to, let's do start date 6-22. So, you know, kind of the last week of last month. Yeah. 25 through today. Okay. All right. All right. All right. Anything else? Just a JV is the. Username. Username. Okay. And it sure looks like she was on vacation and then she quit, but it looks like there's been a lot of activity. Which kind of concerns me. 51,000 records, bulk email records, a lot of them. Yeah, and then from what I understand, there's a bunch of roll-up lists that were made and deleted. Bulk email, bulk email, bulk email. So I'm trying to actually... I put at least a lot of these... I put all these names on a roll-up list, which came out to 50,827 names. I don't know if that's going to be helpful, but I'm trying to turn it into a CSV, but I have a feeling that I'm blowing up your system trying to do it because it's just spinning in circles. It's probably so big you can't even do it. Maybe. That's probably part of it. I'm going to see how many of these are just bulk email. How many are bulk email? And I would like to see what aren't bulk email. Oh, wow. That's it? Well, I just, what I did is I just took that activity, turned it into, you know, a name roll-up list, and it came out with 50,827 names. Yeah, that makes sense. There's 51,000 activities, right? Trying to investigate what's happening here, I'd have to spend some time looking at this. So what we'd have to do, though, apparently, though, she had a bunch of roll-up lists that are deleted now. So we want to see what's been deleted from that time through today, which we keep backups, don't we? Yes. We have a system where we can backup a database to any point in time in the last 30 days. perfect we caught it good because i need to see what i'd like to do is see what she's what she downloaded what she sent out and the you know when she deleted everything because i think there's a lot of forensic in here because there's no way somebody on vacation should have that much activity should they I mean I don't think so uh what was the dates JV was on vacation uh what was it all last week and I think a couple days a week before so like Monday through Friday so like uh 23rd through 27th yeah but I noticed a lot of the but she didn't have to come back to work She said that she quit on the 30th. What day was it? So she sent a resignation letter on Monday. What day was Monday? That was the 30th, yep. Okay. So at about probably, I don't know, two in the afternoon, we turned her off. I have a feeling that you know she spent like all those days well we could tell when she did it because if we wanted to go through a thousand pages because they're all dated but there's so much shit there yeah there is I'm going to click through the pages to see if I can get to like what because a lot of them are bulk email about a thousand of them are bulk email activities um who would she yeah i want to can it show i want to know where they went to um it's in the because she deleted the i think she deleted the roll-ups oh you could just search for the um the time frame and then her name and then like the bulk email activity you can find those specific names and those are the names she would Yeah, I'm wondering how she did it. Because I have a feeling she went into business with somebody that was with us. Maybe. I'm not sure. Well, why else would this happen? Unless she did it on her own self. So how would I do what you just said? I'm just curious what was in that bulk email. Well, it would show you where that bulk email went, right? How about if she deleted the emails? I mean, how about if she deleted the roll-up list? I think you can restore roll-up lists from the recycling bin. So how do we do that? Let me check. Or do you have to do it? I'd rather you do that. I'd rather maybe just have a plan, too, before we do anything about it. Yeah, so there is just, like, the recycling bin. I don't know, though. It's having trouble loading. Maybe yours is very, very full. Maybe it takes a minute. Well, it sure seems like it. She plugged it up. All right. Username JV was on vacation for about a week last week, June 23rd to June 27th. Then she comes in on Monday and says she resigns. She didn't even come in. And she sent an email, but she doesn't call back or anything. I wanted to do an exit interview and shit. Okay, so do you have specific dates and times you'd like to get a restore from? Or what would you need from me? I don't know yet. See, the problem is I want to be able to – I'd like to be – what's the word that I'm looking for? I'd like to be able to isolate the restore as it relates to this which will probably be most of it I would think but is there a way that we can find out what's been restored because that would also reverse that would tell us what she took or if you can't even before if you can figure out by what you see the exact email that went and where it went to chances are it either went to that employee or went to her house yeah you could um you can see it by uh running the activity search you kind of walked me through it, right? You walked me through going to the activity search, setting the date range back to June 23rd, and then searching for username JV, and then the activity... June 22nd. Okay, it's June 22nd is where I went back to, but let's try that. Yeah, June 23rd or whatever day. 22, but it's okay. Yeah, one day, and then just search for the bulk email activity type, and that will give you like 876 results for bulk email. Where do I activity type? I go activity type. Maybe I'm in the wrong one. Oh, bulk email. I got it. Actually, it's spelled out that. You can just type in bulk email, one word. Okay, so I did that and then JV. Yeah, and then that should give you a bunch of bulk email results and then you can see in the activity text what letter she used and who it went to. So, okay, so let me just, let me do this and see what happens. Nothing comes up. Their search contains, oh, it contains invalid dates. That could be why, right? Let's go back. Let's try it. She sent some work-life balance in construction form letter. Work-life balance. We can look at what that contains. Oh, wait. JV. Okay. you said bulk email yeah okay okay I got it so hot okay so I got them all up right now so what do I do so how can I tell what do I hit to know what the letter is so in the results that you see the search results you'll see on the right there's the activity text like column yeah work like balance right and then if there's details like who it's sent to and which letter was used so you can then look up that letter name in the form letters area and then you can see what the letter says okay let me just see one thing for a second because it looks I wonder did she send them all out on the 30th Yeah, it sounds like right before she resigned, she sent a bulk email for some reason. Were they all? Let me see. How can... These are about 700 different bulk emails, or is it? Well, that's one bulk email, right? yeah it looks like they were all one and they're all okay it's probably because she came up the company so let me see okay why did it come up come maybe I had companies because it just showed the company let me I'll look up so look up basically I can look up what the letters and see how do I do it now or can you do that for me and figure out where do I put the name of the email in letters or no so um to see the form letter she used you can go to the system menu yeah and then so that I and that I can do but yeah okay that piece I got let me do that though since we're doing it so what were you what would you ask me to do well I want to know like where it went. And yeah, I guess I would... The activities are name activities. Those are the names that she sent that to. And where was it supposed to come back to? Her address? The email that sent it, yeah. I would imagine. Can you tell which email sent it? Let's take a look at the activity again. I'm not sure. Let me go. You said... Let's see. She sent it with a sequence. So these are sent from a sequence. you guys use the sequencing feature? Obviously, you do. Oh, we got to stop that then. Okay. Go to the sequence and see maybe like the template. JV June letter personal. Go to JV June letter. Okay. For some reason, I'm not able to go into systems. You said I had to go into systems, right? Yes. if you'd like to see the form letter, yeah, you go to system and then form letters and then name letters and then you got to search for the letter title. Okay, form letters, names, I got it. Okay, so the name of the letter again is you remember what it starts with? The letter itself? It's probably a new letter. No, it's not that new. It was work-life balance in construction. Okay, so it starts with a W then, right? Yeah. Okay. Work-life. Okay, and probably I would have to grab her name. I take it. Correct? It wasn't under global. It was under her. It's under her name, yeah. Okay, so that's why I'm not seeing it. Got it. So let me just, I'm going to take out mine and I'm going to take out global. So you might want to hear. Oh, here we go. He says workplace balance. Okay, here we go. 630. Okay. So I see. Okay. Yeah, it was. Modified on 4.40, 4.46 p.m. on 6.30. That's interesting. Or maybe it's the 7.15 a.m. one. I'm not sure. It's actually, those are two. This is really weird, though. Why would she send it on the 30th? Something's screwy. Because she sends it on the 30th, and she resigns. She actually resigned at about 10 o'clock that morning on the 30th. Interesting. So I don't even know how she was able to get in there. Unless you know something. I wonder if that's what Lisa did. We sent one. You know, she said I had one of my assistants. My assistant sent out that email. But we thought we only sent it to about 170 people. Well, the sequence sent it to many folks. So if you put names onto that roll-up list, it will, like, the sequence automatically will send it because the sequence is set up. Well, the way sequences are set up is that they require that a roll-up list is associated with them. And then if anybody goes to that roll-up, the sequence is affected by it. So there is an automated email sent if anybody goes to that roll-up. So it could be that maybe somebody just added names to a specific roll-up and then that just triggered it to send. It could be that it's not necessarily like her sending it. It's just somebody could have moved it. It might have been an accident. Can you tell what – so basically, was that just one sequence? yeah the sequence um is using julia v's like send grid email address julia okay and what day did she send it so what what time does it show and now what time does it show um the the time stamps on the activity uh on the activities would be when they were sent yeah so what what is that do you Kevin, I'm not on it right now. I guess I can look. I can go back and research it. Let me see if I can go. Let me see if I have that page still up. Okay, here we go. 211. 211. Okay. Maybe a little bit before then. it was still sending at 2.11 but it was triggered like a little bit before probably like 2.05 or something like that and you know it takes a couple to send almost a thousand emails it would take you know five minutes or so to so yeah it was like 2.05ish p.m. it started and sending and then finished up around 2.11 okay I got so but I also heard is there a way to tell if roll-up lists have been deleted it? I hope so. What the heck? My desk just moved it. Sorry. Yeah, let me test it in my database. I have a test database. I'm just going to delete a rollup and see if it goes to the recycle bin real quick. I think it would, right? I don't know. It's your software. Yeah, I know. I'm pretty sure it would. That's like me asking, what do you think? You think this president will take the job? Yeah. Let's see. I'll just delete. Oh, this one doesn't matter. This is my database, right? Full is just called full. Okay. Let's see if I delete it. Action. Can you delete? How do you? Oh, you have to select it in the checkbox. So where do you find where stuff goes? Recycle bin or whatever? Yeah, in the system menu, there's the recycling bin. You can access it by searching it, or it'll probably be under database maintenance. Okay. Database maintenance. Okay. Nope. Nope. It was actually... data management data management recycling bin oh why does mine show zero wait a second data management I don't show anything it just says data management results search still in the search because scroll up and then clear your search that drives me nuts too actually oh what is this is doing a search or something yeah so in the system menu when you first load it there's like a search bar at the top left and if you search like a term it stays there as you click through the menu so do you think I'm the one who hit it and I'm searching something I shouldn't or I'm searching something that's making this thing go crazy is what you're saying i don't i don't did you search recycling bin in the in the search bar no i did no nothing oh okay so you click data management and nothing appears for you yeah nothing appears let me do what i did though let me get out of it what i did is i just uh i just x'd out of everything so okay it should if i was doing a search it's done all right let me log in i'm logged in as you so i see i see recycling bin at like as your username when i okay let's see that i see data management and you said but it's not well let me look under data management log out option recycling bin okay it is data management okay i see it now loading yeah that that's going to take a minute because you have a lot of records there but i was able to delete a roll-up in my database and it does appear so if she deleted a roll-up through like the UI of the software, it should be... How long does this go back? That's a good question. Let's see. My personal database goes back to 2018, so pretty far, I guess. Oh, man. So what happens... I've had this thing since 2000, 20, 25 years. Well, that's probably why it's taken so long to load. Mine's still loading as well for yours on my screen. What's going to happen if there's just so much shit in here? We won't get it. That's a great question. Maybe we should add like a limit, like only go back to certain days. Can you do that? I can't do that. That would be like a developer have to code changes to the software, though, to do that. But I was just thinking. Oh, here we go. Something came up. Okay, wait a second. We're cooking with. Okay. Okay, so I wonder if this is from day one. Should it be nice? You can filter by user. I see a user filter. I'm going to filter by JV and see. Okay, so on top, yeah, filter by user. That's good. She did delete roll-up lists on the 26th. Well, I want to see everything she deleted. Let me just see. that seems just I have a feeling though okay there was only one roll up list I think it's I don't think it was her now I think we may be screwed up okay here we go on the 26th if you yeah in the recycling bin okay there's a filter by username you can select JV and it'll show you all the stuff she deleted and she did delete a bunch of stuff a bunch of roll up lists on the 26th yeah Wow. How do I... I want to keep a record of this. Take a screenshot. I don't know. A screenshot. Can you put these on a roll-up list? A roll-up of deleted roll-ups? What do you mean? Yeah. Okay. Wait a second. Okay. The 26. Okay. I see. Okay. Well, I guess, okay. So really, yeah, I guess I, yeah, I guess you probably can't put on a roll-up list. I'd have to take a screenshot. Is that correct? Or something. You could probably highlight the text and copy and paste it into like a notepad or something like that. And then at least you have like a textual list of the roll-up list and their name. Is there a way to, I can just, what I can do, yeah, I can just. I tried making, can I make this bigger? You can only make that small. Okay. Got it. So basically, chances are she deleted every name on every single one of those roll-up lists, I bet. Because you can't, can you delete a roll-up list without deleting names first? But that would show in here too, wouldn't it? yeah she it doesn't appear that she deleted a bunch of names and a list a roll-up list is just a like a collection of name ids you can delete the list and the names can still remain in the database so i know i know the names in the database yeah but are we able to if we reproduce this will we be able to see which names are on these roll-up lists before she deleted them i I believe you can restore the roll-ups, and then you can see what names were on there. Okay, because there's probably... The restore option. Yeah, because there's probably... Yeah, I have a feeling that she did something. I wish I could make this bigger, but I can't. So what we could do then, we can restore the list and I'll just take screenshots of this. And then I could just look at what was in it. Correct? Well, I don't understand. Why would she sow so much? Oh, okay. Never mind. Forget it. She did run an export and then she tried to log in at 8 p.m. and failed. Are you able to see what she did on the export? Let's see. JV0003. Here, I'll walk you through how to find what I'm looking at. So from PCR logged in as BEB, which is yours, right? Let me do this first. I'm going to try to save this stuff. Screenshot. Okay, so we just put this somewhere where I can find it. I got to still take, I'm going to have to take a couple screenshots. If you don't mind. Come on. There we go, save. I know I'm on Eastern time and you guys are. I'm just curious how long are you guys around for? What's your hours, I guess? usually I'm off at 6 but it's no big deal we can get to the bottom of this okay this is kind of something you'll want to see I'm looking at okay let me just it appears that she exported 800 names from the database around 11 1130 AM on the day she resigned no shit Okay, so she done took it then, correct? Here, I'll show you. Follow me along. Okay, one second. I just want to take one more screenshot. Yeah, you're going to want to screenshot this too. Okay, so let me just see. So this is 46 JVPE-less PE. Yeah, this I'll be able to... I got something real juicy for you here. Okay, so we got... Whenever you're ready. Yeah. Okay, so let me just... Yeah, we're not going to restore this for a second. Where's my screen? Second, I got to take another... I got to take one more screenshot. I got to move this out of the way. Okay. JV. Okay, let me just get this real quick. Okay, drive me. All right, so go to system, and then under system, you're going to want to go to, let me see, make sure it's, yeah, data management. And then there's logging options. Okay. So under logging options that'll load the search in the bottom frame you you're going to want to set the username field to JV. Okay something's happening with my computer. And run that search. Okay my computer's stalled I might have to Excel it and go back in again. try it from here go to system again okay there we go so where do I go now login options yeah logging options got it and then in the bottom frame you can leave everything except first change the username to JV and search that and then in the results you'll see there's a log action export on June 30th and then that gives you the name of a roll-up list and then you can go see the name of the you can go look at that roll up list hmm okay so no log feature okay let me go back for some reason this is No. log feature. No log entries. Did you change username to JV? Oh, I put down all databases. Let me go in the right database, maybe. Yeah, that should be fine. There's only one JV. I know, but I'll make it. I have too much shit. I should probably have you. Really, the only thing I'm changing, because it does say, it shows begin date 5-1 and then through today. Then it's, yeah, MR Birmingham. I put that in. Nothing else. The only thing that I'm putting in is user's name. Everything else is blank. I don't, IP address and all that shit is blank, right? Yeah. All I did was change username to JV. Okay, I got it now. Okay. Yeah. So in the results, you should see, like, on June 30th at 1131, 49 a.m., there's an export action by JV, and that's the IP address that's consistent with her, like, logging in. So that's definitely her doing it. And then you can see that the memo for that is export started. And then it gives the JV.0003 rollup list code, which if you go to the rollup list, there's a rollup list called Julia's CDs. and that's that name of that roll-up list that's mentioned in the export. So that's like proof right there, like PCR is showing you proof right there that the JV username exported. I see JV memo, JV003. Yeah, that's the code for the roll-up named Julia's CDs. You can look up that roll-up. It has 800 names on it. How do you know it's Julia's CDs? Because the backend code is... Oh, okay. So you're looking that up yourself. That's the unique identifier for the roll-up list. If you go to roll-ups and scroll to the right... You know what's really strange, too? What would be this? Export. Look at all these exports. Export started. Export started. Export started. All the way to the 28th. Export started. Export started. Oh, I guess, yeah. There's a lot of exports. Okay, yeah, you're right. Companies, yeah. Export, export, export. Okay, yeah, I guess she exported a bunch of stuff during her time off. Yeah, look at that. I didn't even scroll back. Oh, yeah, wow. She exported the whole dang thing, man. Okay. That's wild. Yeah, you have... It really is. You have proof that she exported all this and the names of the roll-ups that she exported. So, I don't know, man. I'm just wondering how we can isolate this. Isolate in what way? What do you mean? If we bring it back. Or, wait a second. These are all, no, not to isolate them. If you can give me all the roll-up lists, because I have a feeling she deleted some of these roll-up lists. Well, maybe not. It only showed, it didn't show a bunch of roll-up lists being deleted, did it? Delete roll is also a log action. and you can see there's a couple on page two, you can see. Yeah, see? You can see her deleting the roll-up list as well. She exported it and then deleted. Yeah, she's been going forever. Yeah, she was going to town. So you tell me what's the best thing to do. Yeah, this thing, deleting the roll-up. I'm not sure what you mean when you say that. I'm not sure there's anything I could do. I can't un-export these names. No, I know that you can't do, but I want to be able to know. I know you can't unexport them. Yeah, I'm not sure. But I want to be able to, if we have to do something, if I show this, it doesn't. I want to be able to isolate these roll-up lists and isolate these exports so it doesn't get mixed up with a bunch of other things. Because chances are I'm going to have to recover these to see who she, because there's probably, she probably deleted everything she exported. On the previous screen, when you are searching or setting the filters, you can set the log action to the one you want. So you could specifically look for just exports and then run the search again. And then you can see just all of the exports. Well, there's exports and deletes. So how do I do just exports now? Yeah, it's go back to the user logins filters and rerun the search with in the log action you select what's it called export and then, you know, keep keep username JV and then you'll see only export in the search results. I wonder if I'm in the right spot. Okay, so I put down JV. Right? JV. And now I'm going to put down... Actually, we're going to isolate it from five. So that's basically kind of our... Wow, she's got a lot of action going on. I'll keep the whole thing. And I'll just do this database because the first time I did or something screwed up okay and log action event is that where the exports okay no log entries what I do wrong I even put down MR Birmingham, JV, and it's just called export, right? Log action is export, yes. Yep. Yep. So basically the way mine reads is I have 5.1 through today, MR Birmingham, I did put in MR Birmingham, export, and JV. That should be perfect. You would think so. Yep. There we go. Okay. So she has just here, let's see how far it goes back. 81 results it says. Okay. Yeah, she's going back all the way. Oh, my God. She's been doing this for a long time. The number next to her name, is that how many exports there were? The number next to her name. You mean in the memo column? Yeah. No, that's the roll-up code. Those are just different roll-ups. JV.0, like, number, number, number. Those are all just the back-end code, the unique identifier for the roll-up. So all those are different numbers, so that means she exported. Those are all different roll-ups that she's exported. Okay, so how did you know what she exported? I mean, it's the name. How many, I mean? You can't really... It doesn't log how many names were selected in the export. You could select one name and then export it and it'll log this. But, I mean, you could kind of just presume that most, if not all, of the names on the... Or at least... But all these exports are tied into roll-up lists, correct? Yeah, you can't... Yeah, you got to export... And another question, too, can we go back, Pat, this only goes to 5-23. Actually, that's probably the day she started, I bet. Yeah, because your search parameters were 5-1, so she didn't do anything on the first 21 days of May. She started X-raying on the 23rd. She went to town. You could always go back a couple more months and see. I'll go back to July. So that's what I, you know, that's really what I got to figure out. And I don't know what we got to do and how much time it's going to take you or how we're going to do it is really all the roll-up lists that these are related to. Do I have an idea of what she has? Because we might have to send letters to all these people. You need me to do, you need me to get you a list of roll-ups? Yeah, I think so. I mean, what I'm trying to do is try to figure out everybody that she exported. And all these would be tied into a particular roll-up list, right? In order to export it, they got to go on a roll-up list, correct? Well, I think, can you export from a name search results screen? Let me see. I'm I'm going to run a quick name search. I don't think you can. I think you do have to be on a list to export, yes. So chances are, well, you came up, you knew that she, did you know she exported a certain number of names because you looked at the back end? No, I just know there's 800 names on that roll-up. That was on one roll-up, right? Correct. that was just the most recent one that she did so how did you know because it doesn't show the numbers oh I went to the actual roll up and I just see that there's 800 names currently on that roll up ok so that's what I need to know then because every single one of these is tied into some roll up and I bet they're all tied into different roll ups well if it's JV0200 or does that mean that that's all the same roll-up? Yeah, so you can trigger multiple exports from the same roll-up. So if the same number is listed in that memo, that just means she exported multiple different times from that one roll-up. So maybe she selected like 100 names and exported and then selected like another 100 names and then exported. Got it. Something like that. Yeah, you can't tell how many names she exported. But you can definitely tell that she's been running a lot of exports in the week that she was supposed to be on vacation right before she resigned. And actually, even the weeks way before that. Yeah, it looks like she was playing in this whole thing. Yeah. But this is the log that would tell you those roll-ups. You just want to copy those down. The only way I can do that is really do screenshots of it, right? there's a couple ways we don't have a way to like export this but you could copy the text you can plop it into like an excel file and move it around that way if you have access to microsoft excel if that works okay try it so i can pay you a little extra to do all that stuff for me or something or how do you i don't even know how do you oh but how do you get in the next This might be a billable thing. I'm not sure. It says configure. So how would I do – because normally when you want to export it to a roll-up, let me see. There's normally – you've got to click the page. So I'm just wondering how you would export it without being able to click a page. I don't know what you mean by that. What do you... I'm sorry. I don't understand. I don't understand. How would I export all these entries to a roll-up list? The entries in the logging option search results that we're looking at the export log files? Yeah, if I wanted to reproduce this and export all these log files, right, and throw them on an Excel spreadsheet. spreadsheet um yeah so um we we currently don't have an action inside pcr but you could kind of just drag your mouse across the text of the page and copy it and then you pay okay so i could probably have okay i got it um you could you could maybe pay like an extra fee to have someone here like a tech no i bet i i just need somebody for you but i got this um maybe one of my guys can figure this out I'm just not a let's see so the last one I got us you can't grab the whole thing to screenshot it so the last one I got is my eyes are so bad 23 at 119 Okay. I got to grab page one, too. Boy, this is... Okay, so... Actually, I probably don't need you to do all this stuff. Just trying to figure out the best course of action on how to make sure, you know, that I'm able to save all the forensic for this, you know? Oops, can you hear me? typing out notes for the call. That's okay. What was that? I'm just trying to figure out the best way to tackle this to be able to possibly save all the forensic on this. To do it where I don't have to just... It almost seems like if we bring this all back in, we've got to do it in a way that is... We've got to do it in a way that it's isolated so we don't have to go through everything that's ever been taken out to find it. Does that make sense? Is there somebody that manages PCR over there? Somebody that does all the... Yeah, I mean, I can have people do it if somebody can instruct them on how to bring this stuff back. Okay. Is there somebody at your place that really might have the best hand? Because part of this is going to be strategic, because we want to make sure that we grab it and we're able to see what we grabbed and not say, ooh, was this one of hers or not? If that makes sense, you know? I think I might have to have, like, just create a ticket with, like, what we talked about today, your concerns, and then maybe have my boss call you and kind of. Okay, who's your boss? What you expect. His name's Nick. Okay, yeah, have him call me. This is pretty important. I understand that it is important, but I'm not sure like where my, like what the protocol for me would be. I got it. No, I got it. I got it. So have him call me. Because this is kind of like an out of the ordinary sort of scenario. I got it. I got it. I got it. I might have to pay for this. I get it. Yeah, it might be, it might be a billable service or whatever. Yeah. I know I need to get it done. I will create the ticket, though. Create the ticket. And what I want to do is, what you might want to do, though, and if you can, if you can just notate what we looked into so far and what we found, so this way we can go straight to it. And I go, man, we forgot this. Yeah, no, I'll go over everything we went over. The exports. well that's pretty much the biggest one right the export we want to go maybe yeah the exports and then the other one to the delete it didn't say something to export and then moved or something I'll go back in there yeah there was also there was also something else that was in there that we wanted delete roll up actions yeah yeah all right Brian yeah and have them call me but in the meantime let's maybe not touch anything but yeah I mean this looks like we're off we'll have to we'll have to get a we'll have to get a database backup of probably from the 22nd yeah well was it Diddle Pass 523 on page two. Let me check. Her exporting? Yeah, it's 523 to the present. But again, we don't want to do any of that. Let me hit some other ones and see. Let me go back without just putting in her name again. Because I remember there was something else that we wanted to look at. Yeah, she's unbelievable. Yeah, delete it roll-ups. There's a bunch we want to look at. Delete it roll-up lists, exports. Exports delete it roll-up lists. All the other ones are successful logins. Let me just keep going. Wow. She's got eight pages. I bet she's got a lot of stuff in here. I wonder at the first page. Yeah, we're going to really want to look at pretty much everything except for logins. export started export started logins I wish you were able to take these and click on them and line them up so you see them all the same way I mean you see them lined up like all you know they're all in groups like you can on roll up lists you know you can line up states or alphabetical order or whatever oh those column headers don't sort yeah right unfortunately yeah Yeah, that's what I meant. Okay, so it looks like just by looking at this real quickly, it looks like most of these are logins, but she does have, it looks like the only two that we want to do is export, and once this login succeeded, name was deleted. Okay, one name deleted. That's not too bad. well just anything that anything that's been exported or deleted is basically i want to see everything that really that's been exported or deleted so it could be names it could be roll-up lists uh because everything else and it looks like there's only one name deleted i'm just running through this really quick okay yeah and see i i there's a gazillion roll-up lists deleted. In the past two months or so by JV. These are all on the 26th. She deleted almost that whole page on the 26th is deleted roll-ups. Let's see, like 100 of them. Let's do the 27th. Okay. Yeah, she went to town on the 26th deleting all the roll-ups. And then it was spattered after that. No, she still let some though, but not that many. So it looks like the two biggest ones are the deleted roll-ups and the exports. So instead of me taking screenshots of this, I think what I'm going to do is see if he can take this. Okay. so write down everything we have because then we find something somewhere else too oh we found it in the recycle bin so all these deleted ones all this deleted stuff should be in the recycle bin correct yeah you can uh restore roll-ups from the recycle bin um so that's what we're going to have to isolate but we can probably isolate it by there's a oh there's a couple ways to go about it right you as the pcr user can go from the front end to the recycle bin you can restore those and see what there is on them or you could like pay for a service and we can like i got it so probably the best thing to do right now is to just notate what we looked through went really all we looked through was this in the recycle bin so far right yeah pretty much okay so everything we did so far and have your boss call me yeah or send me an email where we can do it but yeah i need to i need to figure out i just want to figure out the best way that we can tackle this because there's a lot of shit here. Okay. And it just seems kind of weird that she had 50. I have a feeling all those names, she probably exported all those names. Oh, that was the other thing, check activities. Name and company activities. We want to check all the activities that she did. Actually, we got to do the activities now from 523. Okay. That would be a lot, probably. I'm sure. But I'm just thinking that it looks like she was going to town. She started going to town on 5-23. At least that's what this report, that's what I conclude logic tells me. That was the day she really started. it. Alright, well I'm going to give it off to Nicole. Actually, she also even started exporting 523. Yeah, that was the first day. In May, she started doing that. Yeah. Yeah, because everything else before that is just successful login. Okay. Got it. We can go back a little bit farther, too, to make sure. Yeah. Okay. We might want to do that. This is as far as I can go, but I'd like to, if there's a way we can look, you know, spot check. Because really, once you get past 523, there's just, you know, it's just a login every day. So there's not much stuff. but if you notice as soon as you hit I don't remember what thing are we in right here? Oh this is logging options? Yeah this is called the user group I mean how did we get here? We started with management data I can figure this out but just remember how we got all here System, data management logging options Right. I got it. Okay. Yeah, have your boss call me. Yeah, I will. That'll probably be on my direct line. Do you have a 248-430-1900? Let me see if I do have it. I'll pull you up. I have your company up. Let me pull up the newest of names. Brian. You said 248-430-1900? You got it. Yep. That's what we have for you. Got it. They probably, they probably, no, no. I know Bill Kubitschek. I've had PCR since 2000. Oh, wow. I was one of the first guys. I actually helped him get it into management recruiters when I was with them. Got it, got it. Okay, great. Thanks so much. All right. Thanks, Brian. Have a wonderful holiday. Yep, you too. All right. Thank you. Bye. All right. Bye-bye. Thank you.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 236.078363,
    "salad_processing_time": 187.34272384643555,
    "overall_processing_time": 236.078363,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence Technology.  This is McKenzie.  How can I help you? Hey, McKenzie.",
    "job_id": "02167ddd-70af-4a3e-86b2-f9bfc55f6d63",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence Technology.  This is McKenzie.  How can I help you? Hey, McKenzie.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3002850035036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}