{
  "recording_id": "3002626551036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:19:44.395282Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:19:44",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your participant ID followed by pound. Otherwise, you are in the meeting now. There are two participants in the meeting. That's me. Good afternoon, Mr. Jim. Hey, Jim. How's it going? Not bad. Not bad. How are you? Good. Doing well, thanks. Thanks. Appreciate you jumping on. You ready for the fourth? We are. We are. We are closing down the next couple of days, so we have a couple day-long weekend, so that's good. That's good. Yes, it is. That's great. Okay, and we're going to take a look today at PCRM. Brian's going to join us as well in a bit. We were just on a call a half hour ago, so I just talked with him. That was cool. Great. So I wanted to kind of see a little bit what you were thinking, what you'd heard. Is there things really that's lacking in PCRecruiter? What is your kind of general feel for things? yeah um so we we actually probably like 2021 started working with uh sales loft mainly for business development purposes um i think i was before sequencing was on pcr did a deal pipeline you know all those reasons so we started working heavily with that It costs money, right? So we've recently decided, and it's two different systems, so that's always an issue and an issue there. And so now we're looking for one system, right? And I know PCRM came out, which is great. So that interests us and the features there. We also, we do a couple of things, right? So we sell executive search and we sell a robust, transparent search process to our clients. So they see every candidate that we map, every candidate we vet, every candidate, you know, all the documents, all the screening forms. So, a client portal is important to us. And I know you all have an older version of that. I don't know if you have a newer version. And so, what's important to us at this point, right, is tracking our deals, the business development piece, you know, prospecting, getting people in our deal pipe, in our deal funnel to earn new business for new searches and being able to track all that and have a process for doing that and then being reminded. And then recruitment-wise is being able, you know, to run them through the, basically the recruitment pipeline and funnel, which we're very used to PCR. Our challenge with PCR, as you all know, and I'm giving you all my feedback on this. I appreciate it. But the challenge with PCR is there's a lot of clicks. Things can be hidden, right, behind just viewing-wise. That's a challenge for us with PCR. and then the client portal was a challenge with us. We did use the monday.com through Carbon Web. That was great, but there was a lot of duplicate efforts too. We had to kind of update things, right? It wasn't smooth and clean. And we sold that for a while, but that also was extra money as well. So we're at a point now of like, what's the best system for us at the lowest cost? And because we're a part of SRA, you know, there is Crelate is a big partner there. So we've taken a look at that and they offer a lot of great things. We saw PCRM and it seems like they've redone things to make the layout look better. some tagging features, right, organizational things that we really like. So, and all of our data is with PCR, right? And we worked with you all for so long, and we like you guys. And so we're at a point where we really need a system that does everything in one place. It's kind of our want. And I don't know if I missed anything, Dad, feel free to jump in. Well, let me add to that in that Julian has spent too much time administratively trying to make things connect together. So our goal is to get it where he doesn't have to do that because the system operates and therefore he can use his time for its most valuable is in connecting with clients and candidates. And as he's mentioned, you know, I've been on PCR since 2008, so a long time. We appreciate what's there, but it's apparent that PCRM may be getting there, getting it more streamlined to what other things we see in the marketplace. And we don't want changes to change. We'd rather work with PCR and just have it be more efficient. So I think that's what our goal is. Sure. Sure. I get that. Do you hear this from other people or not? Yeah. Oh, yeah. Yeah. So a lot of what kind of seems what you're looking for, a lot of what we have. The only big thing we don't have right now is a client portal. So that is still something. I've heard discussions. I've heard people specking it out. There's demand. People are asking for it. I don't think there's anything currently in the pipeline for that. But we do have just about everything else. So the PCRM is going to give you a newer, less click-heavy interface. It's going to give you the same position pipeline that you've worked with, but it's also going to give you the new deals pipeline, which is kind of a separate area, like a sales funnel, a whole separate area, and it's going to give you the ability to track all your deals, see where everything stands. It's totally customizable. You could put activities or everything. I'm going to show it to you here, kind of show you what it does. All right. The PCRM, I think, might be worth – Yeah, well, that's for review sales law. Are you familiar with what sales law offers? No, I've not heard of them, no. okay so sales off is tied to sales force uh and so that's uh and their focus is on sales and what you said on deals and tracking that and you know giving you uh they do cadences which is instead of sequences it's a similar thing uh but they push you to connecting with the with the client and reminding you to do that and, you know, the last conversation you had and what it was about and follow-ups and creating templates and snippets in the thing so that you can quickly respond to somebody because you've got a kind of like form letters and DCR, but you've got a quick way to respond back to a person you're talking with. So, it could be that I'm thinking out loud, we might maybe want to walk you through on the other end what sales off does how we're using it and you might say okay this is how we can do it or are doing it in bcr you know because the picture maybe worth a thousand words oh yeah that might be just to look at it kind of see what you're doing now you have access to it still yes okay yeah that wouldn't be yeah maybe um i might i I might suggest a different plan. I don't want to take too much time. I think we showed you that at the end. I definitely want you to look at it and do some research on sales law and outreach as another competitor, right? I think maybe two questions or two things to think about maybe of what we could tackle today. I definitely think we'd take a look at PCRM just like how the general flow goes with BD like business development sales side how it goes in general with recruitment side kind of that layout and then the second question would be the client portal is that do y'all have like an older like a hiring like you showed me like a while ago and I think I talked to support and they're like, yeah, you could use this older version of it. Do you also enable that, I guess? We do, yeah. I hadn't even thought about that, but we do still have that and it does still work. So, yeah, we could take a look at that, kind of see what it does. Maybe let's start with looking at PCRM and then we could maybe look at the what you all have as far as that hiring portal thing and then at the end we could show you briefly on failed law. Does that sound like a good thing? Or schedule another time to review. Yeah, we can also schedule another time. I don't want to take up all your time today. Sure. Yeah, no worries. Yeah, let's hop in and take a look at, at least get started looking at the PCRM. I want to show you what that's going to look like and how that'll work. I'm going to share my screen here, so you should be momentarily looking at the sign-in. Okay, do you see that all right? Yes, sir. All right, all right. So, just a little word about PCRM. It was originally kind of conceived as a new interface for PC Recruiter, probably three, four years ago. And they kind of took it in a couple different directions, started adding different things, reconfiguring different things. And it ended up having so much more of a CRM feel. And the addition of the deals pipeline and also the simple sequencing, some of the business development tracking features, and the sequencing that's in there already really lended it to be more of a CRM. So we actually, beginning of this year, decided to market it as a separate product. It may eventually be spun off to be entirely separate, but right now it is something, it's like a separate logon to your existing database. So if you did get set up on PCRM, you'd still have access to your PC recruiter that you have used all these years, but the exact same database would be accessible from PCRM as well. So that's going to be kind of unique to us. maybe it'll be spun off as a separate product someday, but right now it runs off SQL, so it shares the same database. So therefore, we wouldn't have to transfer our database because it's already there. Exactly, it's already there. So there's no conversion. There's also no fear of totally being moved over to PCRM because you could go and log on to PCR9 if you felt better using it like that or if certain things you like better in 9 and certain things you like better in M, it's up to you. So you'll see here as I'm logged in, This is kind of my dashboard. And then over here I have all of my buttons. Essentially, that's what is currently across the top of the screen in PCRM. It's down the left-hand side. And you'll notice a lot of them are familiar. They're going to do the same thing. So you have your names, companies, positions, three primary record names. Those are certainly going to be there. And then roll-ups, schedules, those are the same. And even actually the analytics and sequences, the exact same screen. because when we designed the analytics and sequencing pieces we already knew we were kind of heading in this direction so the interface looks identical in PC recruiter what you'd be using now versus nine so a lot of it is going to be already pretty familiar but still going to work the same notably though the biggest difference is going to be that deals workflow and that's going to be a big part of this so you'll see it was given its own brand new button over on the side of the screen and that is going to be your customizable deals pipeline So you are able to build different steps here, different stages as you go through. And you'll see I've got like qualified, contacted, needs assessment, contract consent. I'm pretty sure those are configurable. I'm going to actually, I want to confirm that. but I think you can. So you're going to be able to go through and this is essentially your pipeline but it's your deals pipeline and it's going to give you the ability to track just like you're tracking a name through the interview stages you can track a company through deal stages. So as you wanted to add a deal maybe I wanted to add a new one here. So I'm going to add one right up here and I can give it a name so let's say I have the company in my system and I am working with them and I want to kind of go in there I can put them delay and then I can kind of pick my specific company that I want to link it to I can even pick a specific contact there if I have any contacts in that company so as I create the deal I'm giving it a name I can kind of link it back to a company record I also have the ability to put in a close date if I wish I can put in a deal value if needed you can put a confidence level and how confident you are that it's going to happen anything like that those are all optional of course give it an owner usually it's going to be your own username but I think you can give other usernames if you wish yep you could also add a couple of notes in about this deal attachments but something I like that is kind of cool you can actually add follow-up tasks so this is going to be a separate custom little couple of things so maybe the first one's going to be a call and I want to do that within a week so I can do that by the 9th I can add that and then I can go ahead and add another one so I can save that I can add another one then maybe I email and I want to do that within two weeks so I can kind of go through here and I can add some different steps as I go through so I'm It's going to add kind of a sub to-do list underneath this specific deal in my pipeline. And if I hit create deal, that is now going to create a brand new card. It's going to be over into the qualified area, and now I'm ready to go. And it's going to total, like if you put your deal total values, you put probabilities to each different step if you wish, so you have some ability to kind of work with that. The reporting on this is going to be coming out in the next couple of weeks. They're still working on the reporting, the analytics of it. but you're going to be able to look through I have this one is cold and maybe I talked with them today what I can do maybe I wanted to edit that so I can edit that oops no that's going to let me put them I don't remember how you edit it do you click there there you go so I can edit right there and maybe I want to make it warm so I can kind of save that so I can go and edit that at any time and then I can x right out of that so I'm able to kind of change everything up And then as I work, maybe I contact event delay, I'm going to move them by a simple drag and drop. So that is going to kind of move them through my process, simple drag and drop. Again, all those moves are soon. going to be reportable. And then I also can see I have my call down here. It's due July 9th. So I can see there's my call. I can go through into it. Follow. I can check it off when I'm done. So I can go through and I can kind of go through my process here and drag and drop them through as I go. So this is almost going to be like a to-do list because you're going through. You know who needs assessment. Here I use it a little different. I was demoing somebody the other day and I showed maybe I have a specific job at the Idaho National Lab I wanted to put in as a category or an item that I'm trying to create as a deal. I could do that too. So can do it a couple of different ways. And then you're moving people all the way through this process, all the way up until the contract's signed. Another thing coming out very soon is going to be an integrated DocuSign. So you can send the contract right out of PC Recruiter in DocuSign format and have them sign that, and it'll be attached once it's done. So that's in development two coming out in a little bit. So you're able to kind of move through this custom pipeline and kind of drag everybody through your process there. And then there is even only once you win the deal, let's say, you can just add a position to the company record right from there if you needed to. There's also some different filters up here that I can look at all my deals or I can filter by created date or owners of the deal or next task date. So if I want to look at the next task date, do I have any tasks on the 9th? I can filter that down, and it's going to let me find the ones that I have tasks with a certain date. So I'm going to be able to kind of move through, and it almost acts as a combination to-do list and pipeline for moving people through the process there. Okay, and then there will be more because you're going to have just like you have analytics on the dashboard. They're coming out with analytics on the deals dashboard. So in here, like I go to metrics, I can look at my pipeline activity. This is more of an interview activity dashboard coming out very soon is going to be reporting very much like this, but based off of the deals pipeline. So I'm going to be able to report on that information there. Okay, now that's kind of the gist of what the deals pipeline does. Does that make sense? Any questions on that? Yeah, on the tasks, where do you get notified of those, or how do those come about? Oh, I think you can add an alarm on there. Let's see. Okay. Oh, yeah, this one's alarmed. So you see it's got that little alarm clock there. So that one's going to pop an alarm on the knife to remind me to do that task. So when you edit the task, you can add that in if you needed to. Pick a specific day. I don't even know how I added that alarm there. Does this get added to your schedule? I don't believe so. Let me look on the knife and see if it is. I don't think it does. I'm going to go check it here, but I don't think it does. I think it's going to be its own. Yeah, it doesn't go on your calendar within PC Recruiter. It's just going to be in the deals area. So you almost have like your deals tasks to do that it's shown right there. And that's where you can even look at like a task date and kind of pick this here. You can even pick a range and I can search within that range. And I'm seeing any tasks I have scheduled within that range. when it notifies you for that notify button is that like an email or is it um one of those pop-ups i guess or i think a pop-up but i've never seen it uh yeah okay we'll check and see i'll i'll check and see uh so we do that Do you have a master list of your deals that shows here your deals you're working on, what stage you're in? That would be if you take it in a list format. Just toggle over to the list format, and this is going to show everything you have going on, who the owners are, what step they're at. So you'll be able to kind of see where they all are. And I think you can even sort. Can you sort by set? Yep. There's a little arrow there. Oh, wait. Oh, this one can't be. So you can't sort by step. Let's see. Can I sort? No, these aren't sortable for some reason. I will ask them. I don't know why. There's deals there, but you can't sort them. I don't know why. Yeah. Okay, cool. That obviously would help as we're looking for the priority of what to work on where the need is, being able to do that. Yeah. Yeah. Let's see. I think you can filter up at the top, but I don't think you can sort. And I could just be doing it wrong, or maybe. Oh, that kind of pulls them that way. I guess you can't select multiple. You just kind of do it one by one. Yeah, one by one. It kind of goes through one by one. Yeah, through. Okay. And then where it has more filters, what is what click on more filters? What does that give you? You can kind of filter by confidence range, contact company. I think just about everything you can put in there, you can filter by. Follow up. Okay. Okay. Another thing that we've added to kind of piggyback along with this is maybe you're kind of contacting people before you have them qualified as a proper deal. Let's say you just have a list of people, contacts of companies that you're working with or marketing toward. We've added a simpler sequencing piece within PC Recruiter that runs off of the roll-up list. So what you can do off of the roll-up list is if you have a list of people, you can open up that roll-up list, and you can now right here build a simple sequence. And that's going to let you build a simple sequence right on the fly here. And even in just a few minutes, I can go email. I can go automatic. I'm going to pick email address, pick what form letter it's going to be. Then I can go through, add a second step. So this is essentially the same steps you have in a sequence, but this is a simpler sequencing piece. So maybe the next step is going to be a call, and I want it to be a mobile phone number, and then I can save all. And then I can just go activate sequence right from here. I didn't check anyone over my checklist over there, but as I go through, I can go ahead and activate that sequence straight away. So what's cool is if I have a sequence running, I can actually, let's see, I think I see, yeah, there's one right here. If I go into this roll-up list, I can see in my simple sequence, some of these people are stage one. They got an email. So I would be able to see what stage they're at in my sequence. I can click into that. I can see what's going on there. I can kind of work with them. So you can actually build a sequence and use it kind of like roll-up list stages, and it's a little bit easier to build than the full advanced sequencing piece. And you kind of move people through different steps. And then from these individuals, I think you can even create a deal off of someone from here. Let's see. Name, simple sequence. Maybe not. I think you – Maybe off the company. I don't know. Oh, yeah, I'm looking at names. That's right. Let's go to company. I don't have any companies on there. Let's go into one that does. So if I go to companies, if I'm looking at a roll-up list, right under actions, create deal. So there's going to be a create deal option right off of the roll-up list there if I needed that as well. When you create the simple sequence off the rollup, does it create essentially a new list view, or is it you just go back to that same rollup list? It's going to be the same rollup list. It's just going to give you kind of a different column. So you get that additional column for sequences. right there. Just add the column there. And let's see. Different things I can do from there. Oh, sequence actions. So right here, if I go more, I can go to sequence actions. I can skip ahead. So I could skip to the next step if I wanted. So I can kind of take that person and skip them through. So it'll let you skip ahead, skip back, do some different things from there. So that kind of helps with the additional sequences there. Can you select all? I kind of want to see the options after you select all. Where are we here? Oh, like if on the left where it says extra records. Right there? Yeah. Yeah, let's see what happens. And then can you click sequence? what my question would be can you skip all of them like can you do a bulk oh I don't think that you can do that sequence options that's just oh you can pause the thing you can pause the sequence okay but I don't think you can you can't bulk skip okay Cool. Yeah, so that's some of the two main things that are different that are added for this. And you'll see some of the things just like the name interface. It kind of looks like that roll-up list. You now can edit it in line here. You have a bunch of actions if you wanted to send an email call, SMS. You wanted to add activity notes to a roll-up, anything like that. You can do a lot of that from the front screen. And then if you click into the exact record, it's going to slide in over here from the left, the right rather, and then you're going to be able to look at the default view. That's kind of your default view that you look at. And then you have all your other, these are the traditional buttons that were on the top of PC Recruiter name records to begin with, attachments, roll-ups, activities. Those are all going to do the same stuff. But we've added a details button, which is every field they have. And what you can do in that, let's say I want to find phone fields. I can just type in phone, and they're all going to show up right there. So it instantly kind of filters everything down. So we've made it a little bit easier to use. You can pin different items, different skills, different keywords. You can pin people up to the main menu up there if you needed to. so I can do some different things from there if I want. There's a keywording or a tagging feature now? How does that? Yeah, there's tagging. Yeah. Yeah, let's see. So there's going to be keywords, and you can tag them. And you could also, let's see, there's somewhere you can tag, and I don't remember how to do this. There's somewhere you can tag, like, next to their name up there. You can tag elements up there, and I can never remember how to do it. Let's see. Contact. Change company. I can pin. That's pinning it up into the area there. Create a deal right from there if I need to. When you click add, what do you see there when you click add next to keyword? on the activity. Oh, next to keyword right there. Oh, this ad there. You get all of these. Okay, can I take one? I don't know if I can. No, no, apply. That adds them. Yeah, I've seen it done, but I honestly haven't ever figured out how to do it. But I've seen you can pin it up there, and it'll allow you to pin up to three little keywords up at the top. Okay. So here you can essentially keyword on the fly. Can you click edit for me? You can pull one of them out, save that change. That groups them by what they are. Or if I hit add, then I can go to my user defined codes and kind of pick which ones I want to add and then apply them. Can you add it straight from that field, a keyword? Like straight from here? Is that a new one? I just click add right there. And then I add a new one off of these lists. Oh, so it has to be preloaded? Yeah, they're pre-created. Yeah, they're pre-created lists. So you can pick out of these pre-created lists there. Yeah. Okay. Can you add to those pre-created lists? oh yeah yeah are you gonna add that's back in the system area you can do that I just figured out how to tag so if I wanted to tag tool maker right click tag and you'll see that adds it up at the top here tool maker I also take international I don't know how you're right but the keyword but I just yeah I just write select it right click and tag and then I can tag a few of them up there if I full screen it. So where it has user-defined codes, that's where we could put in our own tags. Yeah, actually all of these groups, the skill, specialty, equipment, education, user-defined, and SICK. You have six different lists and you can actually go to the system area, which is, I don't know where they put the system area. It's back in settings. find out together. Yeah, and if I go into keyword, there's your SIC codes education. All the different lists are there, so I could go into my, let's say, user defined codes. There's the list, and then I can add a new one right from there. So I can add a new one or import a whole spreadsheet of lists if I wished to do, or I can edit them individually too. Okay, cool. So some new things. A little bit different format there. A lot of new things, too. Is there like a centralized area? How do people get reminded to do the next step? Oh, like in a sequence? Like in a sequence or something? Yeah, task management or anything. Or maybe let's just say I talk to Jeff and I need to remember to call him a week from now. Well, I'll tell you what I personally do. I utilize the calendar within PC Recruiter. In my calendar, I have, for example, Julian's on my calendar in yellow with an alarm. That is a scheduled item. So Scott was the person I talked to just before. So I can see I have specific color codes on my calendar reminding me to do this. And it pops up the alarm if I have an alarm on that. And like if I edit that, when I create it, I can just check off the alarm box, which I can just check that alarm. Then that's going to put an alarm on there if I need it to. So that'll pop that alarm as a reminder to call. And I can make it five minutes, four, ten minutes, or anything like that. So I personally have always used my calendar. So when I schedule my activity, made this call, follow up next week, I'm going to put it on. I use the color coding. So if I, let's say I went into your record, if I'm creating an activity here and I'm adding that activity, I color code it. Yellow is a demo. Red is important. So you can kind of create these. So that kind of helps making it like a to-do list. You can also use the sequencing area of PC Recruiter. So if you have a sequence running, remember the sequencing area is going to have a little task list in and of itself, this tasks area that defaults. And that's going to show me of the 209 people that were in this sequence, 20 of them I have to call. And here they all are. I have LinkedIn related items, seven I have to schedule something with. So this is going to give me all of my, basically my to-do list here. And if I go into Jessica here, maybe I dial her number with RingCentral. I can even click that button. Maybe I put a little script in there when I read. I say left message. That's going to move around to the next step of my sequence, brings up the next person. Read my script, make my call, left message, brings up the next person. so that's going to let you click down read your read your script and then kind of move them through so that that sequence task list is really showing you everything you have to do same with LinkedIn if I go to LinkedIn I can click into the first one I can either I go right to his LinkedIn profile I can view it invite him to connect or send my email or whatever click what it was and then that's kind of move on through to the next step so the task list in the sequence area is going to also be a to-do list for me. This is all the sequences I have running there. So that's going to remind you what to do. Okay. So a couple of ways you could do that. Got it. Question on client. So yes, you could use the calendar schedule to kind of remind you. Otherwise, you have to click on sequencing to see what's next. And then it's basically adding activities is the way you would do it one-off. Yeah. Okay. Got it. These are the main things on, like, PCRM. Thank you for showing me that. I don't want to take away from you, but anything else new that in PCRM we should look at or be aware of? Well, those are really the bulk of the new features. Some things are different, like the ad record. So if you go through, you can now drag and drop a bunch of records. Maybe you want to put a name in, and then you also want to add a company to. And then what you can do is if you start adding the name and you put Jim in there, you want to get the company in there too, ABC or ABV, let's call it. If I go back to Jim here, I can actually link him to a draft record that ABV I just created on the fly. Then maybe I upload another attachment. I can upload any attachment I might have. So maybe whatever it might be. I don't have anything I can't upload right here, really. But I can upload another attachment and then I could even attach that to this name record I'm going to create on the fly. and maybe I upload another attachment I want to parse that as its own record so the ad screen has got a lot more functional and a lot more easy to use so that's changed that's a big change to it and then other things just the general look and feel like if you even look at the the dashboard you can go through here and you can kind of pick and choose what you want that to look like and everything is centered get that out of here so I can go through and I can say I want active candidates I want that to show right there and I want to drag this chunk down here and I can kind of move things around I have a whole bunch of different things I can do so it's a little bit easier to navigate and configure the database in PCRM but a lot of the terminology is the same so if I look at like my name I can see that if I go to the name record I'm gonna have the same things details roll-ups attachments activities keywords all the same stuff I have and maybe on my resume right next to roll-ups I can drag it right up there it's going to live snap right over there. That's how it is. It's a little bit easier to configure the records as well. Cool. Thank you for showing me that. Do you all still... I want to switch, unless, Dad, you have any other questions on PCRM to the client portal, but Dad, do you have any other? Sorry, I was clicking on it all. No, I'll wait. Go ahead. Go ahead. Okay. The hiring portal or manager portal, I guess people still use that? Yeah, it's still there. So it is going to still be something. So I'll show it to you. It just takes a couple of minutes to share. So if I go in, well, I got to get into my other demo database there. So if I go back into PCR, well, let me see if it's in PCR. I don't think it is, but let's go find out. okay it's not in there so let me go over to pcr9 to get to it okay so if i go into pcr9 let's see here and i will go into system Yes, so it is the employer. Where is it? I think it might be this one, the employer. Yes, so what you're going to be able to do, is that the one? Let's try here. I think this is it. Yes, so you'll see it looks very old. This kind of looks like PCR 8. It hasn't been updated in a long time. But what you can do is you can give the individual contact at your client company a logon. And then they're going to be able, and you can turn off this whole candidate section down here. You don't want them browsing candidates. But they can go through and view candidates for active positions. And if they click into that, they're going to look and see all the positions for which they are listed as the main contact. Okay. I think I double-clicked in there. So if I go back to menu right there. Let's see. Okay, this is the one. So I create, edit, repost your positions. If you go into that one, it's going to show I am the main contact for three different positions, and I can go and view candidates on any of them. So that's going to show me I have these two people, and this is showing where they stand, what process they've gone through, what happened, when it happened, everything that's happened right there. So I'm able to kind of go through, and I can look in each one. so I'm able to see all these individuals, and I can go click the plus to expand. Now, there is something Drew on our web team has to do to match the new pipeline to be able to work with this, but he's done it before, so he does have a way to do that. And actually, I might even put him in touch with you because I think he has kind of a custom version he went off for someone that we use sometimes. That looks maybe a little better than that. When you click on John Smith, the person will be able to see John Smith. Just basically the date, the interview, and the resume there. Yeah, basically about the interview and then the resume if you choose to show it. Okay. So there's no attachments or – Yes, or if we wanted to add attachments where we've done an assessment or anything, can you see that? Those can show. Those can show. mm-hmm yeah so the attachments are going to be down there too so just some very basic info when they click into the individuals below the resume and then you see any attachments they had so real basic info and I'm gonna I can maybe have drew reach out to show you what he's got or further discuss because he's kind of punched this up a little bit and modernized it a little bit to work with the new pipeline is kind of better branded. So if that's something you need, let me kind of put you in touch with him to talk more about that. Okay. Yeah, that'd be great. Cool. And I guess the editing, he would know how to like, I'm guessing you can choose what to display and what not to display kind of thing. Yeah, you can kind of pick and choose. Mm-hmm. Mm-hmm. Yes. Got it. Okay, and he would know how to do, or he could show us how that works. Yeah, he's definitely. Do we have access to it now, or is it, how does that work? It should be in. So if you go into your PC Recruiter and you go to, I just type in link. It's under the PCR web links area, and it's called the employer vendor URL. So that could be, and then you need a logon. So the email address that you log on with. simply must be linked to a record in PC Recruiter marked hiring authority or employee. And then the password is going to be the identification field. So there's some specific things that you have set up, but you can then do that. Got it. But it might be something you even have in your system that you could kind of take a look at it. Drew would definitely know more the specifics on the setup because he's our guy that sets those up. He's been doing it for years. Okay. Yeah. Okay, cool. Awesome. A question I do have, and I guess there are integrations with other systems like HireEasy. Can that connect to this year's PCR? Yes, it connects to either version there. The HireEasy ZoomInfo, those will both push data in. the one thing like that's in PC Recruiter right now, these pieces are being worked on for PCRM. They're not out yet. How you can go right here and you can say, update this record via HireEasy or update the record via ZoomInfo. Those two pieces are still being added to the PCRM piece. But the general push of data from ZoomInfo or HireEasy does work with PCRM, no problem. All right. In a question, we haven't used ZimInfo. We haven't used HireEasy. What's your thoughts on how HireEasy works? From what I hear, a lot of the same basic information. HireEasy is cheaper is what I've heard, but I haven't really heard definitively which one's better, if you will. Different people have said different things. All I know is HireEasy is a little bit cheaper. If we wanted to integrate or connect our ZoomInfo account to PCR, how does that work? My tech team does that. There's some credentials you would put in, and I think when you go here to ZoomInfo, you would be able to log in with your credentials into that. There's a setup. You log in here. Maybe sign on or something like that. I've never done it. But if you do want to do that, my tech support team can help. Reach out and they can get a ticket. Okay. The answer is it can be done. We just have to sit up with them. Okay. Cool. Yeah, those were kind of the main questions I had on kind of the tagging, how it worked and had task management reminders. I guess the presentation link, yeah, that all makes sense. Yeah, that's great. No, thank you for showing us the new PCRM, yeah. All right. And I think a key thing, if we do get connected to Drew, he can probably answer some questions of technical things of what we want to do. So that would be very helpful. Yes, I'll put you in touch with Drew. I've also got a few questions outstanding that I'm going to follow up with you once I've got five or six things jotted down. I'll follow up with you once I find those answers. And just to kind of ballpark the cost to add the PCRM, it's an additional $10 per user per month over what you're paying now, and then it's $3.50 one time to set it up. That includes not only creating the new link, but four hours training on the setup and use of the new piece as well. So you get everything within PCRM, and you get the four hours training. So that's what that will cost you if you wish to add it. All right. And these things you said they're working on, what do you think the timeframe of them to get that finalized on PCRM? I think they're working on, I think in the next week, they're releasing some updated searching. They're releasing the reporting on the deals pipeline. and they're also working on a release of an auto match so that from a position record you can click a button and it'll pull the top 20 matching records in your database based off of that job description detail so they're working on an auto match as well so that's going to be released I think within the next month is when all those are planned to be released okay okay so by Labor Day they're all ahead oh yeah right away that's what they tell me yes okay that's really cool very helpful alright well we appreciate you educating us here and I've got a lot that you and I can talk about but I see how this can work we'll probably have some additional questions after we talk but thank you so much for your time my pleasure thank you for putting me in today and we will I'll be in touch soon and I'll also put Drew in touch I'll send them your way and reach out to get some what's Drew's last name? Rothman I've been in contact with him he's been here he's the only person who's been here longer than me so catch a beat yeah well awesome thank you for getting us connected definitely have a good rest of your July 4th coming up have a good July 4th Yeah. You both as well. For sure. All righty. Thanks much. All right. Thank you. Take care, everybody. Thank you, sir. All right. Bye-bye. Thank you. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 236.244312,
    "salad_processing_time": 130.78250074386597,
    "overall_processing_time": 236.244312,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your participant ID followed by pound.  Otherwise, you are in the meeting now.",
    "job_id": "aceb9cb8-011c-42f9-86cf-7b7b92503376",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your participant ID followed by pound.  Otherwise, you are in the meeting now.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 1
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3002626551036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}