{
  "recording_id": "3005644079037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:25:38.742112Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:25:38",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Otherwise, you are in the meeting now. You are the first participant. Please stand by. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. you Jim? Yeah. You hear me? Good morning, Brian. Yeah. How are you? Doing good. How are you doing? Not bad. Not bad at all. Did you have a good fourth? I did. I did. We had the next couple days off and saw all kinds of people and did all kinds of things. It was a little hot here than usual, like 80s and 90s, but it could be worse. No rain, at least. That's good. Does it not get normally in the 80s up there? Not for as many days as we've had. We had low 90s for several days in a row. Sometimes, but not all that often. Maybe once a summer it might get quite that hot for any length of time, but it's been really hot lately. Yeah, you guys have cold winters, though. Yeah, we usually do. Do you get sick of that, or do you like it? I don't mind it. By the end of the winter, it gets a little tiring, but I like the change. It's nice, and I've been here all my life, so I kind of like the change of seasons. It only gets tiring toward the end when you're ready for it to warm up, and it's just hanging on. We're right on the lake, so we are kind of three weeks behind everyone else here, which is nice in the fall because our summer kind of extends well into September, early October because the lake keeps us warm, but the lake in the spring also acts like a refrigerator and keeps us cold. So those first couple 70-degree days, it's like 55 up here. So kind of a bummer that it holds on because the lake really keeps us cool. We're only about a mile, mile and a half inland from the lake. Nice. That's great. You go use the lake, or do you get out? I do. We don't boat or anything. Boats make me barf. But we swim and we go up there all the time and hike and run along the lake. Okay, gotcha. kayak a little bit. I'm the complete opposite. Anytime I'm on a boat, I'm a happy man. If I'm moving, I'm okay, but as soon as we stop, it's all bad. I see. I got you. Very cool. Well, good, man. Good, good, good. So yeah, I want to see what you got. For sure, for sure. So yeah, so I want to talk a little bit about some of the premium features that you don't have, and then we'll look at the PCRM piece as well. The PCRM is primarily like it adds its all new interface, which we'll take a look at. It has most of what the PC Recruiter has now. It adds a sales pipeline. It adds a simpler sequencing piece. So it adds kind of some CRM functionality. So it makes a whole CRM product and kind of gives you another portal to log onto. But I want to show you first of all what's included in the premium, which is the kind of the higher end version that you don't have of PC Recruiter. So with that, that premium is going to add, notably, it's going to add email campaign features, our new sequencing feature, and analytics reporting. Those are going to be notable things it's going to add. And you can also have, there's an AI suite you can add in to that as well that we can make part of the premium package. So some content generators in there as well. So I'm going to log into my database just to kind of show you kind of what that might look like and how that will work. Do you use the bulk email capabilities in PCRecruiter at all? I don't even know what that is. Okay. So, yeah. So what you can do, you can send an email to all lists of people, essentially, a mass email. So kind of to start with that, if you have a roll-up list, so I'm in PCR9 now, and if I go into my roll-up list here, the email campaigns is going to allow you to select a whole roll-up list of people from a roll-up list or search result or anything like that. and when you go to the letter option it's going to let you kind of build a library of campaigns so you can kind of build different campaigns in there maybe I want this one to update contact information so if I select that campaign you can categorize them they're all going to be based off of a specific form letter that's in your database then it's going to go to a selected set of names you have the option to send it to maybe their primary email address nine times out of ten that's what you do but if you happen to have a second email or a home email address you could send it to everybody's secondary email address if you ever needed to it also gives you nice ability to kind of pick a different alias so if you had maybe a send grid or something to be able to send not from your primary mail address pick that alias that way you can send that up a different alias just this time so kind of helps with deliverability there and keeping your your mail address clean your mail provider clean from bulk sending or anything like that they're also going to have the ability by default it goes to send now but this has the ability to send later you can actually go to the advanced option and you can queue up different options so I could maybe I want to send it Wednesday at 6 a.m. so I can kind of queue up roll up well roll up list to send out these campaigns so you can actually set up a stack to list campaigns send them on out you can also add things like only send 50 a day so you can kind of eat it out 50 a day that helps with response times helps you from getting overloaded with the responses and then with regard to the responses the email campaign piece is part of the premium package which also includes the analytics reporting that gives you the ability to look at a report of your email campaigns so you can look at maybe I look at the last time I sent my update your contact info I can see open rates click rates reply rates bounce rates so I can see kind of what happened I could even look down here and see who opened it how many times and when they less did or I can see even who might have clicked on link because some email service providers also have limits on you know before in their limits on how many you can send a day anyway yeah before they start blacklisting you yeah so you can actually queue up to only send 50 a day or use something like SendGrid that way you don't have to worry about any limit because SendGrid doesn't have any limits. So a couple of ways around that. Okay. And what is SendGrid? SendGrid is like a relay service. So you would send – they would give you kind of a SendGrid email address. However, it masks it to come from your email address. So you're sending – like I don't even remember what mine is. When I send mine – actually, let me hop into one of my roll-ups here. I haven't lately but sometimes I will send over an email to a large number of people and whenever I do I always use my send grid address so if I go right here Jay Lombardo made sequence that's my primary address but if I pick my send grid it's Jim and made sequence on that but it's my send grid account so it still comes through as Jim and made sequence on that but it's going through send grid so I set up that alias you just paid them a fee to be able to utilize them. Mailgun is another one. I think there's a couple others too. So it lets you send out as an alias to save a little bit of time and save a little bit of risk on your mail server. Does it work? Yeah, it works very well. I've never had a problem with it. And SendGrid's kind of the go-to one that people use. Customers of ours that do a lot of bulk emailing, SendGrid's the go-to. That way you never get flagged. And even if you do, SendGrid will switch over to another address it doesn't hurt your address so you're all good there got it and you basically just send up a um you just set that up and you is it a monthly fee or is it a one-time fee for them what is it probably a monthly i have no for sure idea but i would imagine it's a monthly fee don't you pay for it yourself yeah you have to pay for it yourself yeah we don't include it or we know I'm saying those don't you know what I pay for one the company does so I don't know why okay so you I don't know I don't say this okay got it yeah yeah we have an account with several several slots on I'm one of them so I don't know what they pay okay then you can also see kind of if you have links maybe you had a link to your LinkedIn page or your website or even a link to update contact information you can go ahead and see what links the people clicked in your emails how many times so you can kind of see what they're looking at what they're clicking you can see if they clicked maybe included a job posting you can see which job they looked at so you're gonna be able to write a bit more information there so that's going to give you the nice ability to report on all that information track how all your emails are doing cue them up kind of parlaying into the the analytics here you're also going to have the ability to build custom metrics so if you wanted to build a report you can build a report in here that includes any pipeline related activity or any activity type so if you had activity types like cold call follow call reference call anything like that all those activity types all those pipeline stages those are all going to be able to be pushed into a custom report here this report I chose to include first interview second interview and phone screens I can even take second interviews out take phone screens out so I can interact with this report and I'm going to be able to see everything I've done in this case I'm looking at last year but I could look at this week last week this quarter you can kind of pick your different time frames you can also split it up by job so I can look at what jobs I worked with in that time frame or what client so this is good if you funny I don't I don't I don't always use this this functionality of first and second interviews I should but I often don't oh you're not you do you use the pipeline when you go into a job do you have like a pipeline of people that you're moving people through at all like this you know i should do that but i haven't been do you have this version of the pipeline do you know because this is a newer version it's a several years old i don't know i'd have to log in and see okay so this is going to be it's especially helpful if you do use this this pipeline you're going to be able to report on every move so So whenever I take and move someone from one set to the next, that's going to create that trackable reportable event, and that's then going to appear in my analytics report. So that's going to give you functionality. In your pipeline that you're talking about here, are you just – you're going – where are you that you're getting to? So I'm going to any position. So any position in your database, there's going to be a pipeline button at the top. And if it's not showing, it might be in the hamburger option, little drop down. That'll show all of the buttons if you don't have it. Sure, sure. Yeah, yeah. Got it. So and then basically, and how I create even a pipeline is I'm going to, you know, I've created a job, correct? And then you can sort of manipulate the pipeline, correct? Yep. And you can create your own pipeline. You can have multiple pipelines. so that when you put in a job, the first thing it's going to ask you is, which pipeline do you want to use? And you can kind of select and then go from there. Got it. Got it. Got it. Got it. So using that then gives you the functionality to build a report in your analytics. But you could also do something like, I have one of just business development that I've chosen that it's going to be add names, add companies, add positions. I use RingCentral so I could track incoming and outgoing calls because those record activities. You could put emails sent, emails received, pretty much any activity that you find in a record. You can include that in a report. So you're going to be able to kind of see all your data there. Like some people do telecommunications and they look for calls, emails, and SMS. So it's going to give you some additional reporting options there. You can also do like goals and like if you wanted to have a certain number of outgoing calls or revenue goals or anything like that. You could do KPIs and stuff like that too. So, those are kind of two of the things. The third piece is also part of this is the sequencing piece. And the sequencing piece is going to be where you can build a drip campaign. So, it'll take a bulk email, like an email campaign, one step farther. So, you can create a template here. There's a couple. These two, I think, these two come with it. So, you can kind of edit up branches here. Can you not create a template in the normal bulk email? Yeah. Oh, yeah. So the email campaign is going to be just a one-time send. Send this email campaign. What this will do is you can say, send this email, and then based on what happens with it, do something else. So maybe if no interaction occurs in three days, go to the next step, which might be another email, or in this case, is a call. so this you could do strictly drip campaigns it could be an email pause two days a second email wait three days send a third or maybe it's send email a if they open if they get email b if they don't open it in four days they could email c so you can kind of set an automation in here essentially what's cool about this is more than just a drip campaign piece it's going to also let you put in things like calls to be made so in this one when i send my email if they don't interact with it in three days, I add them to my next step, which is a call, I'm going to have a task list in here that is going to be all of my calls. So each one of these individuals, I can go right to their record. It'll open up their record, show me their information, their activities. I can click to dial the cell phone number they have with my RingCentral. I can put in a script to read a script. And then when I get a hold of them, I say, whatever or happen, left message, no answer, not addressed, whatever. And then that will trigger the next step in my custom process. So you can kind of set it up, and it'll kind of let you go through, and you can go through, toggle right one to the next, go on through. So it'll kind of give you a workflow in here outside of your task list or your schedule in PC Recruiter based off of this roll-up list of people on which you have this sequence running. And the sequencing is all through email, not LinkedIn, correct? Yeah, it doesn't send through LinkedIn, but you see this LinkedIn option here. You do have a couple LinkedIn options that you can say you want to send a connection request, or maybe you want to send an in-mail, or you want to review their information. What you can do, it doesn't automatically do that because it doesn't interface with LinkedIn, but if I go to Mike right here, I can actually view his LinkedIn profile, get right to it, do what I need to do and then come back in here and market complete so you could write it it's not a LinkedIn outreach tool no not automated like that yeah okay just a LinkedIn center to-do list right there or then you could write these people you want to schedule a call with so each one of these you can go into and it'll give you a little schedule scheduler over here you can kind of so like yeah so you guys don't have any functionality that's like a dripify or something like that where they're doing all the LinkedIn outreach in the automated format. No, nothing that will work with LinkedIn. Yeah, we don't have anything to automatically work. Does Dripify work with email? I don't know if Dripify – I don't use Dripify, but I know about it. But, yeah, I think it works with email and LinkedIn, but mainly LinkedIn. But I'm not sure about the email. I've heard of it. I've never heard that about it. Yeah, I don't know about email. I think it's mainly a LinkedIn outreach tool to automate those sequences for LinkedIn, I think is what it's for. We don't have nothing like that and no plans that I'm aware of, just because I don't know that we have that. Yeah, I mean, so the sequencing engine is more for email then, really. Yeah, more for email or calls would be the biggest uses. If you have RingCentral, you can even send a text, too. this one okay got it got it got it that's kind of what the premium is any questions on that yeah i mean like you know i have a lot of questions but i think they're more around like you know setting up um my workflow appropriately which i haven't done um and so that's more about that i'm not utilizing what i could be using out of my current solution so But, yeah, that is probably just going to take a little training or something so I know what I'm doing, right? Yeah. Yeah, they can get just trained up on how to build pipelines, the things you can do to create those workflows. You can set up automations, different things with that. So you could do something like that. Got it. Got it. So just to summarize, the main difference with this premium from what I have is the analytics and the sequencing. Is that the main thing? Email campaigns, analytics, and sequencing, yes. Those are going to be the three things. Can't you do email campaigns now, though? You can do bulk emails. So it's a bulk email, not a campaign. A little simpler of a spend. You can't pre-queue them up. You can't report on who opened, who clicked, etc. So it's a little more basic. You can send bulk email, but it's not quite the feature set that the email campaign says. Got it. Got it. Okay. Cool. And then, all right, no further questions about that yet. So, okay, cool. All right. And then the PCRM is kind of our new product. So the PCRM is actually a different logon to the same database. So what I can do, like if I go in and I pick somebody random, I'm just going to do a blank search, and I want to go in and just pick a random name, David Abdo. I'm going to click his name. So he's going to now be the most recent record I looked at. If I go into my name search, as you know, the last name I looked at is going to be David Abdo. If I log into my PCRM, PCRM shares the same database, but it gives you a different logon, a different interface. So if I happen to go in here and I log into PCRM, if I look at names, my most recent viewed name is going to be David Abdo, right up top there. So this is the PCRM interface. It's going to do a lot of the same things and more, but in a different interface. So if I look over here, I can see down the left side of the screen, those are essentially the buttons that are across the top in PC Recruiter. A lot of them are going to be the same names, companies, positions, roll up schedule, all those. Some of them are going to look the same. So if I look at schedule, that's going to look very much the same. So that's going to kind of be your typical calendar. but things like the name they're a little bit different we have redesigned the name screen and what we've done is set up names companies and positions to all work the same so if you're looking at the initial screen it's going to show you the last records you looked at you can edit in row now right on the front screen you can also do a lot of actions right from here you can contact them with an email a call a text right from here you can add an activity a note add them to a roll up submit a profile you could do a lot of things right from the main screen here if you needed to and then if you click on their actual name it's going to slide in from the right side of the screen so you click on the little icon name record is going to show like this and what we've done is we've now given you an additional workspace so you're able to kind of max screen this here so you're able to set up a workspace of basic information that you want to show every time. Maybe it includes the resume, maybe the activities, and then these other tabs up here, these are all going to be the tabs that are the buttons on PC Recruiter. Details, roll-ups, resume, attachments, activities, all of your stuff. You can kind of put those in whatever order you want. So if I wanted activities to be a little more over, I can drag it right over there. It'll snap right over. Another thing we've added here, if you go to details, that's going to show you every single field you have on this person with a search at the top so you can go through maybe I want only phone I just type phone now it immediately filters down only shows me phone fields so it's going to help you to navigate your records a little easier it's a little more configurable you see you can pin a couple I've got a couple of things pinned at the top where I have a couple skills pinned at the top so it's a new interface here same is going to hold true with the company Once you know how to use the screen, go into PC Recruiter. That's going to load the company screen. So basically, it's the same. It's all the same information, just a different way of looking at it. Yes. But it adds. The biggest thing it adds. Yes. And some things like the sequencing, the analytics, those look exactly the same. Because when we built those pieces, we were already developing this. So those look exactly the same. But one thing we've added different is the Steels workflow. So if you wanted to track like a sales funnel of companies you're talking to, you can actually create a custom deals workflow. And you can add these cards in here. Each card is going to be a company you're working with. So I can go through and I can say maybe Melton signed their contract today, so I drag and drop them over to contract signed. So you're able to actually use a pipeline here, but for deals, you can put whether it's cold, warm, hot, your probability for each step. You can put your confidence level in each. You can put a couple of, like this one has a call that I have scheduled to make, so I wanted to send a call on the 9th, send an email on the 23rd, so I can queue up a couple of activities for each specific deal as well. So it just gives you an additional sales funnel. We had a lot of people asking for that. So the sales funnel is one thing that's in the PCRM but not the PC Recruiter. And also there's a simpler sequencing piece, so you can actually build a simple sequence right off of the roll-up list on the fly. so if you wanted to you're working with a roll-up list of people I can go to my list I'm gonna be able to go right here and create a simple sequence so I could say maybe it's going to be an email automatic it's going to go to the main email address pick my form letter that I want then I can go through add one more step maybe the next step is going to be a call manual I pick what phone number and then I save. So I've just that easily created a sequence and I can go ahead and activate it right now. So it'll kind of allow you to more quickly create the sequence and start people right away into the sequence as you go. So it's a little bit easier way of using sequencing. They added that and it gives you the ability to see kind of what sequence they're in. So if you had one running, I have one running on here, you can see that they are at stage one or if they were stage two or anything like that so it'll kind of replace the roll-up list stages to show what sequence these individuals are in. Got it. So just kind of add to that. And one other thing they changed the add field so if I'm adding data adding records maybe I go to a name I can add a name here so if I go in I can pull in a resume maybe I also want to add a new company too I can do that at once and I I can see company and then what I can do is hop over to this name. I can even link him to the draft record. So it makes it easier to add that. I could also upload an additional attachment that maybe is an attachment to Paul's record. And I could right click and link that to the record I'm about to create. I could drag in four more resumes and parse each one as its own record. So we've kind of made that entry a little bit easier to in this interview. OK, got it. Yeah. All right. so yeah I see I mean I see some differences here but not you know just some things that are a little bit easier different interface all that so are you having to go back and forth in databases then if you go to PCM? Sure it's the same database so it runs off of the exact same database so you can set up PCRM and you could use some people have their sales people and marketing people using PCRM but the recruiters are still using PCRecruiter or some reporters may want to switch to PCRM. You can do it. It's the same database real-time, so no problem there. Okay, got it. What's the cost differential? The PCRM is actually $10 more per user per month. For you, it would be a little more because you need to be premium to add PCRM because the features in the premium are included in PCRM. So for you, you would need to upgrade to premium and then PCRM. Okay, so essentially, and I'm kind of looking through what we talked about. Normally, the PCRM is $350, an additional $10 a user a month. $350 to set it up, that includes four hours training and $10 additional per month. But you would be $20 more per user per month and a $500 setup fee because you'd need to add all the premium features and the PCRM. So you would actually get six hours training, 500 bucks to set it up. It'd take you from whatever you're paying, just 20 bucks more. I think you pay 60, so it would take you to 80. Okay. And if I'm doing, do people often move up to premium but not PCRM? Oh, sure, sure. Some people, I've had people that they don't really want a sales funnel, and that's kind of the big thing. So if you didn't want that, you could certainly just upgrade to premium. And I could do that for – that one is still $500, but it's only $10 more per user per month. Okay, got it. So I'd be looking at $70, and it's still $500 to set up? It is, because normally it would have been – yeah, it's normally $500 to go premium. I could probably do it for $350. Okay, all right. Cool. All right, so $350 set up and then an extra $10 a month. Okay, for that. Okay, I'm just making sure. Yeah, so you can kind of do either. If you didn't want the deals pipeline and stuff and that wasn't really of interest and you didn't feel you wanted the new interface, you could just add the premium features to your existing stuff. That would be fine. And then later, if you wanted that, you could do it or not. Yeah, cool. And that would be just another $10 basically, right? Mm-hmm. I think at the time there might be an additional couple hundred dollars set up just because they'd need to add the new, create the new link. You'd need a little more training because you'd have the new interface there. Right. Got it. Okay. Very cool. All right. Good deal. Good deal. Okay. Sounds good. So the premium, just to summarize then, the premium gets me just all the sequencing stuff. And what else does it give me? sequencing, email campaigns, and that analytics reporting is what it will primarily include. Okay. Okay, cool. I just want to make a note of to summarize everything, email campaigns, and then analytics. Okay. Okay. Fantastic. Good. And then even in the, You mentioned in the PCRM that it's obviously a lot easier to do sort of quick sequencing. Is it more difficult to do it in the regular premium? The regular premium doesn't have the simple sequencing. So what you would need to do is you would need to kind of build the sequence ahead of time. So you have to go into the sequencing area, and then you'd have to go to templates. You'd want to create a new template, and you have to give it a name. and then when you build it, you're going to be able to build like all of these different steps. So you got to go in here, pick a step. So I would go what it's going to be, put in my text. Then I have to say what are my triggers going to be and what is the action going to be for each one. So it's a little more involved of a setup process up front. But once you create the sequence, you can use it as many times as you want. It's just a little heavier on the setup there. yeah i got it okay and then um okay fair enough and then um what sort of training is on like on on both of them so if i do if i go ahead and do all of it or i just do the the um premium what what sort of training is available well there are six hours either way uh so six hours of training for either that's included okay and if you wanted training without any upgrade you could even get training under your existing for 95 bucks an hour or 80 bucks an hour if you buy four hours or more but either version either upgrade includes uh six hours okay six hours okay yeah okay cool okay what are you seeing for most of your people that are upgrading are they doing both most really most people are already on um premium uh so the bulk of our customer base is on premium already. So most of them do upgrade to PCRM, but some don't. Yeah. But most people, like I said, most people are on premium. Some like the interface. Some probably just like the interface they're used to. Right. So, yeah. Yeah. Some people like that. They're used to that. They work quickly in it. They don't, they, they don't have a problem with it. So they're like, well, I'm just going to stick with what I've got. Yeah. Yeah. What do you think? What do you like better? I like the PCR 9 just because I've been using it for 10-15 years I mean so I can get around it really quickly but I do like the PCR M it's easier if I need to update a specific field maybe that I don't have in my view it's easy that I could just hop right in and I can look it up so it's easier yeah I can just go to Terry I can go to details and I can say oh I need that field what Is it going to be foreign language? There it is. So it's easier to get right to the data right there. Got it. Got it. Fantastic. Okay, cool. Cool, cool, cool, cool. All right, well, good, man. This has been great. So let me give that some thought. I mean, I'll probably, you know, at minimum probably upgrade to the premium. But let me figure out that timing. And then can I, if I do that, then I can just schedule time with, I've worked a lot with Robin, so is she still there? Yeah, she sure is. Yeah, and what you can do, yeah, I would put in a ticket if you did the upgrade. I would put in a ticket for your six hours, and I'd request Robin. That's perfect. They usually honor those requests pretty well. Great, great, fantastic. Good deal. Is there any other things like, I mean, I know you went through it kind of quickly. Is there anything I should be looking at that gives me a little more detail, or is that you guys have a... Our AI suite, so there's, you can, SMAI functionality, I would include it in the premium or it's included in the PCRM, so it's included in either version. Gives you some data enrichment or some data creation tools, if you will. So if you go to like summary, I can actually build a candidate summary by clicking the AI generator and that's going to take information that finds in his resume and his record and build a summary, a little bullet pointed list of his experience. So you could save that, you could regenerate it. There's one for job description as well, so exact same thing, just it creates a job description. a cool one for email. So if I'm sending an email, this one's a little more interactive. You can go through and hit the generator and you can tell it, like I want it to be casual, initial contact, it'll generate something, and I can kind of put in here, like mention a sales job. So I can kind of bounce back and forth with it, add some things, I can regenerate. Are you showing me something? Because I'm not seeing it. I paused the screen. Yeah, let me go back. So the last two things you've been doing, I had been able to do. I forgot I had that pause. So if I go to David here, I can go to summary. And I can go ahead and click this AI generator. And what it does is it creates a candidate summary based on the information in his record in his resume. Oh, I see. OK, very cool. And I can save that. That's part of the premium. Premium. Yeah. Yeah. Or PCRM. And then where does that show up in the actual profile? It's on the summary. So it's always going to be on the summary tab. Oh, the summary. Okay, I got it. It's there. You probably don't even use it because most people didn't. So that's why they added that there. So that'll generate a summary. Yeah, I don't know. When I look at that stuff on the profile, yeah, I don't know that I know the summary before. So it could be you need to get it out of your hamburger drop down. Maybe you don't even have it pinned because it wasn't. Yeah, I might not. A lot of people use. And then if I go into like email, I can do it. I mean, how do people use the summary? What do they mainly use it for? Back before we had capture, people would paste the person's LinkedIn summary in there and that's a searchable field. So the summary is going to be for any searchable data that you want to store in the database. that's not a resume, maybe bigger than would go in the notes. Summary is going to be an area where you can just paste in a cover letter, a reference letter, anything like that. But there wasn't any defined use for it, so that's why they added that summary generator. So if you didn't have one, it will generate one and keep an additional summary of that candidate in there. It's searchable, and you can use it as part of a presentation if you wish. Got it. Okay, fantastic. Yeah, that makes total sense. All right. And then this one you can say, I want to do initial contact. and it'll kind of generate an email for you and you can do mention the sales job it'll regenerate you can use what you get you can regenerate what you get so it'll kind of generate an email much like chat gpt would do okay got it okay yeah so now i um all right i see i see yeah so you can use that ai functionality you would normally on a chat gpt i got it yeah okay um okay that makes sense. That makes sense. Good stuff. Okay. Great. Well, yeah, no, I'm probably going to move forward with that. Let me just kind of figure out when I want to do that. And yeah, yeah, that sounds good. I mean, it seems like there's enough, there's enough functionality, especially for the premium to warrant another 10 bucks plus all the, you know, especially if you're giving me 350 on the setup. Yeah, that'd be good. Okay, cool. Yeah, just let me know what you want to do and we can send out paperwork when it's time and maybe I'll check in a couple of weeks if I haven't heard anything back. Oh yeah, definitely. I may get back to you before then. Okay, please do. Yeah, they may want to figure it out. But I mean, again, the main thing are sequencing email campaigns and analytics, right? Yeah. Was there anything different? Oh, I guess when you say email campaigns, you just mean the bulk email campaigns, right? Yeah. Mm-hmm. Because isn't that what sequencing basically is? Yeah, more automated. So the sequencing is going to be more automated than just an email campaign. Yeah. Got it. Got it. So really, do people even use the bulk campaigns when they have sequencing? Some do if they just have one email they want to get out. The sequencing is if you have more than one or you wanted to kind of get something running that would not lose people, fall through the cracks. So you'll send one email, pause it a few days, send another. Maybe if they open it, you'll know they looked at it, so then you can send a more personalized email, something like that. Got it. Yep, no, that makes perfect sense. Okay. Very cool. Awesome, man. Okay, sounds great, man. Well, I appreciate you spending time with me. And, yeah, I'll definitely be back to you soon. And, yeah, just definitely ping me to check in here in the short run. All right? For sure. Will do. awesome Jim appreciate the time man take care thank you very much we'll talk to you soon take it easy alright buddy see ya bye bye",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 575.492312,
    "salad_processing_time": 316.1950237751007,
    "overall_processing_time": 575.492312,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Otherwise, you are in the meeting now.",
    "job_id": "c0e1eea6-8a6a-4030-9327-a8028b21dea8",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Otherwise, you are in the meeting now.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 2
      }
    ],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": false,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3005644079037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}