{
  "recording_id": "3006666045037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:20:27.222858Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:20:27",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hello, this is Matt. Hi, this is Garrett with Main Sequence Technology. I got your email. You're having trouble with the activities? Yeah, hey, Garrett. I really appreciate the call. I probably should know how to do this already, but I don't know. It's just whatever button, I can't find it, so it's eluding me, and it's a pretty simple problem. No worries. So here's what I got going on here. One of my coworkers, David, brought this up to me. So when you do an action or when you click on a stage to change it, they have – let me look in my activities here. Where is my – so in the activities screen, when you do like a search of, let's say, a person's activities for the day, one of the headers is ACT type, activity type, slash result. And underneath that, like when we change it to stage three, it says stage three. You know, and likewise for like stage one, it says stage one. But if I change it to stage seven or another stage, it just says activity. And I cannot, for the life of me, find where I could redefine what happens when I change it, like, to stage seven. And I want that to come up in my activity search screen as stage seven under activity type. Okay. So in the result column, you mean, when you're on the activities tab of a name record? Well, yeah, like when you click on, you know, you can search the activities for somebody for the day, right? Oh, yeah, if you're going to activities up in the main menu. Yeah, in the main menu, yeah. David just brought up because, you know, we got to count like sometimes what we do and this and that and whatnot. And it's just easier, like, to count it through if it'll just say, you know, stage seven, you know, under activity type, you know, in that column. But it doesn't. And I must have set it up wrong originally. And so I just want to change it. And I don't know where that is. I've been through, like I thought, like every scenario in the system settings, and I just can't find it. Okay. Yeah, I'm seeing. Okay, so it's writing activity. Interesting. Activity is a custom. Here, let's do this. I'm going to take a look at your custom activities you've created in your database. It seems like the activity type called activity is a custom one that's been added to your database. that's not one that's normally available. Let's see. Oh, okay. There we go. Hmm. Okay. This doesn't have any results with it. Closed seven, stage seven. Hmm. Okay. So I'm going to pull up a roll-up list and see. Or if you could call, like, who are you logged in under? I think I'm under your username, MK. Okay. Let's see here. I'd rather you look up activities, you know, as opposed to a roll-up. Are these activities being generated as you change somebody from one roll-up stage to another roll-up stage? Yes. Yes. OK, I think that's where the configuration is set up incorrectly in the roll up stage configuration. The roll up stage can be set to automatically write a specific activity. And so if you're moving somebody to, like, say, stage seven and it's not set to automatically write the stage seven activity, that's where the disconnect will happen. And so I think it's in that stage setup. And I'll just go. So when you say stage setup, you're in probably database setup? Yeah. So there's some rollups that are set up using global rollup stages. And it looks like, yeah, it looks like your database requires the global rollup stages. So that actually narrows it down. So if we go to System in the main menu and then go to Database Setup on the left, just like you said, Database Setup, and Roll-Up List Global Stage Setup on the right. Yeah. Oh, that's on the left on mine. Let me – hold on. Maybe I'm – hold on. Global List – Roll-Up List Global Stage Setup, right? Yeah. Yeah. So, yeah, your computer is just – your monitor is – yeah, it's on the left for me. but that's okay oh gotcha um so once that yeah i went there yeah um you'll see the various stages there and what they're called in the description field directly to the right and then in the field directly to the or the column directly to the right of that it says default activity type at the top of that column this is the activity that will be written when somebody's moved to this stage. So let's see. So for example, there is one for stage seven and it is writing the activity for stage seven. If they're moved to stage zero, it's just writing the word activity rather than, okay. And the same with closed. Yes. And same with clear, just write the activity one. Okay. Yeah, that just doesn't seem to be right, though. Could you re-log in to David's thing? Sure. Or is it too... No, yeah, I could try that. Let me look at David Lopez DL. Yeah. Since these are global stages, I think they'll look the exact same. Yeah, they should be. But he just had more stuff today. So I actually have both of ours pulled up into the same thing. but perfect. Yeah. Okay. So I just researched it just so it kind of probably matches. So like if you look under, once you just do a, just a general search, right. For, for under him, it says, you know, one of the headers is ACT type, right? Okay. Yeah. It's ACT type slash results. okay you see how like uh you know several of them just say activity right in capital letters like we're seeing back on that other screen right but if you look at the one like one of them in particular like when he switched somebody to stage three you see how it says stage three without anything else it just says stage three under activity type Which name record is that for? I could just pull up that particular name record and take a look. Okay. Yeah, I guess you could do that, too. That is for Jacob Lawson, C-L-A-U-S-S-E-N, Jacob Lawson. Got it. Okay, perfect. So I'll go to his activities. yes I'm seeing he's got a stage two from today seven seven he's got a stage one from seven three um yeah yeah so okay let's see if I click on them here so but you know not all not all of them say that you know like it's just states like one and stage two and I think stage three where they say that in there. Everything else defaults to like activity. And it's just not, it just would be easier if they all said what they were individually. And I can't find out how to do it. It's set up to have it say like stage seven when they move to stage seven. So do you have an example of somebody who maybe was moved to a stage and it just says the word activity instead? Well, if you look up Troy, look up this guy, Troy Wake, W-E-I-K. Got it. Okay, Troy Wake. So just today, just as an example, just as a test, I moved this guy to a stage seven today, right, just to see what would happen. Okay. And now if you look under the activity screen, 7-7, which is today, under results, there's nothing. When I move it to stage four, it says stage four. Or stage one, it says stage one. And I'd like it to say stage seven there so when we look at the overall activity screen, we could pick it out easier. Yeah. Let me take a look at this roll-up list to see how it's set up. It was the one called director of BD-MD. This roll-up might be set up differently in its stage setup. Okay. I think they're all the same, to be honest with you. I don't do anything different when I create a roll-up. Okay. And neither does anybody else. So they're all set up, should be exactly the same. Gotcha. I'll just double check. I should be wrong. Oh, wait. I can't check that one. Let me go back to your username. You have more of an admin privileges there. Let's see. Okay. Okay, rollups. We'll go to director and DVD. So this is using the default rollup stage function. Okay. Yeah, you know, I guess when I start a rollup, I think I choose, like, general, you know, for, like, when you start it up. Like, you can do default or you can do general. I think they're actually the same thing. but they're all set up the same as far as how the stages react. Let's see. Default versus, so there's one called new stages and there's one called default. Okay. Yeah. And default is the one we were just looking at. So moving somebody to stage seven should write the stage seven activity. And it does do that. But under activity, it does write that out, you know, because it says, you know, under activity, it says stage changed to seven, right? Mm-hmm. Right. But that's not easy to see. Like, when you're looking at the activities, I'd like it to say stage seven under result. Yeah, I know. Yeah, that makes sense. I'm just going to figure out where the configuration is where that's not happening. I couldn't find it. And I think at one time we must have known where it was because, you know, stage four says stage four. I'm sure that I did that. I'm sure that you told me how to do that at one time because stage one, it says stage one. Stage four says stage four. It's just other stages I don't have set up, apparently. Okay. I think I know what happened. So in your roll-up list setup that we were looking at in the system menu, you have stage seven set to a pop-up new activity. And all that means is instead of you moving somebody to a stage and boom, they automatically have an activity written, you actually get a pop-up window first where you can put in a couple notes before you write that activity. So that's how stage seven is set. The difference is your username has a default activity type that appears in the slot whenever you have a pop-up window. It's kind of like two separate settings colliding into one. Perfect sense. Perfect sense. That's exactly what's happening. Okay, got it. So there's two things we could do. We can either remove that default activity type that's just called activity so that when a pop-up for the add activity appears, it doesn't plug in that default one. It'll take on the stage seven, let's say. It's not overwriting it with your username's default. We can set it that way. Yes. Or I can show you where when that pop-up appears, where you can choose from the drop-down stage seven if you want to leave your default how it is. Nope, because I know David's not going to want to do that every time that he switches the stage. Okay, gotcha. All right, so to make that change, you would go to any name record under names. Just pull up any name record. And then go to add activity. It's an action button in the name record, like two word bubbles. So you get that pop-up, write an activity. At the bottom left is a gear icon. bottom left of the pop-up. And this first row here says activity type, activity general notes. You can switch that to please select activity type, the very first option, and hit save. And now you won't have that activity one plugged in every time this pop-up, add activity pop-up window appears. Okay. If I change this, what will pop up? It will just, well, in the stages for roll-ups, it'll start taking on the correct activity type that you set up in those roll-up stages. So stage seven, it'll automatically fill in stage seven there and won't try to override it. If you're just adding an activity regularly by clicking on this like double word bubble here, it won't have an activity type filled in. you can choose it from a drop-down because you don't have a detail selected anymore. Right. So, okay, I just went from please select activity to, okay, save. So I save that. And then let me go to somebody else in this roll-up. MD, take another four, page four person, Rachel. And I'm going to move her to seven. Test, moving to stage seven. And then I'm going to hit save. And then I'm going to look up my activities. Fingers crossed, yeah. And then let's see here, activities, search, Rachel, and it just says activity again. Oh, okay. It still just does activity. All right, let me do this. I'm going to put myself in a rollup here. Let me just make a quick rollup. Let's see our support test, default rollup stages, good. And I wonder if I'm in your database. If not, I'll just create a quick name record for myself. No, okay. Making a quick name record for myself. Putting me, I'll put myself under the main sequence technologies company in your database. Okay, and finish. Put myself. in the new rollup I created called PCR support test. There it is. Okay, so my stages here are good. These are the ones I wanted to see. So if I go to stage seven qualified but not this role, stage seven qualified not this role, save, check my activities. Oh, that one worked. So when you're changing the stage on somebody in a rollup, you get that pop up window to add an activity text if you want are you making any changes on the add activity drop down on the left or is that just leaving that out i just didn't know how it is and then you hit save that should um okay let's do this um If you do your activity search again that you've been doing, does my name appear in the list now? I just had your username add me to a stage seven on one of the roll-ups. Yep, I see two things there. And yours says stage seven. Okay. some login if you want a username yeah maybe I have to maybe I'm just because I just made the change well yeah I mean so that's all you did is you went to your name and you just switched it to page 7 yeah I yep in a roll-up list called PCR support test that I just made oh you know what maybe maybe again because you freaking pcr um maybe because uh you created it i made the change and then you created a new roll-up list so now that change is like effective and it's not effective even though i made the change maybe this roll-up is is this it's not affecting it because it's not a new roll-up you know like stuff it doesn't work until something goes forward. Maybe. Yeah, let me test that. Should I add my name to that roll-up list? Yeah, why don't you do that? Okay. What's the name of the roll-up list again? I should go on. Yeah, it's MD. Oh, there it is. Director of BDMD? MD, yeah. Okay. All right, so I'm going to add myself. So what you could do, yeah, you could add yourself to it, and then you could, like, switch it to another stage, like zero or nothing, and then switch it back to stage seven. Okay. Yeah, I'll do that. Right, to see if it... Okay. Yeah, so right now I'm at, well, I'm at nothing here to start. I'll just reset myself at nothing. And then I'll just go to seven real quick. Ah, I'm getting the... Yep, I'm seeing that pop up appear for this one where you still have your default of activity type is general notes rather than stage seven. So it's not taking on the default activity that we just cleared out. So maybe if I log out and re-log back in or maybe it's going to be old. Yeah, that's a good thing to try, actually. Great point. I'll do that too. Log out, log back in. I'll let you do it just because you can do it quicker. Yeah. You know what you're looking for now. Mm-hmm. And I'll go back to that same roll-up. Director, there we go. And I'm on page two, I think. Or no, wait. I'm in stage seven. I'll go back. There we go. Stage seven. There I am. OK, so I'm going to move myself to like different stages, stage six or something. There we go. That. No, it's still taking on your default activity of activity. It's one of those things with PCR, right? When you create a roll up like that seems like all the all that code. It's just like there, and you can't change it. It's like set in stone, right? Yeah, it's like set in stone, yeah. And then moving forward. At least going forward since I'm – now, I did that on mine, right? Do I have to call David up and tell him to do the exact same thing on his too? Yeah. Are you logged in as David? No. No. Could you – Yeah, your general activities are for your username. I could log in as, let me go back. Yeah, could you log in as David and switch it to the same thing? Yeah. Yeah, I'll just, I'll make it so there's no need for it. You know, whatever roll-ups we create moving forward will work. Yeah, there you go. And in the meantime, on those current, existing roll-ups, you can, when the pop-up appears, switch it to stage seven. Yep, just have to make sure, just to switch it, yeah. and then at least it'll be there. Okay, that makes sense. And now I'm logged in as David. Yep, there we go. And I'll just go to his activities and change the default to police alert. Okay. There we go. Cool. Yep, I think that'll do it. I have another question. Sure. Now I'm curious because I don't know why this is happening the way that it was happening. It seems like we fixed the problem. You know, however, my question is, like, on some of these stages, it seems like we assigned a default maybe. Because I'm looking at, I think it's one of David's guys, Sunday Dawson. He switched that person to stage three today. And under activity type, it says stage three, right? It doesn't default to activity, you know, like all the other ones do capital letter activity. So I'm wondering how come some of them are like, how come right now, even with the old roll-ups, some of them are operating like I want it to, you know, saying stage one, stage two, stage three, and some of them aren't. Is it only because, you know, like on stage seven I have the pop-up and that's what's making the difference? Oh, it could be the pop-up. Yeah, let me see if there's other stages that don't have a pop-up setup. I have a lot of stages that don't have the pop-up because, you know, if we call somebody and leave a message, you know, we don't have to go in there and type a thing in. But if we put somebody at a stage seven, which means that they're not good for the job, like we want to enter comments in, right? So that's why I have the pop-up for that and not for, like, leaving a phone message. And it sounds like the ones that are working, yeah. Yeah, that's a great point. So I'll go back to database setup. Which is fine. I mean, that doesn't help me at all. But at least it answers the question as to why some of them are working the way that I want. Yeah, exactly. So I'll do like a stage one for myself then. We'll see. So I'll go back to the director of bd-md. And I should be in here. I might be at stage, go back to no stage. Oh, I'm back at stage seven. There I go. Okay. So I'm going to move this to stage one and see what happens. Okay. So I did that. Now, this gave me activity result stage one. Yeah. Without the problem. What we want. Yep. Okay. So that's the big thing. That's why the problem is happening is because when it does the pop-up, because I didn't have that set the correct way, I need to choose it for the way it is right now. But going forward, I won't have to. It'll just default to whatever, you know, is in the system. So that'll work going forward still. Okay. Exactly. That makes sense. Awesome. Anything else we've been having trouble with? No, I think everything else is going pretty smooth. Oh, good. And, you know, this was just a setting, you know, kind of glitch that I probably should have had that, probably should have done this a long time ago. Yeah, it was a little confusing, hard to track down exactly what was going on, but we figured it out. That was awesome. Yeah. So I will say that cosmetically, I think it does look better, you know, with the upgraded, you know, I guess font changes and color, you know, kind of make it more rounded. Yeah. Yeah. So it does look better. It's easier on the eye. And so that was a good change. Again, I kind of wish that it's just annoying. You know, that's a cosmetic change that, you know, okay, great, it looks better, right? But it doesn't do anything for, like, how it works, right? Functionality. And when I'm in a roll-up, and I know it's probably just me beating a dead horse, but I just hate the fact that I cannot define like what happens when I click on the, the, the what's it called? The header, you know, like first name and it, when I click on first name and it automatically defaults to descending order Z to A, Z to A instead of Z, you know, and that's kind of like super annoying. It seems like that would be an easy change to me. Right. Why is it? Yeah, I never understood why they did that. We do have a couple new people kind of managing the development team. So I could bring that up again at our next meeting and see if they have a they could add that into their their list of feature requests. We have a few new people out there. Things might move a little faster. But yes, it's the descending order Z to A rather than A to Z when you're trying to sort in the roll up list. so it just uh you know and they can have you know in in some portion that could be a choice you know we could choose whether to default to a to z or z to a right so that way they're you know yeah yeah and then uh if i stage let's see here i just was uh yeah yeah that's the main thing but other than that everything seems to be working out pretty good and yeah, no complaints. But I really appreciate the time and getting me up and running and at least going forward now on all the new, do I have to pick anything special? I guess my last question to you is I'm going to click on a roll-up and I'm going to click on, I'm not going to create one, but I'm on a roll-up and then I'm going to hit the plus sign and then under default activity type, do I have to pick any particular one to make this happen when you're creating a roll-up? Right, I see what you're saying. I think that one would just be... I mean, the one that pops up on mine is select activity type. Yeah, maybe leave that one. Yeah, so I normally take that and I put it to activity that's general notes. That could be what's happening. You know what? Let me try to... Oh, go ahead. I think he, when he creates his, I don't know what he does when he creates a roll-up, whether he leaves it on please select activity or whether he goes down to the general notes one. Yeah, I think that might be an additional place that we didn't look at. the roll-up might be created to have that appear. Let me edit director. Yeah, let me see this. I'm going to do a quick change. I'm going to edit the director of bd-md, and then we're going to do our test again. And I'm going to move. Let's see, where am I? Probably in stage seven now. Oh, no, I might be in stage. I think you left yourself in like stage one or something. Yeah, good call. I'm stage one, so let me go to stage seven. Ah, that worked. So now the pop-up is going to – so what was happening is this pop-up window, when I'm moving to stage seven, was taking on what you selected when creating the roll-up as the default activity type for the whole roll-up. Oh, that's the default activity type. That's what it is. Yeah. Yeah. Okay. We were looking at the default activity type for your just username, but there's an additional default activity for the roll-up itself. So even old roll-ups, we can change so that they take on the right activity type just by leaving it as please select. Okay. You know why I didn't leave it as that? It just doesn't look as, you know, it doesn't look as good. It just seems like selecting one, like activity, general notes, it looks better. But, duh, okay, so I'll leave it as whenever I create anything, or I can go back to other roll-ups and I can just edit the roll-up. Let me just do this real quick here to one of mine. I'm going to go to – I still got that problem, but okay. but I still have this stupid problem where um whenever I log into PCR um and I and I hit the roll-up thing it has eight users selected and I see everybody and then I got to deselect everybody with me um uh but I don't want to I don't want to get rid of all my cash and we tried to fix this with just getting rid of, I guess, the cache just for this tab, and it didn't work. So I think I'm going to have to get rid of all my cache. I just don't want to redo all my passwords and stuff. So I guess, but I'm still having that same problem. Oh, let's try that. Well, okay, I'll give you something to try. But go ahead and see if you can edit one of your roll-ups. It's going to have the action drop down to the left of it, and then you can do that. edit okay I see action edit and oh I'm gonna do one here okay edit yeah please like activities save bingo okay cool and even though I mean I have admin duties or whatever privileges, anybody can do that, right? Like David can do this on his too, right? I went to go edit as David, and it wouldn't let me edit the roll-up because I guess he doesn't have that permission. I can edit his roll-up, right? Yeah, you can edit his. Okay, good. All right. I'll do that. Okay, cool. So, okay, well, that's cool. That's awesome. That's great. So I'm probably solved. I fixed the older ones. Yeah. Okay, but I did find something. Yeah, just switching that default activity. But for your deselecting the username filter at the top, here's something you could try. If you perform a rollup search with all of those deselected, so open up rollups in the main menu and then deselect all of them except for MK in that dropdown. and then to the left of that, just type in like the letter A where it says roll-up name, where you can do like a search for a roll-up. Type in the letter A and hit search. And what that'll do is save your selection for the username drop-down because you performed a search with only one name selected. The next time you get a roll-up, you should see just that one selected. okay I think we tried that before and it didn't work oh it didn't okay that was this is yeah this is let me just try this one more time because this is Yeah, it should be where you just, you know, perform the actual full search. Yep. It just was, whenever I did this, it was changing the, anyway, I couldn't, I didn't have access to the roll-up name search thing. Now I do. All right, so I type in A and I hit enter. It's a formatting goofy issue. I don't know what the deal is. All right. So I did that and I searched for a, um, nothing came up. Um, I got one selected. I'm going to hit roll up again and then it'll probably come back with eight. Yeah, it did. I came back with eight again. Oh wow. Yeah. That's strange. So once I, once I, um, uh, actually, uh, how do you say like going to Google and, and, and, uh, redo my, um, memory or whatever, like clear it out, right? Clear out the cache. Totally. If that doesn't work, I'll call you back and we'll have to figure something out. But I think, I'm sure that's probably what it is. It's just some glitch in cache, you know, where it's not letting me do this and it's just something I got to do every day that I log in. Is I got to get rid of all of it. Just, you know. And I don't blame you. I don't like clearing cache all the time just because of the, like you said, passwords and things like that. Right. But I probably should do it anyway just because it's probably good. standard procedures, you know, just to do that. But all right. Well, listen, I really appreciate you helping solve this problem because it was really, you know, I couldn't, I thought I looked everywhere. And so that's good. I appreciate it. Awesome. No problem. Glad we finally figured it out. If you, yeah, if you have more problems, just let us know. All right. Sounds good. I really appreciate it. Take care. Thanks for the call. Sure. Have a good one. Bye. You too. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 222.265067,
    "salad_processing_time": 197.08325624465942,
    "overall_processing_time": 222.265067,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hello, this is Matt.  Hi, this is Garrett with Main Sequence Technology.  I got your email.",
    "job_id": "9585c4ad-f630-4c5c-aee5-3d9ab79964c5",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hello, this is Matt.  Hi, this is Garrett with Main Sequence Technology.  I got your email.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": false,
      "solution_offered": true,
      "proper_closing": false
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3006666045037.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}