{
  "recording_id": "3007250723036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:19:12.385590Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:19:12",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. You have not... Enter your participant ID followed by pound. You are in the meeting now. There are four participants in the meeting. I can hear you. Good morning. Hi, Jim. Hello. Hi, Jim. Hi. All right. All right. So I'm letting everybody get in. Is everybody in that's going to be joining or are we still waiting on anyone? I think we're all set. Okay. Very good. Very good. So I want to show you around PC Recruiter a bit this morning. I wanted to start off just by learning a little bit about what are the main things that you use in a software package now and that you would require of a new package, be it ours or anyone's. What are kind of your main features, functions, et cetera, that are absolutely must-haves? So I can make sure to cover those areas in the system as we look at the demo. Okay. I can lead off on that. So we're currently a Bullhorn customer. So we've been on Bullhorn since 2010, so a very long time. Most of the functionality of Bullhorn works well with us or for us. Some of it we find clumsy and it's a little bit harder. But the basics are, you know, we work both sides of the desk. So we recruit candidates as well as we find, we work with our client companies and getting jobs. So when we send out a candidate, we'll send the candidate through Bullhorn. We send it as a mass mail so that it can be tracked. We can see who's opening up this submittal. And then everything with Bullhorn tracks all the emails between the recruiter here at NDT and the client company. So we like to have as much information as possible and have that be as automated as possible so that our operations team can work on other things. So that's that. In terms of doing bullhorn searches, we do it, but we think that their technology is a little bit outdated and clumsy. so we're interested in really the whole gamut of what your product can offer us. Okay, perfect. Excellent. And so you're looking for something that's going to track client, companies, job openings, interviews, being able to send out candidates, track emails, all of that basic sort of information there. Okay, excellent. Excellent. So let me show you around here, and if you have questions as we go, feel free to jump right in. I am going to share my screen and you should be looking at the sign-in screen for PZRecruiter right now. Yeah, perfect, perfect. So I'm going to go ahead and get myself logged in. So it's a cloud-based system like all of these systems are. You're going to be able to access it from a PC or a Mac. There's a mobile app so a lot of different ways you can access the system. Each user would of course have their own username and password and that's going to be nice because that's going to let you see who has done whatever they did in the database. So all emails are going to be stored, tracked, tagged in the database. You'll be able to see who sent the email, who entered the record, who scheduled the interview, whatever it might be. So as we go through, I'll show you kind of all that information. So once you're in PC Recruiter, the basic look and feel is going to be what you see here. Now, it's going to be configurable. You can actually pin or unpin many of the tiles in the main menu bar. You can redesign the screens, add custom fields, move fields around, so you have a lot of functionality that's going to be configured to your liking. But essentially, you're going to have a primary menu bar at the top. That's going to be your main navigation. The middle area is going to be for searching, search results and lists, and then the bottom area is going to be for the records themselves, as you would be able to navigate the system there. So that main menu bar is going to really handle a lot of your primary elements of PC Recruiter, including the names, the companies, the positions. So those are our three main record types that we handle in PC Recruiter, names, companies, positions. The names are going to be a little different than both. We are what they call single silo. So a name in PC Recruiter is going to be the name of a person you're working with, be it that they're a contact, a reference, a candidate, whatever. they're only going to have one record so if they're a contact at your client company I would mark them a contact but maybe they're also a candidate throw a resume attached to their record they're going to come up in searches so they're going to act as a name record no matter what whether or not they're a candidate or a contact but a name is a name in pcbroker we find that it helps prevent confusion duplication what have you if you need to have two email addresses linked to one record, you can certainly do that. And any emails exchanged with either or both of those addresses are going to be recorded in the activities. So that's going to work real well. So I think we go back on that because that's an important point. So Bullhorn separates it out. So if we're working with John Smith, you know, we'll have John Smith as a candidate and John Smith as a client contact, and it prevents us from ever sending anything personal to John Smith's work address. Are you saying that PC Recruiter doesn't do that? It's only one record? It's one record. And yes, there's one record, and there's no way that PC Recruiter is going prevent you from sending anything to anyone. You'll have to make sure they're on the right list or whatnot. So yes, a name is a name. So I suppose you could create duplicate records in PCRecruiter if you wanted. It's going to pop a little warning up as it finds that you're trying to do that. But what happens is when you have a record, for example, if I did a search here and I did a search just to get some people back, oops, would help if I did a name search. When I do a search, it's going to show me all of these people. So you see most of these people that come back are going to be candidate, candidate. But some people might be an employee of a client company. So that status column is really going to be what you would pay attention to. If you needed to filter down your search to only search a candidate, you can do that. But even if you have maybe Keith as an employee of Vanderlei Industries, but I have a resume for him. So he showed up in my search, but he's tagged as an employee. He also gets this little red icon there that some people get if they're not a candidate. But he is going to show up in a search if you have a resume there, even if he's an employer or a contact there. So you can, with each record in the database, they can have one status. So you kind of want to decide how you're going to do it. I usually recommend if they are a contact, mark them an employee or a hiring authority or a contact or anything like that. But you can still attach a resume to them. But certainly, if you wanted to store a duplicate record of their name with their home address and their resume, you could do that. So you don't have to use it single silo, but you can. I have a question, Jim. This is Risa. I have a question. So say we're using this name, Keith McDonald's, as an example, McDaniels. So are there any safeguards questioning us or whatever the case that we're getting ready to send an email to Keith about an interview process he's involved in, but we don't want to send it accidentally to his company email? Well, in that case, the only secret I would say, make sure that the primary email address field is not his company email. Okay, because when you send a mass email out of PZ Recruiter, it is going to usually default to the primary email address fields. Now, that's not to say you could have additional email address fields, home, second, whatever, but it's going to default to the primary email address field. so there's nothing that's going to stop it if somebody puts a work email in that field and somebody else sends out a bulk email when I go to a list and I send out a bulk email there's nothing that's going to stop it it's not going to know it's a work email or anything like that so if I select all my results and I go right here to send an email you'll see it's going to go to the primary email address field by default but you could pick it to go to any other email address home email, second email, personal email, anything like that. But by default it's always going to go to primary email address. Tim, I have a question. When you had the candidates listed before, next to one you had employer, it said EMPL, then one with CAND, but then you had, there were other terms there that I don't know what they referenced. Yeah, most of them are going to be candidate, well, And actually, I can even, from a record, show you in the drop-down list what they all are. So your status is going to be on assignment, candidate, employee, internal, hiring authority, manager, and then several others that are slightly less used. Usually what most people use, candidate is going to be used for anybody who's just a candidate. If you happen to be doing temp assignments, you might use on assignment or available. and then most people use either hiring authority or employee for a contact at a client company. Now, you could also use, if you wanted to use developed or submitted or unverified or anything like that, you can use any of these others. Also, it'll automatically turn them to placed if they've been placed in your database. So it'll kind of give them a little bit of a different stage there, showing you that that's someone you already placed. but if they're placed and then they're also a hiring manager um do you have to go back to manager or um so that they're not logged in as placed well you might if you needed to know that if you place them there and they become the hiring mentor i would go in and make them the hiring authority so yeah but then they could also be a candidate many times we could place them and maybe two Maybe if later they're a candidate again. You can change it any time you wish. And everybody's always a candidate, really, regardless of their status. If they have searchable data connected to their record, they're going to show up in a search, no matter what their status is. That status is going to be shown, so you can see all these people attempt, someone who's a candidate, even Nathan who was placed. He still showed up because he still had that in his resume. You could filter out specific stages if you wanted. But by default, we're giving you the biggest results, everybody in your database. And then you would know, oh, that's someone placed. I'm not going to want to work with him. So you wouldn't link him into a pipeline. Or you might, when you send your bulk email, uncheck his box or something like that. Jim, when you send a candidate submittal, I know Bullhorn allows me to see that the recipient, the hiring manager, HR person, has opened the resume. and how many times they've opened it. Does your system offer that capability? Yes, it does. We have two different ways of doing that. One, if you sent out a simple email campaign, like a bulk email of a person, that is going to allow you to look at your analytics of that campaign. So this is one way you can see opens. I can look at every email campaign I sent or every submittal I had, And I could see opens, clicks. So I can look at opens, see who opened it, how many times, when they last did. Now, this is more for just a general email campaign. You can use this to submit a candidate. But submitting a candidate, we actually have a dedicated piece for that within the system. So let's say I wanted to send Terry out to someone. What I can do is I would do a presentation. So the presentations area, that is going to be an area where I can build a presentation. It also will let me know every time it is opened, every time they provide feedback, so I can go ahead and create a new presentation. and this is going to let me maybe I want to build a template that's going to have my company logo at the top it's going to have some basic information about Terry and I can kind of pull maybe I don't even want to put his last name and then I can go through I can also pull in other things like his LinkedIn profile maybe an assessment and the skills checklist that I might have so this right here is all of the attachments I have on this record for this specific candidate and I'm building a candidate presentation that's going to comprise or be comprised of their resume and whatever attachments I chose and then over here I can maybe make it so that the recipient cannot download or print the information that I sent I can even set it to expire in a number of days and down here is all of my notifications so I can be notified every time it's viewed I can get an email so I can choose who's going to be notified I can choose also be notified every time they submit feedback so when you send this out this candidate presentation is going to be sent out you can send it out here and I you can send it to up to ten people at a time so that's one of the limitations of this presentation piece you can send it up to ten email addresses there I don't think you could send it to an email address there or to a roll-up list but But as you send it out to individuals, you're going to be able to see every time they open it, every time they click it, every time they provide feedback there. So a couple of different ways. So it seems like it's almost like its own cocoon. But is this information received? Let me rephrase the question. when you're sending a candidate are you sending it to the recipient the hiring manager's email address or does all of this work only if the hiring manager logs into a portal oh no we don't have a portal so this goes to their email address yeah so they would go to their email address so and it would look kind of something like this when they click to it they would see the basic information, the resume, additional attachments would then be combined into one PDF so I'd be able to see everything right there and then they could simply they can't print they can't do anything more but they can go feedback and they can give feedback right there but you can see every time they view it and every time they provide feedback. I'm going to try and send one to myself here. I'm going to send a couple. I don't know if this is going to work, but because I don't know if I can email out of my database there. You could put a nice form letter template in here, anything like that if you wish. Let's see, I'm going to try and set, this may not work because I might not have an email address set up in my demo database here. Yeah, something changed my email address so I can't email out. But I would be able to email it out and then I'm going to be able to track opens, clicks, everything of that nature. And Jim. that can be sent independently to all of the 10 people that you're submitting it to? I'm going to check and see if they're blind carbon copied or not. I don't know. I don't remember how that works. You can send it up to 10 people. I'm going to check and see. I'll ask around because I can't test it. But I'll check and see. In no way of the 10, they know that it's being sent to them and nine others? I don't know. I'm confirming. I don't believe it shows everybody's email address, but I won't say that for sure because I don't know for sure. So I'll have to check on that. I have a question also. So you're sharing that NDT would know each time a resume is viewed and that shows up in Bullhorn. Does that information go to our email as well and just say, you know, for example, Risa, such and such a client just looked at your resume? Or is that something we have to go into Bullhorn to find? No, you would actually, it would show up in, it would email you and also show up in the candidate's record. So those activities would do both. Yeah. Okay. All right. It's 1018, Jim. Let's talk a little bit. I don't know if Claire, Claire, are you still on? Yeah, I'm here. Okay. Let's talk a little bit about inputting information. So, Claire is our operations person. And me, say to Claire, please open Jim Lombardo's resume as a candidate. so let's let's see what Claire is going to have to do okay so parsing in a resume so if you do get a resume we do have a parsing utility so the basic way it's going to work you go up to this quick ad in the extreme upper right hand corner that little lightning bolt that is going to let you add name company or position data so I would select name and then I'm going to be able to go parse from resume and as I go to that parsing utility I can do a couple of things I could hit paste I could click the paste button at the bottom that's going to paste into this resume area it's going to paste the resume if I highlighted and copied it so that's one way or I can hit open and I can browse it off of wherever it might be on my hard drive so I'm going to be able to two ways get that resume right into here and when I do have it into the white area down below it's going to automatically parse out the contact information up top. So it's going to parse out the name, city, state, zip, country, email address, phone numbers, title. Okay so it is going to parse that information out. Now a nice thing about this integration, if you use either Outlook or Gmail we have an overlay that you can kind of add in to your Outlook or Gmail that is going to give you the ability to right-click on any attachment and you can just say parse it into PC recruiter it'll open this screen automatically open the resume parse the information and all you need to do is hit save so you can parse directly from Outlook or Gmail there's also a resume inhaler if you needed to bulk import a whole word folder of resumes you can point the inhaler at that specific folder and it'll inhale them all it'll just kind of import them one at a time creating a record for each one and any of those ways that you're parsing even here it's going to create a record under that person's name and then the attachment or rather the resume will be stored as a searchable attachment connected to that record so you'll have that information in the system there's also duplicate checking capabilities so if i tried to save brian here i have the exact resume already in my database so it's going to tell me the exact resume word for word space for space is already there so it knows you don't need to enter you already have it you can even jump right to the record that is connected to that resume if you What if you have the resume and it's three years old? Wouldn't you want the updated one? Well, likely, if it is, it's going to be different because it is only going to duplicate or tag it as a dupe this way if it's identical. Every word, every space, every character, every period. So if it's three years old, it's presumably going to be newer and different. So in that case, you would get a slightly different option that would say, we've noticed this person's already in your database, but this is a newer resume. Would you like to update it? So it'll give you a chance to update the existing record for that person using this newer resume, and then it'll take that older resume and archive it as a searchable attachment in the record. But the old resume is still in the person's record. Yeah. Because we have people that we've known for like 35 years, and they change. They can become a candidate, a hiring manager, be back to a candidate, and we have all the files of them. You do. I have another question. Some of the resumes come in in a Word document or a PDF file. Does this convert a PDF file? Yeah, either one. It's going to store it in its original format. So if it's a PDF, it's going to bring it in, and it's going to store it as a PDF, likewise with Word. Can you change it from a PDF to a Word document with this? I think you can, because I think if you look at a resume, you can view it in the resume viewer. And you can go, if you want a PDF view, HTML, image, text. So you can easily toggle between and kind of pick whatever it might be. Well, Claire, how do you deal with that? If someone sends in a PDF resume, how do you put it into Bullhorn? So usually I just convert it with Adobe, which is a whole separate thing from Bullhorn. All right. So that's something that she could do with your product as well, I assume. Yeah, you can bring it. You don't even need to convert it. You just take the PDF, bring it right into PC Recruiter. Right, but she would need to convert it because we have to put our letterhead on it and take the, if the candidate's resume has their contact information, and if the PDO, we want to get rid of the contact information and put our letterhead on it. You could do that ahead of time or you can do it in PC Recruiter. We allow you to create and store a blinded copy of the resume. As I have right here, you'll see with no contact info. And by default, if you have a blinded copy, that's always the one that's going to be emailed or used. You also can put a header on here. So you can add a header into your database so that if you were to ever print or email that resume, that header is always going to show up. So you can do either of those in here. Okay. I want to just go back to a question. So, just in terms of the logistics, if we were to use your product and move from Bullhorn over to you, what does the importing, what does the process look like in terms of you're getting all of our information from Bullhorn onto your platform? Well, we do data conversions in-house, and we've done Bullhorn before, so we have a team that would convert that data in-house here. So what happens, it takes 60 to 90 days to convert the database because it's a custom job. So what would happen is you would get signed up, you pay your initial setup and everything, and then you don't pay anything more until that conversion is done. So that conversion is going to take like 16 to 90 days. You would still use Bullhorn during that time frame. And then once everything was done, we would get a final backup of Bullhorn, and then we would run that over a weekend. So it would be up ready after that weekend for you. So it takes like 16 to 90 days start to finish to get it done. So there's a transition period in there that you'd be getting trained up on PC Recruiter and ready to use it. You're saying two to three months to convert it? A few questions on that. So going back to the beginning of our conversation where we talked about sort of the separation between someone who's both a contact and a candidate, so they're both. how would, seeing that that's how they're set up in Bullhorn now, how would PC recruiter deal with that John Smith, who's in Bullhorn, a separated record from contact to candidate? I'll have to ask my team. I haven't come across it in a while. I don't do the conversions. I'll have to ask what they generally do. I know they have a standard procedure, but I don't know what that is? Yeah, because that's how Bullhorn is set up. So, you know, if we have one person who's a candidate and a contact, Bullhorn keeps them as separate records, but you can see if you toggle onto the Bullhorn dashboard, you can see that there is a second record for that person. So, it allows you to do that. My next question is, do you know what the cost is or how your company prices the migration of our information from Bullhorn over to PC Recruiter? Sure. Yeah. So Bullhorn is one of the ones that we kind of have a standard map for, though it is custom. We have a standard starting point, essentially a Bullhorn to PC Recruiter translation. So the bullhorn is $1,250 is what that is, $1,250 for that conversion. And it doesn't vary depending on size. Size doesn't matter. Number of records doesn't matter because it's not that that dictates it. It's just the mapping procedure. So number of records doesn't matter. Okay. And then what is the cost of your product? Do you do it on a monthly basis, a quarterly basis, or how do you charge? Sure. So it is a monthly cost per user. You can add or drop users as often as you'd like. And I think you said you had just joined NPA? Yes. Okay. So NPA actually gets discounted pricing for PC Recruiter. So with the NPA, you'd be looking, our premium package, which is what we've looked at today, is $89 per user per month so 89 per user per month normally that's 115 to 125 for anyone non-NPA so you get this kind of rates there so $89 per user per month and then a one-time setup of 750 and that 750 is going to include creation of the database it includes installation of of this anything like the inhaler if you wanted to install our capture piece that would allow you to pull people in from LinkedIn Dice and deed all of that if you wanted to hook it in your outlook or Gmail, click it to your website to post jobs, all that's included, and 10 hours training. So you get 10 hours with one of our trainers that would train you on the system and everything of that nature. So you get 10 hours training included as well. Jim, is the $750,000 in addition to the $1,200,000 that you talked about, the conversion? So that's like over $2,000,000. Yeah, yes, it's separate. So it's almost exactly, is it $1,250 plus $750 is $2,000. Yeah, $2,000 up front. And then the other question I wanted to ask you, when your company becomes engaged to do this transferring, do you need someone from NDT who's the person that you delegate, so one key person that your company works with? Yeah, you would have one person who would kind of be your coordinator through the data conversion. They would need to be there to A, get the bullhorn data to us, B, they would go through it with our conversion team to make sure everything is mapped correctly, make sure all the fields are into the correct area that you want them in, and sometimes changes are to be made. So they would go through calls with our conversion team to look at the data, make sure it is appropriate. They would sign off on the data map. They would coordinate getting the backups, everything of that nature. So you need to have a point person to work with our coordinator here. And is that all done in the 60 to 90 day time period? Yeah. Yeah. 60 to 90 days. And does that person have to be available every day? No. They usually schedule with him. So they'll schedule with him various times to talk or he'll We'll let them know, hey, we have a pass ready for your review. Let's schedule a time over the next few days. So it's flexible. But the quicker they get back to them and review the data as needed, the quicker it will get done. Jim, going back to the per-month user cost, does your company bill on a quarterly basis, or how do you work? Generally, we bill monthly. Most people will pay monthly. We can bill quarterly or annually if you wish, but most people pay monthly. They just keep a card on file, and it just pays recurring each month. And that way, that gives you the flexibility. Should you need to add or drop users, you're only paying once a month, so you can go up or down as needed. All right, so people can pay by credit card. Yep. We haven't talked about any of the AI tools that you've implemented, and I know we have a limited time, but is there anything that you're very proud of that this product does with AI? Yeah, the AI piece. So we've added a suite of AI. A lot of it is content generation. One I like is the email generator. So you can kind of work much like a chat GPT generator. If you're going into an email here, you can click this little AI generator, and it'll pop up a window here, and you can kind of say what tone you want it to take. So maybe we'll go casual. Maybe it's going to be follow-up. It'll generate an email. you can kind of respond and say mention the sales job you can read regenerate the text use the text and send an email so you have a nice content generator for emails there's also a candidate summary generator so if you go into the summary field on any candidate you can click one button and it'll take information found in their resume and their fields and it will generate a nice custom summary for them so that's another piece that's nice and then one that we have just come out with that I don't think it's out. Let's go see. I don't know if it's out yet, but there is the ability to do an auto match for a position. And there's an auto match that will go ahead and find the best 15 or 20 candidates in your database that match that specific position. And I think literally it was just released this morning. So I don't even know where it is or if it's even released in my demo database yet, but that is something that's in development coming if it's not already here. So are these tools, if we engage with you, are these tools in addition to everything else? No, they're included. They're included in the package. Tim, I have one additional question. So you mentioned 10 hours of training as part of that one-time setup fee. So going forward, one, if we need an update or new training, and also if we have an issue that's more urgent that needs to be resolved, how does your support team work? Well, we have phone call support. So there's someone answering the phone. We have a whole team of people. You can call our number and ask a question. You would also have a point person in your trainer, and also I would be your account manager. So you have several people you can contact directly. We answer the phone live from 8 a.m. Eastern until about 6 to 7 p.m. Eastern on weekdays. So there's often going to be someone here to answer the phone. There's online chat. There is a LMS, like learning management systems, you can train at your own pace. There's also a Learning Center with various step-by-step instructions. and screenshots and videos linked into it. So you have that. And then, of course, all of our systems are monitored 24 hours a day all the time. So if anything should happen, we'll know about it and immediately start fixing it as anything might have happened. So you can dial us direct if there's a question, or there's plenty of online and chat options available as well. Is your support, are the support people based here in the United States? Are they in the U.S.? Yep, everybody's here in Cleveland. Okay. Do you have anyone in New England if we wanted face-to-face training? Do you have anyone? We don't. We're all based out of Cleveland. But on-site training is an option. I think they charge like $12.50 a day, unless you use it as part of your initial 10 hours, but they would charge travel expenses to go. But it's something we could discuss. Okay. Okay. All right. All right. So I think this was a good first meeting. Does anyone else have any questions? All right. Oh, I had just have one question like about the resume and like the can you attach like multiple files to one person or like one company? Because sometimes we have like a bunch of stuff that's not even necessarily a resume. Yeah, so in Terry's record, he's going to have a resume area, which is going to be his primary resume, also a blinded copy if you have one. But he's also going to have an attachments area, which is going to be anything and everything you might wish to attach, older resumes, archived resumes, specific resumes, maybe geared toward a specific position or anything you might want to upload. So you can put as much as you want. You'll see he's got three pages of different things in here. So you can upload all sorts of attachments there. And then if you needed just to give a quick shot of the pipeline, within each position, you can also attach many different candidates to that position through the interview pipeline. So you can go through and see how many people are at each stage, and you can easily drag and drop them from one stage to the next. So you can kind of work with that too. So you can kind of be able to look at everybody who's in consideration for that job too. Okay. So are these the colors that come with the system? Because I'm seeing all different colors. This is all custom. So when you create it, you create the colors. You can have up to 18 steps. You pick the colors. You pick the terminology. You pick what order they're in. That's all custom designed by you with the guidance of the trainer. So we really have to understand your system so that we're all on the same page with regard to colors and all of these different sections. Yeah, the trainers would help you to figure that out. That's our time too, correct? That is going to be your database, and they would train you how to build this. They would help you to build one or two pipelines initially, but then they would train you how to do it if you needed to change it down the line if you wanted to. Is that with the product or is that extra training? No, that's the included 10 hours. Part of that is they'll go over the setup and utilization of the pipeline process. So when we have the 10 hours of training, then we all have to be on board at the same time? No, that's up to you, too. Sometimes an initial training might be just set up and only admin people who are going to be creating usernames and stuff like that. Or maybe some of the hours might have everybody on, but that's up to you. The trainers work with you to see who needs training on what, and they schedule that according to your preference. it's basically we have 10 hours and and we've got to figure out how we're going to use it so am i jim yeah you have 10 hours and you can have everybody on every session or you could have one session is just admin users and maybe the other is just recruiters you can do usually one hour sessions is the kind of loose guidance that they offer but whatever you want to cover, whoever you want to join, that's up to you. Okay. All right. And then I just have a last question. Do you work, are we under a contract or how do you work with your customers in terms of the working relationship? It's a one-year contract. So the $89 per user per month is a one-year contract. And then you can add or drop users as needed without resetting that contract. And at the conclusion of that contract, it'll auto-renew unless you opt out. It'll auto-renew for another one-year contract. Got it. All right. I think we're good for now. Very well. Should I maybe follow up in a week if I haven't heard anything from you, just to touch base? I ask you to follow up on the questions that we asked. Oh, absolutely. Okay. Yeah. Yeah. Follow up on that. And then you have Beverly's contact. You can send it to her. I do. And then she'll let you know. Perfect. I will follow up once I have those answers, and then we can take it from there. Great. Thank you. Thank you. Thanks for your time. Thanks, everyone. Okay. Have a great day. You too. Bye-bye. Bye, Jim.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 123.743886,
    "salad_processing_time": 108.1230103969574,
    "overall_processing_time": 123.743886,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  You have not.",
    "job_id": "28ff6abc-5519-40c6-b4a7-32f80e852b8f",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  You have not.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 1
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "urgent"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required",
      "high_priority"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3007250723036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}