{
  "recording_id": "3008287053036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:21:30.196446Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:21:30",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Robin. No, I'm not calling those people's tech teams. I'm not doing it. You're not doing what? No, I'm not calling those people. David Reese. I don't care if you're technically stupid. You don't pay us any monthly fees. I'm not calling your tech team to tell them how to maintain their Office 365 account. I told them, show them this screen. how it's it was like some message that it's basically locked down by the system administrator over there probably oh so there's nothing wrong it's just they need to have their tech team do it not us from what i remember because i did a screen share with my mom go that's something i don't see you'll need to talk to your tech team they seem to have it locked down he could talk to his tech team they don't pay us any monthly fees i'm not doing it i'm not i got no i'm not doing it just because they don't want to yeah I don't understand them yeah you want to maintain your database on your servers you don't pay any monthly fees you got apparently restrictions on your office 365 account they're stupid I guess their guy got all mad and he wrote in the ticket well I don't know what kind of support they're paying they don't pay for support that's why we didn't give them support. I'm like, did anybody tell them that? The guy's all upset. I don't know if Nick clearly told him, no, you don't have support. That's why we don't give support. They don't pay us for support. There is no support contract. It's not even a PCR issue. You must have their Office 365 accounts locked down, preventing a sign-on, like an OOP. I don't remember this message specifically. I think I sent him a screenshot, if I remember right. Let me see if I even have anything like that saved or anything. it's not it does not seem to be pcr related if it is it's because you're on such an old damn version and that's the only reason why or you have it so locked down but that's all on you and when did i talk to him I don't even know what it was the ticket's in there authentication unsuccessful user credentials I think there was a talk with David Reese okay from the dead page person that I spoke with about cloud that a few what's the other ticket then I think it's under like David Brenner or Drenner or Drebbins or something weird like that. Oh, my ticket, I talked to one of them. I think it was with David. No, I'm not chasing down their support people. It's not fast. And what's this other one about? Oh, here, this one. The user session context is missing. One or more of the user's context values were not supplied. Every request must include these values and maintain them across a single composer work bar. We're unable to get the app password to bypass it. Well, I'll sign in. He's going to reach out. Oh, I told him to reach out to see if they can help him create an app-specific password because we weren't even allowed to do that. That's what I told him to do. so he's got to do that because he's like oh it never got fixed well because he didn't do what he had to do right we weren't able to do the sign-in so I said well we could try like an app specific password because there was these like correlations like I don't even know what this means invalid request the user session context is missing if you look at one zero zero 40467. My last two notes. And I even told him what to do seven days ago. Hi, David. Pre-request. Here's what to ask your tech person. How to create an app-specific password for your Office 365 email account. We can then try using the password it generates instead of using the sign-in OAuth method. I literally told him what to ask them. He can fuck off. Yeah, he just told me, oh, that still has to fix. I don't know what happened. I don't understand those people. We're trying to get them to go ASP because they have no business hosting themselves, but business is down. I don't know that they're going to do it. Can you hear me now? I do now. Okay, great. There's a short in this cord somewhere and it keeps messing me up. Yeah, I literally wrote him an email after the thing saying, here's what the Astro Tech person said. You didn't do it. I'm out. I'm not going to keep wasting time for someone who doesn't even pay you. And I'm not calling their support person. How do you do it? Get your app to Westbrook and then I'll show you where to put it in. That's all I'm doing. I'll just rehash to him what you said and say that this is what you have to do. That's what it is. We can't help anymore. Yeah. If it's not accepting a sign-in method, which might even be like a setting on there, maybe they don't let people sign into their office 365. I don't know. It could be a setting. That's for the tech person to answer. What we can try is an app-specific password and go from there. I still don't even know if that will work, but it might. But that's what he'll need to try next. Nuts. I'm not kidding. because I mean not and then and they don't want to pay oh it's too expensive because your guys are a bunch of losers probably and do recruit I guess right dummies oh it's an Azure our syndicate directly authentication mirrors of the sign-in request failed because some required session information is missing involves cookies headers form fields that are exchanged between the browser and the cookie session was lost from your refresher bookmark logical page and reopen it log in tape with a new tab without carrying over the original session you're behind a strict firewall or browser you're studying I don't know but it's something we can do. Yeah. They could try app-specific password. That's my only suggestion which I gave to him. And if he doesn't want to do it, it's on him. I don't know. Like, this going back and forth is ridiculous. You bought a software, you dealt it, you don't have any support. Let's see. Let's see when the last time they've actually given us any money. I think last fall. I think pretty recently they bought the upgrades, the updates. They did? Well, then it's not version related. It's got to be securities on their side or within our Office 365. What is it called? McCormick? They got invoiced in February for something. What was that for? reinstall of reinstalling PCR in a new server. Oh this will help me here. What this is one. How would they have invoiced this before? PCR update. PCR update annual update fee. All right I got to figure out QuickBooks, let's see. How to generate a report of payment based on specific line item. you'll need to customize a transaction report let's try to find that you're what you guys are wanting like some about who's paid an update fee yeah he wants to he said to find a list of everyone who's paid the update fee in the last maybe three years so we know who's recently paid it so we know who's actively using so we can maybe market them moving to cloud or see what they're doing or anything like that all right let me see if I can get to this area though transaction reports transaction report oh these are just general how could I do it by a line item listen how cute they are who little kid voices oh you can hear him sign up I'm telling David I check with my team here to look the issue is here has to do with the permissions around your outlook account which isn't anything that our support team can handle I've included Robin's last response below and it says here's what you ask your tech person and create the password that's how to do it no we say this is what she suggested you should try the next step did you do this she said what you were to ask them did you do it I've included Robin's last response blows what you should try with your text with your support person that's all I can offer yeah there's support like the one guy I'll pop this in here like he was oh it's just the one oh the one about why is your database growing yeah I don't know because you got shit on your database I don't know he's like I'm not sure the nature of any support agreement that McCormick may have had well there isn't one there isn't a support agreement you do not pay us for support we don't support your servers or anything I don't know why you're like your database is growing so much I don't know how much data you have in there I can't even access your database so how would I know yeah yeah and we didn't do it we don't administer we don't control it that is obviously but open it's a Nix queue that doesn't bother me I'll just leave it open I think I was told not to reply if I remember right I don't even know that somebody else was handling or something yeah I want talking to buckle a cloud but I'm not talking Andrew Silverstein because he's her support guy I'd see see him so he knows I'm talking to them about going cloud but like he doesn't know that we don't support it like there is no paid support anything gotcha how can I do the credit test you told that count sales by product service detail. You could score other reports like business by item, sales by product service detail. That sounds like sales by product service. Let's look for sales by product service detail. I don't know if I have access to everything. Sales by product service detail. Ooh, wait a minute. This might be it. Filter, filter. What did I say it was called? Upgrade fee. Oh, that's not it. What did I say it was called? Upgrade fee. No. What was it called? PCR update. Hi, PFC. Robinson Pine, she misses you. I miss her all the time. How far back do we want this? Like three years, I guess. That would be pretty reasonable. I think I might have no open tickets that's okay first time that's happened now save as as Where's my export option here? I think I got it giddyup print export here's export export to CSV we'll do it to CSV because Excel we don't have Excel I might have gone back further than you wanted but this is no problem better further the less far Oh, did I go to my downloads? Where'd it go? Is it really five o'clock already? I don't keep doing that to myself. Wow. The days go stupidly quick. All right. I don't know if this is going to be. I'm just opening. I'm going to try another export option. Export to PDF as well. All right. I'm going to send this over. No problem. I have a son. Nothing faces me anymore. I thought your son was working down in college this summer as a bartender. Wasn't he doing that? It lasted one night. Oh, like his choice or not? Well, let's see you ask. So they said, oh, here, drink, welcome. It's your initiation. And then somebody rasped him out. Oh, what a bunch of dicks. It was a setup. They got him drunk. And Rick, when you were stupid, you should have just said no. Yeah, just say no. That's what we've been learning since kids. It's like a test, you know? And, yeah, I'm like, do I want to sell for it? I didn't work with my nephew, but I don't know. My nephew's literally hounding him and everything. So tell me what you think. This is probably more than you want. I went back further. There's really not too many in the past couple of years. Yeah. Yeah. There's only one this year. Oh, yeah, we haven't sold it. Well, there hasn't been a self-hosted update this year. Yeah. The biggest problem is like we weren't really releasing any self-hosted updates. So we'd say, oh, you want to pay the fee? And they're like, sure, what do I get? We were like, uh. Nothing. Nothing. Maybe less bugs. Maybe. One, two, three, four, five, six. There was only six last year. One, two, three, four, five, six the year before. so yeah at least it's a starting point it's more than I thought we had that's about 40 companies there but I know a B and ETO is gone somebody's been there twice like Orion I think on oh yeah all right I think they are I think they are yes some other I'll look through thank you for doing that um did you have my chat about Jen Plesser action, whatever it was. What about her? I just want to make sure she's one user, Bill. Well, I don't know. I'm not allowed to change them anymore now that got taken away from me. Why? Oh, because we just can't do it. Oh, for the love of God. We need more people able to do it, not less. And Davisha's not available. Don't even get me started. She's so stupid. I just want to make sure she's still for one user. What was her action? Action. I don't remember what the rest of it was, but let me look at her. AG Action Enterprises. I think it's her. 623 switch to month to month agreement will be will be transitioning to Crelate. No, she's not one user. Oh, she needs to be. okay and then this needs to be done right now because she's probably going to get charged soon but yeah tomorrow tomorrow the 9th yep and that's why probably why she called she called me yesterday or it's like i gotta talk to you and she just wanted to make sure they were at one and i'm like i think you are but i gotta make sure you are because they're keeping one for indefinite for a few months, maybe more, but she actually confided it to me. She goes, we're using the Crelate and it actually isn't going as well as we thought. So we're giving it a try, but she goes, I'm not really liking it so far. So it's good that she has one user left. One user 79, right? Yep. On a month to month. Okay. I'm just changing this. I'm not really sure. You have to change it and say, I had to have you do it. Yeah. Well, I'll make a ticket and say, I had to do this because they're getting a bill tomorrow and it's urgent. There's absolutely no reason that you shouldn't be allowed. By the time I made the ticket, I mean, I guess I could, but well, that's weird. Interesting. I already dropped them from $395 down to $79 in June. You know what? Was that one of the ones where they were changing them or not saving the change? I think so. In June, what's their invoice? Here, let me move this over to my other screen. I think this is one of those that got screwed up. It could have been. I'm trying to look through because she signed a new agreement. And I think... In Mike SQL, I changed it from five to one users, $395 to $79. I did all this on June 23rd yeah so here's how I'll know here's my email on 23rd the email I sent you saying please drop her she signed a new agreement yeah it says out of state that tells me yeah they probably that's when they screwed up we've been catching a lot of those pretty much I think when they're going in if there was a user change recently i think they screwed it up the last couple of days it's like ended last week and like yesterday i was like ready to lose it because of it because i'm like so glad you got we caught this right now because that would have been annoying well it was completely annoying because i thought i was losing my like how you just said like oh can you change this well imagine getting a customer i asked you to do this i'm like wait a minute i did it i see it in my sql i wrote a note and the ticket. I wouldn't have forgotten that step. I'm not an idiot. I'm sure. Granted, I may occasionally miss something somewhere, but it was like four in one day. I'm like, I am not an idiot. I'm not that much of an idiot. Yeah, for sure. Yeah. So I thought I was like, literally going crazy. Have they figured out what they're doing and stopped doing it? So I think what they were doing is, and I was supposed to be going through and checking them, I guess what they were doing is going in to maybe like an open invoice and putting like the the state tax thing in there and then what they were saying is like update recurring like when you go to save it you could save that one or also just three or also update the recurring I think they were somebody was said an update the recurring too so whatever invoice they were in they changed it to what they changed the recurring to what that one is not just editing the one i go i always do it separate and then she's like well there is no user change indicated in the notes i don't for most part like pascal tell you nobody really used that notes area every once in a while they would put like maybe a breakdown where they're getting paid i've been going in there like if somebody's canceling when they're canceled when they the date that they cancel or did i put them on hold. I don't put user changes in there. User changes happen all the time. We go into the recurring, we adjust it for the recurring, we update it on the record in MySQL, and then that's really it. We don't make a note of that in every little thing. You've got to go by the count that's in the recurring, not what they were last billed at because those changes happen in between. Ridiculous. Well, I'm glad we caught this. Yeah. I'm sure there's going to be more. Oh yeah. So now they are at one user because that's where they should have been as of the 23rd. So they still are. And actually, you know what? Yeah. So I already had a ticket for that, right? So I don't need to make another ticket. It was an email because I didn't put it as a ticket, which leads me to my next question. Do you prefer an email or a ticket? Because I just sent you an email because this one that I emailed you about just now, very similar. They left MRI. So I had to rewrite my new contract to get them off MRI pricing. It did not change their products. It did not change their install. All it changed was it went from 50 to 70 per user per month. So I just took the actual agreement they signed, forwarded that to you with, here, please change this. Or do you rather have a ticket? Let's have a ticket because especially when I got made to V-sharp, Cassie, at least I could see who was assigned to, somebody's making a change because I think I told Bill, I'm like, I've been really wanting to point some damn fingers lately with that other stuff. or maybe it was even to you. Well, let me put in the ticket just so it's all on the up and up and it's in writing and we can find it easily. I'll just turn that email into a ticket and I'm going to assign it direct to you. I'm not even going to put it because now that I send user ads, I always send them direct to you. Davisha poaches them out because they go to the group. So I'm just going to send this one direct to you because we've talked about it and we know what it is. Yeah. If you do user change, if you pick the category of user change, It automatically gets assigned to her. I was overriding that and putting it to you. Yeah. But she still somehow got that one. Yeah. They go over to her now. That's so silly. But also, I will put this in as a ticket because I want to get this one done. Oh, I got you. Oh, don't follow up with the customer. I will follow up about their taxes and stuff. Why are you getting involved in that? I don't understand, but whatever. Yeah. I can't wait till she gets one of our angry customers. Or a huffy one. Oh, the one I want. Well, here's the thing. I'm waiting for two really super important things from billing, and they're doing everything else except what I need you to do. I need two refunds issued because you screwed up. I got a couple of them done. I'm still waiting on two. Can we make giving our customer their money back a priority because you screwed up? Yeah. Well, let me figure out how I could do a partial. Do a full and just redo it. I don't care. Do a full refund on the invoice. Figure it out later. The customer needs their money back. Because of this, he was already pissed. Well, I'm not really pissed because he's always, you can say the name of the passage, he'll probably laugh, Dunn Williams. He's always behind. Oh, that asshole. Whenever you're reaching out to him, he never replies until it's like, okay, we're cutting you off tomorrow. Then all of a sudden, he'll call you like three times while you're on the phone. Is Ben Williams with Probitus? Yes, Probitus. Yeah, they like hand the count. They left. They came back. He's always behind. So he's been behind. And then when he finally went into pay, they paid all of his open invoices. Well, one of them declined because he didn't have enough money on his card. And so then he was pissed because I'm like, well, you're behind. I don't know what to say. Like it promised to think. That guy, Wise got an email from him and sent it to me. And I called the guy and he is upset that his training expired after six months. He's rebranding. He's changing his company name. He wants training. He wants a re-demo. He wants all this bullshit. And he's always behind. Tons of busy work for me for zero dollars. And it's so fucking annoying. and he's always behind. The only reason he's current is because when he went in to pay like one or two, I'm like, we're going to need at least, because I was ready to shut him up. I'm like, we're going to at least need two today. Well, when he went in and paid it, it paid what it could if it was opened. I think the last one couldn't. So then with this change, then he went down to three users. So he went from five to three. I think we need to do an audit. But he went down to three users, but then with this goof-up, he got billed for five. So I'm trying to get this refund. He was already pissed because when the last time it locked his card because of paying the other thing, then his card got locked. He's up-to-date accidentally. He's kind of up to date accidentally, but right now he's actually overpaid, but I'm waiting for Kathy to fix it. I sent her an email again today. Look, I'm still waiting for these. She can get a little snooty condescending sometimes. Okay, so I'm putting this in as a ticket. I'm also going to throw the contract in here, so we'll have that. And didn't they use their training time for the most part? It looks like somehow Wise gave them 14 or 16 hours, and they only used two or three of them. Oh, that's not true. I talked to them way more than that. Oh, that's what I think Garrett was working with them, or somebody was. Oh, wait a minute. No, I thought I did. I'm trying to get a recap every time. It expires this day. Yeah, every time. And he's like, I don't think it should. I'm like, but it does. But it does. Job board adjustment. Oh, there's something from seven hours ago. Wants to change the name of the database. No, everything breaks. Well, he has nothing set up. I checked that. He's got one, two, three. He's got a bunch of, he's got three new tickets. Those are probably all as a result of, I talked to him yesterday and I wrote it all down and I haven't even had a chance to fuck with it because I don't have time for that nonsense right now. He's got three new tickets. yeah he was going to be suspended a month ago to count reactivation he was suspended he was already suspended before he's been suspended several times he seems kind of like an ass oh and he's been getting things check us if you're ready to schedule a training nothing um oh yeah he only did use three hours yeah they expirated last october yeah like a long time ago yeah i just ended that ticket for that so from here forward i will always put it in oh wait a minute oh jim white oh yeah i remember this he took forever if you look at my beginning of my training ticket, I keep going back and forth to him. Why? I was like, reached out to him yet? Nope, nothing, nothing, nothing. And then, let's see. By the time his ticket was created in April, he brought up an old database. Oh, he brought up an old database. Did that, did that. I spent way more time than he did there, actually. He finally did his first training in June. Because he was like not reachable. Yeah. Then he's like, I didn't know they expired. Because he doesn't pay attention to anything. Anything. He's like, why? I'm like, well, because we had all these tickets hanging out. And you had all these unused hours of training. And then they would call up when we were already busy with all the clients six months later. And they'd be like, oh, I'm ready for my training now. I'm like, so they sent him to expire. So they do. No, they've always been to expire. Only purchase training does not. Yeah, they used to expire in a year. They got switched to six months some time ago. Yeah, so people don't like just, yeah. Yeah, so you don't just sit there and keep them forever. That's it. So I told them I see what I can do. The other thing I was like, I think that was James' idea, was to really get people scheduling rather than, oh, I have time. I'm like, oh, let's get this done. Yeah, the ticket was created April 5th. 5th, my consulting call notes are finally June 6th. So it took two months for him to do his consulting call after Jim was trying to chase him down. He's a nut. He sure is annoying to me. because I said Bill what do we do when he charges he goes did he owe the money or something like that I go yeah he goes come on he owes us money if this card got locked you know I think that was something Kathy replied back this was like a month ago or whatever if his card got locked he's got to he's just going to have to call his banks the invoices were open it tried to process what it could I think the last invoice I couldn't process because he didn't have enough on the card or that's when it locked but his own fault he's annoying yeah I'm kind of confusing them I feel like I've talked to him like a bunch or at least chased him around a bunch that felt like I did a lot with him okay well that's all I got I got to run. You got to run. You're working too late. Yeah. Yeah. I'm hoping. I'm going to have to do this one now. I can't wait and take the chance if this goes through tomorrow if Delisha doesn't handle it. Oh, yeah. No. Yeah. That's why you can't not be permitted to do this because she's not regular working. We can't just depend on, oh, when she gets to it. Well, she'll probably do it every day. But this one, I know I think it was going to get billed tomorrow. Yeah. I just said ASP. No, I'm not looking for. Okay. Palo Alto Car Resort has left MRI and says they need to have a new contract and get them off the MRI pricing. They are still the same package, but update their monthly costs from $50 to $70. Okay. So did you update Mike SQL for this one? Yep. All right. I just did this afternoon. Yeah, I signed contracts there. Everything's updated in Mike SQL. So the only thing I need to do is just the invoice. Mm-hmm. Okay. So sale customer CJ Walsh. I wonder if it's going to get it either. I don't know. It's under Polycom is in the database, but it was CJ Welsh. And then it was an MRI something before that. Wow. Manager Cruiser. Cruiser. Well, yeah, here it is. Okay. So I just need to go to their recurring, which I already processed for July. So it will be changed for August. Groovy. Okay. And it's enterprise, you said? Yeah. Enterprise package. Do I take off the PPI? Probably, if we jumped them up to 70, right? Yeah, I would say, yeah. They re-signed. They re-signed. Nine users, 70. Take off that. So, 630 a month. Right? Nine times 70. That sounds good. Nine times 70. Okay. Invoice. We're starting. 8125. Okay. Enterprise rate. $20. $20. You are currently billed for $30. You are currently billed for nine users. Please let us know if your user count changes so we can adjust billing. great awesome Robin thank you thanks okay talk to you soon bye",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 223.535885,
    "salad_processing_time": 159.1499137878418,
    "overall_processing_time": 223.535885,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Robin.  No, I'm not calling those people's tech teams.  I'm not doing it.",
    "job_id": "6a85ca3e-238a-45fb-a9a8-8d715f2020ef",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Robin.  No, I'm not calling those people's tech teams.  I'm not doing it.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical",
      "urgent",
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required",
      "high_priority"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3008287053036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}