{
  "recording_id": "3009413647037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:25:45.794336Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:25:45",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. You have not entered any numbers. Please... Enter your participant ID followed by pound. You are in the meeting now. There is one other participant in the meeting. Good afternoon. This is Jim. Hi, Jim. This is Sabina. Hello, Sabina. How are you? Good. How are you? I am well. I am well. Thank you for joining me today. I want to show you around PCRecruiter a little bit. I wanted to start by just learning a little bit more about what you're using now and what you're looking for in a software package, be it ours or anyone's. What are your main criteria, your main functionality requirements? Sounds good. Do you want to leave video off or should we put video on? I'm going to share my screen and actually kind of click through here so I don't ever usually keep video on. So video off is fine if that's cool with you. Okay. Fine with me. Fine with me. Yes. Oh, yeah. I have a dog in my feet. So where are you then? Okay. Sounds good. Well, yes. So I am new to Next Level Partners as Vice President of Executive Search. And one of the first things that's on my docket is to implement, select and implement a recruitment CRM system. And so I've met with the team and gathered what's worked, what hasn't worked. We don't have an actual CRM, which is shocking to me, but we're using primarily all the functionalities in LinkedIn Recruiter really for the last decade or so. So they had an attempt at a CRM, but it was a really small team of two at the time. There are six of us now, and it was just more than they could manage the upkeep on and just didn't really stick with the resources at the time. But we've gotten to a critical point where it's really going to be required, especially as we want to continue to build business. We're currently doing our business development and spreadsheets and along with the consulting practice. So we do have a larger consulting practice. That's the bulk of our business that does continuous improvement consulting. And that's where most of our business comes from is from those clients. But we want to span out and really scale it up in the next couple of years. So that's why we're looking. And ideally, we're looking for a platform that is designed for a boutique executive search firm that is simple to use, easy to collaborate, really gives us better contact sourcing and improved lead times for our clients, better relationships with our candidates, and then also allows us to be able to really drill down and understand and report on our performance as far as, you know, time to fill successful candidates and really capture some of those metrics. Because we are with LinkedIn, and that's primarily where we're, what we're utilizing for most of our sourcing, it'll be important and critical, really, that it integrates seamlessly with that. So, we're looking at systems that, you know, that have those capabilities. Some of the nice-to-haves would be maybe sequencing, but we, you know, we're okay with really as long as we can put the individuals in groups and things like that and do group outreach, we can still do that in a manual process as well if needed. But, you know, really looking to a firm that's able to support us and get us to that next level. And I think that's kind of the thumbnail sketch of what we're looking for. I do have a little list as we went through the requirements with the team. We just kind of brainstormed. I'm finding that a lot of them are, you know, really just standard features, but I'll pop those in the chat so you can kind of see what some of the team brainstormed on, what we'd like to see. That's kind of a laundry list of some of the things that we're looking for. We are not looking for an applicant tracking type of system that manages massive job postings and things like that. So it's much more lower volume, transactional, and quality over quantity. Perfect. Okay, that's good to know. And are you looking to have the jobs posted even just to your website at all or not at all? Yes, that is something that we may potentially move to as well is really having that would be a nice integrative to integrate with our website so that we could put them on there and to, you know, showcase what we're working on more than really hoping to capture, you know, qualified applicants. I think it's more of a marketing tool, but it also will help us develop our bench strength of strong practitioners and lean. That's really our niche focus for many of our searches. Okay, very well. Awesome. That gives me a good idea of what you needed to do there. So let me show you around a little bit, and I'm just going to kind of give you my general walkthrough, concentrating on those areas that you were mentioning. and then if you have any questions as we go, feel free to jump right in as we go through here. Sounds good. Thanks, Jim. Okay, so we're going to be looking. We're right now looking at the sign-in screen. Do you see my screen okay? Yes, no problems. I might move it up to my top screen so it'll look like, so that I can make it a little bit bigger, but it's pretty good already. Oh, I've got to grab it from the top. Okay, got it. All right, I'm ready. So we'll take a look at PC Recruiter. it's it's cloud-based as all of these systems are it's going to run on a PC or a Mac so a few different ways you can access it there's a mobile app too so a lot of different ways you can access the system and you're going to be able to get logged in under your specific username each user would have their own username that way you can see who did what within the system who sent the email schedule the interview recorded the follow-up anything like that so everything you do is going to be tagged back to your username once you're in the system it's going to look mostly like this and I say mostly like this because you can configure quite a bit from the main menu bar you can control what shows up there you can hide buttons you're not going to use you can put them in your own order the records are all configurable so if you want to put in your own fields for a name record company record position record the interview pipeline is configurable just about everything in the system can be configured to your liking within here so a lot of things are going to be flexible but basically and and are those are those like um configurations for the whole team or is each view customizable what um is that how does that work it could be whole team or it could be user specific so that's up to you uh if you want to allow your users the flexibility to design your own screens on their own they can do that or if you want to design a screen on your initial training and then copy that to everyone else and that's what you see you can do that too so you have a of flexibility we kind of try and try and give you as much flexibility as we can so once you're in the system basically you're going to have a primary menu bar at the top that's going to be your main navigation the middle area is going to be for searching search results and lists and then the bottom portions for the records themselves they should click through and that main menu bar up top is going to be your primary navigation that gets you to the three main record types we handle in PC recruiter those being names companies positions so those are kind of our three primary record types that we work with The names are going to be your contacts and your candidates, probably mostly candidates, because each candidate is going to have their own name record. We can parse resumes. We can pull people in from LinkedIn, Dice, Indeed. We can map in a spreadsheet. You can even have people apply online if you have the job posted to your website and enabled, too. So a lot of ways you can get people into the system. They're all going to be in there under a name record. Then, of course, companies are going to be the companies you're working with. So you're going to be able to work with your various different companies in the system. You could even put potential client companies in here if you wish as well. So some flexibility around that. And then the positions, jobs you're looking to fill. Each position would have its own specific record linked back to the company that it's for. And each position is going to have its own pipeline of candidates. So you're going to be able to look at a pipeline view and see everyone's being considered for a certain job. You can drag and drop them through. We'll take a look at the pipeline process within the system. But that is very, very configurable in the system. Okay, so, and then some of the other elements up here are your schedule. So you have a daily calendar if you need to schedule meetings, phone calls, interviews, follow-ups, what have you. That'll sync with Outlook or Google calendars. Your roll-ups, that's your list creation tool. So that's going to give you the ability if you wanted to have lists in the system here. I could go to my roll-ups and I could take a look at a list of anything. It could be all my architect candidates. It could be everybody that I'm talking to about a certain job. It could be everybody with a certain title. It could be everybody within 80 kilometers of Toronto. So pretty much any which way you want to group people, you can put them on a roll-up list and use that for mass email communication, email campaigns, and or sequences. So the roll-up list gives you a nice way of grouping people and organizing your database. And there's a lot of different reporting options, analytics. We'll take a look at those once we kind of get in here. But I usually like to start with the company record, then talk a little bit about the position, then talk about the candidates, the searching, emails, sequences, stuff like that. So any of these records that I go to, names, companies, or positions, as I click in, I'm going to be looking at the last 50 that I looked at. So I have my recently viewed. I'm going to be able to click into any one of those and get into that specific record. So if I look at Vanderlei Industries, I'm going to be able to see their record down below. I also have a simple search up here if I wanted to search by the name. So a specific company called, and I can search their name right up. I can search by a bunch of other fields too. Now the company record is going to be entirely configurable. I keep it in three columns down here. you might keep it in one, two, five. It's up to you. You can add in whatever fields you wish. Usually on the company side of things, the fields are pretty limited. You just need the basic contact information of the company, and that's really it usually. But anything else you want to put, you can do that there. I was demoing somebody that recruits in hospitals the other day. They wanted a number of beds field, so we threw one in there. So you can put anything you need specific to exactly what you're doing in the record there. But kind of centered around the company record it's going to be two subsets of data both names and positions so if I scroll down I can show them right here this is going to show me all my open positions over at this specific company now you likely won't have quite this many my demo database but you're going to be able to see all your different open jobs so I can see each one of them in any job with a chain link next to it that simply lets me know that there is a pipeline of people connected to that job so I have an interview pipeline there so that's going to be a nice easy way to see if there's any work being done or see what's going on with that job I could even click into that pipeline and see it if I want it and we'll come back to the jobs but I want to real quick scroll down I also have a subset of names underneath this company these are all my contacts or maybe even people that I've placed over there so I can make people like hiring authority like Ben Brown maybe a couple people I've placed maybe a simple employee so I've got a bunch of different people that are linked to the specific company record what's kind of nice about that I can click into Ben my hiring authority that'll open up his specific record now I see he's the co-owner I have a place where I can look at his email his phone numbers and I have a complete activity history of every time I followed up on an interview every time I had talked with him any feedback he provided even any emails I've exchanged with him those are all going to show up in his activity history right here so that's essentially a journal of everything you've done with this specific person, be it a contact, as in Ben's case, or a candidate. And the username is going to show who did what. So everything's going to be very easily tracked within the system. Okay. Makes sense so far. Any questions out of the gate? No, I think that's good. The customization, do most people customize it? Seems like it's it's tailored towards the particular requirements of each of your clients? Or do some just take things out of the box? Some people keep it out of the box, but everybody adds a little something, a couple of specific fields that they want to track or various different things. Most people will customize it a bit, but it's pretty simple. You can add custom fields into the back end of the database, into the system area with permissions. You can add a custom field. And then you have the ability, if I go into like name, I'm going to pull up one of my candidate records here, look at Terry. So I'm going to be able to see, maybe I even want to jump it up here and full screen it. I can kind of put in any fields I wish. So if I wanted to have fields that might be like a checkbox, maybe I want to look at the language he might speak, or I have a certifications drop down, or I put in a year's experience field, security clearance, anything I want, I can create and add a field anywhere I wish. So it's really what's most important to you can show up on here, and it can be as much or as little info as you wish. Some people just use a dozen fields. Some people have 150. Depends on what you prefer. And we do that customization ourselves because it looks pretty simple, right? Yeah. Once you create the field, well, we show you how to do it. The training is included. But once you create the field, there's a quick little – you go into system, and it shows all your custom fields. You just hit add and fill it out. you can then go into the little gear icon to customize. And then it's just a matter of taking, maybe you want to drag this field over here. Maybe you want to take this whole chunk of field somewhere, or you can go down here and add a new field. This is going to show you every field, all the predefined and all your customs. So you just pick exactly what fields you want to put in there and then drag it anywhere you wish. And then hit save. So it's a visual indication of what it's going to look like and you can drag and drop those fields anywhere you wish. So once you configure it, I'm going to be able to look at all of my basic field data up here. And then I'm going to scroll on down and I'm going to be able to show maybe the activities. Maybe I want to show the actual formatted resume, some searchable notes that I might put in there, even a history of everywhere this candidate has ever interviewed. I can click and open that. That's going to show how far they got, when and which of my recruiters did it. So I'm going to be able to look at their history, showing everything that's gone on. even their attachments. Maybe I have older resumes, maybe I have their LinkedIn profile, skills summary, a little checklist I filled out when I phone screened them, whatever. I can put all my information on that candidate's front screen. Or if I wish, I can utilize my buttons up at the top if I wanted to not show attachments, but if I need them, I can always go and get them. It'll open them up full screen, then I can open any one of them. So very configurable, and you're able to show whatever information is important to you. And we train you how to do it so you can change it at any time. Okay. Yeah, so it's very, very easy to do that. So your candidates here, let's talk a little bit about searching the various different areas of their records that are going to be searchable. Of course, we have a parsing utility. We're going to be able to parse a resume. I would just go add a name and I just parse from resume. When we parse a resume, what we parse is only the fields you see here. So we're only going to parse absolute concrete fields, name, contact information, such like that. We don't parse job history because that's tricky to do with any degree of accuracy. So what we do instead is we index the entire resume for searchability. So once you parse the resume, it'll use these basic fields to build a record. So I can maybe open one off of my clipboard here or here I'll open up my hard drive. It's going to parse out the basic fields to create the record and the resume will then be stored as a searchable indexed attachment connected to their record. Okay, so I can create a record. It's going to do duplicate detection. So if for example that resume was already in your system it would pop up and it would tell you duplicate name detected You don't need to add this because the exact resume word-for-word character for characters already in your database But if it were a different resume it would note that hey, this is an updated resume, but it's an existing person Do you want to update the resume and archive your existing resume as an attachment? It'll automatically do that with a click of a button so It says the same with contacts if there's duplicates. Oh, yeah It'll look at first name, last name, email address is primarily what it'll put. And even if you put something like John Smith, it'll opt in key and say, you sure you want to add this? Here's another one. And you can look at that record and then you can go, oh, no, no, it's a different guy. Yes, add the duplicate or no, don't add the duplicate. Right. So we do the best we can with that there. So you can parse your resumes in. Another cool trick of entering records into the database is going to be our Capture app. So the PC Recruiter Capture app is going to be an add-in to your browser, which is going to let you import from LinkedIn Recruiter, Recruiter Lite, Sales, basically any version of LinkedIn, but also Indeed, Career Builder, Facebook, Zoom Info, a few others. So any of those sources – so if I go into LinkedIn and I go to pull a record in from LinkedIn, I can do that very, very easily. So I'm going to go through here. Yeah, I'd like to see that. I'm just going to get somebody's name. I just like to pull up a name. So if I wanted to get Margo Morgan Lander into my system, all I need to do is go to her LinkedIn profile, and that little click to add is going to pop up over the far right of the screen. That's going to hold true if I'm in Indeed or Dice or any of the ones that we work with. So if I click that little bugger, it's going to pull her information out into our handler, and it's going to show you, A, it would let you know if it was a dupe and give you the ability to update it. She's clearly not because it's showing me that it's creating a record. it's going to bring in her photo, her first and last name, her title. Many times it'll get contact info, especially if you're a first degree connection or if they make it public. If you're beyond first degree and they don't make it public like Morgan did here, you don't get any email and cell phone. We have some little enrichment tools. If you use HireEasy or ZoomInfo, you can click a button right out of the name record, kind of enrich the information to look up that info if you needed to. It'll show usually her location and then you can add a note. There's even options if you wanted to add her to one of your roll-up lists which might immediately kick off a sequence or you can add a write-in to one of your interview pipelines for one of your jobs right from here but all I do is hit submit it's going to create a record for the system she is now in your database I haven't turned off but there's a little link that'll say hey click the record click here to view the record you just created so you can do that too but I can also go from my dashboard there's going to be a little new names today one there's more Margo So I've got her into my system. It created the record real-time. I'm gonna be able to say I have her LinkedIn address with one-click access You put my username in here the time the date it even tagged the sources LinkedIn Reminding you where I got her and my favorite part of this in addition to the activity It's going to show profile was created was updated on today's date time But under attachments, I have a searchable copy of her LinkedIn profile that I can view right from inside of PC recruiter So all that is now a searchable attachment. So it's a nice piece because if I want a keyword search, I want to do my Boolean search here. I can go right. I like to go to advanced here. This gives you some additional field searches, zip code radius, whole bunch of other things. You can search anything you put in. You can search it out. But if I do sales and marketing, I always like to search all areas. But I could limit it and search only resumes or only keywords or only notes. But I'm going to search all because I like what it does. When I hit my search, it's going to show me where the words were found. And it's going to put the person with the most matches up top. So you see that green score column. It's going to show for Terry, I have a whole bunch of letters over there. So it's going to show me he was found in his resume, his notes, his keywords, his summary, profiles, and attachments. So he has a lot of instances. So he's got a lot of the words I'm looking for. And I can even click and do the R. It'll show me his resume down below. It's going to highlight every instance of the words. All the hits are highlighted. Same is going to hold true with notes. Notes, remember, I typed in or maybe I pasted in a little skills checklist or something like that. So I can put that data right in. That's going to be searchable right along with the resume. Keywords, I can tag him if I wish out of my own predefined lists. So I can tag him and these are searchable bits of information. The profiles, that's going to be his LinkedIn profile. So he had the word in his LinkedIn profile. It's not highlighted because it's an attachment, but it is going to show me the profile and I'm going to be able to see the word was in there. I can kind of comb through it if I wish. Another cool feature, pretty unique to PC Recruiter, you can build these PC Recruiter profiles. They're like web forms. And maybe this phone call questions one was a form that I filled out my first phone interview with him. As I typed in his answers, they're stored as searchable attachments. So check boxes, short answer, whatever. I just fill it out as I talk with him. Now I have that bit of searchable information in addition to his resume, his notes, all of his attachments. You can find his older resumes, too. Even a candidate summary here. This is an AI-generated summary you can utilize. You can click AI, and it'll generate the summary using his resume and his field data. It'll generate a little summary. That's going to be searchable data as well. So a lot of different ways. And then can that be edited and exported? You can edit it. You can also use it as part of your candidate presentation if you wish as well. So a lot of different ways that you can kind of search through and find the best person. We give you a couple little indicators under the name column here. So you'll see if they have a little chain link. That's going to let me know that they're already in a pipeline somewhere. This will get me a full screen picture of their resume. And I can see some of these red icons. Nathan was already placed and he's an employee of one of my client companies. So maybe it was somebody that I placed in the past that's now an employee, but they're still showing up, but it's going to give you that little red hands off just to let me know that that's not one of my candidates coming back in the search there. I also have a last activity date off the far right of the screen. You choose what fields are going to be shown here. I have a few extras, so I have to scroll over to see my last activity date there, but it can't be shown there. Okay. And then if you're searching for potential candidates, can you exclude client companies or even like individuals we've marked as maybe do not recruit for some other reason? you can say status like C. Adding that is going to then filter it down and search only candidates because you can mark people hiring authority. There's also a not available option in your status, which puts a little like a little X or something next to the name. I like that one because you can kind of manually mark someone. Hey, we've worked with them before. We don't want to work with them. So you can mark them out. But if I do this, now I'm looking at only candidates. So that's going to clean it up a little bit if you need to. And I could jump back and I could Add another field, add another word in my query. It's very easy to toggle back and forth and add and take away and start broad, kind of narrow it down as you get your results. And then once you do, you can do a lot of things with them. You could pull up a map. It'll put a little pin next to everyone's location if you're looking for someone near a certain job. You can do a mass email campaign right from here. You can link them to a pipeline, kind of get them started on the pipeline process. Put them on one of your roll-up lists, merge dupes if you found them. You can even customize from here what is going to show in my results screen here. So you can do quite a lot of things with all of these results from my search results here. So it's going to be a nice, easy way of working with your people, seeing your people. Clicking anyone's name, you're going to be able to see everything they've got going on. Most recent activity, oh, it was a resume review for a job over at University Hospitals. So all that information is automatically entered. I'm going to be able to see which user did that to and when. So I can easily kind of take all of my people and work with them from here. Maybe I even want to take a couple of them and link them into a pipeline. I can just go right here and I can pick one of my job openings, link them right into it. So I'm able to do that very, very easily. I'm going to pick a different page. I'm going to add some people. How to do a job. Does everyone have the same access typically or do you do different access for different employees? Up to you. Each username is going to have their own specific permissions, preferences, et cetera. So some people could have the ability to delete. Maybe some people are read-only or read-add. Some people maybe don't have the ability to view admin-only viewed custom fields, so you can really piecemeal what individual users can do. Usually base recruiters don't have a deleteability or exportability or ability to go in and affect the other usernames or anything like that, but there's a full permissions for each one of your users you can set up. And then if I wanted to, I can go over to my position. I can take a look here at the last 50 I was looking at. I'm going to go to this radiological control tech. I just added some people into the pipeline. But my job here is going to be, again, a customizable screen. I have a nice formatted description down there. This can interface directly to your website too. So if you have a job and it's marked available open and it's one opening or more, you can have this post directly to your website. We actually have a custom set up here. So you can pick one of these different templates. So if you wanted your jobs in a list format, or maybe a more condensed list format, or maybe you liked the table, you can pick and choose how it's gonna look and then all of your jobs are displayed directly on your website. Individuals can go ahead and look at any one of these jobs. They're gonna see the detail, only the detail that you choose for them to see, usually a couple fields and a description. And they can apply online if you turn that on right from here. They can apply. You can turn this off if you wish. A lot of people like this because it will allow them, maybe they want to select apply with LinkedIn. That'll let them sign in with their LinkedIn credentials, and then it'll find them if they're a duplicate in your database already, and just connect today's application to their existing record. It doesn't add a dupe. So that kind of helps with duplicate control. Then you're able to have a few fields here, or as many fields as you wish. They can upload a resume, fill out anything, and when they hit next, they are in your database. They've been applied to that job. So if you were to go into the pipeline for that job, you're going to see everyone who has applied online, everyone who you, as I did, linked from a search. So I have a nice, healthy inbox here of people that came back on my search that I think might be a fit. And maybe I took Brian and TJ and Bernie, and maybe I reviewed their resumes today. I'm going to drag them over to reviewed. So you have the ability to build your own interview process here of up to 18 steps. You call them whatever you like. You make the colors whatever you like. Put them in whatever order you wish. And then it's simply a matter of dragging and dropping for one step to the next. And as you do that, that's going to create a searchable, trackable, reportable event in the database. So you're able to see Gary McFadden would have an activity. He would also have an interview under his interview record. And that's something that I'll show you in a minute that we can report on so we can see everything that we did as a whole, everything that we did maybe as a team, everything that I did as just one recruiter. I could filter it and look at only a specific category or anything like that. so you're able to just kind of drag and drop people as you disposition them through your process and you might have what if we wanted to eliminate them or you know not not consider them so let's say that brian hinson wasn't a qualified one for this shot i can right click i can move to how to process what that's going to do is that's going to pull him out of my primary pipeline in consideration and i have the ability to put my own i think you can have up to 10 or 15 different reason codes as to why. So I could say, oh, he was not qualified. Boom, he's out. But it keeps him in this out-of-process area, so I can look at the people that are out of process. That's helpful if Jonathan comes up at a search again for a similar job. I could say, oh, he was not qualified for it this time. Let's skip him. I don't even link him in the pipeline in the first place. So that's going to be reportable too. Right. Would you need to add a node, or how easy is that to do? Because it seems like the part that, you know, trying to find out what the daily work activities for the search consultants would be in addition to kind of moving them? Is it, you know, the CRM piece of contacting them or making notes? When you say move out of process, you can, in your configuration, pick a little pop-up window. So if I might say offer decline, maybe that pops up a pop-up window where I can write a little reason. Offer decline because X, wasn't qualified because Y, whatever. So you can actually prompt it. So when you do that, it'll pop up a little area where they can type in a note, and then it moves it out of process right from there. So that's customizable. You can do that if you wish. And then that would be in the note or whenever the disposition changed action? It would be in the activity and in the action. Or if they wanted, maybe they were working with Arthur, and they wanted just to record that they called today. He seems very promising, but wasn't available to talk long. I can call him back tomorrow. I can actually add an activity and I can put in called today very good fit try tomorrow at two no time today so I can go ahead and just jot down what I spoke about I might even create a specific activity type and maybe it's going to be recruiting call or something like that so I can say recruiting call I might even make it a specific code for that and I can put an item on my calendar tomorrow at to call him back. So I can do all of that right from this screen, hit save. So that's going to let me put an activity in his history. So anybody else looking at the activities is going to say, oh, there was a recruiting call, schedule for follow-up on 7-10, username, admin, here's what we talked about. I can also see his older activity history here too, along with any email I've exchanged with him too. So I can kind of work through my process that way, and then maybe I can simply put Arthur Smith, move to contacted, pop him right over there. And then that'll show up on the calendar or your to-dos for tomorrow or whenever you scheduled it for. If you go into schedule, the 10th is going to be blue because there's something on it. Go right there. That's going to be on your calendar. Arthur Smith. I can even click right to name and it'll pop his record open right off the calendar. So this is like a to-do list that will pop you into the specific area that you need it to be. And we could choose what we want to integrate with Outlook because we might not want to do all the scheduled calls in Outlook. but just the interviews, that sort of thing? I think it's an all-or-nothing integration. You can either integrate it or not, and it'll show everything there. But if you have a more populous calendar, I use my calendar. I use PC Recruiter as my CRM. So I have you on my calendar in yellow because I have a scheduled call. So yellow is my scheduled call. I throw an alarm on there. I have other important follow-ups, not-so-important follow-ups, anything like that. And then if I go into your record, just to kind of show you a real-world example, I'm using this for real. I have very basic data because I'm not recruiting. I'm just talking to people about PC Recruiter. So I just pretty much need contact info. And then my activities here, there's the email where you accepted my meeting. Here's the email where I sent it out. So I've got every email we exchanged. Here I show an outbound call. I use RingCentral. So it integrates with that, puts an activity in there. So I can see everything that we've done. I can see all that I've got. And I even, we actually kind of made up a little pipeline in PC Recruiter. so I keep a pipeline of everyone I've spoken to, and I probably have you under my demo scheduled option. I'll move you over to demo one just to remind myself and put you in my pipeline that we did. the demo. And then I know all the other people that I have to follow up with in the next coming weeks of people that I've worked with. So it's going to kind of, I'm using it as a CRM, but it's just like that for interviews. Same basic idea. Right. Well, that's good to know. You use it for your business development as well then. Because that'll be a tool that we'll certainly be looking to use for that also. Yeah. So it's going to work real well for that. Now, if you wanted to report on what you're doing, going to analytics, that's going to give you the ability to build your own custom reports. I can look at metrics. Maybe I wanted to do a pipeline activity metric. And in mine, I just show first, second, and phone screens. But you could show every one of your interview steps or only two of them. Or I could live pull out first interviews and only look at second interviews and phone screens. Maybe I want to go by job and see what jobs I've touched in that time frame. And I could even pick what time frame, this month, last month, this quarter, last year, whatever. I could do a custom range. I can even break it down by employee. That's only me because I'm the only one who works in this demo database, but I can see what my employees are doing or what clients we've been working with in that time frame too. So you can kind of see all the data right here. You could also go and look at your email campaign. So if I wanted to look at my email campaign that I sent that maybe was a plea to update your contact information in my database, I can look right here and I can see that I have a 93% open rate, 74% click rate. Nice. I can even see who clicked what, how many times, and what length they clicked. So that's all collected data and trackable in my reporting area here. And that all goes through your Outlook mail? Or if you wish, maybe you want to kind of not chance sending too many emails, or maybe your mail provider has a limitation of 500 a day. You can also use something like SendGrid. If you wanted to relay it through SendGrid, then you don't have that limitation or the worry of your Outlook sending out too many emails. So either or. But those emails are drafted, composed, and sent all within PC Recruiter. We even have a sequencing tool that takes it one step farther. So you can build a sequence that might say, send an email, wait two days, send another email. If they open that second one, add them to my call list. If they don't open it in four days, send a third different email. So you can set up a complex sequence in there that you just pretty much set it and it just goes. So you can send some emails or you could even say, if they click this link, then put them on my call list. And I can go into sequencing, and here I have a call list of all the people that looked at my specific email that I sent. I could even go into them, look at a little preview of their record, preview their activities. If you had RingCentral, you could even dial their cell phone right from here. You could even put a call script in. So the recruiter just needs to click the dial, read the script, mark as whatever. It'll go right to the next person. So right to the next person, click the dial, read the script. RingCentral is a phone system, an online phone system. kind of a VOIP. Here's mine. Oh, right, right, right. So it's going to be click-to-dial. It integrates to PC Recruiter for click-to-dial. That's also how we text out a PC Recruiter through RingCentral. We didn't build our own because they already had it built. We just integrated with them. And it's nice because they also have a mobile app. So your number follows you wherever you are if you wish. You can answer the calls on your cell phone, your computer, and it's totally mobile. So we are all remote. My desk number is wherever I happen to be set up. by RingCentral followers everywhere. That's where we are too. And so that's important as well. So that's good to know. I was going to ask about the texting. So it allows you to text as well right from the system? Yep, from the system. You have to have RingCentral. So for that bid, you'd need to have RingCentral. But if you have a person's record, I could go into – let's go to somebody that has a name record there. So I could go into a specific record. there's going to be a little button for click to dial and a little button for click to text next to most every phone number. So you click the phone or if you click the little text button, it'll send a text and then you can send the text through the RingCentral interface, but it'll record the actual text in the activities, which is nice. Oh, very good. Okay. Or maybe the text is part of a sequence that can work like that as well. Okay, so full reporting, sequencing, tracking. I also want to show you something else that we have now released, and it's a little bit of a different look and feel. We have a second product called PCRM, a little more of a CRM product than PCRecruiter, and it's part of the package. It's just a different logon to the same exact database. So if you have PCRM, you might have maybe your people that do more marketing, they might log in to this version of PCRecruiter. And they're going to be able to go and access the exact same data, but this one is going to be a little more modern of an interface. So I can look at the same records that I was looking at. There's Terry Stidham, the same guy I was looking at. I have a customizable workspace here. see a lot of a lot of the same data but this one includes a little different there's a deals workflow in here specific to deals so if you wanted to have your marketing people using this for companies your marketing toward you can create different steps in here you can drag and drop them through this process and you can kind of work with this deals type process there's also a simpler sequencing piece in here too so it comes with the package you can use it not use it have some people on it, it's up to you. But we do include this there. It may someday be spun off to a separate product that could even be a CRM piece independent of recruiters. But right now, we've included it as an option on the same database. So it comes with it. And some people, maybe you like this interface better. Maybe you like the other interface better. It's up to you. I see. So does it have the same capabilities? All the same capabilities? Almost everything. The one thing when they've made it to do CRM. It includes like the same buttons, companies, names, positions, rollups, schedule, the exact same sequences, the exact same analytics. But it's going to give you, like if I look at positions, I'm looking at the same positions. I can look at the same pipeline. So everything is going to be in here. The only thing that it doesn't do quite as well is searching, but they've added the lion's share of that in an update that happened just this week. so they've actually improved the Boolean searching in here as well so it almost does everything that the other version of PCRecruiter does just in a new interface and adding more CRM functionalities but so we're still working on kind of adding there's going to be an integrated DocuSign if you wanted to sign contracts and work with that through here that's coming out so they're working on some different things through there sounds like it's your your up-and-coming project product that you're demoing with your existing clients, which is smart. Yeah, it was originally kind of conceived to be a new interface that would replace this version of PCRecruiter, but they took it in another direction, added so much CRM functionality that it's kind of a separate product, but we're including it so our customers could use either. And maybe someday some people will think, oh, I only want to use PCRM. That's cool. But some people really like the PC Recruiter here that they know and love. And we have such a client base that is so dedicated to us that so many people come back, oh, I used it three years ago. And they like it, they're used to it, and they're buying it because they know it inside and out. So they might not want to use this version. They like this version. So this version, still getting the updates added to it, and we've kind of made it so that a lot of the buttons kind of look the same, the terminology is the same. So you could use both, but really one or the other. They're both included for you. Yeah, because the other one does seem more sleek and modern, as you mentioned, and simpler almost. Especially if we were to share reporting for some of the executive leadership team, for our monthly and weekly update meetings. that it seems like that would be maybe both have the same reporting but it seems like the reporting might be simpler or sleeker as well. Yeah, this one's a little more modern. It's easier to pick up for someone who has never used it before. It's easier to pick up. That was kind of what they were aiming for too. The other one is busy. There's a lot. Maybe newer people like this version but recruiters that have been doing it longer like the other. We get flexibility. So that's what we've always liked to do. Any questions? I'll talk about pricing, but just wanted to make sure, any questions on any portion or any features, functions that we've looked at or anything we haven't looked at? I think I'm good on that. But potentially, what if you could briefly walk me through a prospective new client process and that funnel again, if you can. who we're talking with, who we're sending proposals to, and even with bill and thirds, is there a way to look at that? We're not looking for this to be a billing solution for us, but it would be nice if it could trigger or we could trigger emails to be our billing department at certain areas, or maybe that could even be sequenced to some extent, that 60-day invoice, for instance. Sure. You could set up various different automations and sequences in PC Recruiter that are triggered by events. So maybe a placement, and it might be something like 60 days after a placement, send an email to this person to remind them to do that. So you could do something like that. Our automations area is back in here, and I can just go auto, and the automation. So you can kind of pick and choose all these different options. So when a new position is entered, send a notification of some sort to someone, or sometime after permanent placement. Send a form letter to someone. So that might, two months after your permanent placement is recorded, send this specific letter to that person to remind them to send an invoice or something like that. So you can set up a lot of automations. A lot of these are kind of basic starter points or the build and automation that you kind of pick your own trigger, pick your own action. Or you could even set up automations linked to a specific pipeline category so that maybe when you move someone to out of process, it automatically sends them the rejection letter. Or when you move them to offer letter sent, it will send someone an email to remind them to send a proper offer letter. So a lot of different things you can do as far as automations, reminders, automated emails and such. Okay. And then AI capabilities and intentions going forward with that? Yes. So the AI, so we do have that summary generator we talked about. We have an email generator too. So if you're sending an email out of here, we're going to be able to go to the AI generator, and that will allow you to say, I want it to be casual, initial contact. It'll produce something. Then you can say, mention a sales job, kind of bounce back and forth with it, and then you can either accept, rewrite, or kind of add another query to it or add another qualifier to it. So content generator as far as an email generator, also that candidate summary we talked about. There's a job description generator too. And then there's an AI search. That's one of the things we're improving upon. It's okay. I think I like Boolean, so the Boolean works a lot better, but we are improving the AI searching as well. And there is also that was just recently added, so recently a fact that I don't even know where it is. It was just like yesterday put in. We have an auto match. So if you put a position into PC Recruiter, there's a button you can click that it will automatically find the best 15 matches of people that are in your database. But I haven't found it yet to see where it is. But somewhere there's a little thing that you can kind of click to match, and it will let you find a match there. Okay, very helpful. Thank you. Sure, so we're kind of working with that as well. So, yeah, so you can kind of track your individuals who you've placed. Some people will even create a little checklist within the system that might be the onboarding checklist to check off as various things happen. So you can kind of do that through a little profile checklist if you wish as well. So things are so configurable that you have a lot of different flexibility in what you can check and track within the system here. Does it have sourcing capability? Are you able to look outside here? Is it a Chrome interface? Sure. Other than the capture piece is gonna let you, if you're out on any of these sites, you can pull people in. We don't really have anything that goes out on fetches for you, except we have integrations with Zoom Info and HireEZ. So if you're looking at a name record with NPC Recruiter, right here you can say, update his information using HireEZ, and it'll go find more information about him, pull it back in and update it in the record. Same with Zoom Info. So we integrate with those two if you happen to have accounts with them. I think there's also a Zoom Info integration up here, so if you wanted to search using Zoom Info, you can actually click that. It'll launch Zoom Info and let you then pull people in from there. There was an old monster, Monster Career Builder as well. I was going to say, is Monster still in business? I think I heard they declared bankruptcy just last week or something like very, very soon. Nobody uses them really. Yeah, they were 20 years ago. So we integrate with a few. So you've been around for a while. Yeah, we founded in 98. So we've been around quite a while. 98, right. And I don't think I've used the product, but it certainly, I had definitely heard of it. How many, tell me a little about your company. Where are you based? How many employees? How many clients? We are based in Cleveland, Ohio. And I believe at this time, all of our employees are right here. We're all remote, but we're all in the area here. We don't have anyone overseas or anything like that. We are right now just about 20, 25 employees. we're not real big we've kept it small as we've gone we have about I'm gonna say 2,000 2500 customers using us or so anywhere from one to two users to 20 to 50 to more users so we're scalable we grow so if you need to start small and grow large you can add users at any time our contract is kept flexible that way too so if you at started with five users you can add users even monthly so if you hire two new people you can go up to seven maybe the next month one left go back down to six. It doesn't reset your contract and you can add users flexibly anytime you wish. So our contract is made to scale with you that way. That's nice. Is there, yeah, and what is the contract length? We offer several. So you can do month to month, a two-year or a one-year. The month to month is 125 per user per month. The one year is 115 per user per month. The two years is 105 per user per month. So those are your three options. You can pick any of the three. Most people go with a one year because that's a nice, nice, gives a year to try anything like that. So 115 per user per month is a one year and then there's a one-time setup of 950 which is one time for your whole office. That is going to cover the setup and creation of the database, assistance for our web team hooking it into your website if you want to post jobs, assistance hooking it into your Outlook or Gmail to sync, assistance setting up the capture piece, and 10 hours of training with one dedicated trainer on both packages. They'll train you how to utilize the system, train your team how to do anything. They're also helping you to configure the database but showing you how to do it at the same time. So you'd have one trainer works with you start to finish to do that and then they would also get you logged into the LMS. So it's like a train at your own pace learning management system. There is also a help desk. You can submit tickets. If there's a learning center, you can take a look at various different articles and how-tos. You can also chat us on our website, too. So there's a number of different ways that you can go to find information. Is there phone support? Yeah, phone support, too. Absolutely. What are the hours for that? We are here live about 8 to 7 Eastern Time is the live answer times. The chat a little outside. that because sometimes some of our support team picks it up a little bit later. But usually about eight to seven is our hours. And then obviously systems are monitored 24-7. Sounds good. Sounds good. And is there any way to bring in groups of individuals from LinkedIn with that import? Say there was a, you know, the existing projects that we're currently working on, if we wanted to bring in a group of individuals that were under a project in LinkedIn, is that something that's available? Well, there's no direct integration from LinkedIn projects into PC Recruiter. However, if you can get those into a CSV, which I don't know if you can or not, If you get into a CSV, we can pull in an entire CSV. So we can map that in right from the same place you go to parse. I could say that I want to import a list. You can map in the fields, and you can drag and drop those into whatever fields you want in PC Recruiter. So easiest way to do that is going to be get it out into a CSV from wherever you get the data. You can import that anytime you wish as often as you like. You can also go through your LinkedIn, and you can parse people in like we did using that Capture app. So you can do that too. Okay, so as you do, you would do the research in LinkedIn, and as someone looks good, then click to add them one by one probably is what we'll have to do to get up to speed, right? Okay. Yeah. Okay. All right. Okay. In a pretty quick process, we do everything so we would email the paperwork that comes through in a DocuSignable. It's actually PandaDoc, just a different name brand of DocuSign. And that will give you the information that you can sign up. So you sign there. Once you get that and sign that, shortly after you sign that, they would email you an invoice for the setup in first month. Once that invoice is paid, a day or two and your database link is set up and it's ready to go. So pretty quick set of process. Training would start shortly after there as well. Okay. And I guess since you have the monthly option, that serves as a trial as well. If we wanted to do something like that, try it for a month and then go from there as well. Yeah. Yeah. So you could do the month to month if you wish, but all of our contracts also include an acceptance period of 90 days. So that's going to give you the ability to utilize for 90 days risk-free. So even if you sign a two-year agreement, your first 90 days, if anything happens that it doesn't work or you don't like it or it's just not being adopted by your team, you can drop out, no early termination fees, and we let you out of the contract. And then they even will refund any of the unused setup. If you only took a couple hours training, they kind of find out how many hours, bill them at the hourly rate, and sometimes credit back any unused training time if you had that. But that gives you the flexibility to quit at any time, but it still gives you all of the training and the proper onboarding. Because a free trial, you usually don't get a whole lot of training and you just get people in there. They don't know what they're doing. They get frustrated and they're like, okay, I'm out. So that's why we don't do a free trial, but we do do either a month-to-month contract you can sign up for, or every other contract has a 90-day acceptance period that you can work with. So that makes it more flexible and gives you a little safety net there. All right. That sounds good. So to give you a sense for our process and timeline, we're looking at, you know, obviously a multiple systems. Currently, we're going to narrow those down to a handful. And then I'm on the project management team with more of an IT process improvement specialist and one of the executive search consultants is on our team. So they're going to help me narrow it down to, you know, maybe two or three, then the entire team will review and make a final selection that we'll present to the ELP, our leadership team, in the beginning of September. So our timeline is to have this in place towards the end of the year, probably the November timeframe, sometime in November. Okay. That is fine. Yeah. And if you need a second demo at that time and we happen to make the shortlist, give me a call. We can set up another demo or even a quick, we want to cover a day in the life or a quick, we want to look at these 20 processes or anything like that, I can certainly set that up. When would be an appropriate time for me to follow up if I don't hear anything back? I would say within two weeks. We're having a meeting on Monday to where I'll review the summary of the ones I've demoed so far and talk to, and then we'll narrow it down from there. But I would think the team would want to take a look based on what you've described to include you in that next phase, which would be to have this small team maybe look again or get, you know, even a, you know, a 30-minute demo or something with you that will just cover that without all the other questions and information that I've shared, though they might have some as well. If you're okay with that, that would be the So that's the next step in the process, I think. Yeah, no problem at all. No problem at all. And then that would happen by like mid-August. Okay. That is just fine. I'll put you down for a follow-up on my end in a couple of weeks. Touch base maybe the end of this month and kind of see where things stand from there. And then we can kind of take it from there as next steps are coming needed. Sounds good. And do you have follow-up materials that you can send on the user pricing that you mentioned and such? I can pop it in the email. Put the quote together, yeah. That would be great. Yeah. So you mentioned it was 115 to 125. And then are there other add-ons to integrate with LinkedIn? Obviously RingCentral, I guess we look that up separately and purchase that separately as well. So, yeah, they're totally separate. Anything else as far as do you need any other APIs or plugins or things like that? No, anything else is optional. So RingCentral is really the only one you need that to be able to click the dial or click the text. Everything else is just if you wanted Zoom info or higher easy or any of those. So that's just optional stuff. Right. And the LinkedIn integration add on. What was that called? that little button, is that just built into your system? Yep, that's included. That's capture. You can download it from the app store. It connects to your database. So that's included regardless. Okay. Got it. Okay. Okay. Well, I appreciate your time. That's very helpful. And I will circle back with you on next steps once we talk to the team. For sure. I look forward to it. Let me know if there's any questions in the interim, and I will send you some pricing info all summarized. summarized and then any other questions, let me know. I'll check in two weeks. Thank you. Sounds good. Okay. Have a good day. Thanks for your time. Thank you.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 446.087489,
    "salad_processing_time": 355.1457998752594,
    "overall_processing_time": 446.087489,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  You have not entered any numbers.",
    "job_id": "b71274e8-10bd-4e34-84e7-f824b44aa425",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  You have not entered any numbers.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 5
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "billing",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3009413647037.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}