{
  "recording_id": "3009851470037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:25:49.801109Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:25:49",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hey Robin, what's up? Hey, how much, how are you? Hold on one second, I'm trying to do my input and contact footy. He asked me about how to clear cache to get PCR mail icons to work. I'm just and then her, she was here at Monaghan. Trying to keep up on my notes, my activities and stuff. I know. Thankfully having a little like AI thing at least is helpful for my meetings because I lose, jumping from thing to thing, I would lose stuff all the time. What's up? I wonder if I did that and then we kind of stopped because of all the like, let's find out. I don't think that's a Kathy change. That looks like me screwing around, my guess. Because Kathy was going to... Initially, it was there. So if you... Did you adjust... Would you have adjusted it afterwards? Is that what you're saying? I'm thinking, yeah, because I know what I've seen with Kathy, she does not do it. A credit like that is not going to automatically get applied. You'd have to kind of take a payment from... Generate the next invoice, and none of that's done. We don't keep up. Let's see. When the next invoice gets generated, though, is it going to... It doesn't automatically apply. No, it does not. You have to basically generate the invoice. Excuse me. You basically have to generate the invoice, take that credit as a payment, like that overpayment, and as a payment for the next one. But then it's kind of weird how you have to do it. And then you have to skip the next invoice, like the next recurring. it's kind of like a little clunky my opinion but whatever that's how we have to do it so i don't i'm so confused on this because i swear to god they were saying like they say one thing and then they say something else and then i think i figured it out i think that the problem is so they're not actually in the city of chicago so i think that's why they don't have to um pay for the that's why they don't have to pay to they don't pay tax I tried to I couldn't find the exact like whatever yeah it has something to do with I found whatever the description was like basically Chicago like if you're using software like if you're using software it's like online Chicago still wants their money wait bill said it was whoops yeah that one's specific to chicago but if they're the state of illinois doesn't do that it's local only so i'm thinking it's probably a particular like they don't have to we don't have to do the state tax because they're not somebody not downloading but then there's some other ones that all of a sudden are popping up in that tax menu um like who is the one shit who was it called hold on one second I need to fix this first of all because then there was one email like oh it's about a threshold and I'm like well that's kind of contradicting what you said I don't know it feels like it's not that complicated but then you'll see it is complicated I'm like, well, I just got to be able to explain, like, why. And he goes, well, then tell them to call whoever their rep is for their, you know, wherever they live. We don't make the laws. We just got to follow them. Okay. So this is WorldBridge, right? So I have to change this more than. WorldBridge partner is Chicago. That's not it. I hate, she wanted to say World Bridge. I'm like, oh, there's like so many different World Bridge here. This is just World Bridge Partners Inc. Yeah, they're just World Bridge Partners Inc. Yeah. I know. They were something else before, and she was like, I don't want to say this. I'm like, all right. And then I'm like, all right. Yeah, I think they were World Bridge Partners-Chicago or something like that. Or SC Chicago Downtown. Yeah, Downtown might have been, yeah, that sounds right. Okay, so this invoice. So now, like, there's not just the Chicago one, which is kind of what was leading to all those other issues. There's like Morton, Illinois, O'Fallon, Illinois, Park Ridge, Illinois, South Elgin, Sycamore. So what are they called? Oakbrook? Oakbrook. I don't see that as an option. so then they don't that's why they don't pay taxes so then for the next invoice because they're on auto recurring okay so let me go into the recurring here I am going to put in this note area not in Chicago they are in Obrook It's not an out-of-state tax. So I'm just going to put this note in there. Okay. So what I have to do, bear with me. I'm so sorry about this. I've got to think here. See, somebody checked the box. They were saying tax, Chicago tax. No. No. I'm just going to take that out. I'll just say automatic calculation, do that. Okay, so now I've got to figure out, bear with me one second. I'm going to go to, and might as well make sure this is fixed. They are 15 users, right? Yes. Okay. just in case because if they have been going in, as we know, some are kind of screwed up. I'm still waiting for – I've called today, and I've emailed her a couple times. I got two refunds I need issued, and I don't know why she's ignoring me. That's so helpful. I'm sure – I mean, she's super busy, but I really, like, I need this done. Yeah. Yeah. one was probitas like some I just know can I credit you I I just know Ben Williams just probably just better to refund to shut him up so I guess it's paying on time he's kind of historically always behind we finally got him current and okay so so for this one okay 15 users okay so I got to change this to this okay so I gotta say okay so that's good let me save this without the tax Then what I have to do is use... whoops when's the next one? Hold on one second. Shit. Let me go in another way. Their last invoice was what date? I need to make this World Bridge Partners. I need to make this dated. Invoices. So they got invoiced on the 7th. Why was the other one a different date? Let me get out of here. Transaction list. Why is that one that date? Oh, maybe for the 4th of July? Possibly. Okay, recurring transactions. When do these go out? these go out on the fifth of every month okay so maybe it's because of a holiday okay maybe that's why they go on the set so I need to make one for August 5th so we're going to use change this to August 5th Okay, so I need to make the invoice and save it. Okay, now I have to skip the next, skip next date. that way their next recurring will go on September 5th. Now I got to take this payment. Well interesting, why did that say that? okay well it didn't apply that which is interesting okay I think we're fine you think we're good yeah if I think it won't apply to a recurring but if I made it it did showing this so I think we're okay it's showing is like a payment that has been made towards it, which I'm really kind of concerned about because I don't trust all the old historical stuff. But maybe because I did it this way. Yeah, it's showing balance 941. Payment on 7-7. All right. So, all right. Yeah, it's showing that little bit of a credit on the next one. it is okay cool great yeah because if i do if i wait for a refund i don't know it'll be days so no i i told her she she didn't have a problem with it being on the next bill um okay she was tell her if they if for some reason call us immediately because i'm still like not trusting everything i really hope that i should really look i used to have a roll-up list that i started with I wanted PS3 to go through people that had a negative accounting. I hope that didn't stop paying people stuff. Oh, I didn't think about that. I don't know. With this new system, it would not apply it automatically, but there were some people here. Let me see. A regroup. Let's see. Are they still in here? Oh, can I ask, can I just run a script and get rid of that row? Or do you think, I don't know why they're, do you think it's, do they reply back to me? Support to QA. What name are they trying to use and what name is the person? Is there an informed name? Okay. Hold on one second. Yeah, don't remove it. Don't remove it yet until we know for sure. Yeah, I'm going to have them look. I don't know if it's because it's analytics. Like, why would it stay in that table? That's what I was thinking. or buff, that's what you put in there, but that's what makes the most sense to me. Like it still needs the ID number for some tracking maybe, even if the letter is deleted. They had a whole bunch of letters. They're trying to delete them and do some other stuff. There's two different letters and two different databases. One letter in two different databases that they can't create because the name already exists. She's not wanting to rename them. But they deleted the letter. So if she would have renamed it, then deleted it probably would have been fine. But that's all I could think of now. First I thought, oh, great, we made a recycle bin. Why didn't I think of that sooner? Here, go delete it out of your recycle bin. And she's like, no, that didn't work. And I'm like, shit. Okay, I want to check that out. I would have thought that that would work. I thought for sure but I didn't want to go in and do it on her database either you know it's just weird that clearing it out of the recycle bin well it's weird that it would still be in the letter table anyway but yeah so I think the real issue is it's in the letter table it's not coming out but they're also self-hosted too I wonder if that's the same did you try to do it on yours or not yet um well I just figured Well, I mean, I had no problems. My letter was gone. So I don't really know. But they're also self-hosted. So Alliance personnel. Let's see what happens with them. Alliance personnel. What happened with their negative balance? Why do I have so many damn windows open? All right. Nothing's in there anymore. No, I don't want that one. I want, what tab? This one. Here, let me go to... Did I say Alliance Personnel? Because some of this stuff in here is like so old. You have a zero balance. Oh, shit. Maybe. I don't know. Now it's saying zero balance. They used to have a negative. Well, they probably, maybe they cleared out the old stuff, you think? Maybe. Maybe. Test resume delete. What are you talking about? Why does it do that? Select all from the layer. What are you talking about? Why does it do that? This is like so kind of, um, Oh, tricky because we got two systems and either one of them are very good. Right. Yeah, I don't know on this one, too. They had 193 from 1-4-20. But I feel like somebody had something huge. Oh, I know what you're talking about. It's the one that Jim let come back when it was someone who had never really paid us before. No, that was a whole another issue. That's a whole another issue. Oh, boy. Okay. Super annoying. Great. Why is it doing this? There's something wrong with my workbench. Did it let you pull up the letter underscore records table from SQL workbench? It's mine. It did. but then it started getting a little weird looking like it like a small box or something I don't know yeah I'm getting an alert conversion from type byte to type string is not that easy and then and then it was working but then I lost my run query box it was kind of weird and then I hit a phone call so Okay, let's see. Great, great, great, great, great. And it's not going to let me tab through. Fantastic. Why are you doing this to me? Well, I changed my password. Now I'm seeing this error. Hmm, I wonder why. I had this one guy. I'm like, I'm not spending time with you. I don't even think you're supposed to be using the contract count module. he's like, oh, we're not getting notifications. I'm like, well, your outgoing mail settings is not passing. You need to, you know, go in and make sure you use the sign-in method, you know, send him a screenshot step-by-step. It's still not working. We did a test. Can you... And I'm like, and I'm looking in the database. I'm like, well, you don't have any letters selected. He goes, well, is that going to disrupt things? I go, honestly, I've never seen somebody try to use a feature that has never been configured or use the time sheet feature oh i'm trying to use timesheets this some dude random dude and then and then i'm so then i'm like you didn't i go you really should configure it because they control the content of what's said and things well i don't want to disrupt it disrupt what it doesn't work so anyway so then um i just told him like i don't know i've never had a person that did not configure their timesheets and i'm not going to test it like take out all my letters and see if it works because anyway you're either going to do it right or you could take the risk I don't really care sign you if you could you know you don't want to take the time to read it or do it and then I looked at it that going I go your outgoing mail settings is still failing and he's like so I said like make sure you do this but you know so second time it's home oh I didn't go to that area well there's why you didn't follow my first set of instructions. Idiot. Like, I literally said, here's why. You've got to make sure you use the, I think it was sign in with Google. And, you know, you've got to go to system, email setup, outgoing mail settings. Literally had a screen share, I mean, a screenshot of what the screen looks like, you know, back and forth, back and forth. While your outgoing mail setting is still, you know, did you, oh, I didn't go into that area. Oh, but it's good now. Tell us a first. Great. You're helpful. I sure did. Order. So fill me in on what is going on with JobCom because I'm, like, getting a little nervous by words that they're saying in the meeting today. They have that Job.com database. And we kind of set up timesheets. but they're getting a conversion that, but they want this set up for timesheets as soon as possible because they have a bad thing with Bullhorn. They're afraid they're going to get shut down. They're not going to be able to convert that data on top of this if they start, if they. They're not going to be able to add the data on top of what? If they start using this job.com database and start putting contractors into placements and timesheets, They can't import data on top of that from a conversion. I think that it's going to go into a different database first and then come over. But then you don't get the send-out records. Are they somehow doing that in the back end? I don't know. I don't know what they're doing with that. I'm like, you might want to talk to Mike because normally when you do a conversion, it goes to its own database, you know? Yeah. And so then after that, then we'll figure out moving the records over if we need to. but that's going to be, that'll be something else. I think probably what will end up happening. What happened to Bullhorn? I don't know. I just know that they were coming back. Yeah. But they, I said. It was not a good situation, if you could tell. I go, yeah, like, oh, you know, you people, you leave, you see something fancy, pretty. I go, but then it's just kind of like those people that you used to date, they looked really good, but no substance behind it. Right. I said something like that. I go, you know, I'm sure we all dated one of those. They laughed. They're like, oh, yeah. But I did show them. I was kind of funny. I showed them PCRM, and she was kind of excited about that because it looks similar-ish to Bullhorn. So I think that they may end up having their, some of their users use that instead. The ones that don't need, like, the admin stuff. The two of them are still going to be working at it. 9, but they said that it kind of functions a little bit similar. So I'll walk through that. That part's good at least. Coming from Bullhorn stuff, I know that people have, at least visually, they don't really love it. What am I doing here? Oh, there we go. Oh, I remember. What was his name? Jeff Colonial came from Bullhorn. He was so mad that you can only do 50 keywords because his searches are insane that he does. He gets very, very, very, very, very, very particular. So that's why when I was first seeing the PCR9 or PCRM search, I was like, oh, God. This dude would flip a lid if he saw it. He would be not happy at all. yeah I'm sure that that would be it yeah having to put like each word like in a chip when he was already mad that you can't just free type more than 50 like search terms like you can't do more than what is he typing what is he searching for oh my god his searches were insane like literally I mean he's a database guy he places like every little thing is like a little code that he does like it's it was bad it was like oh well yeah and at first you know you show him like you know here's some few oh no the first time he said here's a search i'm trying to do i was like oh my god i don't know if i've ever tried to if i've ever even seen anybody even try to do a search that was that detailed i think i helped him some with things, but the bottom line is that trying to search to, like, that's so many things. Like, how is that even productive for you? If you're trying to pull back something specific, maybe, but still, that doesn't really make sense. He walks like, I want this, this, this, boom, here's my people. So he's got things like coded and yeah, he very, very detailed on his data. It was a fun conversion. Nice guy. It's like, wow, this is a lot of work for a one-user license. I think he went up to two for a little bit, if I remember right. I don't know why this won't let me run the fucking thing. Oh, that worked. Okay. Oh, because you typed it in. PassY. PassY. Okay, close, open. I would love to spend a little bit of time on cleaning up the PCR mail setups. Oh my god. We spent too much time on this. I know you mentioned that and I'm like, thank god. Spent way too much time. You get into PCR, I'm going to go to configure mail servers. I'm here at the top right. My whole thing was like, hey, this needs to be done. Why will it not let me to an order by? This does not make sense. Click configure. I really need a better canned response for this. I know I've send this like so many times. Configure, choose mail servers. Where did I sign in with Microsoft? Did I do it in a ticket or did I do it in an email? I'll just copy this. How have you been? We're both just like sitting on the phone. Let's see. I think that's probably right. I need to send Deva. Thanks. Thank you, sir. No, resume test to me. I need to send her an email because I filtered that. for that but I got it figured out because I was confused on it yesterday and what they were saying didn't make sense. I don't get it. Okay. Okay. All right. I think that's it for now. Okay. I think that's it. Oh, if anything else comes up, let me know. Just a reminder, I'm... Out tomorrow morning? Yeah. I don't want to go. If I had a standard, I'd actually rather work than go. At least it's worked. It's crazy since then. It's harder to work now because now I'm so used to, one, my bigger laptop screen and my bigger monitor. I just go to one screen and I'm like, so you said juggling all these windows. I'm like, ooh, I don't know how I used to do it being on one screen before. Oh, do you only have one screen? Well, when I'm there, I bring my laptop. Oh, when you're working with your laptop. Yeah. I have a – which it doesn't – you couldn't really use this doctor's office. But I have a, like – I have a portable, like, monitor thing. So it's just – it's basically like an iPad, but it doesn't do anything except – it's just like a screen. But that's really nice if I, like, decide I want to go work. sometimes if I work at like someone else's place or if I want to go to like a coffee shop then I can at least have two screens it's not the same because it's small it's like basically having two laptop screens it's not the same as my nice big monitor but it wasn't that bad and it wasn't that expensive it was only like it was less than $100 I think it was maybe like $80 or no that's not true I got it on sale. It was normally $80. I got it, like, because I've had it for, like, two years, but I got it for, like, $65 or something, which was really cheap. Wow. It was not that good. I like that thing. It's nice. I'm using it when I was working in the airport one day. Oh, what was I going to do? Yeah, I mean, I... Yeah, let's see. What did they say in there? Support to QA. What name are they trying to use for the form letter? Yeah, let's see. I'm sure they're gone already. I should have jumped on this. It's self-hosted, so it's boom, boom, boom. That's the other thing. You don't know. Is it like their version? Is it mine? I didn't notice a problem. What do you mean? Deleting the roll-up? Deleting the letter. Yeah. I mean, it could be that they use this letter. I don't know. It's like per my voicemail. I don't know. I don't know. I wonder if I can do it in PCR. Where's their name? Database. I'm logged out. Username, password. Database. is this one is in the Atlanta, CFS Atlanta, CFS Atlanta letter is named per my voicemail. Do I still have that in line? Do I still have that? Well, All right. And I am probably going to jump out of here soon because I think my son's going to go back to school. So a little change of pace. And he's talked about now leaving at six. So. Okay. Here you go. I'm going to spend a little bit. I'm like, no, stay. Stay. I'm like, I like having you home, even though I'm always working. it just feels you know I like I like that it's nice to nice to I'm like going crazy because like I'm like thinking like I literally have maybe five weeks and all I've been doing is working which I need to totally need to but at the same time I'm like oh this is gonna go by so fast yeah I know they're both so busy like Marisa's like almost always working or she's out with Ron and I'm like It's like little things in passing here and there. That's sad. Yeah, that makes it hard. I was trying to test this because the board bench is being stupid and it's giving me a really hard time. I'm trying to run that period again. Of course not, of course you don't want to. I think it's a specific formula. I don't know. I don't select everything. Sometimes the way they name these tables and everything. It surprised me. Oh, I wonder what's one of these columns. Oh, my favorite is specialty underscore three for name status. Which one? For name status? Yeah. Is it field on a name record? Wait, no. Specialty underscore two. Makes me so aggravated. Why are you doing this to me? What is the issue here? Yeah, it just will not pull. I just don't want to pull this at all. It's just super annoying. Perfect. Oh, that one worked. There's got to be a value on one of these that's super messed up. oh Steve Margolis left a message ugh uh oh that's my son oh he's such a pain in the ass lucky you well it's not for me he didn't get a sign to me he oh okay that was one of Jared's least favorite people because there's like he's always calling in for Dana Cohen or whatever but he's not, you know, like, but he's always asking for stuff he shouldn't. And it's like, they want to pay for like one user. It's like, you guys are like, and he, I think he would, I actually they are paying for a new for two now, but yeah, it was always like always some really big detailed thing. And, and Jared would get stuck with them or he would message Jared directly. And like, I, I just remember Jared was like, I would be, I would not. It's like your two users, like, gosh, I wonder if he, I think we want to save him for a while. It was like one. Oh, this headset. Wait, I'll suggest that you also use the username. What are we talking about? What? Use the username of global. That's weird, though. When I deleted one of another user. I deleted somebody that where the letter was somebody else and I didn't have an issue. Yeah, I was trying to figure out what the deal is with that. What are they talking about? What are they talking about? Okay, I need to get out of that. There's got to be. It's got to be specific. There's something up with the form letters. There's some kind of, one of these fields has to be messed up because it only errors sometimes. And I can't figure out why, what is causing the error. I'm going to go back into this. Let me go back to this table. Unless I can figure out what darn window I have it open in. Get out of that. That, that, that. Leave that. asian media so how did that get deleted they deleted letters and it was in the recycle bin but it didn't have a username i just i created like a username onyx made a letter called onyx letter, deleted Onyx's letter, I was still able to pull it up. So that's why I didn't think it had anything to do with username. But let me look if there is truly no username on this. And maybe that's the problem. Oh, I didn't think about that. It does not have one. Okay. So I'm going to just add why doesn't it have a username? name. Okay. Is it because they deleted the username out of the system? Very possible, but when I did it, I still was able to see the letter. That's why I was like, hmm, this one literally is blank. There is no username field on those. There is no username on the letter itself. Now this is a letter from 2019. Update letter records. Set user name equals global where form ID equals One row updated. That is it. That worked. Yay. I think we have other ones. It was called letter records where user name is null. There's something wrong with the column hash. I don't know what that is, but whatever that column is, that's what's causing the error when we were running that query. If you just don't do select all, but selecting. Let me see if I can find that, her other database. Houston is the other database, Houston. Can you guys please just go get off your own servers? Select stuff from user or letter records where username is null. they have 11 per my voicemail form name and the other one was interview follow up I don't see that one. He's the first one trying to add a letter as interview follow up and had to add as interview follow up. Oh, here it is. Hmm. Update letter records. Set user name equals global. where form ID equals done. Yay, that worked? Yeah. Awesome. I was thinking it would have something to do with deleting a user at first because there was like no name in it. Where even like mine would say like when I deleted Onyx and Onyx had letters, it would say form is used by Onyx and theirs didn't. So that does make sense. Okay. I just don't know how it's getting a letter with no name, but they're also created in 2019. Yeah, I don't know. That's weird. Hmm. Well, you got to figure it out. That's all good. Okay. I should eat something. I'm going to go grab something to eat, Robin. Okay. I'll sit down and do a bunch of other things. But if anything else comes up, let me know. Okay? Okay. All right. I'll talk to you later. Bye. Thanks.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 437.110031,
    "salad_processing_time": 331.5955822467804,
    "overall_processing_time": 437.110031,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hey Robin, what's up? Hey, how much, how are you? Hold on one second, I'm trying to do my input and contact footy.  He asked me about how to clear cache to get PCR mail icons to work.  I'm just and then her, she was here at Monaghan.",
    "job_id": "3149a586-95b1-4ceb-bf4c-6577b05665d1",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hey Robin, what's up? Hey, how much, how are you? Hold on one second, I'm trying to do my input and contact footy.  He asked me about how to clear cache to get PCR mail icons to work.  I'm just and then her, she was here at Monaghan.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3009851470037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}