{
  "recording_id": "3009644361037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:22:49.058951Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:22:49",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your Enter your participant ID followed by pound. You are in the meeting now. You are the first participant. Please stand by. I'm going to go ahead and start the recording. Thank you. Hello. Hello. Sorry, my assistant had also put it on my calendar, and for some reason it popped up as a Teams link, and so I was like, do, do, do, do. And I was like, wait a second, he's a Teams link. No problem. No problem, no problem. So, yeah, so I wanted just to talk with you a little bit about your account. I think we needed to initially get a new signer because the old signer Marsha is no longer there. And we were going to maybe talk about the premium package of PC recruiters since we're doing a new contract anyway. So it might be worth taking a look at that if that would be of interest to you, or do you have any thoughts on that? I don't know that we even use ours fully. We kind of, we need to use it more. We almost use it as like a glorified Rolodex. because I don't know exactly what features are included and what are not. And so that would be good just to go over that all in general. Yeah, yeah. We'll talk about kind of what you're looking at. So you're looking, you are using a pretty basic package of PC Recruiter. You're using the Enterprise, which is essentially just the Outlook integration. Do you post the jobs on your website right now, or don't you use that piece? We post them on our website because I don't know if we have that, It's like it's that capability. I tried to find out and could never seem to find out. Okay. Well, you have an older version. You have an older version called the Web Extensions. There is a newer job board, which is more customizable, which is part of the upgrade, if that was something you were looking to do, that we could post the jobs. Let's see. So it looks like there are some jobs on your site right now, but it doesn't look like they're through PC Recruiter. No, they are not. They are just simply through our website. Okay. Okay. So we have a job board piece that would be that. Do you have the ability to do that now, or is that only with the upgrade? Well, a bit. So you have the web extensions, so you have the older piece of the job board software. So if you wanted to do nothing else but just add the job board, it would be 250 set up, no more monthly. It would upgrade to the job board. So 250 one time would upgrade to the job board because you have an older version now. we really support the new version of the job board 10 is what we have now. So that is part of the upgrade, but even if you didn't want to do the upgrade, it could be part of your existing package. Okay, and the job board, would it automatically, like we would just put the jobs in MP3 Recruiter and they would go up, I guess, on our website or? Yeah, yeah, let me show you. I'm going to share my screen just to kind of show you that, and then I'll show you some other stuff too. Okay, let me share my window here. Okay, perfect. So yeah, so what happens with the PC Recruiter job board? If you put a job into PC Recruiter and it's in there, available slash open with one opening or more. So as long as those two criteria are met, this is a little overrider. It'll default to show, but you can always default to do not show if you wanted to first make sure everything was appropriate before you moved it to show. you'll see you have a little online little green thing they're saying it's online so if the job is entered into the system with one opening or more and it's available it'll go on your website automatically so you would actually have the ability to choose from one of these different templates so if you wanted your jobs listed like this or maybe you wanted a little more information on the screen maybe you wanted it to look like a table so we have a few different options that you can choose from that it'll post the jobs on your site and then the candidates are able to look at so let's go into one they can look at any one of the positions they're going to see the detail directly pulled from PC recruiter formatted description any fields you choose to show and then that's automatic so as soon as the job will be filled it would be taken down off of your site and they're going to be able to go down to the bottom and they can apply so if they hit apply this can be skipped or enabled this will let them sign in using LinkedIn or Yahoo or indeed or any of these and what that'll do is it'll, PCRecruiter will check first to make sure they're not already in your database. And if they are, it won't add a doobit, it will merely update their existing record to include today's application. And then you are able to kind of dictate what information you want to require of them. They can upload a resume, fill out other fields, anything you wish. So it's a custom application. What that does is that's going to let them get themselves directly entered into PCRecruiter and into the pipeline for that job. So it's kind of an online application, puts them right into the database, creates a record. And then if you're going into that specific job opening, you could look at the pipeline and you're going to see those people in your inbox. Over to the far left, you'll be able to see the pipeline. But what if, for example, they are not, because we get a lot of people that apply for attorney jobs that aren't attorneys or that have no skills. And we don't necessarily want them in the database. are they always going to be in the database? Well, you can set up knockout questions and pull them out of process, but there's no way to prevent them from getting into the database. You could delete them out of the database once they apply. So no way to really not let them in. The knockout questions will kind of show who's qualified, and it'll move them to out of process, but it doesn't delete them out of the database. So we'd have to do that manually. And is there like a limit to how many people we have in the database or is that kind of? No limit there. There's no limit on how many people in your database. That's kind of as many as you like. Okay. And are you using this pipeline that we're looking at right here? No. We don't really use the pipeline at all. and it might be an older look to it because I want to say mine's not at all that clear when I do try to use it. Yours might look, I don't even know if I have an older one here, our older pipeline looks more outlooky. No, it's not this one. The new one is kind of more customizable, more of a drag and drop type setup. You're probably using still the old pipeline. Let's see if I have some, I don't know that I even have a lot of them that old. Does your pipeline look more like this? More like that. Yeah, this is the old pipeline. So all updates and it's even, I could even, again, if you didn't want to upgrade to premium, pipeline upgrade is no cost so I could get you moved over the new pipeline no problem that new pipeline is going to give you the ability to set up up to 18 stages you pick your colors you pick your terminology you pick what order they're in and then it's just a matter of dragging and dropping as you move them through so maybe I contacted James Larkin drag him over to contact it maybe I sent candy for a review of hiring manager drag and drop her over there so I can drag and drop people through my process it's a lot easier to navigate a a lot easier to use and the nice part about this this feeds into the reporting option which is one of the basic contents of the premium package so if I whoops whoops click the wrong one so if I went into my analytics one of the big things the premium package does is gives you custom analytics reporting so if I want to look at my pipeline activity I can see a report here showing first interviews second interviews phone screens or I could include all of my interview stages or anything like that you can pull it for different time periods you can also split it to look at what jobs you worked with what clients you worked with all of that so you can kind of customize these reports in here this is also going to allow you to report on email campaigns so if you're sending an email campaign out of PC recruiter you can now queue them up to be sent at a specific time they're going to be able to be spaced out maybe only want to send 100 a day. Yep. Email campaigns because South Carolina Legal is more than any other state legal. And, like, we've talked to LinkedIn about this, and they're, like, amazed at how, like, niche it kind of is. And we guarantee we're not going to poach from our current clients or people that we've placed before. So email campaigns a lot of times are kind of tricky because we cannot poach. Okay. I get it. Yeah, because you wouldn't want to send out a campaign because what if somebody's still on an old list or something like that? So I get that. So that wouldn't be of interest to you. Likely the sequencing wouldn't either because the sequencing kind of depends on mass emails and then you set up drip campaigns and stuff like that. So that wouldn't be of great interest to you. And that might be why one of the reasons you didn't look up the premium package there. Yeah, because we could probably do it for marketing purposes with firms, but not with candidates. And honestly, since we don't do a lot of the pipeline, we have nothing to base analytics on. So what I'm trying to do is get more like use of the pipeline. And the updated one looks a lot easier. Once we do the pipeline, then paying for analytics might make sense. Yeah, once you get kind of some data there to report on, because right now there would be nothing for the analytics to report on. It can also report on basic activities. So if you wanted to look at like, make one for BizDev, I can look at ad names, cold calls, ad positions, email sent, stuff like that. But really, the bulk of people use that to report on their positions, their interviews. So yeah, you wouldn't have that. So, yeah, if you wanted, even if you wanted to hold off on any upgrade, we could just do, I could put in a ticket to get the new pipeline set up for you. That includes an hour of training. I could even, if you wanted to explore the job board, we could do a 250 setup and upgrade you to the job board, but still keep your existing package and then worry about maybe premium down the line, if that might be of interest. Maybe more, like to see if we can actually start using it before we pay for the stuff that we know we don't have the data for yet. But now, for example, if we have that set up as a job order on our website, we have a certain amount of spots on Indeed and LinkedIn, but we have more jobs on our website than we have on LinkedIn or Indeed. Do those have to be linked or will those also go through the Indeed and LinkedIn platform? Well, you can set up a feed. I don't know if there's any way you can limit that feed. I'm going to just chat someone here. Because you all have plug-ins for Indeed and LinkedIn, right? Yeah. See, that's the thing is I was like, oh, I wonder how we use that. But then I don't know if we should always have more positions open than we have actual paid job slots on those boards because they're so expensive. And so I never knew how that worked. And I tried to kind of look into it, and I could never figure that part out. okay I'll wait and see if he responds my guy who sets up all the feeds and does that specializes in that I just sent him a discord here so I'll see if he chats back if we can limit those because I think you could set up a feed but I was under the understanding that it just takes all the jobs on your website feeds not to indeed but there might be a way to limit them I'll let you know what he says while we chat here. But yeah, so we could maybe, why don't we just, since it sounds like premium is not going to be for you, we could just get the new agreement signed. And then you could even, even to do the job board upgrade, that doesn't require new agreements. If you wanted to do that down the line, we don't need to find a new agreement. So we could sign the new agreement for exactly what you have now, just so we have a new designated person who's going to be the one who would sign off on data returns, password changes, data ownership, anything like that. So we can do just the same as you have now, but I could put in a ticket to get that new pipeline turned on if you'd like. That makes more sense. What are some of the other premium features? Or is it mainly the email sequences and analytics? Yeah, email sequences, analytics, the contract temp piece, which you don't place contractors, so you wouldn't need timesheets. and there's also an AI suite as part of that. But we do all of our timesheets and invoicing through Bullhorn. Okay. Yeah. Cause we do a timesheet piece that collects the timesheets and then they push out the QuickBooks. That's also part of the premium package. So timesheets and pushes, but then you'd have to invoice through QuickBooks. Yeah. Yeah. That's probably why we haven't done that part because our piece does all the invoicing as well. Okay. Yeah, that's probably why. So that wouldn't have been, if you're not using QuickBooks, that wouldn't make any sense because you can collect the hours, but then they're in PC Recruiter only to be pushed out to QuickBooks. So that wouldn't work. Yeah, and then it also includes our AI suite, which is some content generators for candidate summaries, job descriptions, and emails. So there's also an auto match that's recently been released that will, there's a button on a job that you can click and it'll pop the best matches in your database, the top 15 best matches or something like that. So that's also included as part of that premium. Okay. So that's the premium package. It sounds like we're not there yet. Like maybe eventually we can get there, but for now we just need to try to use the pipeline so we can create the data to run the report. Yeah, I would say definitely. Right now the pipeline upgrade is probably the best thing to do for you. Yeah. Now, is there any pricing changes or is there, we'll just continue, I'm not even sure what we currently pay, Terry, in the interest of that. So yeah, no pricing changes. So you would, I would still get you in at the same thing you're at now. You pay $85 per user per month. Are you still seven users? We actually are less than seven users right now. Although we you have probably some of those users still registered. I didn't realize it was based on user. Or do we pay for seven regardless of how many? That's like the minimum? No, it is per user. Let's take a look in here. So, yeah, you pay per user per month. You can add or drop users. Let's see how many are logging on. It looks like, is that right? Let's see. You really have four that log on on a regular basis. Yeah, that's what I show. I say A. Glenn, M. Carter. M. Lott and C. Williams are the four that I see regularly logging on. Which one was the last one? C. Williams. I'm not sure what C. Williams is. Yeah, so I see regularly, like today, three have logged on. And those are the ones that are regular. Those are the only three that have logged on this month. A. Glenn, M. Carter, and M. Lott are the three usernames that I see. They've logged in. They're logged in now, today. And then they have logged on pretty regularly. Okay, she was here temporarily, but she is not here anymore. It looks like T. Isaac was also pretty active at one point, but not this month. Yes, she has also left. So I could probably deactivate some of these. Yeah. I don't know. You can't tell from the list which ones are active or not. You can't. I can't. I'm looking at a report to see who's using. And you've only got three. The only others that have even logged in at all this year were C. Williams and T. Isaac, who are both now gone. So it looks like you only are three users actively using the system. So we could probably even do a new contract for just the three. But how do I, if I delete their profile? Because some of these I don't know that we, I guess we just delete them as a user? or do we... Well, it won't hurt. If you delete them as a user, it does not delete anything they've ever entered. So it's not going to delete any data or you could just disable the user on the security tab in the username and that will just disable the user and it can remain in there as long as it's not actually logging in. It's not going to show up on my report here. Where, so I'm on the security tab. Where does it show you that? No permission, full permission. If you go to the security tab at the very bottom, there should be an option, a little checkbox, maybe that says disable user or something like that. Account is disabled. Okay, then we can do that. Yeah, I think it says user is disabled. Let's see, security. Yeah, account is disabled. If you check that box and hit the save in the upper portion of that user record, there's a little save icon, then that will disable that user so the person can't log in, but then you don't have to delete it. Although, if you did delete it, it wouldn't matter because it's not going to delete any information. It's not going to delete anything they've ever entered or done. Okay. All right, I can update that because we definitely don't have that many users. We're pretty small. We definitely do not have seven users. But that's what I was trying to figure out, like how we pay for stuff, because I didn't even know how it was set up, the payment. It looks like you pay monthly on a credit card per user. So what we can do is drop you to just three users. Are those three that are logging in the only ones that need access, the A. Glenn, M. Carter, and M. Lott? Let me find out. Terry Talley would be the other one, and we may want to keep her. That we'll find out. Okay. The other one. Yeah. Because Martha isn't consulting with the company now, so she wouldn't really be a user. Who else do we have listed? Well, the IC, those three, C. Williams, T. Isaac, L. Stubbs, B. Reeves, and T. Kelly are the other ones I see, but they haven't logged on this year at all. Yeah. That would be it. So I can disable. I'll disable those. Yeah. Yeah. So let me know on that. I can email paperwork as soon as I know whether you'll be three users or four. It's still Carolina Legal Associates. Is it still 1330 Lady Street Suite 503? Yes. Okay, that's good. So, and who would be the new signer? Would that be you or would that be someone else? Probably me. It could be Carrie as well. I'm the CEO and she's the CFO, so either one of us could. I'll send it to you since we've spoken I'll just send it you and that'll be an excellent person to be the signer so yeah just if you would pop me an email let me know how many users I can email paperwork for the amount of users we will drop it down to three or four whatever needs to be same package same pricing it will be let's take a look here and see where you are here and then I can also put in a ticket to get you moved over to that new pipeline and And that's no cost. That would be great. It would be an hour of training, too. So that is good. And I have one question. I have been having issues with the documents, the attachments. I cannot get them to open. Is that – who would I reach out to for that? Well, that would be our tech support team. You can email support at mainsequence.net. That will create a ticket in our support system automatically, and then it will get routed to one of them, and they can get back to you on that. Okay, perfect. Yeah, that'll be good. So yeah, so what I'll do, I will wait to hear from you on the three or four accounts. As soon as I do, I'll email you over a PandaDoc. It's a specific document we use, like a DocuSign. And then sign that, get it back. We can get everything into your name and get your price reduced as well as soon as we get that signed and returned. All right, perfect. And it's not going to cause any problems if I click account is disabled for Marcia Silver, right? No, not at all. I know she was a signer and I don't think it's linked that way. That it would match. Nope. That doesn't matter at all. All right. Perfect. I think we got it. All right. Well, I hate that we're not like a big customer with tons of sales, but hopefully we can get the pipeline going and then actually, you know, take advantage of some of this stuff. and become one of the... There's so much more out there that once you have the data, it might be useful. But yeah, we can just take it as it comes. It's difficult to track where things are coming from and what's doing what and what's getting traction. And that would be great to track that. What is the difference with the premium package as far as pricing goes? It's an additional 500 setup. That includes six hours training. And then it's $20 more per user per month. So we take it from $85 to $105. Okay. Which is not bad because we have so few users. But at this point, we're not using it yet. But that is something, if we can take the full advantage of the pipeline, then I can probably justify that. Sure. Yeah. Once you have some data in there, it'll be nice to report and see on that. Cool. All right. So then I will get everything sent over as soon as I hear from you, and then we can kind of take it as it goes once we're going through, see how well the new pipeline, get that used for a while, and then if it's time, we can explore premium maybe down the line. All right, perfect. Thank you so much, Jim. This has been a pleasure. For sure. Thanks for fitting me in today, and I'll look forward to hearing from you. Thank you. All right. Bye-bye. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 265.071011,
    "salad_processing_time": 52.43196702003479,
    "overall_processing_time": 265.071011,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your Enter your participant ID followed by pound.  You are in the meeting now.",
    "job_id": "e9aa6fb5-9668-4b27-ae27-f4fcae9994ce",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your Enter your participant ID followed by pound.  You are in the meeting now.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 2
      }
    ],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "billing",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3009644361037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}