{
  "recording_id": "3010489734037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:23:15.405270Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:23:15",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Enter your participant ID followed by pound. You are in the meeting now. You are the first participant. Please stand by. Ellie, could you turn that down just a little bit, baby? please thank you Good morning, Jenny. do you hear me? I can, yes. Awesome. How are you? I'm well. How are you doing? I'm good. I saw myself in the video and I was scared so I had to I knew we were doing video but I had to get some lipstick just in case. I always keep mine off just because I'm usually looking at the keyboard or taking notes or something of that nature. I prefer it but you know I just try to be friendly about it, right? Oh, for sure. I don't like videos you say but yeah, so no, good, good. Well, good to talk with you. How's your day so far? Okay, okay. And sorry I hadn't gotten. I later dug down and saw that you had replied. I sent it to you late. But it was no worries. We can get in now. So, yeah. So I wanted to talk a little bit and show you a little bit around the PCRM product. See, have you seen it? What have you heard? I only heard that it's existed. And it's a simplified version of PCR, and that's all I know. Sure, sure. So, yeah, so what it originally was going to be, it was designed, it was started several years back, and it was originally going to be a new user interface for PCRecruiter. And they were just kind of freshening things up, making it look a little bit more modern. But then once we started looking at various client suggestions and requests and feature requests and stuff like that, they ended up adding in quite a bit of CRM functionality that the decision was made at the beginning of this year to spin it off as a separate product, but that shares the same database. So it essentially gives you the luxury of being able to log on to the exact same database through PCRM or through PCR9, which is the version of PC Recruiter you have right now. so you could even have people using both and we do some people are letting their sales people and their marketing people use the pcrm and then their recruiters are still using pcr9 because that's what they're used to um up until very recently that's fantastic by the way that's a nice thing and people have if we've really gotten some good feedback because people really like the flexibility of you get both versions you pick which one you want to use some people like the look and feel of PCRM so they're kind of heading that way off of the PCR 9 but we have no plans to end PCR 9 so there's really both versions you can go with up until this week the searching in PCRM wasn't quite up to par but that has been improved and addressed so so that's going to work pretty well as well so let me show you on PCRM just kind of show you that the difference in the look some of the new features it includes and some stuff like that. So do you see my screen? Do you see my screen? Okay. I do. Yes. Perfect. Perfect. So I am now going to get logged into my PCRM. And again, all it is is a different URL to the same database. So all I do is put my same username and password in as I do for my PCR9 database. And I'm able to log into this one. So I can log in. And the biggest difference you'll notice is going to be most things are kind of widget-based. And then over here, the main menu bar is down the left-hand side of the screen as opposed to across the top. And that helps us to make better use of the entire screen. If I select names, you'll see my name search, and most recently viewed is the entire screen. If I click one, it's going to slide in from the right. So it's more of a side-to-side thing than it is a up-and-down thing. You have that feel of what people get on their phone perhaps, right? Yeah, yeah. And screens are getting wider, not taller, monitors. So that's why we kind of decided to go that way. I use just a laptop and keep it pretty zoomed in, but you can really zoom it out and show quite a bit of information on the screen if you're using a second screen or a monitor or something like that. Okay. So you're going to have a lot of the same things, named companies' positions, roll-ups, schedules, activities, reports. all of those are the same terminology. Some of them look very similar, like the schedule, they didn't change that screen much. They softened it up and made it match this version a little bit. They didn't change that much, but they did, for example, the roll-up lists. Those look quite different. So you can kind of see you have an edit in line here, so you can make changes to the description or name right from there. You can do add names right from the main screen, or if you click into one of those roll-up lists, it too is going to slide in from the right. and then you're okay nice that's me okay then I can pop into a record there and then I can go back into the list and I can kind of let's see I can pop the search function so tell me about that perfect perfect so the search a couple of different ways you can do it I like to go to the name search up here and you're going to be able to first name so if Jim Lombardo called I can type in part of the first name part of last name you see it adds those little green chips down there and then I can X those out or whatever and then if I hit search it's going to kind of run that search. I also have the ability to go to the, let's see, more filters in the upper right hand corner and that's going to add all of your fields, predefined fields, custom fields, they have a little purple icon there, so I can search my field. So I could even do like language equal to, not equal to, all of the same stuff in our advanced search, type in your value, or this also gives you the ability to do the all content field and the all content is is nice because that is your Boolean search. So that's going to be where you put sales and marketing. Or just a phone number maybe. You could just put a phone number of someone that you – right? Exactly. So what happens is people will text me and I don't know who they are. So I want to look up their phone number. So I just look up their phone number, and in theory that should show up somewhere in their record. Yeah, let me try. Let me give it a try. I've never tried that because you could, of course, look at phone field that way. But let me see if all content. Well, maybe it's in their resume. So what happened is I lost all my contacts. So people will text me who I should know who they are, but I don't because I lost all my phone data. So I'm constantly trying to figure out who's texting me and not be rude. Sure, sure. I'm going to try it here because I'll show you a couple of different ways we can do that. I'm just going to copy this number there. So if I did all content, let's run that search and see if that does bring anything back. I would presume if it's in someone's resume or something, it is going to bring it back. Okay. It looks like I don't have the latest update that was released yesterday on here, but it is going to also tell you. All these people might have that number? I don't. Like somewhere in their record? Let me look. If I look at it. No. No, no. Somewhere in your record, somewhere that phone number shows up. You wouldn't want to do it all content. Let's try the search up top here. That one seems like it might work. You have Kelly Weissman. Oh, yeah. She used to work with us. Yeah, she's a friend of my husband. Oh, Danny? Danny, yeah. And she, he, my husband, whatever, just are kind of best friends. They're great. I know Kelly worked for you guys. I worked with you for a while. She did for a while, and I love her. She's great. Very good. I like her and Danny. They're both nice. But, yeah, so this does look like it pulled. Let me look and see. I think that would do it. Oh, yeah, it pulled. Got it right there. So it did find it. So if you do the search up in the menu bar at the top, that is going to search that number and it's pulling it off all of these records and each one it's kind of pulling it so yeah it's going to and kind of something you could do is if you have your workspace here and you've kind of put a few fields here if you go to details this is every single field you have on that person and i like to just type in phone it's going to instantly filter them there it was in the home phone field oh that's right so you don't have to do the boolean you You don't have to put the whole word in. You can just put phone. Yeah, yeah. This is going to search just all your fields. So if I want to look at all my email fields, I can just type in email. It's going to filter that. Or if I want a value of a specific field, I know that they lived on, oh, I don't know, Maine. I can look at Maine special territory. Or I could even type in a street name or something if I knew that person's address. So I can kind of search. Oh, that's really good. Yeah, that's great. So that I like. It makes it a lot easier to work with the data there. So this big empty search at the top is going to let you kind of do a quick search for a number or an email or something like that. So that's going to be a nice feature as well. And then also when you're looking at the name records, we talked about you can have this workspace here. So you can put only the main data you want on your landing page. if I expand this page here. So I can look at my main data on my landing page, activities, a few fields, and then I have all my tabs up at the top here, roll-ups, activities, so I could look at a full screen view of their activities. I could even move them around. Maybe I wanted notes to be right next to activities. I could snap them right over there. It moves them live right up top. So it's a little more interactive. Can you customize the other page, the first page you were on to, just their record, I think, was their – if you go back to maybe workspace. I don't know. Uh-huh. Yeah, workspace. Oh, can you add fields there? Oh, yeah. If I hit edit, I can add resumes, activities. I can go through here. I can hit this little gear and add specific fields. So I can add anything I want. So I'm able to kind of set up my widgets. And I can go through here and add different things. A company field list. I can pop there and I can add some company information to the candidate record. Is it the same add-in for Outlook? The Outlook portal, I don't know that that works yet. So the portal, it might not work with the portal. I'll have to check on that. Okay. Because of this new interface, I don't know if it does. I'll have to check on that. It'll still integrate, but it'll still record. I need to reinstall the portal anyway, so I was just curious if it would be a different portal. Yeah, I don't know that the portal works with the PCRM product. I will check. I know that it is, the email still can be recorded. So if you sync up your calendar, your email can still be recorded through IMAP. But I don't know if you can look at this version inside of Outlook. I don't know if they've written that yet. So I'll have to check on that. Question for you, and this is more in regards to the add-in for Outlook. I know that a lot of people are switching over to this new version of Outlook. I'm not very fond of it, so I may stay at the older version. but regardless, is it a separate add-in, PCR Outlook add-in for the new version of Outlook versus the classic version? No, the new version of Outlook doesn't work with the portal. The portal requires the classic look. Yeah, that Outlook web, that can't support the portal. So if you want the Outlook integration, the portal integration for PC Recruiter, you need to have the classic version of Outlook. And I like the classic version better, so that's not a problem. Where do you find most people use the classic version of Outlook that I've found? And the nice thing about it is if you know how to utilize and kind of customize a name record, you know how to do the company too because the company works the same way. It's going to have a custom workspace. It's going to have your tabs. It's going to have all of the same stuff, works all of the same way. So as you can see, it's much easier to get a handle on how it works and how everything works because company's names, positions, the screens, the searches, the customizations all work the same way. We've also added a little edit in line here, so you can edit information live in the grid, or some of the actions. You can contact them, email, call, text, with RingCentral, of course. You can add an activity, notes, add them to a roll-up. You can do some different things right from the front screen here. So that gives you some additional… I wonder, so with PCR, RingCentral, do you have any other systems that integrate with PCR specifically, or can you do a unique API? Well, not as tightly as RingCentral. RingCentral is our tightest integration. We also interface with Google Voice and Zoom Phone, but those don't work with the sequencing piece for texting or stuff like that. So RingCentral is the most thorough integration, but we integrate with a couple of others as well. And can you – so, for example, I use a new system called Dialpad. And I was wondering if there's like a way to – I know that sometimes you have unique APIs and they can record things, and I just wondered if that, is there a way to, even just if you get the phone number and an email or something, just to record it, is that something that people do with other phone systems or in PCR, or you don't know? I don't know. I know there's an open API, and I know that depending on what API the phone system offers, there could be the potential to write something, but I don't write that stuff, so I don't know if it would be possible or what could be done. I didn't know if I was thinking the right way or not. I've got it, yeah. Yeah, there is an open API. So in theory, if our open API and their open API would share the same data and it could do what you needed, you might be able to write something, but I don't know how you'd do it. It would need to be done through someone you found. That's okay. And then some of the things are going to look the same in PC Recruiter, but they're pieces you don't have on your system right now. So the analytics reporting, the email campaigns and sequences, those are included either way in PCR9 and they look just the same. So I could look at my analytics reporting. This screen is in PCR9 if you had it too. And it allows you to build custom metrics reports, teams, goals, KPIs, stuff like that. So this lets me look at maybe a pipeline activity report. I want to show first interviews, second interviews, phone screens. I can look at different time periods. I can filter down and look at what job I work with. That's a second add-on package? I mean, I don't use it, but is that something you said? It is the premium package. So right now you have the enterprise package. The premium package adds analytics like you see here, email campaigns and sequences. now that you that is included in the PCR app so if you upgrade it to the PCRM that comes with it so you'd have to upgrade your PCR 9 to include that too just because of the way it's written Because this is included in here. So you get the analytics. How about the pricing? Well, what you would need to do, it's going to be a little more of an increase for you. Most of the time, it's an increase of $10 per user per month. But you would need to move to the $50 package from the $30 package plus $10. So for you, it would be $30 more. It would be $60 total per user per month. And then it would be a $500 setup. And the $500 setup would include adding all these new features and it would also include six hours of training on the systems and everything like that. Okay. Okay. So one time $500 and it would take you from 30 to 60 per user per month, but it would also get you not only the PCRM but also the sequences, stuff like that. Another cool thing that's very unique to PCRM, the deals workflow. So we've added, it's basically a sales funnel within the system here and it's going to give you the ability to use similar to your interview workflow you can have your different steps that the deal might be going through and you can go say I can drag and drop one to the next great or you can put in town here maybe I have a couple steps in here I want to send a call on the 9th and an email on the 23rd so I can kind of put those steps in there and then address them as they come done so I can kind of track my steps to make a sale or to sign on a new customer or even if, in this case, I have just a job at one of my customers that maybe I'm trying to get the contract to fill that job. I can go that through there, and I can say, oh, maybe I set the contract, just drag and drop it through there. So this recently came out. We are working on reporting and the ability to customize your steps. But this is a nice sales funnel that people have been asking for over the years, and it gives you a nice way to track marketing, like sales, within the system there. And that would be part of the training as well. Your training would actually include training on the setup and use of the PCRM product and all of the features that are in both. Because if you happen to go with PCRM, like I said, your PCR9 would upgrade. So if you had your PCR9, I'm going to log into the exact same database in PCR9. You would gain in your existing database up at the top here. you would gain the analytics sequencing buttons so you would gain some additional features here but what's nice about that is they look the same so if I look at the analytics it looks just the same as it does when I looked at it a PCRM the exact same screens the exact same setup so that looks the same for both versions so does sequencing sequencing is like a drift campaigns piece so you can set it up to send an email and then maybe if they don't reply to an email in two days send a second email. Or maybe if they do reply to an email, add them to a call list or something like that. Okay, that's fantastic. I like that a lot because I know that these sales funnel software are popular these days. Yeah, so if you can create a template, and like a BizDev template here, so the branches in my template here are the very first thing that happens. I assign this to a roll-up list, and you get a BizDev letter one, which is a specific form letter in my database and then basically based on what happens if they reply to it then I'm already in touch with them they're completed the sequence but if no interaction occurs in here I chose three days but maybe you might say five or six or nine days you can continue to the next step which is add them to a call list and then you get a little call list you can work through and you get some options once you make the call you can select connected left message no answer or remove from sequence and then that will do whatever you've assigned that step to do that'll move to the next step that's another email and maybe you include a call or a text through ring central in this or maybe you have only emails so maybe it's one email pause three days second email pause four days if they open it they get an email a if they don't open it to get email B. So you have some different options. That's really quick, right? Yeah. I was going to ask you, when you said, and this is a divergent question, but in PCR, the Outlook add-in, is there a way to sync? So is there one way? That's a completely different question. I was thinking about the add-in because you talked about the SMS and the whole thing. And I guess when it syncs the calendar, for example, does it sync both ways, or can you have it sync one way only? I believe it's a sync both way, and it works through the portal. And what's cool about that is since that would still work with classic PCR9, which is the same database as PCRM, everything's going to go in both versions anyway because your current PC recruiter can still be synced to your Outlook calendar, and that, of course, is synced to PCRM. So it's the same exact thing. okay because if I looked at my calendar like in let's get back to PCRM if I look at my calendar oops where's my schedule right there I think I have a call on my calendar for the tenth maybe yep I do I have that Arthur Smith that's on my PCRM calendar also it's on my PC recruiter calendar and if you had the sync turn on it would also be on your outlook calendar so everything is going to center it's going to sync. That's pretty cool. Yeah, so it's really kind of slick here, the different things. And then there's a couple of AI content generators that are actually include, we're kind of doing it for free for a while, but it's included in the PCRM. So you can do like a little email generator. So if you're sending someone an email out of the system, anywhere you're sending an email there you have a little AI field so I can kind of go and I can say I want it to be casual initial contact it'll generate an email then you can go back and forth it and say mention the sales position so I can add that and then it's going to kind of generate that different you can regenerate or use the text so you have that little AI content generator for email and also there's a candidate summary generator. So you can actually use the summary generator to take, it'll basically take into account any information found on the candidate's resume, as well as their fields in their record. And it will generate a candidate summary for them, just like that. And then if you don't like that one, you can regenerate and it'll change the little maybe bullet pointed and regenerate it there. So you have some different options. That's awesome, right? But it said now it's free. It'll be an add-on at some point. Yeah, it's free. But I think it's included in the PCRM. So if you upgraded the PCRM, you've got it. But right now, like it might even be in your existing database. If you see, if you look at your database, and I don't, because I believe... It probably is. I think I saw something once about it. Yeah, like if we went into Kelly's record, just because we're looking at here, if I go into summary, look for the little hexagon button at the end of the line on the summary screen or a job description screen or any email sent. And if you click that, it'll pop open a little generator here, and it'll pull something right there. Wow, that's fantastic. So it's kind of cool. You know, AI makes the recruiter's job much easier. Yeah, oh yeah, yeah. And it gives you a nicely written thing, and then if I want to redo it, I can regenerate it. It'll kind of change it up a little bit. And sometimes I've seen it, it'll do bullet points instead of a paragraph, or it'll change it up a little bit or do some different things. So if you save that, that's going to put some searchable data in there and then you can also use that as part of a candidate presentation if you wish to. So it gives you some different options in there. That's great. And then, like I said, sometimes this may even be spun off as an entirely separate product for people that aren't even necessarily recruiters to use. But right now, it's just another access point to your PC recruiter database. And maybe you'll find you still use classic PCR9 for everything else except maybe your sequences of marketing you do in PCRM. Maybe down the line, you'll find you like this interface. What is PCR doing, you know, that – because, I mean, I can see myself using PCRM completely. But, you know, I don't know why people would still use PCR for just more robust tasks or – Yeah, some people that have been using it for many years, they're used to it, and they know their way around. So they're like – like I demoed somebody the other day, and he didn't do any real marketing and really liked the old version. He's been on us for 100 years. It's like, I don't really want to switch. I don't want to add that. I'm like, all right. But other people have really liked the new refreshed format and the easier to use format. So some people are kind of liking it. It's really just personal preference. But at this point, I don't think there's a whole lot that PCR9 does that PCRM doesn't since we improved and added the searches in here. Because just about everything is over now. And my database isn't updated, but maybe I just haven't done so. maybe I have to clear my cache or something like that. Because like I said, that just went out. Okay. No, that's great. Okay. I love it. Sign me up. Okay. What I can do, I can email you the paperwork to review, take a look at that. Let me just make sure that I still have all your correct information. My phone number has changed, my primary phone number. Actually, my work phone number has changed as well, so we should update that. Okay. So which is correct? I moved. Oh, okay. Okay. So of these three, do you see my screen, which are correct and which are not? The 769-3188 is correct. Okay. And that is work? The work one is not correct right now. It may come back, but keep the 3188. And you can keep the cell phone number, although that's really a data line now. So I would switch that. My primary number is the 769, and that's the one people should call me on. Okay, I will make that. You should put that as my work phone number as well. Yeah, I'll do that too. I'll copy that. We will pop that right there. That 444 number is not existing right now. Okay. And then I will also, I put extension 111 just to show preferred number, but I will just take that out. So I've got the 3188 as the preferred. And then company name, address, is that all the same? The Garner Group, but it's not Auburn Drive, or is it? The Garner Group is – I moved, so let me give you a new address, business address. Okay. I'm looking for that. Hold on a second. I'm actually in Pennsylvania now. Oh, okay. Okay, it is. Did you move to Pennsylvania? I moved all the things. I moved to Pennsylvania. I moved outside of Pittsburgh. Okay, okay. Okay, so what's that new business address? 4-0-1-7 Washington Road, number 150. And it's McMurray, so M-C-M-U-R-R-A-Y, P-A, 15317. Perfect. Okay. So that will update that. That's good. We always update that whenever we send fresh paperwork. So what I'll do, and are you still two users? And you know what? I do have a different office line, so I can give you the, they said the phone there. I can give you that one. Perfect. What's that? That's 724-201-9077. 9077. Perfect. And are you still two users on PC Recruiter? No, just one. Okay. I may add a second one, but right now I just have one user. Perfect. So what I'll do is I'll change that. So actually, you likely won't even notice any difference because you've been paying for two users at 30, so you were paying 60. Oh, that's funny. Wow. So now you'll be one user at 60. It's been me for probably a year. Yeah. So anytime you need to add or drop a user, pop me an email. I can change it immediately, and we can adjust that as needed. So we can certainly do that. Now, it also shows collections. Are you behind any payments? Usually that's right. It might be because I had to change my bank account. Gosh, it was a big disaster. So I think I paid. I did pay an invoice the other day. I don't know if I'm behind, though. So I did give them new payment information and paid that maybe Monday, I think. Okay. And I'll have to see if they give me a new email. You know what? My email address, that's not wrong. The website is completely wrong, too. website there. It's not stanfordroads.com. Orange. Okay. It's thegarnergroup.com is the one. Perfect. Yeah, that one. Doug on our geography is the right. But yeah, you have me in the... You have the file of a business name on your front page is wrong. Okay, it is? It's not SRA? No. It's... Oh. So you go down under phone number. Mm-hmm. Oh, right here. Oh, oh, oh, oh. Yeah. GRP? GRP. I don't even know where that one came from, that address there. That was ancient. That was from when I started out back in 2005. You probably are from – If you want to go back, I guess I would go to the other – there's another – I saw something else that was wrong on one of the pages. Let me check it. Let's go in here. Yeah, so. Got that correct? Maybe try another page. Maybe the other page you're on. That may be the name. I had your name here. So you have to change the address. I'll just pull it out of here because we don't usually keep it on the name record. We just go off the company record. But I'll clear that so there's no confusion there. And we've got all that up to date, and that's good. But so what I'll do, I will put together a fresh paperwork, send you for the upgrade, 500, and then one user at 60. So it won't change that at all. And then if you're ready to do that, sign that. And then once we get it back in, they'll let me know. If it happens to still show as a payment being outstanding, my accounting team is always real good at saying, oh, wait, they signed an agreement, but they owe this. So Robin will let me know. That's fine. I finally have most of my banking set put together. Awesome. Awesome. So I will send that over, and I will go ahead and get that over, and then I'll check you back in a couple days if we haven't communicated by then. Yeah, I'll try to do this right now. If you send it over today, I'll try to just sign it if I can just sign online. Yeah, yeah, it's like a PandaDoc, so like a DocuSign, same thing there. Okay. Yeah, I'll get it done because I'm definitely interested. I think it's great. It solved my problem of just – I haven't used PCR in a while, so I've been out of commission while I moved twice in the last six months. Awesome. So, yeah, so this will kind of get you some reinvigoration. And since you get some training, they'll train you on some new stuff, answer any questions about stuff that you've been wondering about, show you some best practices. It'll be good. so I'll email that over in a little bit and then I'll check you out maybe Friday or Monday if I haven't written anything back we'll get things rolling alright well very well thanks for the time Ginny I'm glad you sent me in and we'll talk soon yeah thank you Jim I appreciate it my pleasure alrighty you take care have a good day you too",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 278.348194,
    "salad_processing_time": 66.66415643692017,
    "overall_processing_time": 278.348194,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "job_id": "5469733a-aac0-4ed1-8f15-8fc1d278f156",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Billing",
        "confidence": 0.7
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 1
      }
    ],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "billing",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3010489734037.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}