{
  "recording_id": "3012210227036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:25:08.480771Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:25:08",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hello? Hi, this is Garrett with Main Sequence Technology. I received a voicemail that you had some questions about PCR. Yes. Yeah, first thing I wanted to know is how would I be able to go in and, like, archive old files? I have, like, files from everywhere. From, like, 2015. How can I do that? Okay. You can... So are you wanting to basically just delete them out of your database? Not delete them, but just put them like in an archived file just in case. I guess I need them. Okay. So basically we have like deleting where it goes into a recycling bin and you can have it sit there or you can put them all on a roll up list. But there's no like archive, I guess, per se, where just all the records kind of stay in there unless you delete them and put them into the recycling bin. But the recycling bin can be accessed in the future to bring people out of that if maybe you want to use that route. Yeah, that sounds like a good idea. Okay, awesome. So let me double check here. I'll open up your database. and we want to make sure recycling bin turned on. Are you in the new territories client test database or professional search network recruiters inc database? The professional search network. Okay perfect all right and let's make sure All right, so when you open any record and go to the action menu at the top right of the record, there will be an option to delete. So that's the handful of icons that sit at the top right of a record. you can pin or unpin these. So if you're missing the trash can icon, you'll want to click the three horizontal lines at the top right of the record in order to find your unpinned action buttons. Okay. Okay. So I'm looking for a trash can. Yeah. So do you have a record pulled up currently, a name record? Yeah, I'm looking. I see a whole bunch of stuff, but no trash can. Okay, try all the way to the right, clicking the three horizontal lines to the right of all those icons. Okay. And then in that drop-down menu, there should be a trash can somewhere in there. If not, you may not have it. I got it. Oh, no. Oh, good. It's just a little – it's a delete button. yeah exactly delete record trash can so you can click on that on any record and it'll place them in the recycling bin um and here let me i'm going to create a quick name record for myself in your database and delete it just to test to make sure that that's all turned on so um let me just make one for me here but i'm able am i able to go in and do it from like let's say i don't know 2000 to 2015, something like that. Okay. So you want to look at records that were created in that date range or you can... Yeah, I want to take those records that are old and move them into the recycle so that I would still be able to access them. But I just don't want them cluttering up everything. So my question is, are you able to do it like from a date? Let's say if I say, you know, 2010 to 2015 or something like that, I don't have to go in and click everyone and put it in the recycle, do I? No, so you can build a search and say, show me all the records with this certain criteria. So the question is, would it be records that are created in that date range or records that have a last activity in that date range? meaning some action was taken on that record their last activity is in that date range um yeah i i don't i'm trying to think because i want to do like i don't know 2008 to 2015 okay so yeah it sounds like you would want to say any record where their last activity happened in that date range you want to move to the recycling bin rather than any record that was created in those date ranges moved through cycling bin because you you could still be in conversation with people currently from that if they were created back then um so to do that you would just go to activities in the main menu at the top center of pcr okay and then um this is your activity search and you can say here let me let me actually pull this up I have your database open I want to make sure this is the quickest route I don't want to give you the scenic route here activity search okay yeah maybe not actually I I'm going to try a different this might actually be quicker, one second. So I could go to... Okay. Last activity is lifespan... I'll say one... So is it only going to put the contact records into the recycle bin if, let's say, you go to the last time they were contacted, right? But what about if they weren't contacted and there's not a lot of information in there? Yeah, that might be a different search we would build. Let's see. And I am checking a recycling bin now just to make sure it's all functioning. So there is no way to, once they're in the recycling bin, there's no way to, like, select in bulk and say, put all these back into my database. It would have to be one at a time. You can hit restore next to each one. Yeah, that's fine. Okay, good. Got it. All right. So, and I figured out the best way to search for the records that you want to find, I think. So, let's start by going to name in the main menu up at the top. Okay. And then go to advanced to do an advanced search. Kind of on the left, it says basic search, and then there's another tab for advanced. I know what you're talking about. I'm sorry. I went to name. Yeah, go to name. Right under where you clicked on name, it says basic search. Are you seeing that part? I'm sorry. I went out of here. Oh, okay. Okay. So I'm seeing basic search. I went to name. Yeah, and then right next to basic search, it says the word advanced, where you can do an advanced search. Oh, yeah, I got it, yeah. Perfect. Okay. And then there's a heading called Search Params. If that's expanded, you'll get some dropdowns under that. The first dropdown should say Predefined Fields. Yeah. The one to the right of that, look for Last Activity. And you can actually start typing into that little dropdown to find it quicker. want last activity and once you select that to the right of that instead of the word like we want it to say greater than so use that drop down to find greater than okay and then we'll put in the blank field to the right of that we'll type in the beginning date. So it's probably going to be, you said 2008 or something? Yeah, let's do 2008. Yes. Okay. So do 1 slash 1 slash 2008 for January 1st. And then click add to the right of that. That'll add in that as the first criteria. Then we're going to build that again. So in that same bar, we'll now change those to say predefined fields. Probably already there. I'm sorry. I'm sorry. Excuse me. I just want to make sure the I think I hit add for that last one, but then I don't see where I clicked. When you click add, it'll put that search criteria right below that line and add it in as one row. Yeah. So then we'll go back up above that to build our second row. So and that first dropdown should say predefined fields still. And the next one, instead of first name, switch it over to last activity again. Okay. Last activity and then this time we're going to say less than in the drop down to the right of that. Okay. And then we could put in the final date in your date range in the field to the right of that. So that would be like 12-31 slash you say 2015 maybe? Yeah. Okay yes the December 31st 2015 and then add that one as well. Okay. And so now you have two rows stacked up. The first one should say last activity is greater than January 1st, 2008 and the last activity is less than 12-31-2015. Then at the top right in your action menu, those little icons there, there's a magnifying glass. That's how you actually perform the search. Click on that and it'll take a second to load because it's probably going to bring up a lot of records. And we'll see here. Oh, it just loaded for me. So you have 113 records that haven't been looked at, touched, contacted or anything in that date range. OK, maybe I had to move it to 2020. Okay, to do that, click on where it says Advanced Search in green underlined at the top left. Okay. And that'll bring you back without clearing out all your criteria, hopefully. So I just change the date? Yeah, go ahead and change that date. Oh, wait. I'm kind of following along on my end, and it took out one of the rows. it didn't leave both of them. Do you have last activity is greater than 1-1-2008 listed there still? Or did that disappear? Yeah, it disappeared. It did for me too. Okay. Well, the one that you still can see where it says last activity less than, that's where you can change the date to 2020. And then we'll build the one that says, we'll add in the one that says last activity is greater than 1-1-2008. I'm sorry. So it's because the other one disappeared. So I'm going to go to last activity, right? Hold on. Last activity. And then you said this one's going to be greater than, right? The first one? Greater than. Yeah, exactly. And then greater than 1-1-2008. So the greater than would mean anything in the future. Yeah. So that's the 1-1-2008. And then click add. And so now are you seeing two rows? One says last activity is less than 12-31-2020 and last activity is greater than 1-1-2008. Okay, perfect. We can hit the search again at the top right, the magnifying glass. And that brings back 196 records that have had no activity in those date ranges. Okay. All right. So next step, we want to on the left above all the check boxes, click on select all results. Which box? So there's, it gives you that those search results with all those names there. On the left of each of them is like a little check box. At the top of that row, go to select and then all results. Perfect. So we've had those all selected. Then you could go to the, in your action menu, it's a little notebook icon at the top right. When you hover over it, it'll say roll up names. Hold on. Tell me what it is again. So it's at the top right in the action menu. It's a little notebook icon. You'll hover over it. Roll-up names. Yeah. Perfect. And then in that pop-up window, you'll have a add roll-up button at the bottom right to make a new roll-up list. How come? I'm going back to this. I'm sorry. I'm going back to this. Select. I'm going to do all results. Yeah. Select all results. Okay, and then go to the notebook? And then go to the notebook, yep. Okay. And then click on add rollup at the bottom right of this pop-up. Okay. Then you can name this rollup list something, maybe floor deletion, something like that under the name area. Can I put old records? There you go, yeah, old records, perfect. Okay. And then hit save at the bottom right. Okay. And that should start adding in those records to that roll-up list, and you should get 196 added in there. Is it? indicating that anywhere on the screen? Yes. Okay, awesome. Then click on the number 196 when it's complete to open the roll-up. Okay. And you'll be inside the roll-up now. Does it take a while? It might take a second to open, yeah. Okay, so I tried it again. I did it again. Old records. okay so old records default um i'm in the i'm sorry i'm in the add roll up oh okay um instead of going to add roll up uh go ahead and close that little pop-up window you should see old records already listed in your list of roll-ups there and you should see a number 196 to the right of that I see that record okay awesome and yeah if you click on the number 196 it'll open up that roll-up list okay let me know when it loads that up I think the first name will be Jennifer there okay awesome now you have these all sectioned off into their own roll-up list and this roll-up list will let you delete them in bulk or put them in the recycling bin in bulk so to do that you would once again click on select above all the check boxes select all results okay and then at the top right go to your action menu you'll probably have have to click on the three horizontal lines to get more options there and then look for a trashcan icon it'll say delete from database okay and once you click that it should move them all to the recycling bin does it have any pop ups that appear it looks like it's deleting records from database old old records and it's just showing me, you know, nine, 10 percent. It's showing me how much it's OK. It's working. Excellent. And I'm going to go over to your recycling bin right now and make sure some of these names are going in there. Yep. I'm seeing names being added right now. OK. What about what about names in there? Like they have they have a first name. They have nothing else. They don't have a contact, no email, no company, just nothing. OK. Yeah, you'd have to build a search to say like this field is empty. It's like maybe your search criteria. So last name is empty and you could do a search that way and then do the same thing we just did. throw all of them onto a roll-up list and then put them in the recycling bin. So we could do, we could walk through that one more time real quick with the, maybe the criteria of last name is empty. Yeah, hold on. It's still, it's still, okay. Okay, it's done. Cool. You can close that window. And before we move on, let me show you where the recycling bin is so that you can restore a record from it. So to do that, go to System in the main menu at the top center. System. Oh, now what's it look like? I think it's a, yeah, it's just a gear icon. It's kind of at the top center of the screen. Okay, got it, got it. Perfect. And then you'll see a little search bar on the left. Type in recycling bin there. I'm writing this down. Okay. I see it's kind of not. It says roll up, let's build, predefined, I want to, or predefined stage. Or it says layout. oh um try going to system again at the top i think i don't know if you're in the right place so um up in your main menu where it says you know name company position reports system is one of those options up there is that what you're clicking on i mean i just where it says configure if i hover no no it's it's higher up it's your main menu top of PCR. You have your name, company, position, myPCR, all those different options across the top. Is that visible at all? Yep. Click on system in that main menu. Okay. And then you should see a search bar on the left. Okay. And then in that little search bar on the left is where you type in recycling bin to find that setting. Okay. And once you type that in, you'll see recycling bin appear on the right where you can click on that and view your recycling bin. Yeah, I see that. 14,000. Right. So those are all kind of sitting in there. At any point, you can click on the word restore next to one of those records. So the first one I'm seeing listed is a name record that was deleted on the 11th about a couple of minutes ago. And all the way to the right, it's telling you the record name is Jennifer Lazansky, deleted by the username Ann. So you can just restore with the restore button on the left if you want to. Or you can check the box and click on delete permanently down at the bottom right. Okay. So some of these, if they, I mean, they have a description. A lot of them have a first name and a last name. So I don't want to get rid of the ones that have a first and a last name. So these are the ones we just put into the recycling bin. They are people who have not had an activity on their record between 2008 or 2020. so that's the search we just performed right but when i pull up the recycling bin it shows me 14,000 records yeah so those have been deleted over time right now i think we just deleted uh like 113 records total um but the but the uh you know the the there's ones that have been deleted as early as 2018, some have been deleted. So this goes back to any deleted record since the beginning of your database. That's where the 14,000 is coming from. Okay. So then 14,000, it's already been deleted? Yeah. Before you even called today, you had 14,000 already deleted. Oh, okay. Okay. All right. So then how many more contacts do I have in there? Like if I take those 14? So you mean how many contacts do you have in your database or in your recycling bin? In the database. Now, after those 14,000 are out. So it's probably still 20. Yeah, you could see that by going to, you could close that pop-up window that you have open now. then you could go to name in the main menu up at the top. Okay. Hold on one second. For this one that I pulled up, all those 14,000, it says delete permanently. I don't want to do that, right? No. Those are just going to be sitting in your recycling bin, like you said, kind of as an archive. Okay. All right. So then close that out. Okay. Close that. If you want to see how many records you have in your database total, you would go to name in the main menu up at the top. Okay. And then where it says basic search there on the left, leave all the criteria blank. Don't type in anything and just hit search. That'll give you a total number of records that are in your database. Okay. So I'm going to have to stay on basic? Yeah, it has to stay on basic and don't put any search criteria in and then click search below that. That looks like you have 21,648 records in your database currently. Okay. Oh, I see it. Uh-huh. Okay, 648. Okay. That's awesome. Okay. That's really awesome. Okay. So thank you for doing that. Yeah, no problem. Helping you do that. And I know it says book a demo. I am asking, does PCR have something like an AI program or something like that? I saw you could do a demo, but I guess I'm wondering, is it something where you can find candidates outside of PCR? Because I don't know how that works exactly. So is it a demo? So we have released the AI features temporarily as like a free trial to all of our customers. So it's part of your database now. Let me make sure here. Yeah, so we can, in addition, if you're interested, add the AI search feature to the trial. But the AI search will only search within your database. It won't search anything outside of your database. But the benefit is you can use common phrases and languages in a search bar when that's turned on. So you could say things like list my hiring authorities from San Francisco, California or something. And it will give you that list just by typing in that sentence. And you're just going to put it in the basic search above? So the AI search would sit at the top right. You have that quick search is what we call it, the quick search bar at the top right of PCR. If you put your cursor in there, a big white box pops up, and you would see a toggle at the top left of that big white box that you could turn on AI searching. That's kind of how it works. Archive, okay. I am not finding the button that you said on the right. So up by your main menu where we went to like name and stuff there's all the way to the right a search bar called quick search. Do you see that search bar? It doesn't say quick search it just says search. Right that's that's the right bar. So that's that's the one that we can turn the AI on in that search bar where you'll have a little toggle to say, I want to use AI or I don't want to use AI. Okay. It's not installed on your database yet, but if you wanted to, I can have that installed on your database to include that in your free AI trial that's currently running. And I can even send you an article with a video and some step-by-step instructions on how to use the tool, if that would be helpful. Yep, that'd be great. So then you're saying that this is realistically just searching in the database. Right. It's confined to the database. Yes. Right. But I mean, we're already able to do that. I want to go into a search. I can. Yeah. So it's just using common sentences and phrasing with AI rather than saying, I want to, like, using dropdowns to select the first name field and saying the first name is this. Instead, you could just say, show me records that are in California and have skills related to human resources. You could just type a sentence and the AI will find it for you instead of using all the dropdowns and the basic search, how it is currently. OK, so OK. And so will that be in that information that you sent me? Yeah, I'll give you a video and a at the top of an article that gives a couple step by step instructions. But, yeah, that'll I'll have that turned on for you today. Just open a ticket with our tech team and say that you want the AI search turned on. Cool. Awesome. Yeah, I'll have that turned on for you today. Anything else that you have questions about? No, I think that's it. So I guess I'll have to wait for the bit of you're saying that the AI is turned on. So now I can go in and I can go in that search bar and I can put in a whole sentence. Right. Right. Right. OK. Right. Yeah. Once that gets turned on and I'll give you I'll send you an email as soon as that's turned on. So, you know, what's your best email address to reach you at? It's Anne, A-N-N-E at P-P-A-L-S, Sam and Nancy R. Robert I. Indigo dot com. Got it. All right. I will send that over and let you know as soon as the A.I. is turned on. What's your name? My name is Garrett. Garrett, you're awesome. Thank you so much for your patience. I appreciate that. Thanks so much. All right. Thank you. Have a good one. You too. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 339.340427,
    "salad_processing_time": 77.32163906097412,
    "overall_processing_time": 339.340427,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hello? Hi, this is Garrett with Main Sequence Technology.  I received a voicemail that you had some questions about PCR.  Yes.",
    "job_id": "20ba5b01-df46-4a60-9610-2cc7ecc12a65",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hello? Hi, this is Garrett with Main Sequence Technology.  I received a voicemail that you had some questions about PCR.  Yes.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "general",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3012210227036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}