{
  "recording_id": "3012192316036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:25:01.967455Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:25:01",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hey, Robin, what's up? Hey, I'm so sorry. I was in a training session with this thing. This My Job Matcher, I think we kind of relabeled the original Princeton one. This one was just like so weird because remember they kind of like were here as Princeton, then they were Job Com, and then it was Job Matcher, and the whole thing was a little confusing. so I didn't really know if it was going to be kind of treated separately at the time so I think it's really the same so I don't know if we want to merge them or what that was the one they owed us like they kind of like disappeared for like a while and owed us a whole bunch and then uh oh what did my email do The My Job Matcher was really, I believe, the one that I created new, thinking it was going to be kind of separate with Mark Gust as the main person. I didn't really realize it was still going to be so much of Princeton. so the only thing really on the my job matcher is Mark Goss being the signer my billing notes for the pricing terms I do have a QuickBooks ID though but really like a lot of those contacts are under the one that says also known as Princeton 1 which you might want to just so if we did merge them I think we should change instead of aka formerly or was it formerly known as and then the thing was saying is my job matcher but then they seem to be going by job.com more than anything so yeah this whole thing was just a little straight away from the typical process yeah okay well that that makes sense at least yeah this is the one yeah it was kind of like I think Bill was just like get an invoice out to them because he was like I think they had like 20 grand or like it was like a big he wanted that money and then invoice it for this. Bill was more concerned with the invoices to get that money in and then all the details were a little... Yeah, I just wanted to check because it was it came up in my outreach thing. I had them to the high profile customers and I was like oh why are there two of these yeah i would i would just make sure too that the billing notes did you merge them or no no i haven't touched them yet and i am not going to write the second um okay because i want to take a look at it first okay there's one that is just the job master from utah i guess i mean i got that address from them so i think that's probably the one to keep. That one has billing notes about how they're tiered. I have it in the customer notes in QuickBooks, but I also want it on the company record because they are very different. They offered them tiered pricing, which we don't normally do. Honestly, it's a pretty good idea, though. It is. Hey, you want to get big? Great. Right. There are people that are going to grow. So it's definitely a good idea. Yeah. And then what I did even for their invoice template, like their recurring, I put all four rows. Yeah, I looked it up. The four rows. So that way all we have to do is just fill in a number. Yeah. On that row and not kind of like redo all these crazy things. Oh, oh, oh, oh. While you're here. Yeah. I talked to Kathy yesterday. Oh, you did? Oh, is she going to actually reply to you? Are we on the shit list with her? I kind of got the hint from Bill that maybe. She only talked to me. Yeah, she talked to me because she talked to Bill, and Bill said that I was going to reach out. And she didn't have my number and stuff, so I made sure that she had all that info. So what she said about, I brought up the invoicing issue that you were talking about where they're going in and making changes, and it's messing things up. what she said that at least for right now um we're gonna meet next i'm gonna meet with her next week again and talk over everything because i wasn't there for your initial like whatever i know you and liz did that and i think i should i i would like for her to walk me through some of this stuff so i know what she wants and what's going on um and i also told her i want to make sure that we don't step on each other's toes. So like you were saying, there's too many cooks in the kitchen. So if we have like a standard process that we use, that'll make it easier. But for right now, they, she said that they. She knows why now. Yeah. She knows why it happened now. I think it was somebody that would maybe working like doing some work with her for her. I don't think it was Kathy. Yeah. It sounded like so. So. But what she said that we can do, and I agree with her because I think it's easy, in the notes, you can put a quick thing that says that there was a user change in the date. And then if they go in and adjust something, then it would. They wouldn't override anything. Oh, she complained about that. I go, nobody really even used notes until me started putting things in. so we're not going to do that every time somebody changes things we're just not what they needed to do is not go in and change like this is on them not us so and and here's the thing like how many times do people change users i dropped from three to two to we have a ticket all we really need to do is go in the recurring and we adjust it the problem is they were going in instead of just saving an invoice they were saying oh yeah update the recurring instead of doing it separately that's what they need to do not making all these extra unnecessary notes about user changes because we have that as tickets we also have it in mysql what they need to do is not update the recurring based on one invoice that should be changed separate my opinion because we won't have that on everybody and we certainly aren't going to go in and do that on 1,300 people. So those notes are really just, I and really Liz didn't use them. So many years ago, people might have like what the rates were in there, but nobody was really using them before. So the bigger risk would be that, oh, I went and changed it because I didn't see a note. Well, most of them aren't going to have anything about a user change. We would literally have to go in and for them to see something to know not to overwrite it, we would actually have to go into every invoice and say, oh, here's what their last user change was, which we know we're not going to do. No. So I think we're not saying the same thing. When you open up the customer, like I have a customer open, right? You have the notes section under the company. Right, right. You would just put like. No, we can't do that. Why? because every customer is not going to have that currently. Is not going to have what? Is not going to have that note. Right now, nobody is going to have that we did a user change. Right. They don't have it right now. Right. So I'm not saying to, like, go back and retroactively do it. I'm saying, like, moving forward. But if they continue their process, how they were doing it, they're going to say, oh, well, I didn't see a note, so I just let it update the thing. Well, nobody's going to have it. So they're going to think it's okay to change the recurring. What they need to do is if there is an existing invoice, you edit that one invoice only, and you edit the recurring separately. Well, they already changed their process. Right. So then we should be done. And we don't need to add user changes into the notes area. What is in the recurring once people catch it with the mistakes that have been made recently? And it probably will only be people that did a user change or an update recently. Like in the past month, I'm going to guess. Right. Because it would just be whatever was in the past month. So what they did is they went into an open invoice. instead of going to the recurring and making the change there, somebody that works for CAAT, they went into like an open invoice or an existing invoice, made a change on an actual invoice that's already created and must have said update recurring. So whatever was in that invoice that person went into, they pushed it back to the recurring, which needs to be edited separately. Yeah, which makes sense. The other thing that we talked about was the tax sales tax rate. There is a out of state 0% option. We have to make sure we select that instead of there's like an auto calculate one that I guess it defaults to and that does put tax on it. if it's not in this like drop-down list then they shouldn't have any access but what I'm going to do because what Kathy talked about is that there's that obviously this is a mess there's a lot of these that are wrong there's a can I tell you this too there were like if anybody has an address it is probably me last fall going in and putting anything in. They never even put addresses on the invoices. No, yeah, I know. So what I did, she sent me a list that was exported from here. And I'm going to have to be sure to go through and start working on updating that stuff with the information we have. Because that's a good like project for her. And that will be very, very helpful for us moving forward also all of those people where they're like email stuff is messed up um like you guys still have people that haven't signed up for bill or genie right and there's a there's some stuff there that needs fixed is that correct i'm sure there is okay between that and support i'm doing the best i can yeah yeah no no i don't expect you to go through and do that that's uh That's way too much. That's, like, tedious whatever work, but it's good for Divisha because she has the time to, like, go through and do that. And she's good about that stuff. She's very meticulous, I guess, is the word I use. Oh, did you hear my lovely – did you see my lovely email this morning? No, I haven't. Oh, go into Discord. Remember the guy that said F off? Or I'm assuming you did. I'm assuming it's a spouse. And I said, yeah, like, you know, sorry about the passing. Really unnecessary. That was the reply I got. Some people, there's karma. And. Did you message me that or did you email? Oh, you messaged me. I put it in Discord. Can you believe they wrote that? Now, from what I understand from having, you know, younger kids, I think that word is used a little bit more loosely now than it was when I was younger. But anybody my age, that is almost like the worst word you could ever call somebody. Yeah. Yeah. No, no, no. It's definitely different. Yeah. Now. Like, I saw that word and wanted to, like, I'm going to be calm. But, like, who does that? Like, what a miserable person. Yeah. Yeah. Really could have just explained, like, oh, here's an, okay, thank you for letting us know, you know. What an ass. Okay. I think those are all the things that I had. Like I said, I'm going to meet with Kathy next week so she can show me whatever needs done. And if you have any questions that she hasn't answered in the meantime, let me know and I can back that up for her. Okay. All right. Did you have anything else for me? I don't think so. I think we're good for now. I was in that training and I got a few callbacks to do. I got to figure out some stuff. So I do need somebody who's who's what's Tyler doing as far as what Mac would have had before. Other than him doing bug testing right now, he hasn't started much of whatever. What what what were you looking for? So I kind of brought it up in the meeting. But remember that, like, I was so surprised that this computer had such a short battery life. I would always bring my charger before with my old computer. I'm like, oh, I'd have to run and go grab it from the other room. And I'm like, oh, it's probably fine. Well, this computer does not have a long battery life either, apparently. So who is it? There's one, like, the guy with PCR capture. I have no idea what else to do for troubleshooting, why it won't log up or start up when you first load the page. I mean, I think if I remember right, like I should have took better notes. I think I was like end of the day or whatever. I might have apparently I forgot to save notes of everything that I did. I did like I mean, I was on for a while. Like I think we reinstalled, we cleared cache, which I don't know if cache is really related to extensions. but just in case we did that, I think we turned off other extensions. I think he went ahead and removed some because he didn't use them, just in case those were conflicting. Is it only on his device, his computer? Well, as far as I know, I mean, my capture pops up fine when I go to a page. It's just a regular LinkedIn account. Like when he goes to someone's page, the capture doesn't pop up until you hit that reload at the top left. So something's causing it. I just could not figure it out. Yeah, I don't know. I'm confused on that. And he wants it fixed. I'm like, I bet I don't know. like I look through browser settings. I look through extension settings. I did a whole bunch of stuff. So I don't know if there's anybody that's like really good at like the backend troubleshooting. What else? Maybe I've overlooked. I don't know if it'll be, I don't know how much he'll be able to do with it, but he does know more about that. So I would send it over to him, but he's off today. Oh, he's off today. Oh yeah. Yeah, that's right. Okay. So that was one. And then the other thing, I think this is going to have to go to McKenzie. Let me think. Who was it? Was it one of my ladies? I don't know why I always confuse, like, Isabella with Shelly Amundson. Was it Shelly Amundson? Or is it Isabella? Isabella. She's got a whole bunch of email things. but she's got like duplicate folders, but I think they're under the pop account if I remember right. Yes, it's under the, so she wants them removed, but I think that's going to have to be McKenzie, right? Yeah, probably. Okay. Can you reach out to Isabella? Okay. Okay. and clear out the duplicate folders she has under the she was all like one thing after another like why is this email not show up like well it's under a different username and why doesn't it show up here it's like well because it only right it the email link is only for the first person not if you have like three people and it's like back and forth okay I need it I'm hoping to get kind of caught up here soon so annoying I broke my test database and well I mean I so you know how we um so that onboarding thing that Mike's been working on for forever and ever and ever at one point I thought that we were going to release it because they were talking about it and so I put it I put the serial code into my database because I was going to start the learning center stuff and I just left it like I never took it out because I don't know I was doing other stuff and didn't think about it and I took it out the other day and now I can't log in and And the database is gone. So that's fun. I'm going to have to try and fix that. Fun. Oh, did we come up with a date for this trial period? I don't even know if you replied back on that for me. Oh, yeah. Do we have an idea? 30, 60, 90? So this, first of all, the trial itself, I did like basically the day before we released the update. So it was haphazardly thrown together. There was a lot of confusion on it. That's why the whole reason that we, that blog post said that AI search was included, that was the whole reason that we have those like calls and tickets and shit. Because. Yeah, I was under the impression from the beginning that AI search was not going to be part at all. That's what was communicated. But apparently instead, it's when they contact us, we can get it to them. Well, that's when I put in the thing. I'm like, wait a minute, isn't this supposed to be job description? It was supposed to be the email creator, the job description. That was not communicated to Drew, I guess. Oh. That was the issue. Like I said. Oh, so can't we just say, oh, correction. You know, I don't think most people read that. Yeah, probably not. I mean, I'm sure he can go in and edit it. Because he edited it to at least kind of be that. I thought that you did. I thought that already happened. Did he not? I just thought we weren't doing it at all. And then it sounded like, oh, we can, but we've got to serial code it. And then give him Lucene. I had to ask James about it, and he said, no, we are giving it to them. And I was like, okay, well, we can't just push it because it requires Lucene. So a bunch of people are going to have it, try to use it, and it doesn't return any results if you have keyword two. And then we're going to get 50,000 calls about why isn't this working. Right. So I would rather have the people that want to use it and notice it ask for it. Plus the switch sucks. The switch is really bad. I'm sorry. I wouldn't pay $10 a user for a month for... The search is not worth it. I think the email generator is good. I think the summary is probably the best of all of them. Just because you can put in a new candidate and click on summary, and instead of having to go through everything, you can get a quick look. Here's my concern with the email generator. when it does generate it doesn't use our tag for name or signature and if somebody doesn't notice it and they just click oh let me use it it's pcr's ai generator that did this it's going to work and they start sending emails without fixing it that's my only concern is if there's a way to tell it to use this at the top and this at the bottom and just generate that middle stuff that would be my comment right now no because you're just sending it it's like you're basically so the way that stuff is set up right now we're using open ai so you are basically going to chat gpt with whatever information it sends and it is returning a chat gpt answer that we then have like recognizing us in the transfer stuff okay right exactly so that is the current issue they are working on a solution for that. I think we're trying to move away from OpenAI, if I remember correctly. Is there a way to pass however it's putting it over to say, use this if it's like, almost like hard-coded in how it's passed over? You would have to literally send every single insert field with the call, and they can't do that. Oh, I would only be concerned about the name and signature because it seems that that's what it wants to generate automatically. Hypothetically, that probably could be done but I think that it would require, I think it would require coding that we don't have like the resources for right now. So I think for right now we're just going to leave it. We might want to make sure if it's not in there, I'll be honest, I don't know, but make sure we at least document it. That if somebody didn't read the instructions, like you know, if you use the email generator, you know, it's kind of passing, you would, if anything that's trying to merge or suggest what to put, you might need to replace using insert fields so that way we're at least protected and someone instead of calling us it's like well you didn't read it. I don't think so. Now that they read anyway we know. Right. But at least we can say hey you didn't read this apparently. I'll just put something on this real quick. I'm just adding a step in there. That'll be easy enough. Where are you? Oh, and confirmed my husband does have skin cancer. It is officially confirmed. Say that again? I'm sorry. My husband's spot on his face was skin cancer. I thought... Oh. They told him, but waiting for actual biopsy results came back. Confirmed. The doctor said, yes, it is. And then now it's confirmed with test results. It's the basal kind, though. It's the what kind? Basal. So it's not melanoma, which would be a lot more serious. Because then they're like your bones and brain faster. Apparently there's different types. So he's got the one that's less serious. So I think he's going Monday to get that taken out. And then he's got, I think he really just went for, he's got this, like, bump on his back. I'm like, I watched Dr. Pimple Popper. That's a cyst. You've got to get that taken out because it's getting bigger, you know. I'm like, you've got to get that taken out. And so I think when he went to have it looked at that, because it's right at the, like, almost like the base of his neck, like top of his spine. And it's getting bigger. I'm like, you've got to get that out. I watched Dr. Pimple Popper. And I'm like, a cyst? It's a cyst. He's like, you don't know. I'm like, I watched enough. I'm like, a lipoma looks like this. A cyst looks like that. And so he's going. Oh, no. It's the following Monday. Monday the 21st, not the 14th. And then he's going on August 11th for the neck thing. I guess when he went for the neck, they're like, hey, we got to check out the spot on your face. he's like gosh just a little you know they're like no I don't think so so ah signature which now I have a spot on my leg that now I really like hmm it kind of looks like what he has I wouldn't doubt that this is and I've had this thing for I don't know how many years I better get that taken out that's what you were saying yeah that you needed to here I'll show you a picture So, wait a minute. Let's see. Camera. Ignore my dry, scaly legs. Okay. I have psoriasis. Oh, my God. My legs are so dry right now, especially because I'm so tan. Oh, but this picture looks really worse. Oh, my God. Are my legs scaly? Ew. Gross. Gross. I mean, we're definitely putting. Like seriously, look how bad this looks. I've had this for years. That's probably one too. That's kind of similar to what he had on his cheek. Look how gross. Let's see. I don't know. It's always hard to tell, but it's better to, it's definitely better to get it looked at. I'm going to have to go to an appointment with him. 1 o'clock, what day is it? 1 o'clock oh, Barry Smith, this email troubleshoot I don't know what's going to go on with this guy alright, I got to I got to go to the bathroom before I do this 1 o'clock alrighty bye",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 335.5027,
    "salad_processing_time": 224.49171900749207,
    "overall_processing_time": 335.5027,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hey, Robin, what's up? Hey, I'm so sorry.  I was in a training session with this thing.  This My Job Matcher, I think we kind of relabeled the original Princeton one.",
    "job_id": "88354a51-63e6-46c2-a70b-590d64435ac0",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hey, Robin, what's up? Hey, I'm so sorry.  I was in a training session with this thing.  This My Job Matcher, I think we kind of relabeled the original Princeton one.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "billing",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3012192316036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}