{
  "recording_id": "3013802583036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:26:19.260264Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:26:19",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Team Sequence. I'm Heather. Oh hello this is David again. I just talked to you a few minutes ago. Fixing all my problems today. What else we got? I so I'm in the PC recruiter view and Outlook and when I am clicking on like a LinkedIn redirect it sends me to I think it's Microsoft Edge, which I don't use for a redirect. Is there a way to set the default to just the default browser? Because if I do it in regular PC Recruiter, it defaults to a regular Chrome browser. So what Outlook does, I believe, is they're just going to assume. That's what I figured, yeah. They're going to call their own program. Now, if I remember right, I wasn't able to do it. Let me just figure out where I did it. I'm pretty sure I've done it on mine. I always feel like it's a weird. Some kind of setting somewhere. Okay. In your Windows search, type the. Wait. Choose file apps and protocols. Open by each app. I feel like it's something else. Okay. Type the word protocol in the Windows search area. Mm-hmm. And then do you get choose a default app for each protocol, the system setting? Choose a default app for each link type. Choose file types and links open by each app. Set default app. No. Okay. What comes up as the first one? The first one is set a default app. Hmm. I wonder if they changed the language in different versions of office. So basically, like, there's, like, HTML, and then it's going to go to – you could set it, or maybe it's HTTP, because I have mine set to Chrome. I'm just looking. What is the link that you're opening? Is it, like, HTTP? It's a LinkedIn URL, www.linkedin.com. Okay. What were the other choices? How were they worded on yours? With protocol. So I get... Oops. I get set a default app. choose a default app for each link type, set your default programs, choose file types and links open by each app. I'd have to see it. Let's do a screen share. Hold on one second. You're getting different choices than I am. So let me see here. I'm on RingCentral too if it's easier to share through that. Oh, I can do RingCentral, yeah. Okay. I was about to send you a Google meeting, but let's see. Okay, if you can open up your RingCentral app, go to video and then click join. Okay. And then it's going to ask you for a meeting ID? Yep. nine four eight one zero. Okay. Okay so at the bottom of your screen if you can hit share, but make sure you select to show your entire screen. Okay. Okay, let me bring you over to my bigger screen. Okay, so let's go ahead and go to Outlook. Okay, so can you go down the bottom of your computer where you type protocol there. Okay maybe it's just maybe it is that choose a default f for each link type. Let's try that one. Finds word of difference. Okay go down to where I'm I guess for HTTP, HTTPS, this is what I did on mine. Unless they just changed it all together. Okay. And you want it to open in Chrome? I want it to open in Chrome, yeah. Yeah, that's what it's set to do here. Okay. I don't use Microsoft Edge. Can I just uninstall it, or is it going to cause problems with other Microsoft? It could possibly. I would keep it in there because it is a Microsoft product. Can you show me what it is you're doing? Let me see if I can. Yeah. So, like, if I'm in a profile, if I do it within the portal when I'm already in Chrome, it pulls it up fine and where was I over here trying to do I just pulled it up in judges. Can you maximize this window? I'm not even seeing the options there. No. Got it now? Okay, that's odd. Okay, let's see. HTTPS. Okay, let's exit out of here for a moment. I want to try something different. If you just go to LinkedIn field instead of using that shortcut, does it open different that way? So like underneath your home phone field? Because you were in the sidebar at the left, right? Yeah. Oh, right here you mean? Yeah, let me see what happens here. Yeah, same thing. That's where I did it initially. I didn't know it made a difference. Okay. What is this actually in now here? What is this? It's weird. You don't even get... I was going to say I don't even get a drop down. Hmm. Okay. Let me... Yeah, this is some other setting. I've got to figure out what's going on here. Okay. Why does yours not even show anything? What was that pop-up? I think that's just the LinkedIn prompt because I'm not logged in. But it will show you everything if you're a logged in user. And I'm not logged in through this browser. Hmm. Okay. What if you hit sign in? I'm going to see what it actually does if you're signed in. Can you hit try to continue with Google, I guess, option? Oh, I don't even know my Google account. Can you go right over to Google, maybe? We're just in a new browser? Yeah, I just want to see something here. Okay, so you see all of that there. Why would it not do it from the other place though? Okay. Let's see. Okay, it's kind of this. If you click on apps and then click on default apps. Okay. Scroll down to the bottom and select choose links by link or choose defaults by link type. Let's see. This is right out of the Microsoft community. scroll down and locate HTTP and HTTPS and it says change the chrome which you have done okay strange I am totally stabbing in the dark but I feel like there was a setting inside Microsoft Outlook the app that had something to do with this before. That is vaguely familiar. I couldn't tell you where, but... Because it's only happening when I'm trying to do it from within the app. And you have Chrome set as your default browser, I assume, too? I believe so. Okay, try this. In Outlook 63, okay, file options. This would be in Outlook. Yep. File, options, and then advanced. So options is at the bottom. And then it says to go to advanced. Where the heck is advanced? There we go. Advanced. Yep. Hold on one second. Okay. Open hyperlinks from Outlook in where it says default browser. See if there's a specific option for Chrome there. Hmm. Okay. Well. Interesting. It's saying here that it defaults to Microsoft Edge, but we do have a default browser. Can you open Chrome for a moment? And then go up to the top right. And I think it's going to be under Settings. Try you and Google. Oh that's it. Okay. Synchronizing. Manage your Google account. Okay. Hmm. candling that's worth staying there Those are all the settings that I'm finding. Yeah, I'm trying to think of other places. I'm even trying to Google. It's real strange that it's set up here. You would think if it's launching from Outlook and that was... Open hyperlink. Let's see. Export Outlook information. Is there anything else in here? Open Word. What's the one above there where it says Open Word? Just out of curiosity. browser open word and definite using that one's interesting that wouldn't be just upper browser open hyperlinks from outlook that seems to be with the one we want though can you hit okay on this and then let's go file exit At the top, let's go choose file and then choose exit, which is at the very bottom left. Okay, now let's go back into Outlook. Try it again. Yeah. If you were just in that record, you could hit name it. It should show your recently viewed to get there faster. Oh, okay. Nope. I'm just wondering if you have something to do with not maybe even recognizing your login. I don't have the app from the Microsoft Store. We're not trying to do that. Because it's not even giving you, like, anything other than opening the window. It's kind of weird. We're not even getting – like, when mine opens, whether I do it from – let me get all features. I don't even – never use Edge, so I don't even know if this is, like – Well, I know you definitely need the Edge Web Viewer within Outlook because that's what's actually showing your pages. Right. You're like looking at a name record. That's actually an Edge Web Viewer. Gotcha. So it defaults to that natively for certain things anyway. Yeah. I got it. Like looking at Daniel, you're actually using an Edge Web Viewer to do this. In this view right here. Mm-hmm. I gotcha. So full disclosure until today when we just reconnected this earlier, I've never actually attempted to go like hit the LinkedIn redirect from here. I've always just done it in the PCR portal. Can you go to your Windows server and see if you can get the again and type in default apps or X is right there okay default apps let's scroll down let's choose Chrome I don't know what this mhtml is. There's a few of them. XHTML, XHT. HTML, XHT. Let's see if there's anything different on mine. And I'm also on a different computer too, so I don't even have Let's see. Your window settings are different too. I think it's just the HTML. Is it a crazy exercise to just change all of those to Chrome? Maybe try this one, Microsoft Edge HTML document. I guess we could try it. So this one down here? What is all these different types? Let's scroll down even more and see if there's anything else there. HTTP. HTTP. Hotel protocol. Okay. Can you go back to just apps? What about apps for websites? What's in there? Open links in an app instead of a browser. Nope. OK. Go back. Let's try advanced app settings. Okay, that does not seem to be anything in here. And it doesn't make a difference if you're already signed into your office, right? it doesn't really matter. I'm sorry, into your LinkedIn account? It doesn't seem to because I'm signed in the Chrome browser. Oh, that's right. Okay. Can you open Edge for me for a moment? see it's not even can you go to the three horizontal dots here up at the top right Can you go to settings maybe? Click on default browser. going to have to just kind of flip through here. Not allow sites to be reloaded. What's under? Yeah, I mean, I think we're just going to have to just flip through these. I don't even know if this is where it would be. I just don't even change that. Let's go like through each section profiles, privacy search. I think we're going to manage account. Okay. Maybe go to appearance. It just looks like colors and themes. browser behavior customize your general browser behavior it doesn't seem to be that what's that what's the next one start home and new page tab Show home button on the toolbar. Let me see here. Solving real mysteries here today. with RIDA you can't even tell you don't even see the options for it I'm going to tell you, give your husband the next thing you do. How much do you want? There's no insurance. All that's very wise. We're having service. We're not getting so costy. We deliver this all. That's true. You want to help? Use your phone. Call 1-800-5-3-3-1-1-1. That's 1-800-5-3-3-1-1-1. Call 1-800-5-3-3-1-1-1. Bring me the next number. The people that were here one day, Lenny Haas, said why you're allergic to that. It was just normal water that you could see once you were in a cave. But if you went in gender-oriented caves, that's great. But please go in a central pond and try to find some. You guys, you know, you said it's great. I did? Yeah. And I'm a natural person. We're going to pray now. Seraphim will pray for us as we will actually form a group that's the most cognitive decline all group of memories focus and concentration location Sarah Coleman brain wall is integrated with the smaller brain that's brand new to the community now also available without a free bridge at SarahColeman.com and Amazon it changes my brain for all to be recommended Sarah Coleman brain wall we've got job ads on the island today and we have some more videos that's great to watch another version of the brain wall is integrated with the smaller brain Hmm. OK. Accessibility. What's under System and Performance? Performance. Background, startup boost, practice setting. Okay. Well, is the goal to use the PCR capture from there? Yeah. If we can get it working, great. But if you need to, you know, have them look around and figure it out. Let's try this as an option to even see if we get it to even show up. Let's go open up Edge. I don't know if it's going to work, but we're going to. I mean, I know you can use it in Edge because you can get a Chrome extension in Edge as long as you start there. So let's just open Edge. I'm just more concerned, like, we're not seeing those options at the top. Okay. Okay. Can you open Edge and go to do a search of Chrome Web Store? Right here. Okay. Yep. Go ahead and do that. Okay, so go ahead and type in PCR capture. Click on there. Click get. And hit allow. Add extension. Okay, so I'm going to have you click directly on that little funny puzzle piece option. And hit the push pin next to PCR capture, that way you can see it. Okay, and then I'm going to have you also try this. See the three horizontal dots? to where are they gonna call it I know they call it go to favorites this is different how is it in this one like a 10 I'm so used to using Chrome anymore Thank you. I'm good, by the way, if you want to keep me on the line and troubleshoot or you guys have to kind of research this and circle back like it's not super time critical for me. Let's try this though. Let's have you go back to that person and let's see now that we have this if we even see that icon up at the top. So you have to be over in the mail tab. Oh, that's why. Okay. And then just go to name. Right here? No, go to name up at the top left. In the top, oh I see. Okay. And just click you're in that search area, if you click just left or right of it, it takes you, it closes that window. Now, um, see where it says search, by your quick head? Just click just to the left of it, and that closes that pop up. Okay, alright, so let's now go to his name. Go to attachment or I'm sorry, the LinkedIn URL. Sorry. Okay. Hmm. I want to say. Why does it not... Okay, let's exit out of here for a moment. Let's copy your database URL. I want to see if it would actually pop up. I can't even tell what browser that is. Let's go over to your main PCR in Chrome. Copy that URL at the top. Go back over to Edge. No, just click directly on the extension at the top right. Paste that URL into that field. You got to paste it. Copy that in there? Yep. Okay, hit login. Put in your PCR username and password. And make sure you select which database. Click login. And then do you like people to, like, do you like to have them go to the default or do you like them to, do you like to get the company? I like to be able to get the company. Okay. Okay, so we'll see where it says capture the default company. Turn that off. Okay. All right, let's exit here. Okay, close there. And then let's exit this screen. Okay, let's go back to Outlook. and let's click on the at LinkedIn icon again can you go ahead and sign in um Thank you. Okay, let's give it a try now. I just want to see what if there's any difference. Why are we not seeing any? Can you go back to his name record? and then click the icon to the right of the LinkedIn field. What is going on here? Can you see this? Yes. I'm going to ask for control here. Because why is this not even giving us any info? About link permissions for this site. Edge setting content site details. Edge settings content site details. Okay, let's see if that has something. Where was Edge? What was that other thing saying? settings um Thank you. and then we'll get you in line to play the scene. Now the GOP regular is worn over. Now the morning bell is coming right down. . . . . I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. I got somebody to bet. um there here What are these? Two blocks. That's just Facebook, okay. That's what I do. You know, ultra-high-end drones, you're wearing, this is what my job is. The middle window is recommended for the computer. What? You're able to keep to love it at every game. You know, it's a great job. Beautiful breakdowns are complex, but with endurance, you can never stand a pocket for a company of care that's getting a particular $14,000 investment. All right now, it'll be $300, but we plan to go now. We have done a good job, and just throw it in the list of last. I'm going to just delete cache images and files only. Nothing else. I don't use anything in there. It's nothing I use or care about. um Yeah. The whole world, but since my new podcast called the best people, they've introduced some of the smartest, funnest, and wisest people I've ever met. They're like Jerry Pusha, Rachel Maddow, John Grisham, Jason Aiden, Jeff Innes, and various other partners and people. I think they're a beautiful cookie area, but sometimes they're right too. The best people, the whole world, is perverse and insensitive. They've overstated all the strategies, and are actually innocent. I mean, worst case scenario, I can use it out of here. can we just add the extension though so I can well the problem is I'm not getting anything to show up at the top oh for the toolbar yeah like I'm not seeing anything pop up here which is kind of I'm trying to figure out why Almost like it's some lite version of a browser. About link.com. Connection is secure. Like what is this? Thank you. What is this portion? Kind of weird. Let me see something. Thank you. um okay Hey, unfortunately I don't have a solution at the moment. Right, that's fine. If there is a way to do it, I would like to move it back, but it's not the end of the world. To HTTPS, I'm going to be having, like, what is this? I'm going to doubt Google, right? Well, that's not what I meant to say. Okay. Possible causes, temporary browser glitch, sometimes a minor browser issue can prevent specific settings pages from loading correctly. Could that have something to do with the toolbar? All right. I'm going to call you right back. Head update. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. All right. There it is. There it is. three years here was made for the right to go to Jacksonville. The corporate rate to individual rate for all the residents with a bracket and annotate tax on a national record. That's in the box. And that will be a digital bill that has actual and I control the signing that bill and it looks basically like it was without any universal effects. Thank you. Right now, as we're going to know, how we help on 1 and 2, there are a lot of people on both our networks explaining that I'm playing the board is required to preserve our philosophy. And I'm going to remind you, we're going to do a podcast together each weekday featuring our full conversations and analysis, and you can listen to whatever you want to hear. I'm going to have to look at, I'm going to have to, I'm not really sure on this one yet. Yeah, fine. Yeah, if you can figure something out. Yeah, and I have a call scheduled to start in six minutes. So, let's see. Yeah, I do. You guys will just call back if there's some kind of workaround? Yeah, I mean. One more. is hey is Thank you. Do you see an option that says you want this app to make changes to your computer? Yep. You run that. Hit next. And hit repair. And then hit finish. And then after this, I really do have to get ready for a call that starts in three minutes. Okay. Okay. So we're going to try going to Outlook again. Yeah, I'll need to look into this more. Yeah, no problem. We can fix it later. Okay. All right. Thank you for turning in. Appreciate it. Thanks. Bye. Thank you.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 385.987505,
    "salad_processing_time": 248.9341208934784,
    "overall_processing_time": 385.987505,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Team Sequence.  I'm Heather.  Oh hello this is David again.",
    "job_id": "b8b91aee-ad44-4033-966b-692f822fe950",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Team Sequence.  I'm Heather.  Oh hello this is David again.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3013802583036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}