{
  "recording_id": "3014727956036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:27:59.156957Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:27:59",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Enter your participant ID followed by pound. You are in the meeting now. You are the first participant. Please stand by. I'm going to go ahead and start the recording. Hey, Jim. Hey, Greg. How are you? Good. How's it going? Not bad. Not bad. All right. All right. So I want to show you around a demo of PCRecruiter a little bit. I'm going to kind of give you a general walkthrough, take questions as we go. So if anything is of interest to you there. you wanted to specifically look at that you recall from when you used it in the past or just kind of a general walkthrough? No, just walk me through it. Like I said, yeah, my struggle with it all from the beginning was, well, it was a lot, but my database got filled up with a lot of crap. And, um, hang on one second here. And I'm never sure, you know, I don't think I ever really figured out how to use it right. And so, you know, maybe things have changed a little bit with it. Newer versions. I'm not sure I ever had the updated version. So just show me what you got. Let's talk about it some more. For sure. For sure. So I'll share my screen. let me know when you see it okay should be looking at my sign-in screen right now yep perfect perfect so let me go ahead and get myself logged in so I'm going to show you the PC recruiter 9 product right now this is kind of the bulk of what most people use we have a PCRM a CRM product called PCRM runs off the same database has a little bit different format almost all the same features and functions but I always like to start with this version too because this is a little more mature piece of software so I'm going to get logged on It's all cloud-based, so you're going to be able to log on from any internet connection, PC or Mac, that doesn't matter. And once you're in, it's going to look mostly like this. It is very configurable, and you're going to be able to set it up to really, you can redesign screens, turn buttons on, move buttons different places, a lot of functionality. You can configure a lot of the screens there. So mainly, menu at the top, that's going to be primary navigation. the middle is going to be for searching search results and lists the bottom is going to be for the records themselves so that's going to be generally how that would look and how that's going to work in your main menu bar you're going to have buttons for three of the primary pieces and you're going to have names companies positions so that's how you get to your three primary record types in pc recruiter names companies positions names of course going to be your candidates also your contacts companies companies you're marketing toward or companies that are your client companies and positions the jobs you're looking to fill. So that's kind of the basic three primary record types we work. Also up here you have things like a daily calendar. So you have a schedule up here that's going to let you schedule meetings, phone calls, follow-ups. It'll sync with Outlook and Google Calendar. You're also going to have roll-ups, which is a list creation tool. So you're going to be able to build lists within your database. You can build lists, call them whatever you'd like, add to them, take away from them. So a lot of flexibility in how your rollup lists are going to work. So very, very configurable there. A lot of reporting options we'll take a look at. But basically, a lot of your day is going to be spent working in the names, the companies, and the positions. So if I go into company here, it's going to hold on to the last 50 that I looked at. There's a quick search over here if I needed to search a company by name or city or state, keyword searching, Boolean searching is all in here too. But if I go into, let's say, Vandelay Industries, that last one I was looking at, I'm going to be able to see right here, here's all of the fields that I've chosen to show for this company record. Entirely configurable. If you want industry-specific things, you can add those fields. Very easy to do. And then there's kind of two subsets of data that are linked to the company record here, and those are going to be your jobs. So here's all the job openings I have at that specific client. If there's a little chain link next to it, that means there is a pipeline of people connected to that job. And then I also can see I have a grouping of names as well. So these are my contacts or employees that I work with there or people that I've placed. So these are going to be all the people that I know that I'm working with at that company. OK, so everything is kind of centered in those three record types. So working, you're going to work quite a lot in your positions. So if I go into positions, I could click in any one of these down in the bottom frame or I could go to the positions. positions. This is going to show me the last 50 positions I was looking at that I was working with in the database. I can click in any one of them. That's going to show in the bottom frame my custom design screen. Again, I keep it in three columns. Put any fields you wish. This could interface with your website if you want it. So when the job is entered, if it's available and has one opening or more, you can have it shown on your website. So it'll interface to website. Candidates can apply online if you wanted to show that. You have a nice description down here you can paste or generate a description for the job in there and the nice thing about the job is every job is going to have its own pipeline of candidates so if you're looking at pipeline this is showing everyone you're considering for this job so you're going to be able to see all your different names I've got an inbox over here to the far left that's kind of you all of the initial people that I am considering as I move them through my process maybe I reviewed mark today maybe Hassan I contacted and maybe Steve King wasn't qualified I can pull him right out of process so I'm going to be able to with a simple drag-and-drop create a searchable trackable reportable event as I move individuals through this interview process so really easy to do really easy to work with within there this interview process is entirely configurable so you can put in your own steps your own colors you have up to 18 spots you can use and that's going to give you the flexibility to design this around your specific type of hiring and if you needed to have more than one more than one interview pipeline in your database you can do that. So if you have certain clients that have a different process you can have more than one interview process in your database there. Okay now what's nice too is as you move people through that process if I looked at Colin Bay for example if I look at his name I'm going to see a custom view of my name record there. activities is going to show most recent was a face-to-face with that job at the Idaho National Lab. So that activity is automatically recorded. Also below his resume, if I had one on him, I'm going to have an area where I can see every job he's ever been linked to and how far he got, who did it, and when it happened. So that drag and drop is going to create and trigger some different events at other places in the system. So it's going to be easy to keep track of anyone. Also, if you're looking, we'll go back to his record, if I wanted to look in his activities, I could see anything like emails I've exchanged with him or if I scheduled a follow-up or whatever, I can add an activity with my own specific activity type and I can create follow-ups and then I can report on that data as well. So anybody I go to, most recent activity is going to be whatever happened, be it that it was a phone call or an email or an interview, whatever it might have been. Okay, so that's kind of the gist of everything in a nutshell. So does it make sense so far? Is it kind of what you remembered, different than you remembered? Any questions? Yeah, a little bit. Yeah, a little bit. I'm not sure I ever got that deep into, you know, using, you know, the pipeline. Yeah, the pipeline's newer. So it's only been around three or four years maybe. But we've also added some other new functionality, including the pipeline reporting. So if you needed to go into analytics, you're going to be able to build custom reports within here. So if I looked at my metrics, maybe I have a pipeline activity report. So I'm going to be able to build a report using each and every one of my pipeline interview stages. I can add them take them away I can do different time periods if I wish I can also filter to look at what I'm doing by job or by client or by recruiter or anything like that so I have these custom analytics reports that I'm able to build off of the data that I'm doing every day anyway you're also going to have the ability to send out email campaigns I think you said you didn't do a whole lot of that was that when we spoke this one you said you didn't know a whole lot of campaigns yeah if you need it it's there can even do sequences So if you want to just send one email, pause five days, send another, drip campaigns are included in here as well. You're also going to have a nice keyword search. What I like about this is how easy it is to find any individual. So if I go to advanced up here, I'm going to be able to type in my Boolean logic. So if I wanted sales and marketing, I'm going to search my whole database. And I like to search all, but you can limit it and only search keywords or only search resumes or anything you want to do there. So I'm going to leave it at all, and if I do my search, it's going to show me there is all the people who have those words that I searched for, and that score column is going to show me how many different places they appeared and how many different times. So I can see it's going to highlight every instance of my searched upon word as I look through their resume or their searchable notes. Or if you happen to have a LinkedIn summary, we can pull people in from LinkedIn, Dice, Indeed. We have an app to do that. those are stored in the profiles area. So I can see it was found in his LinkedIn summary that I happen to have in here. Or one or more of his attachments, even a custom summary screen. You can even tag people if you needed a keyword tag people with various different skills. I could tag them out of a predefined list. That's going to be searchable too. So a number of different ways that you're going to be able to find people, search on the data. When you get your results here, you're immediately going to be able to tell if anyone's already in a pipeline if they happen to be here they're on assignment if you happen to be doing contract or if they were a someone you've already placed or a hiring manager they also like you'll see my plan shed is placed so he's got that little red briefcase that's a hands-off there and then you have the ability and you can check off any that you wish you have a number of things you can do you can pull a map put a pin next to everybody's location you could send about mass email here, link up to a position, get them into that pipeline, start contacting them and moving through that process. Maybe you just want to put them on a roll-up list and use that as a pre-pipeline. You can do that too. Even merge a dupe if you find there's a duplicate record. So a lot of data handling, a lot of mass data moving or individual data moving within the system there too. And I always like to show the capture piece. That's going to be, like I said, a nice way to pull people in from any of these different sites. Darius versions of Zoom Info and LinkedIn, Indeed, CareerVenture, whatnot. When you go to anybody's record on LinkedIn. Yeah, yeah, yeah. If you have Zoom Info. Yeah, I use Zoom Info. Yeah, if you have Zoom Info, you can not only capture them using a capture tool. Also, in the advanced search, there's a Zoom Info search up here that you can search Zoom Info and download them in bulk. Or if you have an individual candidate and you wanted to enrich his information using Zoom Info, you can go right here. If you have your credentials put in, you can update via Zoom Info. And that's going to go out, look for the cell phone, the email, anything like that, so you can enrich it. So we work three different ways with Zoom Info, also with HireEasy and all of those other sites you saw in that capture piece. So a lot of different ways you can work with that, too. Okay. And then, like I said, we also have our new interface slash PCRM product. It runs on the same database, and it's a totally different interface. But it's the same basic idea. It adds a couple of additional features, a little bit more CRM-centric. So if you were looking at the PCRM version here, this version kind of goes left to right. So it's a little more modern. You're still going to have names, companies, positions, roll-ups, schedule, a lot of your same stuff. However, if you go into names, it's going to look a little different. It's a little more interactive and a little more easier to pick up. I can edit in line here if I wish. I have a lot of things I can actually contact them right from the main screen. I could add an activity, add a node, put it on a roll-up, do a lot of things from there. And then it's also a little more configurable as I go in. As I click on a person's record, it's going to slide in from the right-hand side of the screen. And what we've done is we've given you a workspace that you can customize only what you want to see in your primary workspace. And then you have all these other elements. The details is going to be every field you have on the person. A feature I like about this is if I'm looking for phone numbers, just type in phone, it's automatically going to filter down only phone number fields there. or I could look at their notes or their resume. So I have a lot of different ways that I can reconfigure what my records are going to look like in this different interface. And then this one, like I said, if you're into it, it adds a deals workflow. So you essentially have a sales pipeline that you can put companies into the system and move them through a process. You can kind of say, I want to call them to email, something like that. It'll prompt you to call them or anything like that. So you can kind of move them through contract signing, contract sent, closed the deal. Maybe they're a client now. You add a position in right from there. So, adds a couple of new features and a whole new interface. And you could, with PC Recruiter, you get both versions. You can kind of pick which one you want to use, depending on what you're doing or depending on who's using. Some people really like this new interface. Others who are used to PC Recruiter 9, which is this version, they prefer this. Nothing wrong with either. They're both around. Neither one's being discontinued, so you can use either one of them there. Okay. Now, any questions on anything? Was there anything you wanted to drill down into? I tried to give you a good 30,000-foot view of some of the basics, the basic functions of this. No, it's good. Is there a way people are using it more effectively than, you know, for a solo guy, what's the most effective way to use it? I mean, what do you, I mean, I used to just put stuff in there. I don't really do reports. You know, the roll-ups were good. If I end up bringing somebody from LinkedIn, does it automatically put them into the company tab? It could. It could. When you bring someone in from LinkedIn, you can say you want to bring them in under the candidates area, if they're a candidate, or if you want to get their company in, it'll create their company record in your database and link them to that company. So a couple of options there. so you have a few options around how you do that. But yeah, if I wanted to go in, like if I went on LinkedIn and I wanted to get anyone, if I go into, I can just go into anyone's record. Oh, she's already in her little option. You see if the little PC recruiter icon pops up next to their name, that means it's already in your database. So that's a quick visual indication there. But anybody that I want to bring in, I think, I think mine is set up, so if I wanted her record, I... to be able to pull her in just by clicking the little quick to add that's going to pop up over on the right hand side of the screen and that click to add is going to first make sure she's not already in the system second it's going to pull in the information show you what it's importing photo name title email and phone if your first degree or if they make it public sometimes you don't get that though it's going to usually pull in her city and state you can put in a note you can also turn on features to add them to a roll-up list or put them right into a position pipeline if if you wish. And then here, I have it linked to candidates, but if you wanted, you could have it create a record for Pubmatic and link her to that as I created the record, either way. So then when I create that record, she's in my database already. So if I go in into here, easiest way, I go to Dashboard, My New Names, there's Paula, she's got a record in here. I have one-click access to her LinkedIn page, her photo, time, date, username, stamp, all that data's filled in there as well. So all of that's gonna be very easily accessible right there. Interesting. So I could do that too. And then she'll go right into, so I could just put like, you know, I, you know, what I'd like to do is figure out how to get my hiring managers in. I, you know, I guess roll up, you'll get a roll up list, hiring managers, people I want to just continue to start to send stuff out to, you know, maybe updates, search updates, things like that. You could do that. You can pull people in like that, and you could have them on a roll-up list and send out updates periodically. So you could do that through your email campaigns if you needed to. Okay. I got you. Yeah, so it's about the same, pretty much the same in a lot of ways. Yeah, this old interface is the same. We've added the new PCRM interface. But, yeah, this interface looks pretty much the same as it has for about the last 10 years or so. It hasn't been drastically changed really that much. okay I got you what are most people how are most offices using it are they using it for sequin you have to or you know for marketing as it well I guess I feel well most officers are using it for recruiting a little bit in the marketing side more and more people are coming into the PCR M piece that was released maybe February so it's nothing around all that long but more people are starting to utilize in that capacity. Gotcha. Okay. Yeah. I mean, it's pretty much the same. It seems like it's a little bit more easy. Perfect. What's the monthly on it now? Well, if you were looking to go to premium, which is what most people go with, the premium is going to be one 15 per user per month. And that's going to give you everything you've looked at here. You can add or drop users as often as you wish. And then there's a one-time setup of 750. That 750 is going to include 10 hours of training. It includes also the database setup, all the installation of the, if you wanted to integrate with Outlook, Gmail, Capture, Zoom Info, all of that's included. And then 10 hours training included on that as well. So 750 one time, and then 115 per user per month. And does that get me all the – does that get everything I've got now back into PCR? What is your data in now? What's your data currently stored in? I use Clockwork now. I've got – I don't know. Probably 10,000 people. Okay. A couple of options there. If you can get that data out into a CSV, easiest and most cost-effective way, and the quickest way is going to be to import it from a spreadsheet. So we have a spreadsheet import as part of PC Recruiter. You just go ahead, go to Names, you import list. So you'd be able to map that list in with the guidance of the trainer on the first training. We do data conversion services in-house, so you could have us do a conversion for you. Those are $1,000 or so. Usually they take 60 to 90 days. And Clockwork is one. I don't know if they've done it before. like I knew they do a lot of Bullhorn and Big Biller and those but I don't know if they've done clockwork a lot of times so they should be able to do it but it'll take 60 to 90 days be about a thousand bucks whereas if you can get the data into a spreadsheet you can just map it in much easier much quicker okay perfect cool all right yeah it's kind of as I remembered it so all good um beautiful okay yeah do you have any kind of a time frame for a decision or a time I should follow up? Yeah, I'm kind of thinking about towards the end of the year, like November time frame when things start to slow down a little bit is my thought process. Candidly. I know I get out of this contract I'm in now too. I think I'll commit to these guys until November, December, which is fine. It's no big deal. Okay. Yeah, so I would say, yeah, if you're not doing a conversion, really just sometime around November, December, if you're going to do the conversion, you'd want to get that started a couple of months before your contract was up. So just know that. But if you're not conversing, don't worry there. Let me figure out how to get the data out of Clockworks in the best way. Because I've got, you know, everybody, like I don't have roll-up lists, but what they have is tags. So, you know, you could, you know, tag like a, you know, VP of engineering. Whereas you guys would have it in a roll-up list. You know, they have it in a tag. So I'm trying to figure out how to get, you know, how to get the tags such that you guys get imported or could all be imported so that I don't have to go back and reclassify everybody again. Yeah, if you get those into a field, we can often map those into like a larger field, maybe even the notes area. So we can map those in. So that might be some way we could do that. All right, cool. All right, Jim, that's perfect. Let me work on my end. Very well. Let me know if you have any questions. I'll check in maybe a month or two if it's reasonable. Yeah. Let's do that. It's perfect. Okay. Very well. I'll put you down for that. Anything you need in the meantime, feel free to give me a call. Thanks, Jim. I appreciate you. All right. Thank you, sir. Appreciate the time today. Thank you. Thanks, Jim. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 446.358298,
    "salad_processing_time": 210.83774828910828,
    "overall_processing_time": 446.358298,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "job_id": "f497aecf-7d3d-44be-8df7-3fa70d245861",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 1
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "general",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": false,
      "solution_offered": false,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3014727956036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}