{
  "recording_id": "3014660315036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:27:55.277224Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:27:55",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence. This is Robin. Hi, yes. I am calling because I am obviously a PCR user, and I'm not able to capture my Indeed resumes like I typically do. It won't give me the little box. Okay. I do need a moment to finish writing a note here real quick. Yes, no problem. No problem. Let's see. Okay. I am so sorry about that. No problem. But I will just forget my... Okay, and your name is? Tracy McBride. Tracy McBride. Okay. Oh, I think I talked to Ann earlier today. Oh, did you? Yeah. Yeah. Like, wait a minute, that company name looks familiar. Why? I think I was just in this record. Yes. Okay. Let's see here. okay so you're trying to use pcr capture is that the issue right well yeah and usually i when i'm in indeed like i click on a resume it usually that little capture box comes up and i can click on it and then at least get it that if it's a new person into the system okay Could be a couple different things. Do you happen to have RingCentral? Yes. You do? Okay. Let's meet using RingCentral. I need to take over some screen control. Sometimes it's easier. I mean, we don't really use it, but I know I have it. Okay. So if you open up your RingCentral app. Okay. How do I do that? Just go to hold on. Okay. If I'm in my apps, let's see. RingCentral, hold on. Oh, come on. Okay. Hold on. Why isn't it searching for me? Because that's the first thing whenever I restart, it comes up. I could do it another way. I mean, we could just do a Google Meet if you want. Yeah, that's fine. oh I got it okay if it goes to ring central okay okay oh I got to sign in I don't even know what our account is we don't use it I have it but okay hold on Tracy I'm trying to sign in Let me see if it lets me. I don't know what my password is. Okay. It's okay. I'll just send you a Google Meet. Let me just. Okay. Sorry. That's okay. Don't worry about it. I obviously have it, but we don't use it. Okay. So let's see. So is it Tracy at PFNRI? Is that the? Correct. Okay. New meeting. I probably didn't have to do it that way. Okay. She's got something that's got like a meeting link in it. It would come from Robin at mainsequence.net. Yeah, I just, yeah. Okay. Okay. I'm hitting. Okay, so you're going to join with Google Meet. Okay. And we don't need camera or microphone since we're already on the phone. And we're going to be watching the screen, not your camera. Gotcha. Okay. Let me put my name in. Yes. That just lets me know who's joining. Okay, so I've got to admit you. Okay. All right, so if you can go at the bottom of your meeting screen, there's an option called share screen. rectangle with an arrow that points up. Mm-hmm. Click on that. Okay. And you'll be prompted to go over to entire screen. Okay. Share. Yes. not showing anything did you click on the screen to show over when you click entire screen gives you kind of usually like a preview there you go okay all right ignore that this is bouncing around uh if you can go over to i guess you're probably using chrome when you're in indeed okay so go over to Chrome. So we want to keep this tab open, but we're going to like just ignore it. Okay. So let's go ahead and go over to LinkedIn or I'm sorry, Indeed. Do you want me to log into this? Well, are you using PCR capture to bring them in? yes so here's an example i'll go and i this person can you can you see my screen okay i go like this then i click on her okay so this is opening an edge okay okay that i don't want it to open an edge but i don't know how to change yeah that's just because you're in outlook and it's going to open its own programs. What if you click on Sarah's name again? Usually that box comes up and I can click and it's not coming up. What if you click on Sarah's name again? Like so you're actually going into her profile. Oh, that's just a clipboard. Okay. I'm just wondering if it's how we're getting to her thing. Resume. Yeah. Yeah. Like it might be like a different way that how you're open. Is there like a view profile option? Yeah, see here, if let's say I do a search, let me see what happens. Let's see if I open her up. I don't know. Can you click directly on the extension for me? Up at the top of your browser? Yes. Well, this is now in Chrome, so that's not where we have it. go over to the one in edge yeah you have to add them separately for chrome or edge because they're different browsers um can you click directly on the extension for me over at the left like that purple green and blue one so this is in your edge browser oh yeah yeah sorry yeah okay and you want them going into it's called the default company right yeah okay so you do a lot of things turned off here for some reason that's probably why I don't yeah but I don't have them turned off in Chrome is that but yeah it's Chrome and Edge are going to be separate they're two different browsers so see all these little sliders you're going to have to turn those on I don't know why they would get turned off I don't know yeah and then scroll down like if you don't use CareerBuilder a lot of people don't even use those anymore we don't use CareerBuilder yeah facebook you get nothing useful anyway yeah all right so let's okay and then you i'm going to the default company right yeah okay i would turn that off and then back on just to kind of reset that very bottom right option just to make sure and then turn it back on okay let's go back to what you were doing before and start over. Okay, let me go up here. Yeah, it's open as much. Yeah. It always usually pops up and I can add this person. Let's click on the extension one more time. Maybe it's not even connected to your database. Let's click on it. Let's hit log out. Let's hit log in. then put in your credentials. This is what I'm pretty sure this is. No, would not be a full, it would not be an email address. Okay. I don't know what the password would be. I'll tell you if the username is right. Okay. Let's exit the extension. Okay. See over at the very far left we have like that reload option at the very left of the URL. Try that. I wonder if it says smart sourcing. Maybe that's like that URL is different. What if we go where it says candidate Sarah Friel? Is that like a different way? No, because it's, yeah, Yeah, what I do is I go to my, like it was an Indeed alert. Here, let me. That I had. Let's close out here. Okay, so it's like my Indeed alert. 801. Okay, so then I reached out to her. Sent a message. And now I want to put her in PCR. And usually I'm able to do that with the little box that comes up. And that would normally pop up exactly on this page. On the right, on the right-hand side, yeah. Okay. And I don't know why it's suddenly not letting me do that. Okay, let's go to the Manage Extensions icon, which is like that funny-looking puzzle piece. Yeah. Oh, what's that Unblock Origin? What is that? What is that? I don't know. Let's click Manage Extensions. Let me turn this off and back on. Let's do the Unblock Origin. Oh. Let's just turn it off for a moment. Let's just see if that has something to do with it. And then where it does say PCR Capture, let's go down where it says Details. And I'll say allow access file. Is that something I usually have selected? Hold on one second. Okay. Let's try it again. Let's go back over to your main, your Indeed page. You want me to X out of here? Yeah, you might as well. Okay, let's hit the reload option. That does not appear to be. Do similar cancer in her resume. Okay. Not really that familiar with Indeed. Smart sourcing is... I wonder if my LinkedIn will let me. Now, this time you're going to be going in through Chrome, so you could have, like, different settings there. So that's something to be aware of. Yeah. We're not integrated with LinkedIn or Indeed or even, you know, like we're actually, our extension is just reading the page, but there's also other factors that's based on browser. Okay, so let's see what happens when you go to somebody's page on Indeed. Yeah. Okay, let's go to, hold on. Let's see this. Yeah, here it is. All right. Let's go back over to your Edge. And let's go to Indeed from here. that'll help me kind of narrow down is it the extension or is it indeed um do you have a new tab okay and we'll go well no but at linkedin i want to see if the extension works even on linkedin over here oh we're linkedin or indeed you're going to go over to linkedin i want to see what happens if you I'm trying to narrow it down if it's Oh on Chrome I mean on Edge I'm going to see what happens here with LinkedIn Oh gotcha gotcha I got it okay LinkedIn Okay Okay Let's call up anybody Yeah okay so that one popped up no no it was it showed there for a second oh here it came it didn't know it did it did okay so it's something on indeed okay so let's exit out the two LinkedIn tabs. And then let's have you click directly on the extension. Let's see if we can force it to pop up. I don't even think works on anymore to do it that way. If you click on the extension at the top right, like what happens we just it's just going to give you that preview right yeah yeah just click on there yeah just click on there okay we still have indeed selected now and let's scroll down I don't think there's any more indeed related options they're all just gonna end this to zoom info master job Street employee oh can scroll up a little bit to where you are going to see Indeed. HTTPS www.indeed where these come from resumes to indeed.com. I wonder if that's the difference. Sometimes like they do is they change their URL. Okay let's have you go to candidates and start and do a search for Sarah Friel. Let's see if that link is a little bit different. Okay. Hold on here. oh I would typically go zero let's see Naperville, Friel, Sierra, Friel. Okay. Okay. Okay, same page. Hmm. Hmm. Let me see. Let's see. And is that the only link that you get in that? I'm going to try another one just for... I mean, I could create a ticket, but we do not have an Indeed account, I don't believe. So we might have to ask for your credentials when we have a developer available to work on it to look into it further. As in, so I need to know my credentials? All right. And then did we try Indeed but within Chrome? You only did the opposite, right? No, I don't. Yeah, I think. Let's see. Because it could even be that Indeed displays differently in Edge versus Chrome. We'll have to see if there's any difference here. Indeed, let me do resumes. Usually it's the smart sourcing is what we use. So let's pull up somebody. Let me do the same. I'll just do the same search I just did. Or do they go to a project? Okay, real Naperville. Okay, and this is exactly what I did in Edge. nothing but I used to like that's just like I think it started on Friday I had some issue and I never yeah unless you need to change something with their pages Yeah. Very possible. I mean. And you know what? Friday I did get my new contacts, like 30 more contacts that came on Friday. And since then I've had an issue. Were there any, like, account changes or anything like that? Yeah, there is something different. Yeah, like you pull up. Yeah, there is something different. like when you get an alert okay so reach out to them then no no no no no no no i'm just trying to i need to understand what's different yeah something new came up like you have a candidate and now you can you either message them or you can say not a match that's new what if you close that option Let me just see if this could be something. See where it's got X over at the right? What does that do? Okay. Now let's hit the PCR capture extension. Actually, hold on. Okay, let's hit the X for a moment in here. Okay. let's hit the reload option at the very top left yeah they changed where things are located on their page that could certainly be an issue they added this thing not a match that that added not a match that is new okay and i wonder if that's kind of interfering yeah not letting it I wonder, like I asked my colleague Tia, she's having any issues with getting Indeed resumes into PCR recently. yeah i said because it doesn't seem to be like our extension is not working in the browser because we got it to work in linkedin it's just it's not working on these indeed pages do you have any messages that were from before this change like when you would get these emails um hold on like these indeed resume alerts let's see monday the 7th let's see yeah here's a candidate okay let's just scroll down indeed resume alert Do you want me to open this person? Well, I wonder if they're going to change the links. I don't know. It's still got that. They probably redirect those. Because, like, even, like, all this, it's really not a page. See at the top? It's like a search. Yeah, right. And it's resumes. And there's no other way to get to somebody's page, right? Not from my alerts. This is how that pops up. Like I usually just click on, as opposed to if I do a search. You want me to do a search and see what happens? No, I'm just wondering once you get a page, is there something where you're taking it off the search area and you're really just going into the profile? Like that's just saying copy name. oh that's yeah what if you just click that link is that anything like a different view no it just says name successfully copied oh and what about over at the left just a little bit see how like underneath the name it's underlined Yeah, nothing. Can you go to somebody that you would have had a week ago or so? Do you have anybody in your database? Go over to your PCR database. and then go to I don't know if you're going to have it go to name where you've gone into any of these where they've been like from a week ago she was a LinkedIn yeah usually if it's a picture it's a LinkedIn person because that's the only one that gives you pictures Yeah, there's a... What can I think of that? We have to go to new names down at the very bottom left there. Go where? New names down at the bottom left. New names, okay. and then at the top where it says new names today let's change that and go last six days I guess any of these looking familiar that may be brought in from Indeed. You might need to go like a little bit further back. Friday. Oh, this Tampa's. Yeah. Oh, Keisha. I think I just put her in. Thank you. yeah shouldn't tell me the date only well scroll up it depends what your hip configured into so those are from seven to eight that's what yeah maybe I'll oh so go to the bottom so go to the bottom of the page and try one that like the oldest ones and then go over to the record so let's try this well that's going to open the company. Go over to the left. Go over, use that scroll bar, go to the left and then click on the person. Okay. I usually put the resume in there. Yeah, and I put a resume in there. I, yeah, that one worked. Go to details. How did you put the resume in? I do that manually. I download it and upload it, which at some point it used to go in automatically, but it doesn't do that either. If you have the Outlook portal you could right click and do update resume if it's like an attachment to the email. The only thing I think it was indeed it can also cause issues though because they don't give you they don't send the email from the person so you could be creating duplicates or something like that but um yeah if you let's go to see if there's this attachment summary there's that three-lined icon. Over here? No, I'm on the name record. Oh on the name record. Yeah go over to the right with that three-lined icon and let's click there and what was I coming here for I was coming here to go to details oops you don't have access to it yeah so that one was the last probably one of the last that worked eight or I was able to and then I put the activities I did an indeed email to this person Yeah, the only thing we'll probably be able to do is if you would be willing to share your credentials, we could create a ticket. But we don't really have an account to use. We'd have to use your account to verify and test. So what does that mean? So because we have to code the extension to read the page. So if there's changes on that page, we need to basically go into ZHU and see maybe what's different and causing it to not be found. But we don't have our own Indeed account to test with. Okay. We have to test with yours. So what meaning, and you need to know how to, I need to tell them how to get into? Yeah, if you're willing to share the credentials, I could create a ticket and I'll put the credentials as like an internal note. but they would have to log in as you to actually see what's going on. Oh, that's fine. I mean. Okay. So if you can send me an email, it's Robin, R-O-B-I-N, at mainsequence.net, and then I can get that created for you. Robin, sorry, at mainsequence.net. Yes. Okay. Now who was the one you were saying? Lakia Blakely. I'm trying to... Lakia Blakely. Let's see if I can see anything. Lakia. L-A-K-E-L. I'm trying to see if I can figure out a way to like find the link up there if the link is even like stored different or something so indeed it doesn't save an Indeed URL at least for that one ah email me on Indeed well that's an email address but it's Indeed.com. And it doesn't have anything to do with resumes. Let me see. Custom field. Social underscore. Indeed is not empty. I used to go by resumes.indeed.com slash resume. What is that page when you look at the top? I'm just trying to see. Yeah, I don't know where you are. Yeah, I'm looking at a record in your database. Go back over to like Sarah, like when you get that link out, I'm trying to see if anything about the URL has changed, and that's why it's not popping up. You mean like go to... Hold on. Okay. Wow, one thing I see that's different, and it says, see how your page says resumes.indeed.com and then search? Yeah. Where in an existing record that was already brought in, oh, wait, that was actually March 8th of 2025. That one, it says resumes.indeed.com slash resume. I'm going to kind of flip through these. Yeah, I think the URL format might be a little bit different. like where you see search like it has yeah slash resume after that and then some so I think they changed their url format with um now do you know is this like some kind of upgrade that you did or no i i just i get 30 contacts every month and it comes on the 11th and i got my new contacts on friday and now and it had that different um the thing i showed it says not a match or whatever that ever since then Yeah, I think they changed the URL in the layout, and I think that's what they did. And so, what does that mean? We can't use it until we have a developer available to recode everything. Okay. This has happened before, too, when they've changed something. Yeah. Unfortunately, you know, it's not an integration. These things aren't, you know, especially LinkedIn, they actually will try to threaten your account if they think you're, like, bouncing around two pages because they'll think you're a bot. What our extension is doing is actually reading the page to find information. So when they start moving things around and changing URLs, it basically breaks our capture. and the only thing that we can do is when we have a developer available to address these features, they have to go in and look at it and literally go through everything and see what's changed to see if it can be recoded to support whatever change they made. I'm assuming you'll get more calls. Now, do they give you a resume for anything? Like, when you go to their page, is there a resume somewhere? Like, where is the resume? You mean in the contact? Yeah, when you're viewing this page, is there a resume file somewhere? No, I'm just looking at the resume like this. I guess I'm not sure. Okay, so is there, like, any kind of download resume option? Oh, yeah. Mm-hmm. Okay. So you could at least do that to get the person in. well can you show me I don't know how to do that if I download okay so if you download it so go ahead and download it okay do I have to save as I would probably do save as okay and then let's make a folder maybe on your desktop let's go to desktop and then let go to new folder new folder why am I not seeing that up a pyre okay go to new folder you're just on it was I here oh a little Up a little higher. I see data transfer. No, no, up a little higher. You want to make a new folder on your desktop, right above where you are right now. Oh, here? Oh, geez, my goodness. Okay, new folder, and call it Indeed Resumes for PCR, or something like that. Okay. Okay. So open that folder. Just click to open it. And then save your file into this folder. Should I put her name? If you want to. Yeah. I'll just do it. Oh. Okay. Come on. I already saved, so I'll just... Okay, so what am I doing now? Okay, so you saved it basically to a downloads folder. and then what I'm going to have you do is go over to Peace Recruiter. Okay. At the top right where you have your quick add option it's that green lightning bolt. Oh yeah. You click on that, go to name parse from resume and then hit start and that's going to pop up a window. Go ahead and click open at the bottom of this window and then go to your desktop and you should see that Indeed resumes for PCR. Go to that folder, click on that resume and then open. Oh, so this is how I get them in there. You could do it this way. Yeah, you could do it this way as a workaround. At least you get something. Let's hit save. And let's view the record that it created. Now, you won't get much from, like, what they shared with you, but if you go to the resume, you're going to have, let's see what it looks like. Go over to resume. Oh, okay. And then at least it's a lot, but at least I can record that I sent them an email and not manually write in their name and, yeah. Yeah, you could do that. Now, if you had, like, several in that folder, when you pop up that add resume screen or parse from resume screen, let's say you go in that folder. If you had, like, five of them, you could, like, select the five resume files and just drag them on top of that bottom half. and that way it'll show one and immediately show you the next one. Okay. Okay. Okay. All right. Yeah. And I know a long time ago we learned how to do that like you just showed me, but I haven't had to do that in a long time. So, okay. All right. I would assume then you're going to get more calls regarding this issue, I would think. From other people. Yeah, I don't know. Yeah. I mean, that's what happened before. It's happened before, and they said that you guys were working on a whatever, a coding. Yeah. But, yeah. Okay. So right now, that's basically how I have to work it, right? Yeah. Okay. all right i appreciate your help all righty have a great day okay thank you okay thanks so much okay bye",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 443.853269,
    "salad_processing_time": 341.64977169036865,
    "overall_processing_time": 443.853269,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence.  This is Robin.  Hi, yes.",
    "job_id": "638b2d0d-a9ae-4744-ae4c-fd77a3bbc639",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence.  This is Robin.  Hi, yes.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3014660315036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}