{
  "recording_id": "3014835984036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:28:06.041426Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:28:06",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Mean Sequence Technology. This is McKenzie. How can I help you? Hi, McKenzie. This is Cliff Rustak calling from MWorks Search. How are you doing? I'm doing fine. How are you, Cliff? Good, good. I had a couple of questions today. The first one is regarding sequences. So I put a list together. I give my researcher the list. They find contact information. They put the names in the PCR, and then the sequence sort of gets going. So if I have roll-ups, I have activity codes that I click after making a call or an activity. One of them is like wrong info. So if there's wrong info, I click it. Then I tell my researcher, go back in this roll-up, check all the wrong infos, and fix them. How do I do that in a sequence? because I don't have an activity code like that. I see. Okay. Let me catch up to you. One second. Here, go back and check the wrong info. Is wrong info one word or two? I don't know. I'm not in a roll-up. I'm in a sequence. It's okay. It's okay. Yeah, I know everybody's got different codes, but one of my codes is like wrong info. or, you know, so I just tell them, this code, go take a look. So it's like six or nine, I think, if I'm in a roll-up. But I don't really do, like, recruiting in roll-ups anymore. I'm doing recruiting in sequences. But about half the names or email addresses are wrong. So I want to know what the best practice is and a quick way to say, hey, this is wrong. go back and take a look, see if we can find a phone or an email that's better. Right now I'm not doing anything, so I'm losing like half the people. Okay, so when you do send to the wrong info, is your sequence like executing like an automated message or something like that? Like so it's going to like nowhere or is it just not, is it doesn't do anything? Well, there's two things. Well, the two activities that are going to drive that type of response is either a phone call, like this phone number has been disconnected. I get that message, or it's like, hey, this is Amy, and I'm trying to call McKenzie, so I know the phone number's wrong, or inactive, or discontinued. Or the email, if the email is wrong, it'll bounce. Okay, so this is a phone thing. Oh, okay. It's mainly phone. It's not as much email because the email response that you get sometimes is they'll opt out. Or if they don't opt out, you know, they have their filters set up where it's opting out. So can't really do anything with that one. It's a good email. It's just they're opting out of email communication. Gotcha. Okay. Yeah, I'm sorry. This is a strictly phone issue. That's good to know. Mainly phone. Yeah, mainly phone. You said there's two things, and you went into one. And I thought it was just going to be simple phone and, like, email or something. So what was the first example that you gave me? So, you know, that's basically it. It's either the wrong phone or wrong person, and I know it. Okay, yeah, okay. And right now I'm not doing anything. But I'd really like to signal, hey, guys, go back and take a look at these names to see if we can get a better number. Okay, so you're working through the sequence yourself, and then when you come across a name and call them and find out it's the wrong info, you want to send it back to another person to kind of like update the information and then put it back on the roll-up list? I don't even want to remove it from the roll-up list. If it were in a roll-up list, instead of saying recruiting message one, recruiting message two, recruiting message three, I just click wrong info. Then I email my researcher and say, go into the roll-up, check out all the wrong infos, and see if we can find better phones. I want to be able to simply do that in a sequence because there's really no code. all I do is I like move it to the next, remove it from the sequence and put a note in there. Those are like the only things I can do that I'm aware of. Okay. I'm going to have to look at your setup. So let me pull up your name, Cliff. I haven't, I've been like writing down what you're saying. I haven't pulled up the account you're using. Give me one second. If you don't mind, let me catch up to you here. Yeah. if you called before i'm kind of guessing at how your name oh i think i found you are you using in the work search m work search oh okay yeah yeah okay sorry eric name i think it may maybe your name changed over time or maybe you bought this database or I don't know. For me, it looks like MR Wicker Park. Yeah. Oh, okay. But then in the second half of your name, it says Mwork Search. What's the username that you log into? ZRustnack. ZRustnack. Okay. Take a look. Hold it right. Oh, there's no C. I'm sorry. All right. Let me go. Sequencing. So are you using roll-up? When you said stages, are you using roll-up stages before? Yeah, you do have roll-up stages. I see. Okay, cool. But like I said, I'm not using roll-ups anymore. I'm using sequences. Yeah, okay. I'm trying to. But I'm not using the roll-up and roll-up stages. or I would do an automation plan, have the codes, and then I can signal them when there's an issue. Those researchers, are they strictly working in the roll-ups, though? Or do they use the sequences? Well, they're doing whatever I tell them to do. So if they're in a roll-up, I'd say go to the roll-up. I could tell them to go to a sequence but I don't want them spending an hour going through every name in a sequence to view notes, wrong phone number and what I do now is I just push it to the next step but I'm pushing it to the next step I got another phone call two stages later and I'd rather push it to the next step which is an email, and somehow trigger a note back to them to see, so that by the time we get to stage four, the second phone call, we may have a phone number for them, a better one. Okay. Does that make sense? Yeah, I'm trying to get it all down, because I'm definitely going to forget if I don't write it down. Let me catch up. By the time we get to the second phone call in the sequence, we've... Yeah, so if it's the wrong phone or wrong email, I just push it through. I move on. But it's hard to find people, let alone find good people that have experience. So now I'm just like pushing it. I'm just sweeping it under the rug instead of saying, hey, let's see if we can find this person's info after a first pass. So they may be using Zoom Info, so maybe they'll go back to Lucia. Maybe they'll go back to Apollo. Maybe they'll go somewhere, use another tool, and maybe get a different phone number. That's what I want them to do. Right, but then they eventually do return to PCR, update the number, and then you want to give a set of instructions for them to follow to signal you to check it again in the sequence, right? Yeah, if it were the roll-up, I'd categorize it six or nine. I'd say go check it and fix it. So by the time I go back to whatever activity I need to do on that, they will have checked it, fixed it, and I don't worry about it. I'm moving on. So if there's a new phone number in there, I'll call it. If there isn't a new phone number in there, I won't. Here I just push it on. and if the email is wrong then we got incorrect email incorrect phone number and there's no no connection with a possible candidate okay um can i get the name do you know the name of the template at least the one you're using right now because i see that there are a lot of sequences yeah there's a bunch in there the one like the one i just finished and that's why i called it 767 lead project engineer find it in the list to make sure I'm in the right place here hashtag 767 lead project engineer okay cool so I can look at the sequence template here okay ten steps mmm so step one and then you call them in step two and then you find out that the information is wrong. You push it to step three, pushing it under the rug, as you said. And then you're hoping to, by the time you get to step four, have somebody take, get the name. So, yeah. So you have, yeah. So, okay. Yeah. So you have put wrong info in the notes of the people, right? Yeah. And are you looking at it now? What name are you looking at? Like I'm looking at Brett Johnson. He's at step two. And there's Anna Green, I think. I've got calls with both of them later today. Okay, yeah, I'm clicking on Brett Johnson, and I see him. So you could see his email, johnsbt.1009. I could say, oh, that's probably his email. It looks like it could be. But let's say it were A. Smith, 1, 2, 3. I'm like, that's not his email. But that's probably what the researcher found in Zoom Info for Brett Johnson. I know it's wrong, but I'll still go to step three, and then it'll bounce. So there is a twofold need here. You know, here I'm at the phone call. The phone number's discontinued. I want to sig alone. But then I'm at step three. The email is obviously wrong. A. Smith is definitely not Brett Johnson's email, you know, like 99.9% sure without even trying it. So I want to be able to, you know, again, put it back on their plate and say, go back, take a look, use another tool. Let's try to find a real email for this person. So that's sort of what I'm trying to accomplish. I don't know if there's a solution for it other than me putting in the notes, Brett Johnson's cell phone number is discontinued. See if you can find a new one. Then you've got to go back in a sequence and look at every name and sort of manually look for stuff. It's just time-consuming. Gotcha. So you have not done that yet. That was just an example you were giving of what you could have done, right? Yeah. Oh, okay. That's what happens every day, every time I'm in these sequences. The phone number is wrong or the email is wrong. The more contact you give me, the more you're helping really me understand your need. Okay. So it is a little bit of a complex question, and it would probably deserve a really complex answer that I would need to kind of facilitate and, like, gather and kind of present to you all at once. I don't want to kind of ramble on inefficiently. as it would be. If it were a roll-up, I would know what to do. It's not a roll-up, so my only thought is to add to notes that seems pretty time-consuming and not productive to me. Maybe your team will say, have Cliff add wrong info as a mark as. So then if the phone number is wrong, I'll click wrong info. Yeah. And I don't know if they can sort all the wrong infos in a sequence. You know what I mean? Oh, I see. I don't know. So that's sort of what I'm looking for ideas for and help for. Sure. Okay. Yeah. Isn't there some filtering options? Oh, okay. I thought maybe if there is I haven't I haven't created that in a template so far for a sequence because then I will add an extra if I can a mark as I don't know if that's the best thing to do it because the mark as is going to slow it down because the mark as will probably not push it to the next stage. So let's say I do have for Brett Johnson, I've got his email, his phone number's wrong. I put Mark has need updated info. He's not getting an email while we're waiting to try to find a cell phone number. So I'd rather not do something that stops it. I'd rather do something which pushes it to the next step, but signals my research team that they need to go back and do something. Gotcha. Okay. I'm going to note that one second. Without manually doing it. I've either put it in notes or I have an email open when I'm making my calls. I'll say go to Brett Johnson, wrong cell phone. It just takes too much time. It's just slowing me down. Sure. But also I understand I understand what you need. I just don't know the answer yet, but I can go get it and get back to you. I can't be the only one with this situation because it happens to everybody. And I think everybody is probably doing what I'm doing, but maybe the best people that are making the most money have workarounds. You're not going to get 100% of the email and phone numbers, but if you can get 10% more, you know, that's a win in my mind. okay um i'm gonna have to go consult with one of the trainers who's a little bit more savvy with the sequences and try and like collaborate with him on how to kind of go about like getting you some sort of ideas you said you're looking for ideas maybe a couple different workarounds for this type of need. Yeah. So I think I've documented pretty well what you need. And you went into pretty good detail. So I think I'll be able to make a ticket for you and then get back to you. Have you ever had a ticket with us? Yes. I've had PCR since 2010. Okay. All right. All right. Well, then I'll create a ticket and we'll communicate via the ticket if that's okay with you. Yeah, that's fine. So let me know what you come up with, and I'll keep an eye out for that. And in the meantime, I'll just keep doing what I'm doing and sort of hope to come up with a solution soon. All right, cool. All right, thanks, Cliff. So my next question is a lot of the people I work with have gone from PCR to Crelate, so they're using Crelate now. And a couple of the guys are using Crelate, and they They've got these AI agents that are integrated into Crelate. So they can go to software provider 1, 2, 3. They provide them the AI API. They link up with this AI tool to do things. Do you have agents that you work with, AI agents that you work with, or would you be able to provide me with your API so that I can link up PCR with the AI software they're using to automate some stuff? We do have an API. Okay. There's documentation on the API. let me see are you on the computer can you go to Chrome and open up the PC Recruiter Learning Center or do you know how to get to the Learning Center on PCRecruiter.net under technical info at the top it's Learning Center and then from there you can So you have an API. Yeah, absolutely. Okay. So then I'll find out what tools they're using and see if I could use your API with these tools. Would you be able to tell me that? Well, we have an API, and you could use it. The tools that you're using, I'm not sure how to answer for the tools you're using other than our API. You know what I mean? Yeah. I know you have an API. Everybody does. I don't know what the tools do. I don't know. I can't really say for 100% sure. Okay. I mean, I'm probably, yeah, I could probably do it. So I'll get the names of those AI software programs, but you don't know of any AI software tools you're already working with that can do AI-related tasks. I haven't been told to try and market or... No, not to recommend anything like that. We do have small AI features that we've added to PC Recruiter that we do offer, but it's not like an agent that goes and seeks and does things that you're describing through the API. It's more like if you wanted to generate an email inside PCR. We added an AI generate this email button or a job description. We added some stuff that will help you generate, flourish up your certain things that involve creativity. But yeah, I'm not told or I haven't been told about any sort of like AI agents or integrations that go and do things of the nature that you're speaking of or to recommend any sort of thing. So I don't, I personally do not know. All right. I'll ask them for the names of the companies because all this stuff I'm doing now in chat GPT. So I'm doing something, I go from whatever to chat GPT, then I put it into PCR. So like a candidate submittal. I have a prompt and a template that I've been using to speed up candidate submittals. So I put it in ChatGPT. It gives me a draft. I work it. I review it. Then I put it into PCR. What these tools do is they link in with Crelate. So the minute information goes into Crelate, it does this. So the minute I want a candidate submittal, all I have to do is do it. I don't have to take the resume out, put the job description in, put my transcribed notes into ChatGPT and do all this. It does it all immediately when the resume goes into Crelate. So if they want to submit a candidate, all they've got to do is do it. press a button. Or if they want to map a candidate in a business development call, they click a button and they can do an email and it generates something out using the format that they create. So it's an automation tool. You know, I'm doing all this stuff today, but I got to take it out of PCR, put it in a chat GPT, review it, then put it in the PCR, then send it to a client or prospective client. So it sounds really cool to be able to build that process into PCR so I don't have to do it every time I want to submit a candidate to somebody. Does that make sense? Yeah, those AI tools sound very powerful. I personally do not have an impact on the design or the future choices of what we, but I could pass along some of those ideas or, you know, that information that was like kind of revealing, that's kind of cool. That sounds pretty, pretty intuitive, like pretty cool and very helpful. I'll get the names and call back. That way you can tell me if there are API could link with PCR and do this stuff. If not, you'll know, you know, what, what other, you know, software programs are doing to, I think, I think, that stuff in? I think they will. Like if it's, you know, API is pretty like standardized, right? Like you, you make calls as long as you know, kind of like the address of the calls, it's sort of, you know, all standardized. So if you give a AI bot, you know, the map of our API, all the different addresses we have and like what they do, which you could probably find in the API documentation um i suppose the ai bot would be able to read it and then know how to communicate with pcr so i'm like confident that like it probably could uh do we condone that or no or like how that will work out or you know can we assure that it will work i don't know because it's you know not our api doing it or ai doing it um so you know i think it will work but you know i can't really say much other than that you know like i think it might i think it may i'm pretty confident it may um but that's yeah that's about as far as what i can be sure of is um i know that apis you know they're it's computers do what you tell them to do and apis are just like a framework for communicating in the back end rather than like through like a username or like a person and doing it like with an interface that they click buttons on. It's just two things kind of communicating directly. And yeah, so the API documentation is on our website. You can find it if you go to the Learning Center, search API. And then the first things you can go, one of the suggestions is developer API. You click that. And then on that page, there's a link to our API docs. and then from there I mean that's public so I can't really I can't stop you from showing that to whoever I'm really interested in this tool and maybe if I gave you the name of the tool you know again other people may already be using it in PCR or if they're not using that maybe other people are using a similar one say no we don't work with this company we work with that one because I don't want to you know be a guinea pig for anything so all right cool all right um all right yeah the ticket look out for that one ticket that we talked about before the ai question came up all right thanks for your help mckenzie have a good afternoon uh thank you you too cliff bye all right see you",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 450.430436,
    "salad_processing_time": 153.26604390144348,
    "overall_processing_time": 450.430436,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Mean Sequence Technology.  This is McKenzie.  How can I help you? Hi, McKenzie.",
    "job_id": "b9c3e2a0-4f1d-4c70-bb1a-e6d9e501cd71",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Mean Sequence Technology.  This is McKenzie.  How can I help you? Hi, McKenzie.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 1
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3014835984036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}