{
  "recording_id": "3017904646036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:31:26.545284Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:31:26",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Enter your participant ID followed by pound. Otherwise, just press... You are in the meeting now. You are the first participant. Please stand by. Steve, I'm going to fly. Okay. Ready. Hi, Jim. Hey, Laura, how are you? Hi, Slate. Good, how are you? I am well, I am well. Thanks for joining me today. Thanks for talking to me. For sure, for sure, yes. I wanted to talk with you a little bit about PC Recruiter, and I think we originally were going to look at the AI piece, maybe PCRM to look at the new format, the new interface. So kind of wanted to see just what led to us connecting and what issues you were having or what complaints or whatnot? It just seems like it's so old-fashioned. I mean, it's even called PC Recruiter, you know? I've been using this for 15 years. There have been very few changes. It's the clunkiest, hardest-to-use interface. I've seen, like, what some of the other competitors are doing, like Cruella, and it's so much easier, like, to process candidates it's so much easier to find candidates in your own database. And PC Recruiter is just like not keeping up with the times. Yeah. So we actually do have a new interface, which we can take a look at there. So I do want to show you that. And then also maybe the AI suite. Talk a little bit about that as well. Yeah. That was of interest to you. So what we did, we actually have a new interface called PCRM. And it is more of a CRM product, but it is going to have all the functionality, just about everything you have now within PC Recruiter. So let me show it to you, kind of see what you think, get a feel for kind of what it looks like. Okay. So I'm going to share my screen here. Okay. So this is the new PCRM. And when are these things launching? This is available now. So this actually, a little background on this. This is PCRM, and this was originally conceived several years ago, It was going to be a new interface and a replacement for the current version of PC Recruiter. And as they redesigned things, added things, carried some things over, and many of the, like the sequencing of the analytics, some of the newer screens look just the same. Hold on one second. Really quick. Hold on one second. All right. I mean that sorry about that okay no problem okay so so what they had done so this was going to be like I said a replacement for PCR 9 it was going to be a new redesign and what they did was they ended adding some significant CRM functionality that they ended up making it a separate product at the beginning of this year when it was released and it is a separate product. How come I don't have this? Well because it is something that's been advertised some we haven't put forth a huge news release or anything about it but it is something that you can move right over and it'll it basically runs alongside your existing database so there's no conversion instantly as soon the link is created you can access your existing database but in this interface. So see a lot of it is going to be some of the same terminology but an entirely different interface. So rather than top and bottom you have your menu down the side so I can look at names, companies, positions, roll-ups, schedule. So a lot of that is the same functionality, the same terminology but it's got a whole new interface. So for example I go to names I'm going to be able to look at my names screen a little bit easier to navigate if I click on a name record it slides in from the right side of the screen. You have a configurable workspace, and then all of your different tabs are up here, like keywords, resumes, activities, all that you normally have, but it's all here in this brand new interface. There's some additional things. You can have different resumes in these different tabs, so you can have more data. There's a nice easy way, if you're looking at details, if I want to get to my phone fields, I can just type in phone. It'll instantly find all my phone fields. So we've added some easier-to-use functionality, And even on the main screen, the list of the last 50 records you looked at, you can now edit in line. So you can edit fields right in line there. Or there's an actions column where you can contact or you can add some things like activities, notes, put them on a roll up, quickly add a new resume. You can do a lot of things right from this front screen here. Yeah, that's easier than what you have now. It's a lot easier to use. And it's even easier to configure. If I want to look at a record, I could go into this record. Excuse me. And if I wanted maybe the resume to show right between details and activities here, I could go to my drop down and I could just drag it right there. It's going to snap right up. So I can go through, I can easily edit and maybe I want to take and move the company. I want to delete that block of text or something. And I want to move the contact info up. You can kind of drag and drop the widgets around, add different things and move them around very easily. So it's easier to configure. You also have a nice area where you can pin specific things up here. So like for Terry's record, I pinned a few keywords up next to his name, where his name is. He's a candidate, and then I pinned a couple of keywords up there. A lot of the buttons. Okay, what would be really good is if PC Recruiter was taking those keywords and you didn't have to enter it yourself. Yeah, that hasn't changed, so we don't parse keywords at all. We parse the resume. should be because if AI was really using it being something that you were doing, I have so much data in my database, but you're not able to make it so that I can find it. It's all on me. How is it in resumes and notes? Where is the information stored? Right. If I don't put it in notes, if it's sitting in a resume and I didn't put it in the keywords, it's not finding it. Well, you should be able to search it in the resume. If it's in the resume, it should show right up. Like if I went in here, I should be able to go in more filters. And what I can do is an all content search. This is going to let me do a Boolean search so I can look up sales and marketing. For example, just to throw in a couple of words. oops and then if I hit my search it's going to bring back my list of the resume mm-hmm it's searching every resume now I don't have the latest version does show you where the word was found it's going to put them in an appropriate order but to show you how you should be in PC recruiter the current version here if I you should be easily able to search that and you should see everyone that has it in every resume. So if you go to name and you go to advanced, you should be able to type in here what you're looking for. So I can go in here and type in. And that would pull it from a resume. Just what I'm saying, like you have to go in advance. Like it's so hard to use. Yeah, it'll show it. And every resume you're going to be able to see, it keys in and it finds every instance of every word in every resume. And I searched everything, but you could search only resumes if you want it. There's an easier way to do it if you just go to the name button just in this keywords area. Just type in like sales. Type in any word you want. Right, that's what I would do. Yeah, and it's going to come back. But it's never a CCS sale. Yeah, well, anything you want. You can type in a long string, this but not that, this exact word, this and this and this, anything like that. And it should search it real well there. What about, I want to see on the new, on a new interface, what does a position look like and moving people through the different stages of a position and follow-up because that's been really, really bad. Okay. Well, it's going to have the same pipeline that you should have right now. So in PC Recruiter currently, do you have the new pipeline which is going to look like this? Roughly. Yours might have different terminology where you drag and drop from one step to the next? No. Okay, you're still in the old pipeline. So yeah, you'd want to get a new pipeline. So the pipeline has looked like this for several years. It's been mentioned. It was in beta for a while, but anybody can get it. Yeah, then why wouldn't mine switch over? Well, this is one of the few features that when it was released, we didn't automatically switch everyone over because what it does is instantly old positions, it doesn't update the pipeline. So from this point, you'd be using the new. anything from that point and before you'd be using the old so people had to request it to know they were changing interface since it doesn't go back and change the old ones into the new pipeline but the new pipeline here and much easier to use and I understand where your cook that old pipeline is terrible it's years old and it's really clunky but this is going to be just the same in PCRM so if I look at that exact same position I can look at my pipeline in here and for that I like to full screen it but it's going to look just the same. And then I'm able to take and drag and drop everyone from one step to the next. So you're saying you have to take everybody from the roll-up and put them on the pipeline as contacted? No, whatever you want to do. So you can link people to a pipeline from a search. So you have to get them in there. So you can link them from a search or from a roll-up or you can set it up if they apply online through your website. If you have that piece turned on, they they automatically will end up in the inbox. So three different ways. So you could have that. But yeah, if you had candidates and you wanted to get someone into a pipeline, you can do it even right from their record. So if I went to Colin Day, I could actually go to, there's a little chain link button that links him to a position. It's going to let me pick one of my jobs. And I just click, confirm, now he's in the pipeline. So then you're able to kind of move him on through that process with that simple drag and drop. So then he'll be in the roll-up and in the pipeline, which doesn't make any sense. Oh, no, he doesn't go to a roll-up. He only goes to a play. You should be able to just go through the roll-up. Are there no roll-ups anymore? Oh, no, there's roll-ups. So you can still go to roll-ups. So if you happen to have a roll-up list, you can go through to that list of people. And if you wish, you can link these individuals too. Right from here, you can just go action, and you can link to position from there. I think you might even be able to click multiple people and do a multiple link to position. If you have three or four or eight of them, you could en masse link them from the roll-up list. And you don't need to use a roll-up. Some people like to use it, but you don't need to. When you're using the tool to add people from LinkedIn, can you link it directly to a position, or do you still have to move it to a roll-up and then into a position? Either, either or both. So when you use that capture tool, you can turn on the ability to link it to a position or a roll-up list or both, pick it next time. Yeah, so you can do that from there. Okay. Okay. I don't see that option on mine. Oh, let me see. So let me go into Capture. Let me here. I forget where it is. You turn it on. Oh, yeah, let me just, let's open up the Capture. Let's go to LinkedIn and let's get to somebody's record so I can get to my settings there. I'm going to go to Brian and I'm just going to go. So if you go into capture, open it up. And then you can go through here. Okay, let me click him. That's the one. Where is the, oh, under there. Up here you can edit and you can actually turn on the ability. Okay, now add group. Oh, add to roll up. I can add group. I can add to position. So I can add those two. So now I have those additional options on here. so if I save that anybody else I'm going to now I'm going to have the ability so let me get out of him I want to get to someone else so I've left them looking at a record now if you go to the click to add because I have mine turned off for some reason too but it's going to parse out her name her photo or basic contact info and then you can add her to a roll-up or a position either neither you have to add that functionality no you should well you have to configure it just click the little next to the X in capture there's a little configure option that's where you just pin that option to you to your capture front screen will you show me that click on that yeah so it just then where was it add group at the end of that green line on top add group and you can I hold on I'm gonna do this right now hold on sure Wait, I have to do it the same way you did that. Hold on. Come on, there we go. Okay. so yeah if you pick those different things you can pick i'd recommend add to roll up and add the position there's a couple others on there too um but you can add that too so that's going to help okay to build them into that pipeline and then once i'll get you the new pipeline i could do that i can throw in a ticket today there's no cost to do it we could move you to it instantly it's just from here forward all positions would be on that new pipeline league they throw in an hour of training with how to use it too so that would so that would help so the new pipeline is going to help and the new pipeline all kinds of so do you have to turn that on or do i have to do something to get my team my team does it i'll put in the ticket my tech team will add it into your database and then they'll contact you to get an hour of training set up to go over how to use it how to create pipelines because you could have more than one if you need the two or three or are there any other new functions that that I don't know about that I should have that are your fault? I wouldn't think so because most new features are automatically applied. This one wasn't because it was a unique one because it changed the architecture of the entire database. So we didn't want to just say, hey, everyone, now everything looks like this and you can't go back. So that's why you kind of had to request it. So I'll get it requested. the new pipeline that'll at least help some if you went to edit PCRM that would also then you need to have the new pipeline anyway but the PCRM new things it adds okay so a couple of new features in here you're going to have the deals pipeline so if you were looking for like a sales pipeline there's a whole deals pipeline in here so it's very much like that interview pipeline but it's for contacting companies to try it and develop business so you can create a different card for each one you can create different steps you can give them like a probability of close you can give them a hot warm medium cold whatever you can even put a list of different activities maybe you want to call first then an email you can check them off as you do them so it's going to give you almost a pipeline but for deals so like a sales funnel within PC recruiter and when you move someone all the way through we're also going to release in the coming couple of weeks, a DocuSign integration. So you can actually send the contract right out of PC Recruiter. It'll interface with DocuSign. That'll be stored in here. And you add your contract to PC Recruiter? Right now, you could upload it as an attachment, but soon you're going to be able to send it and have it DocuSigned all out of PC Recruiter. And then the signed contract would be attached to the record automatically. So that's in development. And then there's also going to be reporting on this deals pipeline, much like we already have in the analytics. And I don't know, do you have the analytics here that you can build metrics reports? I do. Okay. So there's going to be deals reporting built into this as well. And then in here, you're still going to have your email campaigns. So if you wanted to look at email campaigns and see clicks and opens and unsubscribes, all that's here. The sequencing is here as well. And do you use the sequencing at all? The drip campaigns? No, I don't even know what that is. Okay. So that's going to be something it's available in the PCR 9. It's included in PCRM. You can actually build a sequence with NPC Recruiter so that like I could go to a template here and I could build a sequence maybe for candidate engagement or for business development. It only works like if you're doing all of your outreach through email, but it doesn't work if you're using LinkedIn. Well, yes and no. So this could be only email or you could have calls and LinkedIn related activities it just doesn't automatically make that call or do that LinkedIn related activity it would actually add it to this task list so I can tell my two related LinkedIn related activities are I have to go send a connection request I'd have to go click view LinkedIn send that request then come back in them and mark that I did it so it doesn't automatically work with LinkedIn to do that but it'll put it on here that you can hit connect then come back out into your thing and then mark it completed. So you can have it prompt you to do LinkedIn, or there's even a call step. So if you maybe, if they open the email, they go to a call step. Here's my calls. And I can say my first person, if I had RingCentral, I could even click to dial, read my script, mark them, whatever. That'll then move them onto whatever I've assigned that to kick off. And then it'll go right to the next person. so you can kind of card through them, click the file, read your script, go through next. So it could be emails only, but it can also be interactive things. Maybe these are people I have to schedule with. So I can go to the first one and I can put him on my calendar for a specific date and time, and I can go ahead and save that, mark him as scheduled. So I can go ahead and do that. And when are these AI tools going to be released? Well, the AI suite is available now as well. The AI suite is – How do you use it? It's included in PCRM, but it's available in regular old PC Recruiter and what it does It's going to be actually might even be in your system now So if you're in PC Recruiter four things it's really going to do three of them are content generators The one people have really been liking is if I go into a candidate's summary area so you can go right into summary That's going to have an AI content generator So at the end of the line is an AI generator that if I click that It's going to take the person's resume and any information in their fields and it's going to generate a summary and it's going to kind of just create a summary based off of what I have on them. And I don't have a lot on him, so I don't have a resume, but it shows a little information about any company that he worked with or anything like that. So how did this happen? I'm sorry, I got distracted. Oh, there's a little, I'm going to do a different one. There's a little icon that is added to the summary button, AI generator, the far end of the line of buttons there. I don't think I even have a summary button. Okay, it might be in the dropdown. It might be something you need to pin because a lot of people didn't really use it that much. So if you hit the hamburger, you might see it there. And then you can pin it if you wish. So you see mine is showing there. And if you click that summary, that's going to generate a summary using the information found in the person's resume and their fields in their name record. Right. I think I need to get some training on some of the new features and get some of the new features added to my... You know, and I also don't have Quill integrated. Okay, yeah, Quill is a nice integration. Yeah, well, from here, we have a number of different things we could do. If you wanted to explore moving and adding the PCRM, that's going to give you that new interface that you could move over and start using too. And that one is, it's $3.50 to set it up, but it includes four hours of training. And it adds all the new features. It includes the AI suite. It includes the sequencing. It includes everything. but it's your same username same database same data you could log in as soon as it's set up so it's 350 to set it up that includes four hours training and then it's an additional 10 bucks per user per month so it would just bump you up by 10 bucks and that would get you all of that new stuff let me make sure that you are let me see what version you're on a PC recruiter what person do I have? You have. I missed the word to point out. So you're on the premium package, but without sequencing. So yeah, you're in the premium package. So you're at 100 a user. It would be 110. And that would just get you the PCRM, the sequencing, the AI, all of the new features. You'd be on the latest and greatest of everything. The new pipeline as well. So you would have all of that. And then that training, four hours, you could use it to cover anything you'd like. They'll show you, and they'll actually train you on PCRM, so you could get trained on how to utilize this. But if you said, well, hey, I want to know how do I do that in my other version, they'll show you that too. So you can use one version. Well, I don't want to use the other version anymore. Okay, yeah. Then you could switch over and use this version entirely, because this has everything that you have and then some in a nicer interface. Does it still look like this? What, the PCRM or the PC Recruiter? So this is the PCRM. This is how it looks. And it's our new interface here. Yeah, and like I said, it's live, and it's constantly being updated and added to. Okay, excellent. All right, yeah. So let's try to get that meeting set up. Okay. Well, what I could do, let me get you, I'll email paperwork for you to review. If you decide you want to do it, sign that paperwork. Then they'll send you an invoice for the setup. Then we can get a ticket in, get you training. How much is it going to cost for this to get set up? $350 one time. I don't really want to pay that. I've been paying for a tool that is like ineffective for years and years. I could probably do 250, but I can't do it for free because it's actual training time and they add everything new into the database. They generate a new link and everything like that. So there's some fixed costs. I can't do it for no cost. I could do it for 250 for four hours just in light of that. All right. Well, can you send me the paperwork? I can see. Yeah, it's no obligation. I'll send it to you. Take a look. If you decide you want to do it, go ahead and sign it. We can get started. I'm going to put in a ticket to get you the new pipeline anyway because that's free. So that is a good step in the right direction no matter what happens. And then if you want to explore even just getting some training on the older version or whatever, we can take it from there. But I'll get in a ticket and send you paperwork so you can kind of have two things going on. They'll be in touch to get you the new pipeline to at least get you set up on a more up-to-date pipeline piece. So that's going to be done regardless, right? Yeah. The pipeline is regardless because you'd need it if you went over to PCRM anyway. So it's a good time to do it because why not? It'll just give you that latest and greatest. Okay. Okay. Okay. Thank you so much. Certainly. Certainly. I'll check in a couple days if I haven't heard back. Okay. Thank you. Okay. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 565.089234,
    "salad_processing_time": 207.80833983421326,
    "overall_processing_time": 565.089234,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "job_id": "e323fa1d-f7fb-489a-85f5-b4f4d7745696",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "general",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3017904646036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}