{
  "recording_id": "3019272414037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:32:58.601672Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:32:58",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " welcome to zoom enter your meeting ID enter your participant ID followed you are in the meeting now you are the first participant please stand by Thank you. um Thank you. Thank you. you Hello. Hello Daniel, how are you? Good and you? I'm well, I'm well. So I wanted to show you around PCRecruiter a little bit and kind of show you a demo. I'm just going to kind of take you on a general walkthrough of PCRecruiter but did you have any initial questions or requirements that you needed to see as as we take a look at this. The shop questions don't ring. Right now, I don't. Okay, perfect, perfect. So as we go through here, so I'm gonna kind of share my screen here and kind of walk you through a general PC recruiter walkthrough. So it's gonna be a cloud-based system. It's gonna run on a PC or a Mac. It'll work on Safari, Edge, Chrome browsers. Chrome's probably the most popular. and so a lot of different ways you can access the database. So getting logged in, I'm gonna go ahead and get logged. Do you see my screen okay? Yeah, I can see your screen. Okay, so I'm gonna go ahead and get myself logged in with the password and then I am logged into the system and the PCRecruiter database is gonna look pretty much like this. And I say pretty much because it's quite configurable so you can actually pick and choose what tiles are gonna show in the top, in what order. You can move the fields around on the screens. You can set up your own lists, your own kind of widgets around here. So a lot of things you can really tailor to your liking. But the basic look and feel, you're gonna have a menu bar at the top. That's gonna be your main navigation. The center area is gonna be for searching, search results and lists. And then the bottom portion's gonna be for the records themselves as you're going through the system. So open your main menu bar. That's gonna be where you get to the three primary record types we work with, those being names, companies, and positions. So those are gonna be kind of the three primary record types, they're all cross-related. So the name area, names are gonna be your candidates, but also your contacts, so any person whose contact info you need to have in your database, they're gonna go under a name record. And then that name record can be linked to a specific company record, maybe the company they work for. Or if they're a candidate, usually we'll just create a kind of a fictitious record called candidates resumes or something and link the candidates all to that specific company record companies are the companies you're working with or the companies you're marketing toward so you can track potential client companies in there and tag the contacts to those company records and then of course the jobs you're looking to fill the positions so those jobs are going to be entered into PC recruiter linked back to the company that therefore and you're going to have the capacity to post those jobs and share those jobs you could do some different things once you put the job openings in PCRecruiter. Okay, so they can feed to your website. So we have an integrated job board which will allow you to post jobs directly to your website as soon as you enter them in PCRecruiter. You're also going to be able to share them with a feed to Indeed, ZipRecruiter, LinkedIn, some different things you can do as far as feeding the jobs. There's even a shareable link that you can just email out or blast it out in an email it'll show the link to that job on your website so a few different places that we can share job openings in PCRecruiter so those are our three main record types some of the other elements up in this main menu you have a daily schedule that's merely a calendar for scheduling meetings phone calls or follow-ups your roll-up list that is a list tool so you can actually build lists within PCRecruiter and you're going to be able to go into roll-ups and you can go ahead and see here's all the roll-up lists we have I click into one list I can see that list of individuals here roll up lists are nice because you can mark them different stages statuses priorities so there's some different things you can do as far as that goes also a lot of the reporting options are up here you have reports you have analytics reporting your sequences are also found in that main menu bar so that main menu bar is going to be really the bulk of your primary navigation I like to always start around the company screen because the company screen kind of ties the names the positions together So if I go into my company, I open up the company screen right there. I'm going to be able to see there's the last 50 companies that I was working with in my database. Or I could go ahead and click right there, and I could search part of a company name or something like that if I wanted to pull it right up. And when I do go into the company record, I'm going to be able to see that company record down below. This is a configurable screen, so you can put in any fields you wish in any order. So you're going to be able to work with that. And then as we're looking at that list of company fields, there's going to be two subsets of data connected to the company record. So you'd be able to scroll down here a little bit. You can see here's all the positions. So I've got all these positions in here. These are all my job openings for this specific company. Each one with a chain link next to it, by the way, means that there's a pipeline of candidates connected to that specific company. And then I also might have a group of candidates or contacts that I know at this company. It could be my hiring authority, Ben, right here, or a couple people that I've placed there, maybe even Bart, who's just an employee. So I'm going to be able to kind of track all of my contacts, all the people that I know that work here, and each one of those contacts is going to be their own record. So if I go into Ben Brown's record, that's going to open that up in a brand-new tab. I'm going to be able to then look at his information right here. I have all of his direct contact info, emails, phone. I can also look at an activity history, everything I've done. Every email I've exchanged, every activity I've written. this is going to be a journal of different activities I've done with a specific person so name our career this is nice because I can track my contacts can track my follow-ups and then I also can go back and see all my job openings right there okay so I want to talk a little bit about the jobs pipeline then I'll talk about searching but is everything making sense so far looks good so far yes yes okay perfect so this is a few four perfect so so I have all my positions here so looking at my positions I could go to the company first for any specific company and I could look at the individual positions or I can go right to position this is going to show me the last 50 that I was working with so these are like my recently active positions and if I go into any one of them it's going to open the position record in the bottom portion of the screen. It is an entirely configurable record, so it's three columns here. You might have four or five, eight columns, whatever. And you're then going to have the ability to enter the position in here. You can put a nice formatted job description. What's nice about this is when the position is entered, once it's available slash open and there's one or more openings, this can interface to your website so that the position is shown directly on your site. So that's going to give you the capacity to see every position on your website. So if I wanted to go in, I could kind of, let me open this up here. Our job board piece, you can actually pick from any one of these different templates. So if you wanted your jobs in a table format or in a list format or anything like that, you're going to have the ability to see their jobs. Candidates can go and apply to these jobs online. So this is going to be a full integration to your website, and the jobs are going to be posted there very, very easy. So just by putting them in the database, they're automatically going to be posted onto the website, which is a nice piece there. And then candidates are going to be able to apply. You can allow them or require them to sign on here. if you want they could sign on with LinkedIn or any one of these different sites or services so you could have them do that or if you wanted to skip that all together you could just go to an application screen right here so a couple of different ways to work with that that's up to you how that's going to look and how that's going to work and you are able to kind of put in whatever fields you require in there so you're able to kind of pick and choose what you want to require of these individuals when they apply online. So what's cool is when they apply online, you're going to have the information pushed directly into PCRecruiter. So applicants are going to be able to apply to this job. As soon as they do, they get an automatic email thanking them for the application. They are then going to be put into the pipeline here, which we'll take a look at in just a minute. But you can also, like we talked about at the top of the call, you can set up a feed to feed that job to Indeed, ZipRecruiter, or LinkedIn. All three of those usually by default would route the individual's applicants back to the application screen on your site so that they would all be applying via the same avenue. But LinkedIn or I mean excuse me Indeed is a little different because if you wish on the Indeed integration you do have the ability to have the applicants apply on Indeed and then they can apply on Indeed be fed directly into your database. So a few different options there if you wanted to. So you do have some flexibility on that. So you're also going to have a little share link here if you wanted to share the job on Facebook, LinkedIn, Twitter. There's also a direct application URL. So this is the direct link to that posting on your website that you could just email to someone as soon as they click it. They're going to go right to the posting on your website to apply. So it gives you a little bit more flexibility as you're going through and you're working here. And then you're going to be able to collect people into your pipeline as they apply online. So the inbox of the pipeline all the way at the far left of the screen, that's going to be comprised of all the people who have applied online or maybe people you found in your database and you've linked them to the job. You can do that, too. So as you find a match in your database, you're going to be able to from the search results screen or from the candidates record you can just click link to position and that'll link them right to that position and that's going to give you the ability to help build your pipeline just like that so your pipeline is going to be everyone you're considering here people have applied online or people who are just a good match that you found searching your database then the pipeline is custom to your needs so you have up to 18 steps and stages that you can use and you can call them whatever you'd like. You can pick your colors, pick your terminology, pick what order they're in. And then it's merely just a matter of dragging and dropping. So if maybe I contacted Bernie Rose today, I'll move him over to contacted. And maybe James was sent to the hiring manager for review. I can drag and drop him over here to hiring manager right there. So I'm going to be able to move individuals through this process. And that's going to track them every step of the way. Each time I do one of these drag and drops, for example, if I looked at Candy right here, I can go to her name record. I'm going to see in the activities, there's where she was sent a hiring manager, and it's going to show what company, what position, what user did it, the name of the hiring authority or the main contact automatically. way okay so so you're going to have activities created each time you drag and drop you're also going to have an area here where you can see every position that that person's ever been linked to and how far they got who did it when it happened so all that data is collected with that simple drag and drop as you're moving them through that process okay so very easy to do just drag and drop You can create automations. So if certain things might want to trigger an email be sent or something like that, you can do that. And everything you do is also able to be reported upon. So if I needed to report on what I've done last week or last month or last year, I can go to my analytics, look at my metrics, and I can build a custom, let's say, pipeline activity report. And in this specific report, I only elected to put first interviews, second interviews, and phone screens, but I could have put every single one of my stages in there. That's up to me. But I can look at different time periods. If I went last year, this year, this quarter, this week, I can look at all the activity I had. I can scroll down and see how many second interviews or phone screens. I can even see who they were if I drill down into them. Or I can split it up up here if I wanted to split it up by job or split it up by client or even by employee if I had more than one recruiter working in the database, I could instantly split that data, see exactly what I've got going on, how many candidates are out, how many of each step. All that data is right here, right at my fingertips, very easy to report on. Okay, and so each one of my jobs is going to have its own pipeline and if you need it, you could even have more than one interview process, more than one pipeline with a different process you can do that too. So a lot of flexibility around the pipeline piece and that's really going to be the bread and butter of your tracking as you're moving people through the processes. You're moving them through all the way up until maybe they're maybe out of process. So maybe I found out that Michael was not interested. I could right click, I could pull him out of process and I could say he turned me down. So I could move him out of process there. That gets him out of my main consideration, but it's still going to keep him showing that he was out of process and for what reason. So I'm able to track this all the way up until placements. NPC recruiter can track permanent placements, contract placements, or both. You can track offers. You can send emails out of the system if you wish to send an offer letter, something like that. You can send that out. We are working on that. on a DocuSign integration that's not out yet but we you do have the ability to send form letters out of the system very very easily okay so each one of your job openings gonna have its own pipeline that's going to allow you to collect all those individuals as they've applied online now I also might want to search my existing database maybe to get people that I maybe have worked with in the past or some of that nature I can go over here to my name area and I can do an advanced search right from here and this is going to give me the ability to look up I'm going to type in sales and marketing people but I'm going to search my entire database just like that for those two words so everybody that's going to come back is going to show me that here's all the people that have the word sales and marketing in my database and I'm going to be able to see the score is going to show me the closest match and I'm going to see Terry has the word in the most different areas of his record. So I can tell that Terry has the word in his resume, his notes, keywords, candidate summary, profiles, and one or more attachments. So he has the words that I'm looking for many different places in his record. I can even drill down into there and I can click that R and it'll show me the resume and highlight the words I searched on. Same with notes. I can hand enter tidbits of information here into my notes and I'm going to be able to see they're highlighted I've got all the words I searched upon and then maybe I have a summary these can be something you paste in there you've designed it yourself we also have an AI summary generator so few different ways you can kind of arrive at a summary that's searchable data also your profiles that maybe include a LinkedIn profile that is going to be searchable data as well because we have a capture called or a tool called PC recruiter capture that gives you the ability to enter a person right from LinkedIn dice indeed zoom resume library a few others and it'll store a copy of their lips in this case LinkedIn profile as a searchable piece of information so I have that to bit of searchable information too along with any attachment these are a lot of older archive word resumes as I've updated his resume and they're going to be able to see right there so I can see everything that's going on okay and then from my search results I'm gonna Oh question yeah I said I haven't garbage trying to join the meeting um colleague from the team hello guys it's going to you yeah thank you so much okay certainly certainly so so when I do my keyword search here I can then take this data a couple of things that are going to be shown here I can see if they have a resume it'll show a little image of a resume that's clickable if I click it that's going to open up that resume in a full screen it's gonna highlight the words from there too I can also see if they're linked to another pipeline maybe I have to consider them somewhere else or I could see if they happened to be a contact or some I've already placed like Nathan right there is already placed. Keith is an employee. So those are people, a little red icon showing that's not someone I'm going to want to contact if I'm looking for candidates. So I have a lot of information going to show right there, give me a little insight as to what the candidate is. I also have some buttons up in the other right-hand corner that once I arrive at this list of records, I can click off a few of them. And if I wanted to, when I do click off a couple, I can go up here. I could pull up a map and put a pin next to everybody's location if I was looking for someone in a certain geographical area. I could hit letter and I could send them a mass email right from here. You can even track opens, clicks, unsubscribes, all that. I could link them to a position that would insert them right into that pipeline that we were looking at. Or I could put them on a roll-up list. That's essentially taking this whole list of people and saving them for later. So I can actually create a roll-up list right from here. And I'm going to be able to save these very, very easily. so that's going to be a nice crop of different things I can do for my search results. Okay so I'm going to have full keyword searching capabilities I want to talk also about how we get these records into the database of course we have a parsing utility if you wanted to parse a name record I could go name I can parse a resume right in here so I can just parse a resume and if I start that process it'll let me click either open or I can click paste that'll pull it off my hard drive or if I click open that will allow me to pick one out of my hard drive it'll open up it'll parse out the contact info here so I'm going to be able to parse the contact information to build the record of course the resume is then going to be stored as a searchable attachment I even have the ability to import a spreadsheet so if you happen to have data on a spreadsheet now if I go to name I can import a list that is going to let me pick a whole list to import so I pick a specific list maybe that I already have I will go to the generic file mapper and I would be able to browse to wherever my file is and I can map in an Excel spreadsheet to CSV so it's a nice easy way if you have data right now in Excel you're going to have the ability to map it right in you can match up the fields in your data to go into whatever fields in PCRecruiter you wish, map that in, it'll even detect and update duplicates if you wish. So a lot of different ways that you're going to be able to track and import your data here. In addition, our PCRecruiter capture tool is going to be something that would import from LinkedIn, Indeed, Career Builder, Facebook, Zoom Info, a bunch of different sites. So you're going to have the ability if you're ever on LinkedIn and you wanted to import someone's record that you found so if I go in and just I'm just did a random search there if I wanted to get anyone in my database and my database there I could go to Kenneth Friedman right here as soon as I'm looking at his record I'm gonna have the ability to click to add over on the far right and that click to add is going to open up our PC recruiter capture tool and it's going to bring in all this information it's showing you it's going to import his photo his first and last name his title if your first degree connection sometimes it'll be email address and phone number sometimes not if you're not if they choose not to make it public it'll usually pull in their city their state you can also add a note put them on a list or link them right into a pipeline right from here as you create the record and one other cool thing if you wanted to maybe you wanted to market mark market earth like earthwise bags you wanted to market you his company another option that you can do is you could choose to put it you could choose to have PC recruiter capture create a company record for the company that this person is linked to on LinkedIn and then attach them to it so you've essentially added a company and a name record then you can start marketing toward them maybe you put them in an email sequence to send them an initial email and then get them into a into a sequence there right along the way so super easy way to import data build your database and if I go back into my database here from my dashboard I can look at all new names I entered today there's Kenneth that I just put in and I think the coolest part of this in addition it brings to this photo you have one click access to his LinkedIn page time date username all that information is put in there but the coolest part about this is under attachments you're going to have a copy of his LinkedIn web profile that you can view and search on every word so all of this information is going to be searchable there so you're going to have a nice easy way of collecting and basing your database and then able to search on the data so nice way of tracking names track your companies track your positions we're also we have email campaigns we talked a little bit about that. You can send a mass email to individuals. You can queue it up to be sent tomorrow morning at 6 a.m. Of course, that's all reportable. So if I looked at analytics, I'm going to be able to look at every email campaign I've ever sent. Look at that. Look at a detailed report. And I'm going to be able to see the last time I sent your update contact info, 93% opened it. I can even see who opened it, how many times. I can even see what they clicked if I included several links. So all that information is right at hand there. And then if I needed, I could even go and build a sequence. So our drip campaigns and sequencing piece, the whole new place up here, this is going to give me capacity to set up kind of a templated sequence. So maybe it is just send an email, pause three days, send a second, pause four days, send a third, or maybe it includes a call. So maybe if no interaction occurs in three days, and my call list. So I can actually go back and on my task list, I can have a live active call list of all the people that I sent an email to, but they didn't respond in three days. I can go right into them and I'm going to be able to call them from here. So I can really easily work through that. I can go through here. I can schedule items. I even have a prompt to do LinkedIn related items. They don't happen automatically, but I know I have sent a connection request is what I want to do for these individuals. so I can click into them I can click right into their LinkedIn profile do what I need to do then go ahead and mark them complete that'll move on to my next step so a full sequencing piece is all contained in PCRecruiter now also within PCRecruiter this is kind of PCR9 so this is our recruiting software product we also have a PCRM well a CRM product called PCRM that we include so So you would actually also have a different interface of the exact same database. So if you needed to, maybe you prefer this specific interface, same database I'm logging into, a little bit more modern of an interface. This also adds like a sales funnel, a sales pipeline if you wanted it. But this is a little bit more of a more modern interface. So you might choose to use this interface. So you'll see there's Kenneth Friedman that I just entered. I've got his name record entered. I've chosen to show whatever info I want there. I can look at a detailed view of every field I have. Maybe I wonder if I have a phone number. I can just type in phone fields right there. It will filter them down instantly. So this new interface, also included with VC Recruiter, you can use either or both, or depending on what you're doing. A lot of people like this because of this deals pipeline. Deals pipeline is going to give you the ability to track different companies that you're marketing toward, and you can kind of move them through all of these different steps. So maybe I contacted Mellon Logistics. And then I might even have a couple of things I wanted to do. Maybe I want to call them on the 9th, and I want to email them on the 23rd. I can queue up various different tasks, and I can edit them, get rid of them, mark them as done, whatever I want to do. Maybe I even want to say, this, I think, is going to be a hot deal. They're getting a little closer. I can change the temperature to hot to kind of help with forecasting and such like that. So in this piece, we have a deals. pipeline and also a newer more modern interface that's going to give you the ability to work a lot of people like the left and right versus the up and down same database we just include both pieces there any questions on anything at all anything I hadn't talked about or that you wanted to go a little deeper into anything we've looked at. These are major goals right now. I just would like to go into pricing, not to waste our time, to know if it fits the budget. I also want to ask, how long does it need to be implemented into the system? And is it a month-to-month or an annual contract? Certainly. Well, to talk about pricing, the pricing for PC Recruiter is per user per month. So you have a couple of different rates you could choose from. If you wanted to go with a one-year commitment, that is $115 per user per month. We also offer a month-to-month, which is $125 per user per month. And on the other side, if you wanted to commit a little longer, we also offer a two-year at $105 per user per month. So you can select two-year, one-year, or a month-to-month contract and that varies but it's anywhere between like 105 and 125 depending on how long of a commitment you want you can add or drop users as often as you like so you're not locked into a specific number so you can pop me an email you can add a user or two and drop them right back off as needed you're also going to have a one-time setup cost of $750 and that's 750 is for the the office as a whole so no matter how many people you are that includes setup and creation of your database that also includes help hooking it into your website setting up the indeed feed the LinkedIn feed setting up integration if you wanted to set up that capture piece or if you wanted to hook it into your Outlook or your Gmail or anything like that a few different things we can hook up all that setup is included and 10 hours of training so you'd have 10 hours of training with one dedicated trainer that would get you up and running on the system and to talk time frames everything we do is all paperless so we would email you the paperwork that is like a DocuSign thing once you sign it we instantly send the invoice for the setup in first month once that's paid within a day or two you have your link set up created and ready to go the admin username and password is emailed to you and you're ready to start using it now the training takes a couple days to get a trainer assigned and then we have an an intro call with them. And then usually a couple of days later, you'll schedule your first training or first several trainings with them. So I would say to get the database set up a couple of days to get the first training underway and be utilizing it maybe a week, week and a half. So it's not all that much trouble. And I think you said you were using just a spreadsheet. Now that could be important on the first training. Yeah. So that could be important on the first training with the guidance of the trainer. So they don't do it for you, but they'll help you do it. They'll kind of walk you through it step by step. That way you'll know how to do it in the future. And then you're going to have the ability to do it any time. So that's going to help you to be able to pull in that information so you can do that any time. Sounds good. I think month to month will be fine for us right now. You can do the trial for mechanical maintenance. Okay. And you can also always start month to month. and if you try it for six months and you find you love it, you can rewrite your contract and commit to a one-year and then drop it down, or commit to a two-year and drop it way down. I love that. Okay. Yeah, how do we proceed? How do we move forward with the next steps? Well, what I could do, I could email you the paperwork as a next step to review, and then if you're ready to pull the trigger, sign it and then that'll come back to me. I'll countersign it and then we can get the billing sent and the invoicing sent. All I would need to know is how many users, you said month to month, so I know that piece, how many users would you be looking for to start? Right now, there's just five users. Okay, okay, five users and then And then I also want to just confirm that I have the correct company name and address for you here. So I have Kinetic, the technology agency, and I have over in Louisville. Is that your correct address? Louisville, Kentucky? Yep. Yeah, that's my correct address. Perfect, perfect. And, Daniel, what I'll do, I can send this to you if you'd like. That way you have it in hand. Let me know if there's any questions if you decide it you're ready to go Just sign it and we can get the process started if you have any questions or anything Let me know we can we can answer those for you and kind of take it from there Okay, thank you. I also have a sense you do adjust on the chat Are you going to send it to me in the chat? Yeah, I'll send it. Perfect. Awesome. Excellent. I've got that there. I'll make sure I've got the correct thing. I think that's what I had, but I'll be good. And yeah, I will email that over to you in a little bit. And then any questions, let me know. I'll circle back maybe Monday if I haven't heard anything from you, just to make sure you received it, see if there's any questions or anything like that, if that's okay. very well I will then circle back down and if you have any questions in the meantime by all means feel free to give me a call I'm here I'm happy to help and answer any questions you have thank you very much alrighty thank you for the time today I'll speak with you soon and I'll send that email over in a little bit I'll be on the lookout thank you have a great afternoon bye bye",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 614.017269,
    "salad_processing_time": 127.62075805664062,
    "overall_processing_time": 614.017269,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " welcome to zoom enter your meeting ID enter your participant ID followed you are in the meeting now you are the first participant please stand by Thank you.  um Thank you.  Thank you.",
    "job_id": "962542a3-bb2b-4d51-a7e6-5ac9cba07fa6",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " welcome to zoom enter your meeting ID enter your participant ID followed you are in the meeting now you are the first participant please stand by Thank you.  um Thank you.  Thank you.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Billing",
        "confidence": 0.7
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 12
      }
    ],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "billing",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": false,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3019272414037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}