{
  "recording_id": "3020180462036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:33:53.988870Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:33:53",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Enter your participant ID followed by pound. Otherwise, just press pound. You are in the meeting now. There is one other participant in the meeting. Good morning. This is Jim. Hey, Jim. Good morning. How are you? I am well. How are you? How are both of you? I'm good. This is Mike, and she was with me as well. Okay. Hello. Hi, Jim. Hello. Yes, I wanted to show you around PCRM a little bit. Have you recently looked at the PCR10 at all? Have you been in there recently or no? got to be honest no i have i have a little bit like i was telling you but yeah um okay yeah what uh that kind of changed as as we were going through with the the pcr 10 product i was telling mike yesterday um when it was originally conceived a couple of years ago it was um it was going to be a replacement it was going to be a new interface that was going to replace the old 9 interface. But as we were developing it, we added some extra CRM functionality and combined with the fact that we were also talking with people that didn't dislike 9 and didn't want to leave it. So what they ended up doing is spinning it off as kind of a separate product called PCRM. And what it is, it's more of a PCRM product, but it basically contains all the functionality of PC Recruiter itself as well. And it's wrapped in a new interface. So that's kind of where it's ended. So what people are doing now is since we released it, maybe February, March was when it came out officially that we were releasing it, maybe April. And it is something that will run off the same database as PC Recruiter. It'll just give you a different access point. So you're accessing the same data real time. And if you had half the office using PCRM, half using PCR9, that's no problem. Everything is shared. So people are getting it like we've been selling it kind of included with the new package. So when you buy a PC Recruiter as a new customer, you get both PCR9 and PCRM. You can pick and choose which you want to use and maybe you'll gravitate toward one or the other. So we've kind of left it in the client's hands. So I want to show you around a little bit some of the stuff in PCRM, some of the new stuff added, and it might be some of a refresher of what you've seen. you've seen we've also improved the searching a little bit as well just a question though when it comes to like you said that you can access the data and both like existent existing there is a drop down menu of like how you log in to databases so is it the same kind of functionality that you would have different login points or how is that the same the same everything just with different login points so let me share my screen and I'll show you mine for example so I'm looking at my sign in for PCRM here and it has all of the same databases as I have in my exact same database right here so same exact everything same usernames the same passwords the same databases and if you change something in one it's instantly available in the other because they're sharing the same database okay so it's it's very convenient to almost give you the chance to use either or both and see what you like better and maybe down the line nobody knows but maybe people will start to gravitate more toward PCRM and in a number of years PCR 9 might be phased out but right now there are no plans to phase out PCR 9 because it's it's still the product there and just adds some different things and gives a new format there so I'm gonna go ahead you have myself logged in. Oh, go ahead. If there are different databases that actually you log into and it's real time, so it is real time, so if one recruiter is operating in PCR 9 but three are operating in PCR N, whatever is done in one or the other is automatically synced automatic? Yeah. Okay. Like real time. So even if I went in and I can log into both and if I logged into PCR 9 here and I went to just a random name record here and let's say we went to Paula and we added a quick activity and I can say talk to her today I can throw this in pick my activity there and then I can say if I look up Paula if I go over in PCR M I can go to names I can look her up but she's already going to be the most recent person there I can click right into her name look at her activities and that's going to show up right there okay so it's it's all true real-time okay perfect okay so what the biggest thing we did with the PCRM is everything's down the left-hand side of the screen so a lot of these are going to be the same button as a nine but down the left-hand side everything's going to load in from the right so for example if I go to names I clicked on Paula's name her name loads in from the right side of the screen we've added this workspace which gives you the ability to design an initial custom workspace here okay I can zoom in let me zoom out a little bit so you can actually have your own custom workspace there but then you're also going to have access to all the tabs you normally would have resumes activities keywords notes all of that so all of that information is going to be the same terminology just a little bit different of a format something like we've added in PCRM if you go to details this is every field you have and if you want to look up her phone just type in phone it'll instantly search those down and instantly kind of snap up to just phone fields or something like that we've also set it up so that everything is very similar to how it works so if you go to either a name a company or a position it's all going to give you the same grid you can now edit in grid you're also going to have some quick actions you can take right from the main screen. You can contact, email, call, SMS. The call and SMS works through RingCentral, incidentally. You can add activities, notes, roll-ups, submit a profile. You can do a lot of things right from this main screen. You can go to roll-ups. I think that's going to add them to a roll-up, link them to a position. So you have a lot of functionality on that front screen and if you know how to use one screen, same thing works on the name screen, the company screen, and the position screen. So that's going to be a big differentiator there now some of the screens if you use the analytics or the email campaigns or the sequencing they're going to look just the same because when we designed the sequencing screen we were already developing PCRM slash PCR 10 at the time but it looks identical so some of that's going to look very much the same the analytics the sequencing the email campaigns I think this schedule also looks very much the same just kind of plugged into the new interface here so some of the screens are going to look very much the same so it's going to be familiar yet some things like this deals workflow that's a new totally new function that was added this is going to be like a sales pipeline and for years we've had many people asking for that to be able to track deals through a sales process you have your different steps here you can create a card of what it is you can on that card put different things if you want to have a call and email if you want to give it a temperature a value projected close date everything here is set up to do forecasting which is coming out in a future update in the next maybe month I believe so you're going to be able to run some analytics reports on this deals pipeline here so it's it works very much like the candidate pipeline drag and drop one step to the next and that's going to let you move through this process then when they become a client you can link a job to them company records already in the database so you're good to go so everything is in one database PCR M or I I mean your CRM functionality and your recruiting functionality because you're also still going to have your positions which will still contain the same pipeline so if I look at my pipeline there I'm going to have the exact same pipeline working up there so that carries right over so essentially you have a CRM with all of the PCR PCR 9 functionality in it So any questions so far? Does that make sense so far? That's all if the information and the data is in PCR, though, the CRM stuff. Like it can't be like imported from an Excel spreadsheet without adding the records to like PCR, right? Like all the details have to be in PCR in order to use that, the deal tab. Yeah, if you add a deal. Well, I don't know. So you can link it to a company, but yeah, I think that's required. So you have to link it to a company that's already in PC Recruiter. So yeah, the data has to be in PC Recruiter. It's just going to be in a deal rather than marked a client and working in a position or a pipeline there. But you could import a spreadsheet of data if you need it, keep a private roll-up list that is just the deals that you're working, and then you could even make that non-visible to other users, and then you could pick those companies and make individual deals of them if you wish. Okay, another thing along those lines that we've added is a simpler sequence tool. So the sequencing, if you've used it, it takes a little setup. And that was the feedback we were getting from people, that it takes a little time to set it up and to configure it and set it up because you have to go in and create the whole sequence first. What we've now added is on the roll-up list, you can go over to any list and you're going have a little simple sequence right here you can create a simple sequence on the fly so in a minute or two you can kind of pick what you want it to be you can pick email get that alarm out of there automatic email pick your roll up pick what form letter it's going to be and then you can go ahead add another step maybe it's going to be a call maybe you can say I want to call the cell number so you can kind of go ahead and hit save and activate all at once so this lets you build a sequence right on the fly and access it right from the roll-up list you don't have to go and set it up and apply it and test it and apply it to a roll-up list and activate and anything like that cool thing about it is when you're running the sequence you're going to get similar to like your roll-up list stages you're going to have a sequence step in here so you're going to be able to see where they are in the simple sequence that is running when it happened what's going on right there so that simple sequence kind of replaces the roll-up list stages with a simpler version of the sequencing tool right and then we've also improved the data entry so if you're looking to add information I can go up to my ad up here similar to how we have that lightning bolt in the current pcr9 you can drag and drop a number of files right to that blank area or as I like to go if you want to add a name you can go ahead and add a name and you can go in and add like Jeff and what you can now do is you can say I want to add a company on the fly I can say it's ABC and what I can do is go back over to Jeff I have the ability to link him to a draft record so I can create a company and a name at the same time link them to one another I could upload an attachment and then link that to Jeff's record or any other record maybe I want to upload an attachment and parse that out as a a resume. So it can do all sorts of different operations all at once on this screen as you're adding data. So it's parsing, additions, uploads, attachments, all at once. So it's kind of all combined. So that's been improved a little bit. So a question for you. I know the name record has traditionally shared the same customization and formatting between a candidate, like a name versus a company, has that been like separated? So a client contact record is different than like a candidate record or no, it's all still the same. Yeah. A name is a name. So, so no matter what they are, a name is a name. Still going to have the same statuses and it's going to note that, but you don't have that, that ability. Yeah. Okay. Okay. And then the searching works a little bit different. So you're searching up here. It works in tabs. So if I looked up, as I look up different fields, it adds these little chips here. You can move them, resort them, close them out, or you can go into more filters. And if you want it, you can do like the all content is going to be the Boolean search. So if I want like sales and marketing, I can go ahead and search that. I'm going to be able to search right back. And then now this version doesn't because it was released last week and I haven't gotten the newest version yet. but it's going to tell you kind of where the word was found, how many times it appeared, give you the ability to click into it or anything like that. One of the shortcomings of PCRM in the past was that they didn't include a good Boolean search because they were designing it more as a CRM so Boolean search kind of was low on the list but they've gotten to that so that is addressed and in conjunction with the AI search we've also are coming out with a match so there's going to you a button on the position screen that you can click that button and it's going to go ahead and produce the 15 closest matches for that position in your database. So it'll kind of use AI search to go find the 15 closest matches. That's due out in, I think, a couple of weeks. They're working on that. And that's based on the job description within PCR under a company. Is it going to automatically filter those main records into the PCR pipeline and put them as like, you know, that exclamation mark? I believe it gives you an option to. I don't think it automatically puts them there because in case you didn't, but it's going to suggest them. Here's the best 15 that we found in your database that match this job. And then I think, as I understand it, I haven't seen it yet, but I think there's going to be, you can check off the ones you want, pop them into the pipeline for consideration. So it only goes to 15, though. When you say it goes through the whole database, it's not like a zip code radius. It's everyone in the database that's going to come up with the best 15 or 100% match. I believe so. That's what I'm told. Again, I haven't seen it, but 15 is the number I've heard thrown around that they're going to put the 15 best matches, the people that have the most instances of the most words that are in that specific position it could be 20 I don't know I've just heard 15 like I said I haven't seen it yet so I don't know exactly what they're working on but it's going to search the entire database and bring you back the best matches just kind of a suggested here's a 15 people that we suggest could be a good fit for this job so kind of a neat piece there okay so that is kind of in a nutshell show what the PCRM is. That's how it looks. Just that new interface, add some CRM functionality there. And it includes the AI suite. It includes all the premium features of nine, and it shares the same database. So you'd have the ability to use either version on your same database. so mike was sharing that the um the new pcr m um if we opted into it um it'd be like an extra ten dollars per user yep 350 to set it up that includes four hours training and then 10 bucks more per user per month for everyone so in terms of the one thing that I wanted to ask you you stated that all new customers are getting both so I sorry I have to go and answer the door just one second sure all right Jim we're the only two in the office today um oh somebody has uh been pressing the doorbell consecutively. That's good. Distracting. Yeah, yeah. I don't know what is going on, but yeah, they pushed it about seven or eight times, and they're still pushing it. Oh, my goodness. Can they see you? Yeah. Oh, so they can see you in the window? No, they can't see us. Yeah, no, no, not at all. We're well hidden in the middle of the office here, but people they cut. We have doorbells at the front and the back of the office. And I don't know why, but they come and they just consecutively push it as if, I don't know, they think it's not working or something. Okay. So I guess my question, and I know Mike maybe has already talked about this, but the new customers are already getting both. and we've been with PCR since 2011, like is that the best rate that you can give us for the $10 per user? Like if new customers are getting both, like... They aren't. Most of them are paying $1.15 per user per month to get both though. So they're paying the much higher list rate than you guys have. I don't know what you all are at. I could probably do it for like $7 per user per month just since you were a beta tester for a while. you had you've been with us for quite a long time I could probably do it for seven per user per month a little bit cheaper but my most new users are paying 115 to 125 for PC Recruiter with PCR9 and PCRM okay okay sorry Jim I'm just asking because like I mean if it's automatically and I understand that like obviously new customer rates are probably higher but you know when we've been with and we've tested various and then new customers are automatically getting both. It never hurts to ask the question, right? Certainly, not at all. It does make sense. I'll discount that a little bit to seven rather than 10 because you were beta testing and you've been with us for a good long time. Appreciate it. Sure, sure. I think I'm good with everything so from here what you would need from us is to gain the approval from our senior management in order to go forward with the PCRM correct yeah what I would do when when you're ready I would send a new agreement that would include the AI suite plus PCRM. That spells it out plus at the new rate, which would be $7 more per month per user. So once you have that approval, if you do, let me know and I can email over a new agreement to get signed. Okay. So question for you. And I think Mike had shared that you would need some time in order to change the database over or something like that. So would there be any downtime for us? Because I know that you're traditionally, you know, you guys actually do a lot of your software upgrades and everything like that during the business hours that we operate. So how would that impact our business? I don't, from what I've heard, it really doesn't because they're just creating a new link. So they create that new link side by side. The AI is included in it. I don't think there's anything really that gets installed or changed in your existing database because, again, this is just another window to look at the same database. so I don't think there's going to be any downtime. They would just create the link, email it to you, and say, here's a different link, but use your same passwords, your same everything. So I don't believe there'd be any downtime. And Jim, for the AI edition, because the PCR9 is a trial run, is there anything different? Do we have the full package, I guess, as a trial, or would it be something more that we would gain with that, like with actually moving to the PCRM and the AI package? Yes and no. So right now you don't quite yet have the AI search because they needed to upgrade some of your databases to Lucene. Once you have that AI search, you will then have the entire AI suite. So once you go to PCRM, you would have that same entire AI suite. That being said, once the candidate match is released, you'd then get that too. So you would get that down the line. But you almost have it all now. Just they had to get some things fixed up to get some of those databases on Lucene to be able to run the AI. Yeah, yeah. Okay. And were you able to see, like, where were they at with that? Yeah, what's that upgrading to Lucene? They have isolated which databases need to be upgraded to Lucene. And Lucene is just easier to use. It's smoother. It's quicker. So they have waived any charge. Normally, they charge $250 a database. We waive all charges to do that. And McKenzie is looking at the best time that he can do it that's going to affect you the least. Usually, he does late, like close of business, stuff like that. So he's finding the best time he can do it because it's not going to take you down like we talked about. It's just going to, when they start to kick off, it's re-indexing the database. so if you're doing a keyword search at that exact time you're not going to get as many results and then if you did it five minutes later you get a few more and then a few more as it reindexes so it doesn't take you down it's just gonna slow your searching a little because it's reindexing the databases so he's kind of looking at the best time that he can do it outside of business hours so it wouldn't but even if he did it like now your searching would be a little wonky you wouldn't get as many results but it would grow by the minute so he's trying to do it the best time but that ticket isn't QDR working on And just one last question for me, Jim. API. We heavily utilize the API with all our websites that have databases at PCR, which are every one of them. So we integrate so that new positions get pushed to our website. Candidates can sign up onto PCR as a new candidate right through our website. So that all gets pushed there. They can apply to positions, blah, blah, blah. We're really heavily integrated in. I did speak with Garrett, and he had mentioned in an email that there was no, like nothing which should affect our API. But given that it's two databases, is there anything that we need to look at updating on our side just to alleviate any issues in the future? I don't think so, because the AI runs off the database. So the interface shouldn't matter. I've heard nothing of anybody having to change anything with that. Okay. Okay. Good. Good. Good. That was my own. That was it. I just wanted to double check. I know, I know in the past, like when you guys, when PCR updates the API or they push them, there's always a little trickle down with our, you know, some sort of issue with the website. So I just wanted to kind of verify that hopefully it's nothing should, should come up. Okay. Yeah, I haven't heard anything. I can't say forever. It won't be, but I have not heard anything from anyone, from clients or from my team saying, oh, this is going to happen or anything like that. Sounds good. Sounds good. No, I'm good. Thank you. Well, Jim, we're good on our side. If there's anything else on your end. I guess the only thing that I would probably say is if there's any, like, marketing material that you have that is a one-page simplistic, is simplistic, just so we can present it to Jason and David to help sell. You did talk a lot about it. Oh, we did? It was a sales and marketing link. It's got a little bit of information on it. Okay. Yeah. The website's all I have. I'll see if we have anything more. I don't think we do, but I'll send her anything I can find. But, yeah, we have the website, which has some basic info on it. Okay. Truthfully, with some of the search, yeah, I think it makes sense. We just got to sell it, like Sheila said, to our senior team. And the only reason why I say that, Jen, I know that you probably are well-versed. There's been a lot of change in the market, right, like with the political environment that's going on between Canada and the United States and the world, for that matter. but it's impacted a lot of business and, you know, obviously everyone's looking at costs, right. But I guess Mike and Mike and I have to prove out the, you know, the increased interface and the enhanced functionality, right. It will ease on whose, whose part and save time or increase, you know what I mean? Ultimately increase the amount of candidates that we get in front of our clients quicker, right. Sure. To get started. And yeah, and I appreciate you looking to decrease the cost a little bit too. That'll, that'll help play into our game of trying to justify all, you know, a raise in cost. So there are other, and like Sheila, they're always trying to get us to how can we lower costs? So to come up and say, Hey, we need to up, even though we're getting more product for that cost, it's still, we still have to present. So, yeah. I understand. Okay. Well, awesome. Awesome. Thanks a lot, Jim. I appreciate it. Sure. Let me know if there's any other questions or anything more I can do, and I'll just wait to hear from you. Sounds good. So we won't be able to touch base with them probably until next week. I don't even know when David's back. I don't know either, but we'll touch base with Jason, and then we'll go from there. So, yeah, I'll get back to you. I'll keep you posted, but let me – it won't be until early next week before we even get a chance to talk to one of them. So, yeah, give me a few days. Will do. Not a problem at all. Awesome. Thank you, sir. Have a good weekend. You as well. Thank you. Take care. Take care. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 645.76531,
    "salad_processing_time": 298.4218764305115,
    "overall_processing_time": 645.76531,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "job_id": "8ca0b56e-3f6a-4673-9ac3-cee2b87f6ae9",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3020180462036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}