{
  "recording_id": "3020693983036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:34:28.495024Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:34:28",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Integrity Bookkeeping, this is Teresa. Hi Teresa, is Kathy available? Yes, just a minute Robin. Okay, thank you. You're welcome. Thank you. Robin? Yes. Can you hear me? Hold on. I have no sound. Is it me or you? Are you there? Yeah. Can you hear me? Hold on just a second. Can you hear me? okay i should have sound now can you hear me there yes yes thank you oh okay between you and me my headset i don't know who's what i have a problem that might have not been done right or whatever i don't know there's something you did because i can't remember if i asked you and i'd have to go through all my notes but I'm like just trying to get things through things quick right now can you in QuickBooks look up WJ I'm sorry JWP strategic let me get there I don't think I adjusted that invoice on my own. I can't say that I... Say again, what's the name? W-J? JWP. And I'm going to bring up their cancellation ticket, see if I can find that. Okay. cancellation effective 8-1-2025 yeah so occurring set to end 7 30 somehow for their july 1st invoice i guess they must have been invoiced for two i'm trying to like look through everything but they basically they paid for two it looks like invoice payment invoice payment invoice payment And it should have been one user, but then there's this row for 710 created by QuickBooks Online to adjust balance for deletion. I think something. Because it says that the invoice on 7-1 was $88.66. Yeah. And they paid $191.05. Yeah. So the balance does say $88.66. Let me look at the payment. So I don't know if I fixed it and didn't really look at the payment maybe. Hold on. It's got something added weird. So let me. Because basically he's looking for the amount refunded back. Let me check the payment and see if it really did charge that. Because the invoice of that extra is on 710. after the payment was made. So it doesn't seem to me like that would actually have charged that amount. Let's see. And the client is deleted, so I have to reactivate it or I can't see it. Okay. Bill or Jeannie, so hold on just a second. I'll make it active. and it could be that QuickBooks in its stupidity made that change after we went to go inactive yeah this thing does some weird stuff I wouldn't expect it to sometimes I remember Patsy always said Patsy would always tell me it's quirky I'm like, why is it doing this? It's quirky. Well, sometimes it's quirky because people are quirky. I'm quirky. That is very, very true. Sometimes it's quirky because people are quirky. But right now it's trying to use a lot of AI stuff, and we're finding that we're not happy with it, just to be honest. So it looks like there was a payment on 6-1, And then it does say 7-1. The payment was $191.05. Okay. And that was approved. So I would – let's see. I'm going to delete the 7-10 invoice that actually QuickBooks created. That's weird. QuickBooks created that on its own. It does say created by QuickBooks. Okay. And I'm going to delete this. So then the refund would be $102.39. That does end up. See, that's the weird thing is why would it have filled $191.05 when the only – was it – oh, no. Because the only invoice that was open on 7-1 was $88.66. Unless I went in and modified the users – after it really already processed. That could be what happened. Well, let me look at the invoice. And I'm going to look at the audit history. And see what exactly happened. Okay, let me see my notes. I was on I'd so okay it was not till August this started a long time ago rich um no well that wasn't me so you edited it on 7-1 which is the day that it was creating the invoice and okay let's see if it didn't say when remaining Oh, okay, yeah, here are some notes. Yeah, we did switch billing system so you need to add your card details for the first invoice from the new system. You've done this already so you're all set. You will have invoices dated 6-1 and 7-1 remaining, so this is back in May before the cancellation. I made sure the recurring invoices will end before the 8-1 cancellation date. Are you still at two users for the remainder of the agreement. I'm not using this system and I don't think they did either. We do have to bill for the remainder of the contract but I can lower it to one. You would appreciate that. And yeah, so probably on May 9th I would have lowered it to one user. yeah he paid for the June invoice was $85 so he paid $85 on June 1 because it went by credit card directly from Biller Genie and then on 7-1 it was $88.66 but it filled you know what it had been maybe the recurring was still at $177.31 that could be and then $88.61 Nope, it's $88.65 different. So, yeah, I'm not sure. But I can refund the $102.39 if that's what needs to happen. Yes, that's what needs to happen. Okay. Okay. So, let me. I think I have to do that. And I got most of those other ones. Never mind. Let me do that first. See a customer. jwp history refund 102 39 and i'll um the email is the jeff at jwp right yes yes Yes. OK. And I'll do that. Jeff at JWP Search. And him. Yep. So we'll refund that. OK. That's been approved. So let me now mark it in QuickBooks. I think this is going to come out. Okay, 102.39. Okay. Okay. Take this message out that we don't need. And this is the 102.39. And we're just going to save and close. We already sent the other refund notice to them. Okay. So that one is, let me fix this. It's not. Why is that not? Oh, God. I'm going to be losing people telling me. Not you. Thank you. Thank you. Thank you. 191. I want it. Put my motivation. I might have to fix it a different way. I'm going to have to fix it a different way. I hate QuickBooks. Just do what I'm telling you to do. Okay, I'll fix it. It won't let me tie the refund to the overpayment, so it's leaving a balance on there, and so it's driving me mad. So I went to do a – I figured, okay, well, I'll do a credit memo instead, and I'll link them together, and it won't do that either. So I'll fix it. Is there something else you need? Because I got, like – No, but anything else will just delay. I think there is one thing about that sales receipt stuff, but we don't have to do that right this moment. For sales receipts? Remember that one list? Yeah, let me look. No, that list of 17 or 18 customers. There was a couple I wanted to review with you, but I don't know if now is a good time. Probably not, it sounds like. Well, I want you guys to be able to get paid. So I'm going to go on right. So let me know which is the one that you're not sure about. OK, let me find my drive here. OK, let's see. Drive, sales receipt. Go into it. Now my notes. OK. I think Morgan, Bridget Morgan. Bridget Morgan. Is that the one? Oh, yeah, that's the on hold one. I don't think any of that on hold stuff should have been sent because they are active at the same time. I don't know why they had two invoices or two sales receipts. during that time. But if they didn't go through for the $20, you said they, the, the regular ones went through but not the hold ones? Well, let me see. From August 24th to March 2025. Yeah, that's, I wasn't sure because sometimes you'll have clients that have like two separate billings, you know, like maybe they'll have, two divisions or something like that. Yeah. But the, you're right, the on hold ones did not process, but the, looks like the ones that were 119 Those did go through, right? Did. Okay. So I don't know if you want to void, delete, whatever, but basically it doesn't, those hold ones should never process anyway. Because Liz yeah LID put the customer from on hold to active on August 22nd 23 then a hold was initiated and they've been active since they're not um actually logging in but hey if they're paying and their database is active then yeah okay so August of 24 through March of 25 those all those $20 ones are no good. Hold on. I'm wondering if it's really the opposite. Hold on one second. Let me look at this for a second. Change log has it as Liz went from two to one. When was the last status change? she made them active back in august of 2023 and they were previously on hold before that but they should be active since august 2023 yeah they made a 515 payment in august of 23. Okay. After a whole bunch of $20 payments in 2023. And those look like they did go through the $20 ones, at least when I look at the one in July of 2023, that one did go through. So my guess on that then would be they were, they put on hold, didn't pay on hold payments, and then they asked to be reactivated and so she put them on active. well they've been active they had the regular they had a regular invoice in September of 23 through August of 24 and then in August of 24 started the $20 again so they had a whole year they had a whole year where they paid regular okay let me look at but I think I'm just going to leave it because I've adjusted other things. So those $20 didn't get paid, and I can write those off after the fact. Well, I think I've already done it because they didn't process. So I've already, on the accounting side, written them off. But if they didn't owe them, then I just wouldn't pursue them for fun. Okay. Yes. And then I'm looking at tickets and knowing how low they should be. ticket ticket they had a ticket to remove users but never anything since they're about canceling going on hold so they should be active since that august 2023 or whatever it was okay hold on just a second yeah they went to one user who did february 28th So Bridget Morgan? That's Bridget Morgan Company. They went to one user in February of 2024, but that's the last change of anything. So the one $19.95 is there is just one user? Mm-hmm. Yeah. Because they have the big package, we'll call it, the premium. Okay. I got sequencing and all that. So it seems like these things before, I'm sorry, after August 2023, there really should be no on-hold invoices. That's okay, because they didn't cash. So we're just going to leave it. Yep. Yep. Now, is it better to take that off so that we know it's done? Or that's one thing I'm not really sure. No, I put a note. No, I put a note. I don't want to take them out because I've already adjusted the income. Okay. So I don't want to take them out because that screws up my income adjustment. Okay. So I'm going to put next up resolution. Okay. So what should I say you did? Kathy has. I already put a note in there. You need for your system? Yeah. I'm making a document. I don't know if I think I sent you the link of what I've done. Kathy has added notes to the $20. It wasn't owed and it wasn't paid. So we're just going to leave it. Yeah. Okay. The amount was not owed. So it does not matter if it's not paid. This is done. making that in green I guess I got a whole bunch of I got a little pushback from one of the customers this morning I'm like hey why did this happen and what are you going to do for us I want to invoice somebody I'm like look it's an accident yeah and you you've had free services you know um yeah basically what I wrote, you know, regardless. I'm not going to bill your card instantly for everything you haven't paid yet. That's what I'm going to do for you. You are on the same page as me. Do you want to hear what I wrote to her? What was her name? It went back and forth. It went back and forth. Okay. So what was the last one that I sent to her? What was her name? God, these are a number of emails. Oh, this is crazy. This was her. It was that Shelly Herman. I said, I completely understand your frustration. I'm really sorry for the situation that this caused. This was unfortunately an oversight on our part, and the issue went unnoticed on both sides for quite a while. Passing a little blame there. Being a little passive-aggressive, aren't I? We did not have – Well, how come you didn't notice? You didn't – Yeah, there's me being a little passive-aggressive. We did not have any transactions for your company's cards or checks received during that time. While not ideal, the Peace Recruiter services were provided throughout that period. We know getting an unexpected invoice isn't easy, which is why we offered the option to spread the balance over three to six months to help. We truly appreciate you being such a valued customer for so many years. We're confident our new billing system will better support auto pay accounts. The new customer billing portal allows you to manage your payment method directly. you can update your card on your own for auto pay and if there's ever an issue with a card or invoice you'll receive automatic reminders thanks again for your understanding and I'm going for thanks chat GP because oh that's very good Robin yeah I grew and what I wanted to say like I said no change this change this yeah a little help there help organize my thoughts and still be nice about it okay take the blame but okay so deep okay yeah there was another one too there was another one okay so that one is done okay so I got to do that okay who is it that one are we that one I'm waiting that one hold on let's see waiting for response waiting for response that one's paid okay that one I I figured out Kemp Group that when it looks like you kind of made an invoice or whatever and you kind of automatically processed as an invoice for Kemp Group K-E-M-P-S I'm going to guess you did this because there was one email should I go ahead and process it I think you did um I'm sorry tell me the name again sorry have group K E M as in Mary P as in Peter s and it's a weird name huh thank you that's hard for me that that's hard for me to hear sorry yeah so I think what would have been 1231 24 sales receipt oh then what's the 65 now i'm really confused this one was really confusing i kept looking at like a hat it moved to like a half a year thing it says every year but i don't know why it's oh because he didn't get a bill in 24 he didn't get a bill on 12-24. So we billed him a six-month late. He's supposed to be billed every year. And it looks like the new recurring one is, you know, $648. It's with a 12 months with a 10% discount, but technically, you know, he's six months in where he hasn't paid. And I don't know if he must have changed the amount of users because the sales receipt for 23 says four users so now he's now he's down so he got billed in june um as a sales receipt see yeah that's why it's so weird that's what that may be you i did that i thought maybe you went in and like kind kind of maybe reprocessed it from the backside. That's what I was thinking. Let me see. Maybe because I was like, oh, let's get his card. Yeah. Don't you sometimes do that? I might have. Okay. Let's just leave that one as is, I guess, right? I don't know. They are supposed to be two users. He's getting six months for free. Well, he's paying six months late is basically what he is. He's got two users at $30 each with a 10% discount for paying annually, even though he was paying six months late. Hold on one second. Oh, okay. They got the discount of the thing worked in there. That's why. Okay. I'm like, wait a minute. This says different amount, but that's because they have it listed with the discounted rate. Okay. All right. Actually, I'm going to put a note of that, that this is really... He'll get billed again in December because that's when the renewal is. He just got a six-month stay on his 12-31-24 invoice. He paid in June, and then he'll end up paying again in December. Okay. I'm going to do this. It's just 30, 60. That's really their rate. It's just they get a billing note. 10% discount for playing annual. I'll put that separate. All right. If they decide not to go annual, they don't get that discount. All right. So that one, I think we just leave it as. What do you think? Yes. Yep. just leave it yep okay okay Kathy processed the invoice okay all right no further action that one's done okay boom boom okay what else did I have I think the Murphy ones um I think we got to change that email address I got to call them I think I got to call the son I'm thinking either the father retired or maybe worse. I think I emailed you guys about that. I remember a while back when I was training him, I think he's like, yeah, my dad's not doing good. I thought he said he had cancer. So I wonder if he's kind of taken over and we have the wrong email. So that could be an issue. Okay. Did you send it to the .a? Did you send it to the son? I sent it to, no, not yet, because I don't know if it's best to say, hey, we've been sending, but he probably gets the email. But they bounce. I wonder if we could just say, like, they bounce, rather than admitting a mistake. I would send it to both. I would send it to both, so that he sees, like, oh, they've got the old email on there, too, you know. Okay, maybe I'll even add that on there. So, okay. MedBest, I sent that one. I'm waiting. That one's paid. That was just one missing payment. So I just sent an email, and then that one, if they don't reply quickly, I'm just going to make an invoice. Oh, here is the one that was. I think it was this one because that's all pending pending pending or response okay so here's the one that was really confused with out helping I think it's helping SC if I remember right. This one I got a little confused on but again it was really late at night anyway. Cleaning up this one here. Okay, that was good. So out helping? Yes, out helping. Yes. Okay. Whatever that means. Okay. So this is, according to my little notes I have from last night, I was going to review with you before emailing the customer. had a user change to three users starting with invoice dated 5-14-25. For those May and June... These, okay. So there's a couple issues before we go any further. So I cleared out the 2025 payments that didn't actually process, but I might just need to delete those for 25 for those first three months. Okay, so tell me what's your question. Okay, so here's what I found. So 514 and 614 invoices were correct because they dropped to three users. then their template got overwritten okay so I adjusted the 714 invoice to three users and I also updated the recurring so I handled that part but then I noticed that there's this deposit transaction dated 314 yeah that's my change okay that's my final for this because the first three months they didn't process and so those payments were hanging and then because I never saw anything recorded as a deposit so I didn't know if it handled I didn't really know what to do with that. Yeah let me um I'm gonna I'm going to take this out because it's okay so the payment on 620 isn't over the payment on 620 really was only applied to the June invoice, right? Or what it shows actually the payment on 620 was paying two invoices. Right. The May and June. Yeah. And the May and June are the ones when I dropped them down to three users. So those were correct. And then what had happened was the 714 and the recurring were overwritten, probably with the tax stuff, I guess. So I've since fixed those because one was still open anyway. And then the recurring is obviously what's going to come next. So those are now fixed. But then when I was doing that and then looking at these other things, that's when I noticed this deposit. And I wasn't really sure what that was. Yeah. Yeah, because that one was part of my trying to correct all the hanging deposits that never cleared. Okay. So that one's no good. I just took it out. But you have all of the totals of what they didn't pay, right? Okay. So it is still July 2024 to February 2023. Is that correct? Wait, I'm sorry. July 2024 to February. July 24th to February 2025 is what I meant to say. No, March of 2025. So the March of 2025 was $730.10, and that one didn't process either. So the January, February, March of 2025, and I'm going to void those. But just make sure. So the January was $1,069.08. That was the same cost for January and February. and then March was 730.10 okay so it is those okay the March okay because I think I got confused with a deposit because it was it what days did it dates been mentioned um oh because it had January February March so I wasn't sure if it was like overlapping based on the time frame you had sent before. So, okay. So I still do. No, part of the problem is sometimes QuickBooks won't let me delete these or see, it won't let me void it because it's unprocessed is the problem. So it thinks it's still waiting to process. I can only delete it. I can't void it. So that's why I was trying to back it out by making it deposit and then clearing the deposit out and adding that they owed that money but I'm going to delete these and then that will have to be those three amounts will have to be in your new invoice of what they owe. Okay. I really need to do this from July 14th 24 to March 14th, 25. Yes. To March. And I'm going to change my notes here in the, in the QuickBooks. Because it doesn't include March, but it should. March did not, March did not process. Oh, I did. Oh, actually, no, I, if you look at my notes, it says July through February is 106, nine Oh eight and March is seven 30, 10. so that's why I separated because March had a different cost oh there's a different line item below okay I see that gotcha okay so that's why that's why yeah that's why there's extra things because March was a different fee yeah but then that deposit thing that you were doing that had the dates of January February in the March so then I was like well does that mean that okay alright so I will just make a note status need to send email now that have reviewed and updated with Kathy okay all right I get that last that's I believe the last one I need to spend other than trying to get a hold of the one that bounced okay all righty thank you very very much you're welcome all right yeah the lows of a vacation i'm just kidding that would be nice huh yes all righty thank you so much have a great weekend bye thank you too bye",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 665.483615,
    "salad_processing_time": 129.06368899345398,
    "overall_processing_time": 665.483615,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Integrity Bookkeeping, this is Teresa.  Hi Teresa, is Kathy available? Yes, just a minute Robin.  Okay, thank you.",
    "job_id": "04e1bf4c-340f-4c6f-bd0a-d296543ec6a4",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Integrity Bookkeeping, this is Teresa.  Hi Teresa, is Kathy available? Yes, just a minute Robin.  Okay, thank you.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical",
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3020693983036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}