{
  "recording_id": "3020868019036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:34:44.737855Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:34:44",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence. This is Robin. Hey, Robin. It's Michael with Viewpoint. Hi. How are you? I'm doing good. I was just going to ask you something. I'm messing around with the PC recruiter right now, and I'm wanting to send out mass emails. Could you just point me in the right direction of where to start because I already have my script and everything I want to do? Where would I add that? So the content is – I assume you're just sending to a list of names, right? Yeah, so I have a roll-up list ready that I want to send out to. I just need to be able to put the content in, and then I want to click the names I want to send it to. Okay. Let me just make sure that I am looking at my notes for you guys because I don't want you to get your account blown up. Okay. What is your username? mkaroo. Okay. Bear with me one second. I want to double check everything. OK. Make sure that these are testing fine. Oops. Okay, that one's failing. Failing. Okay. Did you have to change your Gmail password recently since we did your Gmail setup? Okay. So there's going to be a couple things going on that we've got to have you fix first. Okay. All right. So at the very top right of Peace Recruiter, where you have your user image, there's the little gear icon that kind of floats on the edge. Click on that and then go to email. Okay. And then that's going to put up a new tab with your email settings. So right now things aren't like sending or receiving because you changed your Google password. so we'll need to change it fix it in two places we're going to go to configure up at the top okay and then go to mail servers gotcha and then you're gonna at the in the bottom half you're going to see my email that's your incoming mail server you're going to go to action and select edit let me know when you're there i'm there okay um there's a blue sign in with google option and you're going to need to sign into your google account gotcha so that way if you get replies and stuff it can be recognized okay i'm signed in okay once you're signed in and it's showing you in that mail server screen click test connection just to make sure that it's passing this time invalid credentials oh hang on yeah okay Because it didn't have me type it in. It seems like it just picked up my mind. So hang on. And then do I need to manually type in the password where it says username and password on the edit email server? No. When you use a sign-in with Google, it should be bringing back your credentials. It's going. I'm pressing sign-in with Google. I'm clicking on my email. Okay. And it says you're signing back into PC Recruiter recruitment and application tracking software. Oh, okay. At the bottom of that screen, I think you might have to hit, like, allow or something like that. It just says continue. Yeah. And then it's asking me to press continue and two different things. Should I press continue? I think so, yeah. Okay. It says continue. Give me my name. Oh, yeah. It says, okay. Okay, perfect. In that pop-up of the test, hit the X, and then in the mail server screen, click Save. Now that we know that it tested okay. So that's one thing. Correct. Perfect. Okay. The other thing that you're going to see once you're in PCR mail is called Alias Address List, which is your settings when you are logged in to send an email. so that was not authenticated either because everybody should set up for sending that everybody has the feature for the get me and coming to so that's why we have to authenticate in two places so once you click alias address list at the top you're going to see a card click the pencil option okay same thing sign in with Google basically same thing yes sign in with Google test it then save Okay. It says okay. Okay. And then place it. Okay. That's just making sure the email gets out. Now, one thing to be cautious of is when you are sending through Gmail, they don't let you send too many at once. How many people are in your roll-up that you're going to be? I have like 199, but I can do it in sections of 10 if I need to. Yeah, I would definitely keep it as low as possible just because Gmail and Office 365, They don't want to be like email blasting servers, and you don't want to jeopardize your account. Okay. Okay. So for the content, what you're going to do is go up to system. Okay. And go to form letters. It'll be in the upper left. Okay. And then you're going to go to name letters. Perfect. So these are basically all your email templates, if that makes sense. Okay. Okay. so um so emails so you have to do an email template because even like let's say you're sending to 10 people you're really sending to 10 you're really sending 10 separate emails and that way we give you the ability to say hello robin by inserting field data and so that's where they yeah like with the with the little quotation not quotations but the little uh double bracket yeah yeah yeah so when you go to add letter which is the plus symbol once you're above that list of letters? Yeah. Okay. You're going to give the letter a name. Okay. Name. First contact. Okay. Okay. Where it says username, clear that out just in case you want somebody else to be able to access this letter in the future. Okay. Might as well just let, okay. Now in the body area, I don't know, do you want it to say hi or hello first before their name? Yeah. I have High bracket, first name, and then bracket again. Okay. So put high space. And then there's an insert fields option in the editing toolbar. You'll click that, and that's where you're going to get the fields that you can merge in. So if you have, like, name in brackets, what you actually have to select from us is name. Where that sounds like a name. name dot first underscore name so it's got that table portion so you got to use insert fields to make sure you're picking the right field so first four okay username user underscore name nope uh it's gonna be no it's gonna be name dot first name so if you when you get that window it'll pop up but once you start knowing your field name as well like type in the word first and then it'll show you matches. Okay. Got it. Sometimes easier than scrolling through that big list. Yes. So then hit insert. Okay. So basically what it's saying, from the name table, pull this field with this name. Perfect. And it has two brackets. Is that okay? Yes, that's exactly what it needs. That's basically saying it's like a placeholder for something that you're merging in there. Then you're going to put your content. Perfect. I got that. And then when it says my name, like your name as in me, I can just pipe that in because that's not going to change, right? No. So what you want to do is take that out. Is it more like your signature? Yeah. Okay. Here's what to do instead. Take that out of whatever you grabbed this from. I don't know, do you get to use like chat GPT or something like that? Mm-hmm. Okay. Yeah, so they don't even know that you're using PCR. So you've got to use our fields. Instead of doing something like that, go to insert fields and use that little, replace what you see with the word, just start typing signature, like S-I-G. And you'll find the option that says system, current user email signature. Perfect. It's always best to use this. That way you set up your signature in PCR for your username. Whenever you're sending this letter, it uses whatever you have in there, and you don't have to type it out in every letter. And then let's say somebody else is using this letter. When they're sending it, it uses their signature. So double benefit there. Okay, cool. And then below the signature, you might want to go to Insert Fields, type in the word Opt, and you're going to see Email Opt-Out Link. And that way you give people the ability to opt out. Okay. And is that Google, they like seeing that too as well? Like the system, the servers like seeing that opt out link on there? Yeah, I know like if you were to ever like sign up with SendGrid and set that up as a second alias, like for a higher volume bulk emails, they actually require it. you're really supposed to according to anti-spam laws whenever you're doing any kind of ball okay so why don't you save what you have done so far and i'll take a peek at it okay let me know when you once you've done it first contact new business okay now is there something different that maybe you would want to have there's two ones in there um you might want to fix the name of it Is this what the customer would see? Like the subject line? Well, by default, it's going to go to that. So if you change it to what you want the subject line to be, if you ever wanted to do this, like, just right from somebody's email, like individually, not as a bulk email, at least you wouldn't have to worry about changing the subject line. Yeah, I'll just put it to the subject line. So helping you hire top accounting talent viewpoint vendors. And press save. Cool. All right. I got that. Okay. So it's kind of like mail merge, if you're familiar with that term. Yeah. Okay. Okay. Now, what we're going to do now, you've got your content, you've got your rollup, right? We're going to go over to your roll-up. Okay. And when you click roll-ups, is it this partner in the list? Yes. Okay. Click on 199. It says results 199 to the far left. Hang on. Okay, yep, I'm on there where the list pulls up. Yeah. So right now you've got people like 50 per page, I'm going to guess. Mm-hmm. that's borderline number i don't it's hard to say when it'll stop like you know what i mean um i think 25 would be good maybe as long as they're not set at the same second though right like it can be a second like 10 seconds apart well we have them set for three seconds but even still once you hit so many Gmail and officers this is like trying to protect their own servers here's what I would recommend doing see at the top of your roll up list where you have like your link to position your form letter the little magnifying glass icon there's that three lined icon click on that and go to configure and which one was it again the gear icon configure icon. Yeah, you have to go to the three within the toolbar. So when you look where it says roll-up list, partner list, names, there's icons to the right of that. Go to the three-lined icon since it's not pinned and click configure. Let me know when you're there. Yep, I'm here. Okay. See where it says rows per page? Rows per page. Should be over at the right. Okay. 50. You can temporarily lower that to maybe like 20 or 25. I'll put 20. And then press save? Yeah. Okay. All right. I don't know if we should just do it as a one-time sequence. Do you want anything to happen after this goes out? Okay, I'm going to add Walker to the call real quick. Okay. All right. Hey, I'm back. Sorry. Yes. All right. Cool. Sorry. He's not going to be able to jump on, but I'm here. All right. So just press close. Yeah. So here's what I'm wondering, though. If we should just do it as a sequence has a rate limit or we could say send like 25 per hour. And that way you won't have to keep going in like selecting, send it, wait a little bit, send it again. Yeah. Okay. All right. Let's do this then. Now, do you want anything else to happen or just send it? Is that really all you care about? Yeah, I just want to send the emails. Okay. because one of the things with sequencing is like well if you if they reply or things like that then um you can have other actions happen okay so let's just do it as a sequence instead so go to sequence up at the top okay and go to templates oh it looks like you started one yeah i started one today oh you started a sequence okay so oh Okay, so let's work with this template. All right, we're halfway there. Okay, so click on that template name and select edit branches. Like if this is just going to be a one-time email, you could have just done it with called a mail campaign. But that doesn't have the rate limiter, which is unfortunate. But we do it as a sequence. At least we're going to use that feature for this. Okay, so you got your new business screen oath, right? Yes. Okay. You're going to click Add Step. Okay. Email. I'm going to get out of there. You're going to select Email and then go to Automatic Email. Okay. Okay. Let me. And then just pick the letter form. Yeah. I want to make sure. Like me being in there isn't going to wipe out anything I did. So I'm going to go do this into. Okay. So system. Oh, shoot. I went in the wrong database of mine. Hold on one second. I'm so sorry about that. Thank you. You're in sequencing. Oh, I think I'm getting so darn slow. You can still hear me, right? Okay. Yes, ma'am. That goes, okay. I was worried my internet was kind of getting a little flaky there. Okay. Okay. So what you can do, and as I go to email, automatic email. Okay. And then where it says form letter type, you're going to leave it as name letters. Mm-hmm. then where it says form letter that's a drop-down that's gonna where you're gonna pick the letter that you created got it okay and then you type in whatever subject line you want this this area if you can have a letter one named and send it as something else as a subject line but if you ever want to use it again just like oh I'm on a name but I just have the name of the letter be the subject line category is very important related to opting out so let's say you selected business development if somebody opted out like click that unsubscribe link and after that they'd by default only be opted out of business development whatever category you choose you could use business development you could use marketing I think that's a choice kind of like marketing as well that way someone doesn't see the underscore okay from you got to pick your Gmail alias perfect okay send to you're gonna pick email address email to the first one yeah now see where it says use rate limiting over at the right mm-hmm check that box. Okay. And then hit create. Perfect. All right. Now, once you put that step in, what we need to do is just have conditions. If all you really care about is just send it, what you could do is say when email is sent, or I'm sorry, click the little plus sign underneath to add a condition. Choose email sent, sequence is complete. Email sent, and then the action is... The sequence is complete? Yeah. Okay. So once it sends it, it's done. Perfect. Okay. hit save up at the top right to check for problems so it should be a one-step sequence so we should not have any problem yep sequence ready to start okay now what check one thing did you put when you started the template edit template name oh oh we got to fix that okay click to hit the go back option okay you saved it right yeah you saved it okay yeah that should give you your template list click where it says get new business contact and you got a six that late you got one going per month it's a little too slow So edit. Okay, so I might get new business first contact. Now what do I do? So when you click on that, select edit template name. Okay. And that's going to be those initial settings. Per hour? No, I don't even do one per hour. I'd probably maybe do 10 per hour. Or you could probably do like 15. And what should I do necessarily? So instead of you going into your roll-up, picking a few, sending it as a mail campaign, then having to wait a little bit, what this will do is it'll send a few, wait a little bit, send some more. So it'll space them out for you. So I don't have to keep checking them out. Yeah. So we're just going to activate it on that roll-up list, but what it'll do is it'll send just a small group and then wait an hour and then send another group. but I can select everybody at once and then it will just do it at its own time yes it's just going to automatically paste it which is why I said maybe doing it this way is better because then because if you just went into your roll-up and like picked and sent the form letter even if you did it as in a campaign you wouldn't want to pick all night 199 because they'll try to send almost 200 just three seconds apart and that's where you could be risking your Gmail account at least by slowing this down a little bit with sequencing Even though we're only doing one step. I think it's going to be safer to protect your Gmail account Perfect okay, so let me know once you have that saved And I would probably do you know something per hour All right sequence saved Okay, let me just click on it just double check here Okay, got it, 10 per hour. Okay, so it'll take about 20 hours to send it. Perfect. All right, so what you're going to do is click on that template name again and select activate sequence. Activate sequence. All right. At the bottom, it says activate sequence. And it should open up that screen where we're setting up the steps again? Okay. Yes. You could use this template on different lists if you ever wanted to. Okay. I would probably not name it the same as the template, but maybe, you know, some kind of unique name that way in case you ever use it again, you distinguish one name from another. Okay. So sequence name, change it, like change the name of the sequence? Yeah. As long as you are, unless you're okay with that being the name of the sequence that matches the template. It's okay. if you do. Yeah, I'll be okay with it. Okay. Begin sequence. Pick the date when you want this to start. Do you want this to start today? Yeah. Okay. Go ahead and pick today's date. You can leave end sequence empty. And then what days do you want to send this on? Like Monday through Sunday or do you want to exclude Saturday and Sunday? Let's do today. You're going to want it to so basically what this means is your sequence starts let's say there's because you got to think of a sequence could have more than one step where like if you're sending emails they only send one day so you got to pick what days it would actually be recognized so if you want all days just go in there and pick all days like monday tuesday like if you didn't want it going out over the weekend like you wanted to wait till monday if it's not done otherwise just do okay i'll just pick it all except for Sunday. Okay. So you, yes, you could pick which days it actually is working and recognized. Now, the other thing you want to do is start sending at and stop sending at. So you could do like eight to eight where you're not emailing somebody at three in the morning. You know, so whatever time frame you don't mind people getting this email. And that's actually, it has more to do than just emailing. Even if you're just doing a sequence like for calls, like nothing happens with this sequence. It's basically kind of almost off. Like nothing's happening with this sequence outside of these days or these time frames. So I'll just do 8 in the morning to 8 at night. Okay. Make sure you pick your time zone. Primary users should be you. Perfect. Okay. Okay, and then where it says roll-up list, ask where you're going to click in there and then pick that roll-up list that you created of those 199 people. That's basically saying who we're running this sequence on. Mm-hmm. And then just double-check your rate limiter selections down at the bottom. It should be all set for you. Temporarily. Okay. So you could have like where my template is 10, but maybe I changed my mind. I want this particular sequence to run at 15. You can always adjust it as you activate it. Okay. So as long as you've got your name, your send on days, I'm sorry, your begin date, your send on days, start and end times, time zone, username, roll up list, rate limiters on, hit activate sequence. And now it's just going to go do this, huh? Yep. and you can go grab a coffee, whatever you want to do. We have dinner tonight. It's still working up until 8 o'clock. And then what we'll do tomorrow is... And then tomorrow we'll start at 8 in the morning. Yeah, if you pick Saturday, tomorrow at 8 a.m. it'll pick up again and keep running until 8 o'clock tomorrow. Now, the only thing I don't know if I had set up and maybe we should have done this before is my email or like my name, like my signature. unless we did that. Well, we might have done it. I don't remember. Let me look. Okay, go to, let's see. Is this yours? Yeah, it's just an email setup. You just have your name. Oh, okay. Very quickly. Click system. Okay. email setup email signature you know signature put your content I wonder if I wonder if it's too soon let's stop that sequence we started before I change this I don't know if it's going to recognize if we make these changes over kind of just like well it is an email so they can i mean i know this is our first time doing this but it's uh let's put it in i just i'm not sure on that one to be honest like that and then if i wanted to go check up on the sequencing i just click on sequence or like the the what i just is it would that be activities or would that be you know i think where it's actually going to be better for you for this case because it's essentially going out as an email. If you go to analytics and then you'll see email campaigns. Perfect. Now your analytics pulls data every 15 minutes and it just did a data pull. But basically what you'll end up seeing you just want to maybe wait an hour you know let somebody reply let somebody open it that's when it really starts tracking release once one person opens and it has a data pull but basically what you'll be able to do is you'll be able to go under analytics email campaigns and then click details so there was one that i did as an example okay and then here you would be able to see how many people opened how many people replied how many bounced or unsubscribed. And if you scroll down more, if you wanted to see who opened, you'll see opens with a number down at the bottom right. And that'll actually open so you could see the opens and clicks and all that kind of stuff. Okay. All right, so mine should show up soon once there's actually data in it because this is the June training example. I can just click from different campaigns. Yes. Right now, this is the only one you have. So after the next data pull, as long as one person has opened it, you will start seeing right above where it says June training example, you'll see the one that you just saw. Perfect. This is all I need. And then Walker and I will go, I'll show Walker how to do what we did. And then I'll be like, okay, I need to set up another training with Robin. Thank you so much for your help. You are welcome. Have a good weekend. You too. All right, thanks. Bye. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 674.668949,
    "salad_processing_time": 75.50172877311707,
    "overall_processing_time": 674.668949,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence.  This is Robin.  Hey, Robin.",
    "job_id": "937e2c61-ef11-4a23-b252-a92346c1b9ea",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence.  This is Robin.  Hey, Robin.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3020868019036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}