{
  "recording_id": "3022247919037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:35:39.760662Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:35:39",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Enter your participant ID followed by pound. Otherwise, just press pound. you are in the meeting now there are two participants in the meeting this meeting is being recorded good morning this is jim jim hey wayne miller good morning good morning how are you i am well doing well i have my associate vanessa coming in she she used it on pc more more than I do now, so I figured I'd let her come in and take a look. She's on there. So I'll leave it up to you to show us the way. Excellent, excellent. So we're looking at the PCRM piece today. Is that right? Yes. Excellent, excellent. So a little background around the PCRM. I'm going to share my screen here. You should have a sign-in screen showing up momentarily. But this was originally conceived as kind of a replacement invoice for an invoice a replacement interface for PCR 9 when it was conceived several years back so it was going to replace PCR 9 so they started development in that capacity but then as they moved on and started developing it they added some additional CRM functionality naming leave deals pipeline a simpler sequencing piece and that combined with the new interface at the beginning of this year it was decided that it was going to be launched as a separate side-by-side product for PCRecruiter but it shares the same database as PCRecruiter so what that does is that gives you the unique ability to utilize either PCRM or PCR9 so you're going to have the ability to use either or both because it's not a conversion per se so if you added PCRM it doesn't change or affect or turn off your your existing PCRecruiter but you'd have full access to this new interface so it's going to have just about everything that the PCR 9 has the one thing it was lacking for a while was searching but that has been improved and is continuing to be improved so that's going to be a little bit of a help now so I want to show you around kind of what the new interface looks like as we go through so do you see my sign in you see the screen okay I do I do so just to confirm so you could any given time you could log into PCR 9 or log into PCRM simultaneously and the data would be updated both on both sides basically real real time both ways yes okay all right yeah so a lot of people like that being able to use both so I'm going to go and get myself logged into my database here and kind of the biggest thing you'll notice when you get into PCRM is going to be everything is kind of not top to bottom anymore like the current PC recruiter it's more left to right so you're going to have a dashboard screen of different widgets you can configure so you can kind of pick and choose all these different widgets at the top and just drag one right down you're able to drag and drop them wherever you want them to be so a little easier to configure and the biggest thing down the left-hand side of the screen is going to be all of your typical buttons most of them are the same as the PC recruiter now name company position roll-ups so those are going to be the same terminology but they're down the left-hand side of the screen but they're going to look entirely different so if I went into for example names the name screen is going to take up the entire screen now it's going to show you your recently viewed records and we've read totally redesigned this this initial screen to give you the ability now you can edit in line if you ever needed to edit any of that data in line you can control what fields are going to show here sort by them if you wish you can even pin fields so if you have more than one field as you scroll over you can pick several of fields to pin and they won't scroll so it's a little bit more configurable user-friendly than the existing version of PCRecruiter and then you're also going to have this unique actions area over here where you can say I want to send them an email or a call or a text I want to add them to a roll-up or add an activity right from there so you can do a little bit more from this front screen to your recently active records you're also going to have a search at the top So if I wanted to look up someone I can type in first name, last name, it'll add these little tags here, these little chips. And then you're going to be able to search in that capacity. So you can add as many of these as you wish. You can X them out individually. And then you're also going to have your Boolean searching here if you wanted to go. Actually, it's an all content search. So you can search that and I can look up sales. And then I can search in that capacity. So that's going to give you the ability to keyword search the database. That has been, like I said, that has been improved. I want to take that chip out of there. So that has been improved. I don't think my version is yet displaying it, but it is going to show where the word is found. It's going to highlight the words that it found, show you how many different places it found them and what have you. Okay. So that could be from the title. That could be on their resume. It could be from an attachment anywhere, that word is shown. Okay. And what we've also done is held it the same. So if you went and clicked over to companies, it's going to look pretty much the same. It's going to work the same. So you still have all your same actions. You still have all your same edited lines, your same search rules. All of that information is going to kind of look and work the same for all three types of records. And then as you click on any one record, it's going to slide in from the right. And then you have the ability to configure this record. So what we've done is we've added a workspace tab here, which is going to give you the ability to design a custom workspace with whatever fields you wish. So this is kind of your basic landing page. You can put pretty much basic information that you want to see initially. And then all of these other tiles, I can fit them in the dropdown here. These are the normal buttons that had been on the main name screen of PC Recruiter. Only they're easier to move around. So if I want to move keywords up there, I could do that in a real time slide right over. So I'm going to be able to interact with that. Another thing I like about the PCRM is if I go into details, I'm going to have an instant search. So this is every single field I have on that person. I can look up phone. It'll instantly limit me right to the phone fields. Or if I wanted a value of a field, see if he speaks Spanish. He does not. But I could go through and see he's got various language fields, but nothing in those. So I can go ahead, look at all of his email addresses. It's going to fill it out. It's as good as I do, Jim. I know. I'm a terrible typer when I'm not thinking about it. Yeah, it lets you kind of quickly hop into there. And what I like about this, I use PC Recruiter too. And if there are certain fields that we track as a company that aren't on my main screen, it's easier for me to just go in, type in the field I'm looking up, and I can find it right there. You don't have to go through or comb through dropdowns or anything like that. It's a little easier to use. a lot of these screens have been redesigned say it again you say companies there can you say it one more time the companies that you don't work with a lot oh yeah you can say some details so if I had a specific field I needed to update in a company record I could go into that company record maybe it's not in my default workspace if I go into default I could just look up any field what is it called and I can say oh I need to do my ID field oh yeah the identification federal tax ID right there So I can get to a field just by knowing the title of it. I can filter it very easily. Okay. All right. It's easier to get to something like that. Another couple of things, we've changed kind of the look and the feel, so like the resume screen, if I go in here. So if I look at resume, it now gives you the ability to add multiple tabs. So you can name different resumes. You can kind of line them up. I've got a regular and a blinded up there now, but you can add more resumes as you go right on the resume screen. Some of the screens are going to look pretty familiar, like the activities is going to look pretty familiar. You've got some tips to filter them right there if you wish. The notes, it was designed to look the same in both because when it was released we were already developing this, so it looks just the same. Your keywords are a little bit the same, but you can actually tag certain keywords up in your main menu up here. so I can actually go through it. And I forget how you do it. I think you right-click. Oh, you can untag. And then if I want, I can tag. And you'll see it shows up at the top there. So I can tag it kind of up at the top. I can tag a few popular keywords or a few strong keywords for this candidate right up there. So it gives you some different... Can you do multiple at one time? I don't think you can, though, because you have to right-click on each one. Yeah. Okay. I was thinking about we have 8,000 HVAC engineers. It would be nice to have a global at one time go ahead and tag all those HVACs so that we can then use that instead of having to go to a roll-up list in the future to find them. But that's okay. Go ahead. I think you can add the tag as a global change. You just can't mass put it as one of their three primary tags at the top. So you can't mass put it at the top, but you can mass add it to records through global change. you can do that there. So a lot of it, so it helps that you're familiar with PC Recruiter 9 because you know the terminology, you know what a roll-up is. But when you go into roll-ups, it's going to look a little bit different. You can go and see kind of the description, which ones they're on, all that information there. Or if I go to my roll-ups over here, it's going to show all the lists I have. And then I can click into any one of them just by clicking the icon. And that's going to open up my list there. I can click into any specific record. and here we've added our simple sequencing so if you use the sequencing now you know that you kind of it takes a little setup it's a heavy setup to add a sequence in PCRecruiter but here I could just create a sequence on the fly you just pick it's going to maybe be an email automatic I want to go to my main email address I pick my specific form letter add another step it's going to maybe be a call I can say I wanted to go to the mobile number and then I could that another step as I save all I can actually save and launch this sequence right there in less than a minute so very helpful if you're doing marketing using the drip campaigns or the sequences you can set that up and run it right off of the roll-up list and what's nice about that is I have a simple sequence running here you can create a column called sequence and it's going to show what stage they're at in said sequence so it replaces the roll-up list stages with an actual interactive drip campaign sequence in there and then you can also of course pick and choose what fields are going to show on the roll-up list you can sort by them you have your different actions you can take right from the roll-up list same as it looks from the the main search screen so again same sameness it makes it easier to pick up easier to utilize because you know if you see actions it's going to be the same set of things from anywhere okay and one of the reasons i quit using the sequencing tool in pcr originally was that the that it's very hard to kind of accommodate for every single scenario that would happen. Like, you know, if somebody were to actually answer an email three weeks later, you know, it's hard to come back and figure out where they were in the sequence or adjust that. So that's kind of one reason why I've kind of moved away from it. But I mean to see if that has improved here with the simple setup process. Yeah, that's why we did it, because a lot of those simple sequencing, It was almost too much for people, too many options, too much setup, too many different things that could happen, and it got to the point where it was just they really needed less options almost. So we made it simpler to use, simpler to set up, and simpler to kick off. So that's going to be a big improvement there. And then another thing that's unique to this version is going to be the deals pipeline. so you're going to have now the ability to create a custom pipeline very similar to the one you use for interview tracking but it's going to be for deals only so you can put different steps are they qualified are they contacted do they need assessment to just send a contract we're also working on an upcoming release the ability to send a DocuSignable contract out of PC recruiter and interface that from the system here so they can DocuSign it'll be uploaded directly into PC recruiter so working on some different things in In there, this is going to give you the ability to put in your different deals. You can even, in the deal card, create different, maybe you want to have a call and an email. And you can put that there and you can check it off when you're done. You can make it a different temperature if it's going to be warm, cold, cool. So you can kind of put in potential value, projected close date, your confidence level, stuff like that. That's going to help with the upcoming reporting on, like, forecasting. So you have some of that in here too, so you can actually track your sales efforts within this deals pipeline, like a sales funnel that people have been asking for for a long time, so that got added into here. It's a whole unique feature to PCRM. So that's going to be something new. And then some of the other things like the sequencing looks exactly the same. It looks and works just the same. So does the analytics reporting. Looks exactly the same, works exactly the same. Because when it was designed, we were already developing PCRM, so we designed it the same in both versions. So some of the things are going to look very much the same. Another thing that's quite a bit different is going to be the capacity to add records. So if I go up here where I would normally have my quick add, I just have that little add records button where the lightning bolt now is in PC Recruiter. And this is going to give you the ability to drop a large number of files there. So you can drop a folder of files or if I go to names, let's say I can add a name and I can go, I can add Jeff Smith and then I can say, oh wait, I want to add his company. but I don't have to, like now in PC Recruiter, you have to go out, add the company. Now I can just say I want to add a new company. It's going to add another option on my list. I'm going to say ABC Company. And then as I go through here, I can toggle back over to Jeff. I can link him to a draft record, pick ABC Company that I've created. Now it's going to show that they're linked together. Then maybe I want to upload an attachment. I could upload an additional attachment there. and from there then I could link that attachment to the record I'm creating to or even opt to parse it out as a separate resume so I can parse multiple resumes at once link multiple names to companies I'm creating on the fly right here so the ad screen has really given you a lot more flexibility you can do duplicate checks in in as you're adding it there so it'll kind of check some dupes there then you can add the records from there so it gives you a little more flexibility as you go through here. You'll see mine show they have duplicates. So I've already got those. So giving you a little bit of a new interface and a lot of additional functionality in adding records into the database there. And some of the things like the reporting, the reporting looks and works just the same. What is that? Oh, no, that's activity reporting. That's a little bit easier to use now, but the regular old reporting the schedule like the schedule looks just the same A little bit of a newer interface, but it looks works. It's basically just the same the reporting is going to be just the same It's not completely overhauled yet, though. It may be down the line All right, okay So that is kind of in a nutshell what the new interface is going to look like within PC recruiter It gives you a better use of the screen, more flat, more left to right versus up to down, a little more configuration, a little easier to pick up. So a lot of the people that are using this, one of the big things we're hearing is that it's just easier to learn. It's easier to learn from a new user standpoint. It just makes more sense to people. And the PCR, the LinkedIn importer works with this, or does it all go back into PCR9? It's the same database. So, yes, the capture will work. Right, right. You can access it from here. Yeah. The nice thing about the big share databases is anything that integrates or queries your database direct, it's still going to work because it's the same database. Okay. Okay. One of the frustrating things about the import, I'll just tell you this because I haven't mentioned it before, is that when it comes in, if I don't catch it and it pulls in the company name from the profile versus me going in and actually picking a company from the database, and that helps us get to a point where we have several companies in the same location in the database. And so if we don't catch it right away when we do the import, it is a little frustrating. It creates a bunch of different companies. and then we have duplicates and all that kind of stuff. But that's just a little quirk that we have to remember to go in and select and click, click, click, click, make sure we use the company that's in the database when we import. So it's just a little bit – it's not quite as seamless as it could be, I guess. Yeah, we've never found a good way to fix that, and we even have a problem internally ourselves. So we oftentimes, if somebody inquires and their company name is slightly different than it would be on LinkedIn, if we happen to bring them on on LinkedIn, in, even if it's just the matter of it's CO dot at the end of it, but CO no dot when they inquired. It'll come through as a duplicate company. So that happens to us sometimes. And you can improve it, but you'll never totally fix that just because there's so many wildly different variations that people could write a lot of company names. So you do have that, unfortunately. They're figuring out anything they can, but we just haven't been able to figure out a perfect way to be able to do that. But it does still work. So how would you – we spoke about this the other day. I put some thought into it this weekend. I kind of came up with an idea, but how would you recommend – since you can't import into this, I get that. So back in PCR 9, how would I deal with importing this list of contacts in that would potentially have several thousand there in duplicates? And if the email address is a little different, particularly if I had a business email and PCR, and now I have found a personal email, and so it's going to come in and say, oh, that email doesn't match. How would you recommend our best way to avoid the duplicates doing that? Best way to do it, let me show you a couple of tricks in here. I'm going to go through, I'm just going through an import list in my database. And the import is only a nine right now. They're working on it in a release in the upcoming couple of months for PCR. So that is forthcoming. But I'm going to just pick a random roll-up out of my generic file. I'm going to select a file here. I think I have one on my desktop somewhere. So I'm just going to pick in a data file. Now as I go next, I have, obviously this is your mapping area. You're going to have all of your fields here. And I'm just going to pick three or four just so I can go last name and then first name is going to be first name. so I can go through here. So you're mapping everything in here. Now, one of the easiest ways is going to be to have their LinkedIn address in that data. So that's going to be because nobody shares the same LinkedIn address. So even if they have a different email address or anything like that, the LinkedIn address is going to be an excellent way or mobile number. Mobile number would be a good one too. So if I went in here and I pick my, maybe I'm just going pull LinkedIn right there so I'm going to be able to map everything once it's done now normally you'd have more than three fields but just because we're going through a demo here I'm just going to go through to the next easiest way to pick your dupe is duplicate checking say update if duplicate is found you can skip if duplicate is found but then if it finds a dupe it's not going to get it in but that doesn't also affect if you have two different email addresses so I would say update if duplicate is found and then instead of all of these standard ones pick your LinkedIn and check that that is going to let you pick one specific field from your import that it's going to look for and it's going to check that field in PC recruiter so that's where you're not saying it has to be last name and email address because if it's a different email address as you've learned from experience it's going to bring it in so you might do maybe that or maybe cell phone because cell phones aren't going to be a duplicate. So you want to use something that is surefire not going to be a dupe but not going to be different. So LinkedIn is probably the best one. Cell phone is probably the second best because many people don't switch their cell phone number as often as their email address. So I would say try and make sure that when you're importing that data, you have either cell phone or their LinkedIn address. Or even if you had a unique ID, I don't know, depending on some of them come from like if someone pulls in from Leopard List or whatever. LeopardList sometimes will create a unique ID for each person, and then you can say, I want to import that ID into a custom field, and that's going to be my duplicate definer. So then it would go off of that specific field of ID. But if you don't have something like that, LinkedIn or cell phone record is going to be the best way. And then when you do that import, it's going to pull it in, and it's going to say, oh, this person has the same LinkedIn, but it's a different email, so it's going to add the secondary email into their record. and I think it'll add it into a custom field is what it does I think I think it's called supplemental email but I just want to make sure so it's not going to actually replace the email is there it's going to add it as a supplemental email I believe so I'll try and find out where it goes by default maybe I'll test it just to kind of see okay but yeah I'll check on okay for sure but yeah that's definitely way to do it so you want to pick a duplicate field you don't want to go by one of these because what you're doing is specifically trying to find a different email so probably the most common one people use less than email address isn't going to work so you want to use something outside of that all right so what what i was the way i could i figured out what to do would be to go to my spreadsheet which is going to be a lot of work this makes this will save me some work which is to go and make sure everyone that was in like a train train in tennessee i changed that column to train dash tennessee and changed it to train Tennessee and PCR. That way it would at least match up with the right company name and not be like train technologies, train company, train co, just train and create all those different options out there. All right. Okay. Do you guys play nice with call mantra or call mantra, whatever it's called? Not that I know of. I haven't heard of it. Okay, because they advertise that they integrate with you guys on their website. They're a call program like RingCentral, except they have some things like a power dialer and other aspects on their platform. But they do recognize that they integrate with PC Recruiter. And so when I called them and did a demo, Vanessa and I did a demo last week, I got an email back. They had to talk with PC Recruiter development team, whatever, for integration. I'm like, wait a minute, you advertised it. Why have you got to go to the integration team or development team? But I was curious if you had any customers using that platform at all. I've not run into anyone, no. And this does happen quite often. Somebody like Comantra will write their own integration through our API for one mutual customer that we don't even know about. And then they say, oh, they'll just add that to their list of integrations, and we don't even know about it. So sometimes that happens. And I've not run into anyone using them, but that's not to say they couldn't have written something. So that does happen sometimes, but I don't know of anyone. I've not heard of them. Okay. All right, so let's go back to PCRN for one second. You're on the scheduling part. I was curious if your – just like PCRN ties in with your Google Calendar real easy, I would assume. Kind of links in with your Google Calendar. Okay. And let's see. I don't know of anything else. So I've gotten familiar with the new pipeline. I've got a handle on that, doing the automated emails and all that. That seems pretty straightforward. I guess the pipeline didn't change very much. So, Vanessa, do you have any questions for Jim as he's going through this? No, Wayne. It looks straightforward. No question. It does look pretty straightforward. Okay. Okay. And Jim, you said this has only been out for a couple months now? Yeah, it was probably fully formally released in maybe March, April timeframe is when it got fully released. And we've been – many new customers were kind of including it for both, including both packages, and they could use either or. So some people are starting to use it that way, and people are starting to move over to it from our existing client base as well. Okay. Okay. I hadn't heard anything about it. I heard about it by accident last week. I hadn't heard anything about it. I don't think I got any other questions. Everything looks pretty straightforward. Tell me this. Is this the app? I know we had the little PC Recruiter app. Is there going to be anything done differently with this as far as the email that I use? I still use the old email platform from way back when that It has the five different categories when you log in, but are there extensions? Is there anything else that's coming down the pipe with emails better for your phone? Not that I've heard of. The mobile app hasn't been updated in quite some time, so that – maybe, but I haven't heard of it. That's not on the instant – or on the immediate list for things they're working on. Okay. Okay, because the email that I use is from a – it's a www.pcrecruiternet. It's an old address, and it comes up with, like, you know, it comes out with menu and names and company. You can do a very, very basic search from probably 20 years ago. But it's still functional, but, you know, some attachments won't open up there. But I just was curious if there's anything coming down the pipe on the email interface for you guys. Not that I've heard of. Could be down the line, but not the immediate future. Okay. All right, Jim. That's all I got, I think. I don't have any other questions. I appreciate you taking time, and Vanessa and I will discuss it a little bit, and I'll shoot you an email a little bit later what direction we want to go. Like I told you, we've been evaluating top echelon and LOXO and haven't really seen what I was looking for, as they say. So we'll discuss it. I'll get back to you later today. Perfect. And then if we get to go ahead, what's the time frame? What's the time frame to get going? How fast is that? Pretty quick. So what would happen, we would send a new agreement. So it's an additional $350 set up. That includes adding the new piece and four hours training. It would generate this PCRM link. And then it adds, it's $10 more per user per month over what you're paying now. You're already on the Premium Plus version, so you already have everything you need in nine. so it would just be 350 one-time setup and then an additional 10 bucks per user per month so we would send new paperwork once that's signing to pay the setup fee within a day or so you'd have the new link created to your existing database the email it to you and then we get training started shortly after all right sounds good all right Jim appreciate it very well quality soon I will talk thank you all right bye bye bye bye",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 704.767187,
    "salad_processing_time": 362.9831631183624,
    "overall_processing_time": 704.767187,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "job_id": "faf40ecb-7166-4784-a059-4d36d23943c2",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 5
      }
    ],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "general",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": false,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3022247919037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}