{
  "recording_id": "3023405161037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:36:47.174072Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:36:47",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is McKenzie. How can I help you? Hey, I'm trying to get the – hey, this is Gus Cawley with Staff Financial here in Atlanta. My resume inhaler is not working off my inbox. I was wondering if you could help me with that. Okay. Inhaler working off of the portal inbox? You're using the Microsoft OLIC portal? Yeah. okay this could be an issue with either the inhaler credentials or perhaps the outlook portal credentials do you use the outlook portal for anything other than inhaling not really okay uh well that tells me that you're probably not using the portal so maybe it's the maybe it's like an issue with the portal maybe we just need to like re-look at your portal connection because like the inhaler once you're once the inhaler is set up and doing a thing, it's kind of like you have to go in and change it in order for it to change what it's doing, right? Well, I get it to inhale files from a folder, and I just got a new laptop, and after I got my new laptop, I never could figure out how to set up the inhaler on the Outlook. Okay. All right, well, let's take a look. I guess we could do a screen share. I could help you get set up? That would be awesome. Thank you. Would you like to go to meet.google.com for me and I'll give you a 10 letter code to join my meeting? Sure. Go ahead. I'm pretty bad at the phonetic alphabet. So hopefully we can do this without it. But So the 10-letter code, when you go to meet.google.com, in the middle of the screen, it says enter code. It's going to be S-R-K-A-O-N-C-G-U. And when you join, make sure to mute yourself and turn your camera off. We don't need that. We just need the screen share capability. Okay. I will admit you to the meeting and then from there if you could please go to the share screen button at the bottom of the screen there we go and it is share your entire screen so I could see everything not just a window all right great okay okay all right what first thing I noticed is that you're using Outlook inside of the web but but I've got another one here okay good okay good great okay gotcha yeah okay that's what we're looking for all right is this oh is this a newer version I see I think I'm kind of I'm not as savvy on the phones as many of the other support members but I think that this version of Outlook is not currently compatible with our current version of portal. You need to use like a legacy Outlook. Let me see if I can find information. Yeah. Just tell me where to go and I'll go get the legacy. Okay. Let me see if I can find that. We provide a legacy download for that. Downloads. I might have to ask a colleague of mine to... Here it is. The PC Recruiter for Outlook plugin supports classic desktop versions of Outlook from 2010 to 2021 in Office 365. Maybe it lied to me. Man, you found that quickly. Where did you find that, if you don't mind me asking? Google. Oh, that was just, you just, Google AI has us figured out already? I said legacy Outlook that works with main sequence PC recruiter software. Oh, does it give you a download link? That's amazing. Resume inhaler. So let me just do that. I'm going to do that. And then PC recruiter for Microsoft Outlook? No. Let me go back and ask it again. Do you mean legacy Outlook that works with main sequence PC? Yes, yes, I do. But these are PC recruiter downloads, not the... I need a download link for the old Outlook app. Thank you. Thank you. I'm trying all the avenues I have at my disposal right now. It is from 5 to 6, so I am like the only one really on right now. So it's kind of tough. No worries. I appreciate your help. Microsoft. I'm searching in my Discord here. Yeah, I got all these emails coming in, and I've been having to manually import them one by one. It's no fun. Yeah, the portal will help definitely with that once we get it figured out. It should be this one. How do you find that? It's here on the Learning Center. Okay. Installing PCR for Outlook. It's on our Learning Center apparently. it's on the the PCR for Outlook Learning Center article on our page PCR for like FOR Outlook should be the title of it I think PCR for Outlook main sequence and then Right here. Right? Oh, sorry. I'm not looking at your screen anymore. Okay, I'm back. Okay, I can see you need to sign in as Gus at stafffinancial.com. The screen, I don't see. I don't see any download screen or download links currently on your screen. How do I log in here? You mean in Outlook? I see Outlook. I go to the Learning Center. Do I go to the Learning Center? I don't see a screen that is showing. uh the learning side oh hold on two seconds i'm over here yeah yeah okay that makes sense all right so yeah okay so yeah search for um what was it pcr for outlook and then on there that will give you a bunch of different they're all for pcr for any of those works those are all part of it uh so then scroll down to the like the third or fourth section under I think you went past it. It'll be right under that picture right there. Download the installer. Yeah, it's that one, I believe. Well, I have the installer. It's right here. Oh, that's the inhaler. That's the inhaler. Yeah, that's the installer for the Microsoft or wait, what? he's your portal okay just kidding that was not it sorry sorry give me a second let me look it back at what the I was told I think I know what you're talking about that was not what I needed you to click on we're looking for the downloads There it is. All right. Sorry. It's actually at the beginning of that page. Let me show you back up so I can see what you're doing. All right. Can you go back to the screen before where it says for Outlook? The classic desktop version of Outlook right here? Oh, maybe it is there too. I wasn't told to go there, but maybe that's that. Download PCR for Outlook? No, you did that already. Click the other one. Click that one right there. Yeah. See if that's it. I wonder if, okay, two different things lead to it then. That's where you want to go. Okay. Okay. Okay. Sorry, I'm so rough around here. You're fine. You're fine. It says it's installed. it's probably considering the newer version i don't i don't think you could have both versions so i think you might have to uninstall the newer one which is unfortunate let me ask let me clarify that with my uh can a user have both the new and old versions of outlook at the same time I guess I could Google that too. I'm going to treat it as a separate application. Okay, cool. so it says you can um so when it says it's installed for you oh that's okay okay if it is installed then maybe it is somewhere but you're you're opening your the newer one uh can you go into your windows and and search like programs and features and we'll look at the list of all the programs you have and we'll see if there's like two versions of outlook you can go to add or remove programs and then it's or that yeah there it is oh okay wait that was a that was like a Bing search or a Microsoft Edge search. Sorry. Can you go back to the Windows menu again? And try and search just add or remove programs. There it is. Perfect. Add or remove programs is good. And then in the top right corner of this window Oh, it's the newer version. Okay, wait. Alright, let's scroll down to where it says like M for Microsoft Outlook or Microsoft programs in general. Are there multiple versions of Outlook or anything like that? It's a little bit further down. Okay, Outlook 2016. That is, that is like an older version, but it says 7-19 on that date. Can you click on that more to see what it shows? Is there any way to show more or right click on it and see if there's anything that it can do? Uh-uh. Okay. Actually, you know what? I think we might have a link. That might be bad. Can you please go back to the Learning Center where you click the download link or like where you click that link to go to the Microsoft? off it does say classic there it does say classic there okay that is it so i don't know how to get a is there is that little arrow next to installed can you can you click that little arrow there's like a little icon is there like a download anyway ah darn okay i was wondering if we can just force it to be like download the client install even though it says it's installed it says it's installed and the Outlook when you open Outlook how do you open it? right here click on that it says Outlook parenthesis new oh I can download this oh now you can download it? what the heck? why did it say it was installed before? oh now it goes to installed okay um all right let's uh is outlook currently closed like the new version yes okay can you just search for outlook inside the like search bar at the bottom right there and see like what comes up i want to see if there's like two options or just one Classic. Oh, there you go. So Outlook Classic is what you're going to want to open. So it is there. It was there the whole time. Great. Yeah, you're going to have to set up your email. Work, correct? Well, I mean, is this a way? Are you working? I'd say probably. Yeah, at work. Yeah. I mean, this is all Microsoft questions for you. We're not at the PCR part yet. Okay. Hold on. I've got my authenticator code. Well, we'll see if this works, but... How do I create an authenticator for Classic? So here, I guess I create another one. It's asking you to authenticate, and your authenticator for that account doesn't work? That's interesting. The authenticator probably should be anywhere you wanted to log into the Microsoft email account. I think the authenticator should work. So I'll hit personal account. Sign in with Microsoft. Does it staff financial? Okay, next. Okay, so then I just hit this. Work, right? personal like other personal connect continue I got a test message I'm sorry I was texting my colleague that I was answering my questions back and I didn't really quite see how you got to that error there sorry you were running the you were trying to authenticate and get your authentic yeah what yeah Outlook classic no no no I don't I want a different email here add another address I don't want this one I would backstate that out yeah is this it okay that is this classic okay okay oh wow what is going on yeah a lot of stuff is happening here this is the classic version of outlook yeah or the version that works with pcr i should say have you never opened this version it seems like it's throwing so much stuff at you some of it's pcr related no not all no um okay so So, all right, so now in the top bar, it says PC Recruiter. That's good progress. We can actually see a version of Outlook that is using the PCR plugin. If you can click the green wrench, it says Options next to it. It's kind of over to the right in the bar. And we'll have to log in. Click the Connections button. And then you're going to want to click Add Connection. and you want to paste your URL to log into PTR there. Okay, hang on. Would you like it to synchronize the calendar? And would you like it to write activities for your emails? Alright, and then, for some reason it didn't save the password in that. Could you click the remember my password checkbox there and then also enter in the password again? Normally it saves there. I don't know why it did not there. And then save and close. We should log in. And that's cool if it does. Because that means we can then set up the inhaler and it should be good after that. I'm not seeing anything. Can you click on name at the top? I want to load a name record or something and make sure it comes up. This is the equivalent of clicking like name and PCR. I'm not seeing anything happen in the portal window. Interesting. All right. Could you please click options one more time? The green wrench. Go to connections for me one more time. It did not save that. I swear you hit save and close. Oh, wait. It loaded. Did it load any information in those fields? Sorry, I was taking a second to actually load no it didn't what why is that the case I guess I guess try again I don't know I don't not sure why I didn't it didn't say that add connection and then every paste your URL in there okay a good thing that you backspace that out you don't need all that Okay. Signing in. Yes. Okay, it did at that time. That looks better. Save and close. Okay, click name again. Please load. Why isn't it loading? I wonder if it's still going through adding like your Outlook stuff. Because it looked like it was loading emails. your inbox is still filling up as you can see it's like 26732712 it's like still pumping emails 2728 so it might be that these two things happening simultaneously like slowing it down or maybe something's getting caught up I don't know you might want to try this all again when Outlook's kind of caught up because everything you're doing for adding the connection looks correct but it's like not taking for some reason I don't know I'm not sure why it could be maybe because it's like the first time you've opened it. But from here, let's let this go. And can you pull up the Outlook? Sorry, sorry, sorry. The inhaler, the PCR inhaler. And then we can go over how to set that up as well. Or maybe even get that set up. And then the last thing would just be to log in to. So from here, yeah. Oh, OK. You already have it logged in. OK, great. So you could pick a folder there. Okay, so now the only thing that needs to happen – oh, is it working? Did you hit folder or from email? Hold on, hold on, hold on. I picked the wrong folder. We don't want it to – actions, exit. Yeah, I don't know if you clicked folder or email there. I think you might have clicked folder. Yeah, but I don't want it to go to my inbox. I wanted to go to LinkedIn. Where do I want it to go to? New candidates. Well, that's, I mean, that's up to you. Oh, yeah. That's where you're going to be putting all your emails that have resumes on them or things you want to import. So once this is set up and it's like set to monitor, I see that you have the monitoring on. So once this is all set up, which it looks like it is, it will just monitor Outlook for that folder every so often. But Outlook has to be open and portal has to be signed in. So once portal successfully finishes catching up loading, in theory, you should be able to log in to the Outlook portal and then start the inhaler. And it should be working as long as you've established a connection to the database inside portal, which we tried to do twice. But for some reason, it didn't take. But it looked like everything you were doing was right. So maybe you just have to try when it's like caught up because, yeah, it's almost doubled in the inbox. Your inbox almost doubled in size in the last couple of minutes. So it could be that. OK, so hold on. How do I get the rest? Like. So LinkedIn. Just for grins. At LinkedIn. I don't know what those are. Portal errors. You're running a search in your Outlook inbox, right? You're not trying to... Yeah, I was trying. Can you click the details when those come up? I'd like to see if I can glean any info. Okay. So I'm going to do at LinkedIn.com has attachment. Yeah, what does the details button say? Let me just... I don't know if I can really get anything from here, but I'll try. Should I go to my Gmail and move everything over to the has attachments or the new candidates? If you want the inhaler to monitor that folder or take anything in from that folder, yeah, you'd have to put those emails into that folder. So if this is an email account, then yes, you would have to move them over from the – So I'm going to go at LinkedIn. Yeah, I don't see any useful information in that error window. Sorry, you can close that out. I'm not sure why the portal is throwing errors when you try to search in your inbox. That seems like... So I'm going to come over here. Alleyteam.com has attachment. Has attachment. So like for the resumes coming in, new application. Okay. So like I want to take anything from this email, right? Do from that, yeah. Or an inbox from that. Select all. and has attachment how many are you and I want to move could be it could be a lot I want to move them in here the new candidates okay so I just click and drag again? I think in Gmail, yeah, you can click and drag from here. You have them all selected. There is a lot of emails already in that folder, 94,000 specifically. The inhaler will have a lot to do once it gets hooked up. Okay, so they're all in there. Okay. They're all in there. I think we just need to get the Outlook going and the inhaler looks like fine. It's just it needs to have the Outlook portal simultaneously logged in so it can access those folders. I believe that is the case. And yeah, again, you've almost doubled in size yet again. So it seems like it's just got to run through the initial setup of Outlook before maybe it's like calm down to where PC Recruiter won't. I mean, maybe you could try again, add the connection to PCR again. PC Recruiter has fired an exception? I think that's because it's not logged in correctly. I don't think you've actually established a connection to a database yet. Could you try, though, clicking on options once again? System is like the system menu in PCR. Go to connections and add. Hopefully it takes. If not, I would probably wait until Outlook finishes its completion. If that's not a solution, then I don't know. Maybe this version of portal. So would you like to synchronize? We'll say no, we won't synchronize. Would you like to auto create activities? No. Okay. Save and close that. Okay. Click on the same options again for me just to go immediately back to it. And there's a test connection button. Can you click on that for me this time under connections? Oh, it's okay. Hold on. Before it was it took a second. It took a second for it to load. See if it loads after a bit here. Normally this loads immediately, but I think because Outlook is still chugging along in the background that it's slowing it down. Click on connections one more time and just give it a sec for the page to load. Because normally it shows fields in the middle of this page. This window is actually not completed loading yet. Unfortunately, there's no loading bar, but it should be loading. There's no reason why that middle area should be all gray. There should be lines of like text input boxes there, but it's not showing. So yeah, it's again, I think it's because of Outlook is still chugging emails into your inbox. It's still increasing in number and that's, that must be slowing down everything that like all the add-ons do as well, which makes sense. Outlook can only do so many things at once. So. So let this populate and go through this again. I would, I would try that. If that doesn't work, then I would just call right back. But that could be a while. You had a lot of emails in there, so it could be a bit. It might be even like a tomorrow morning type of thing. Right. Okay. Is there another way to inhale? From the folder, you... had that set up. If you have, well, I guess you'd have to strip all of the resumes off of those inboxes and put them into a folder and then configure that folder. Do you know how to do that through Gmail? In mass, I'm not sure if there's an easy way other than one by one. I don't actually think there is a way to just choose all and export all the files attached to them. I've never seen that, or I guess I've never really had a need to do that. That seems like a wild feature to have, so I'm going to see if I could check all. Is there an option to download attachments? I don't see that option in the dropdown menu there. Mark as read, delete, report spam, archives, select, snooze, tab, smooth to label. No, I don't see a mass ability to strip the resumes and attachments off of your email. So I don't think that would be something you could do. I think it's probably... The Outlook would be the way to go once it's all set up. It would be easier for you to just set it towards that inbox. But unfortunately, as you can see, the Outlook is kind of preoccupied with populating emails. I'm not sure why this isn't working or loading. It probably has to do with the Outlook finishing its setup. I would definitely let that finish off and try to come here again, add connection, and do everything you were doing. It looks correct. And then hopefully it actually saved it. I think maybe when it's trying to save all that info while it's pulling in all your other emails, it's just kind of failing at some point along the way. which that's my guess. I'm not actually a hundred percent sure, but that's, that's what it appears to be happening. I've played, or I've messed with the outlook enough times to know that like what you were doing is correct. You know, you were adding the connection correctly. So yeah, I would try again. That's my best, that's my best guess at this time. alright man thank you yeah sorry Gus I couldn't actually resolve it on the call I would you know appreciate if you tried calling back tomorrow or you know after you tried it if it didn't work what time do you start tomorrow well the support line is open at 8am eastern and it goes to 6pm eastern ok Mackenzie, right? Yes. Thanks, Mackenzie. Yeah, thanks, Gus. All right, hopefully that answers the question. Bye-bye. Have a good night. Thank you. Thank you.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 741.414167,
    "salad_processing_time": 182.68239545822144,
    "overall_processing_time": 741.414167,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence Technology.  This is McKenzie.  How can I help you? Hey, I'm trying to get the – hey, this is Gus Cawley with Staff Financial here in Atlanta.",
    "job_id": "1f088def-3876-4110-b43f-fa16e4d8e6dc",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence Technology.  This is McKenzie.  How can I help you? Hey, I'm trying to get the – hey, this is Gus Cawley with Staff Financial here in Atlanta.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3023405161037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}