{
  "recording_id": "3025574238037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:38:29.152955Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:38:29",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Otherwise, check. You are in the meeting now. There is one other participant in the meeting. Good morning, this is Jim. Hey, Jim, how you doing? Good morning. I'm well. Christopher, how are you? I'm doing well. Nice to meet you. Fantastic, and good to meet you. I wanted to kind of talk with you a little bit through the process with PC Recruiter and Dimensional Search and talk about how those two are related and everything there. Are you part of the September class? Yes. I was, we're trying to get me in for August. Okay. Okay. August 4th. I think that is. Oh, that should still be here. I'm, I'm thinking a week short. Yeah. Christina has been kind of rushing me through it because August is, it's probably the better timeframe than waiting until September. September might be too long because at this point, I've already started doing a lot of the work. I still need a couple of things I got to get done. You know, my company name I've been working on with Darren, and I got to get that figured out. And I just got my market, my vertical market set up. So, you know, there's a couple of things I still need to do before getting into the training. Okay, excellent. So what we can do is we can get you going and underway with PC Recruiter quickly. So what I can do is, so I would be able to send over the paperwork today to sign to get everything started. It comes through like a DocuSign style agreement. It's PandaDoc, just a different name brand of that. And it is $7.50 set up, $50 per user per month. And it's just you, just one user for now? Yes, that's correct. Okay. And then what happens is once you sign the agreement, then they send the invoice for the setup in first month. Once that's paid, we will get a trainer here at PC Recruiter assigned to you. And that trainer is going to get two to three training sessions in before your dimensional search training. So they'll get you the basics on PC Recruiter, creating records, some of the setup. And another bonus is you get the dimensional search template. So there's some pre-populated information and templates in your database and stuff like that. So you would get that. And then, so we'll do a couple hours training. Then there will be the dimensional search will take some training for a while during your class. Then you'll come back to PC Recruiter and do a little bit of training. So they kind of bounce you back and forth. And we know what they do, and they know what we do. So they have a nicely coordinated training program there to get everything up and running. Okay. So all I need to do to email everything over to you to get signed and started is know your company name and email or your company name and street address. Even though I email, we just need a street address for tax purposes. Yeah, I have a street address, but I don't have my company name yet. The company name I'm still working on. Okay. And we can actually put that in your name. So we can put the contract in your name because you're the owner of the company and you'll be the signer. So that happens sometimes. Okay. Okay. Because right now I have a name that I set up on the business website for Sunbiz in Florida just to get, because I had to work on an SBA loan. And not until I spoke to people at the company did I find out that really I should choose something that's a little bit more generic as a name. Because I just used CJO Recruiting Solutions, LLC. and they figuring that, you know, I should try and get something a little bit more, I don't know how you would say it, just branded, something that I could brand a little bit easier than my initials. Okay, sure, sure. So yeah, so what we would do, we could just put it in your name. That's no problem there. So what would be the street address that I could make it under? It's 3307 Port Royal Drive South. The apartment is 206. I'm in Fort Lauderdale. That's Florida. 33308. 33308 and I think I have your email address in my system already yeah I do the gmail address well that's my personal email once I have a company name they're going to set me up with a business one I don't know if I can update that afterwards what will happen once you get your company name so I'll put everything under your name just Christopher Ortiz but once you get the company name let me know we can change that in our records I don't know that we'll change it on the actual URL of the database, but that's nothing anybody sees except you, so it wouldn't really matter anyway. And then we'll update your email address. Anything needs updated on our end, we can do that. So no problem to do that. Okay. Yeah, because I don't want to use my personal email for the business. I would rather use a company email. Okay. Yeah, after you get that new address, just let me know and I can update it here. So that's no problem there. Okay. Okay. Okay. Any other questions at all? I'm going to send everything over. Yeah, my assumption was that we were going to be able to get it like an initial, like you were going to kind of walk me through what the system looks like a little bit. And also, I had some questions about PCR9 versus PCRM. I had talked to, I guess, my tech guy. I can't remember his name, but he recommended that I go over that with you also. So I thought this call would be a little bit about that. So that's where I was hoping to get a little bit more information about PC Recruiter. PCR, is it PCR or PCR? Both. It could be. It could be. This call is anything you want it to be. So we can certainly take a look and answer any questions there. Yeah. I just want to see what it looks like and, you know, how it works. And, you know, if you could just point on some basic things. They told me that this is the system that the company, most of the people use. There's a lot of different data services out there. So I was just curious about what you guys offer for the money and the support and stuff like that. That's all. Sure. Sure. Absolutely. Yeah. So I'll share my screen here in a minute. But to show you a little bit or to talk a little bit about the different options there. So PC Recruiter is the name of the software. Main Sequence Technology is the name of the company, but we also go by PC Recruiter. The product that the majority of the dimensional search offices use is PCR9. So that's PC Recruiter. It's been around for a number of years and that's the one that they train in. PCRM is a newer interface. It is a much more up-to-date interface. It contains some additional CRM functionality, so it has like a sales pipeline and a little bit simpler of a sequencing piece so it includes a little bit of additional functionality not a lot of the dimensional search offices they're just starting to move over because one of the ways that they use PC recruiter isn't in that version so they had to kind of refigure how they were going to train there's an even better way in PC recruiter but I don't know where they stand on figuring out that in their training but you could get set up on both if you wish. So let me kind of show you the options here. If you have any questions, while I get everything opened up. Yeah, I'd like to just know the advantages of which one would be better. What kind of integrations does it offer to me as far as, you know, most of these sources or these databases that you can use are only as good as the user, you know, if I could say it like that, because you really need to know how to manipulate and use the product correctly. And I'm sure a lot of people don't use it to its full potential. So that's where I'm kind like which product would be better? Is it better to move to the newer one or to use the old system? And as far as doing like setting up templates for emails and other stuff like that, I don't know if this does that also. You know, sending out response emails or responders or automatic, like an AI system where things will automatically move once you put them in motion. so I was just curious about that and also I had a question about if I use a Mac computer is that going to be a problem with integration is it just a PC based item or is it something I can use on a on a Mac also yeah it'll run just fine on a Mac so no problems there either version so no problems there the only thing that doesn't run on a Mac there's one little use now utility. You can parse resumes in a PC Recruiter, but years ago we designed a bulk parser called the Resume Inhaler. That doesn't run on a Mac, but that's only if you had 100, 200 resumes in a Word folder you needed to get into the system, which most people don't have need for it, but that's the one piece that doesn't run on a Mac just because it's written in ActiveX that doesn't run on Mac. One more time. I didn't really understand anything you just said. So it's bulk resumes? What would that be? Yeah, if you had a folder of 150 resumes and you wanted to get those all into PC Recruiter at once, there is a tool in existence called the resume inhaler that you could point at a folder and it'll just sit there and run in the background and inhale. It'll just kind of pull in all these resumes, parsing each one, creating a record for each one, importing each one, indexing each one for searching. So it's if you ever had cause to need to import a bunch of resumes either out of Outlook or out of just a Word folder. So that one specific add in doesn't work for PC Recruiter on a Mac. but it's very seldom used anymore. Almost nobody uses that because most people either bring in a resume one at a time or in small batches, or they pull people in using our capture tool from LinkedIn, Dice, Indeed, Zoom Info, or they pull in records from Zoom Info or HireEasy, or they use the standard resume parser to bring it in out of an email. They just right-click and parser write in so there's so many ways to get data in that one specific a bit antiquated way doesn't run on a Mac but okay the system itself runs everything you can do fine on a Mac no problem okay all right okay it really functionality wise you're going to have everything in both versions so both versions have the sequencing automated drip campaigns auto responses automations they're both going to look at that part even looks a bit the same the main difference is going to be the look the look of the database so let me happen to want to just kind of take a quick click around here so if I go into pcr9 this is the pcr9 and this is what most people are using in dimensional search so this is going to be the database here it's a standard main menu bar at the top there's going to be a middle and a bottom portion of the system here middle is going to be for searching search results and lists bottom portion for the records themselves so some of the things up here you have an area for all of your names or all of your people you're talking to all of your companies that you're working with potential companies or current client companies and then the position tile is going to be for your jobs that you're looking to fill so So you're going to have the ability to put in, those are kind of our three primary record types. And then some of these other buttons, a daily schedule, like your calendar, you can schedule meetings, phone calls, follow-ups, what have you. Rollups is our list creation tool, so you can build groups of candidates and records. So if I even click into that, I can look at rollups. That's going to show the rollup list in the top, and then if I click on a specific list, it's going to replace it, and then I can look at specific records as I go through in the bottom frame. So I can look at each record. I can kind of go through. This might be used as a call list or a pre-pipeline or something like that. Any reason you might need to group people together, this is also how you would send an email campaign. If you needed to send a mass communication to all these people, you can do that from here. And the roll-up list is also what runs the sequencing piece. So the drip campaigns piece that we have that you can set it up to send an email and then if they open it, add them to a call list. And if they don't touch it in three days, send them a second email. You can do some different things like that. That runs off of this list as well. So the roll up list is kind of a key feature. And some of the, you have your reporting up here, all your different reports, some analytics reporting, that's going to give you the ability to build custom metrics, like I can look at all my interview activity, or I can look at who opened my emails, or anything like that. And this version here, I always like to kind of walk through starting at the company record. If I go through, I can type in part of a company name, or just go into one of the last 50 I looked at and then I can go into that specific record in the bottom portion of the screen this screen is entirely configurable so it might be three columns four columns one column it's up to you I think the dimensional search has a set vision or a set view that they give you with the fields that they train on and find most important and then you're going to have a set of two different sets of data linked to the company those are going to be your jobs so here's all the jobs I have at that organization and then I can also see all my contacts over there maybe people I've placed maybe my hiring authority or maybe just an employee over there at that company so I can connect names to the company I can connect jobs to the company and I can also get right to those jobs let's say if I go up into the position tile at the top here's the last 50 jobs that I was looking at in my database and if I click into any one of of them that's going to show me the job record and it's going to give me again a configurable record nice formatted description and then if I go to pipeline that pipeline is going to show me everyone that I'm considering for this job this is going to be a custom pipeline all of your individuals are in the inbox over here maybe if you search the database and link them here or if they applied online which is an integration that you can set up you can interface this to your website so as soon as the position is entered into the database it will show up on the website candidates apply online they put themselves into the database and then you simply have a means by which you can drag and drop them through as you move them from one step to the next and that's going to be a trackable event and you're going to be able to move people through your custom interview process all the way up until they might have a first interview second interview they may you made a placement and you can even track your placements either permanent or contract or both all in the database. Okay. Okay. Now, all this data that I have accumulate over the years, what happens with this data? Is it saved to my computer? Is it saved in a cloud? Where does this data back up to? It's entirely cloud-based. It is on our cloud servers here in Cleveland, but you retain ownership of the data entirely. So we have no ownership. We don't have access to it unless you give us a password to get logged in. So it's your data. So if you decide to move on down the road or you want to go switch something else or you stop recruiting altogether or sell the business, whatever, you can always get a copy of the data. We will make it available in a Microsoft SQL database, the most common database format there is, and you can take it with you and do anything you wish with it. Or you can always export it to a CSV like an Excel if you need to keep it easily accessible and get your contact information out. but you own all the data. Okay that's good. And then dimensional search will I think they initially get you some data or you get some data somehow there's some data from like hire easy or zoom info I'm not sure which they pre-populate that data to start you with some data in the database I believe so they would do that for you and then you'd have a database in here that you could go through and I might if I needed to talk to Jim Lombardo I could type in part of his first and last name that's going to search them right up or I can go do an advanced search and I can look up like people with sales and marketing experience and I can keyword search my entire database just like that and it's going to search everybody it's going to find it in their resume and everything like that okay so this is the PC or nine version this is the version that they been training on it until recently everyone used this version people have kind of creeping into the PCRM because a lot of people like the interface. So I want to show you, I'm going to log into the exact same database. I'm even going to go the same person. So if I look at Terry Stidham, this is a sample record of my database. I can look at his name record. I've got all his information here. So he's now going to be my most recently viewed record in my menu here. So if I log into PCRM, same database, and we can even get set up on both. It shares the same database. So if you would rather have this interface, you can kind of have access to the other interface too if you really want it. But this version, the PCRM, is more of a left to right versus up to down. So you'll notice on the left side of the screen, you have the entire menu that we just kind of went through across the top in PCR 9. It's down the left in PCRM. A lot of the same exact options. So if I go to names, it's going to show me the last 50 names I looked at. There's Terry, that record I was just at. Gives me the option, I can edit it in line here though. I also have some actions I can email him from there. If you have RingCentral you can even call or text him right from here. You can add an activity to schedule a follow-up, maybe add a searchable note or add him to one of those lists to maybe start them off on a sequence. So you can do more from the main menu and then if you click on the person's name or their little icon there, their record will slide in from the right and this is going to be a configurable record here. You'll see it looks a little different, a little more modern. We give you this custom workspace that you can design to your liking. So you may be a little version of the resume there, some basic fields, maybe you have this activity history, and then you're also going to have all of the other things like his resume, keyword tags. tags, and then we also give you an additional button here called details. What this is, is this is every single field I have on this person in a searchable format. So if I needed to get a phone number, no matter where it might be in the record, I can search right here, phone, it's going to instantly isolate down and only show me my phone fields. So now I can see all the numbers I have for it. or something like that. So a little bit easier to navigate, a little bit more configurable, and like I said, some people really like this interface better, some people like the other better. They do the same thing, they work on the same database, this gives you a little more modern interface. Like if I chose, maybe I wanted the positions that he's linked to, maybe I wanted that a little bit further to the left. If I go down here, I can just drag and drop it up there, it's going to slide right over. So you see it's a little bit easier to affect how the records look and how the screens look. But I'm going to be able to look at companies too. I can go to the same Vandelay Industries. I have my landing workspace. I have all my positions that are linked there. It just looks a little different. Yeah. That's from Seinfeld, Vandelay Industries. It is. Some people catch it, not a lot. Yeah, that was the industry that what's his name? George, was it? Yeah. Yeah. That's funny. But yeah, so this is just a little bit different of a view. A couple of things it does give you that the other doesn't. A deals workflow. So if you're tracking marketing efforts and you're selling to companies your services, so you're working with different companies and you're trying to move them through a process, this PCRM version as a CRM includes a sales pipeline. So you can kind of have your different steps here and drag and drop your company records through these steps You can even set up different steps and maybe I could say I did my intro call I can check that off So you kind of add some different things in here. You can also edit this screen and give it a different temperature And give it a potential value projected close late So this is going to give you a little more ability to forecast and track your sales efforts or even creating new clients to recruit for There's a simpler sequencing piece, but some of the things are going to look the same. Like the analytics, for example, that we looked at those reports, it was designed once PCRM was already being developed, so it looks exactly the same. Same with the sequencing. Some of the screens are going to look very much the same, but the basics, the names, the roll-up list, the company records, the position records, those are all going to be the new interface. But I can look at that exact same radiological control type position I was looking at, but the pipeline is going to be the same. So pipeline is the same in both versions. So it's a little similar, but this one's more modern and a little bit easier to navigate. So you can kind of feel like... Yeah, it looks like it might... Yeah, we'll probably gravitate towards the newer ones because it's usually... Usually when you come out a new product or innovations to a product, it's to enhance it or make it better, not to go backwards. So I would think the PCRM might be the better advantage. Now, is there a difference between for the initial setup? Can you just set up with the PCR9 and still get logged into the PCRM? Or is it a completely different platform? You said you can kind of go back and forth. How does that work? Well, it's going to be the same setup. They would just create two links to the same database. So you would have one database. So all your data would go to the same one place. You would have two doors to that database, if you will. So kind of depending on what they do the training on, dimensional search may be training primarily in PCR 9 because that's what their training over the years has come to, it's been developed, that's what it is. So they might do training and that's what might be helpful to log into 9 sometimes and then maybe use 10 on your own. Maybe they'll start kind of training into PCRM. We've really only very recently started opening up PCRM two-dimensional search offices. But so far, people are liking it. So I don't know how much of their training is geared one way or the other. Okay. So yeah, when you purchase the three-year contract for this and you do the initial setup, the initial fee is the $750. That's not a reoccurring. That's a one-time fee and that's it. And then you pay $50 per month. I'm the only user, So it would be $50 a month would be my reoccurring. Exactly. Okay. And with the initial setup, is that first month already included, or do you get a month for free? How does that work? You pay initially $800, $750, and the first month. So your first month is paid as part of the setup, and then in a month you pay for the next month and usually put on a recurring card like everybody does there. Okay. Okay. Okay. So once you have this set up, you'll get a logon. When I get initiated into this, I'll have a logon for PCR9 and PCRM, which I can see them move back and forth. Okay. Yeah. And you can see, you might find that you really like M better. And maybe you get a little trained in PCR9. You know how to use it. Some of the screens are going to look the same. So that's going to be great. And then maybe you like the interface on PCRM better, more modern, certainly go use PCRM. That's fine. And they're going to be kind of heading a little bit more in that direction, I think, as well, because it's the newest and the latest and the greatest. Exactly. Okay. Is there anything else that I'm not asking that maybe I don't know about that there could be some insight into this, or is this basically it? You've gotten all the good questions, all the basic questions that even some people don't ask, such as data ownership, Oh, okay, perfect. You're using a Mac. A lot of people don't ask that, or a lot of people don't tell us they're on a Mac to make sure, and it does work, but a lot of people don't tell us. So it's good to know. Good to know there. But, yeah, so, yeah, what I can do is put together paperwork, get that to you, and then when you're ready, DocuSign it, comes back to me. I countersign it. Then I have my accounting team put out the invoice. As soon as that's paid within a day, you get your links emailed to you. And then I think you share one of the links with Dimensional Search and they pre-populate the data. And then they also have a process, but you would start with our process. We'd have a call between you and me and your newly assigned PC recruiter trainer to go through a questionnaire to introduce them to you and kind of your specifics of your network and your industry and whatnot. And then they'll help you get a couple hours of training before your August 4th session. Okay. And then is that included in the 10 hours of training? They talked about over six months I have 10 hours that I can use of training. Is that part of that or is that just an initial and then I can go back if I have any questions? Or is that something I do? The initial call is over and above that. So the initial call is just maybe 20 minutes. The trainer would have some questions for you. And then after that, the 10 hours starts. So the initial call doesn't count. toward the 10 hours. Okay. And then if I have any additional questions after that, that's something I'd have to just go through the company instead of through you guys. Like, if I have any issues with the system or anything like that, is that something I deal with the IT department at Dimensional Search, or do I deal with you guys directly? You could start with them, but you could certainly call us anytime. You have a dedicated trainer. I would be an account manager, and you're also going to have the whole support team's number here. So you can call us with any questions like that. Certainly no problem at all. And we have chat online, can open up a trouble ticket. So a lot of different ways to get a hold of us. But we support as well as they support. So you essentially have two companies behind the system there. Any troubles with the database going down or system problems as far as data? Has there been any issues over the last couple of years or is it something that's pretty steady where you guys have backup systems? We have backup systems. We have diesel generators backing up our labs. We have multiple labs with fail-safe, so if one router should go down or one server overheats, whatever, it'll just fail right over to the other one. You don't even notice anything. So very, very seldom is there any downtime routages. Yeah, it seems like a solid product, and they really talk highly about it at Dimensional Search. they not only do they uh train on it but everybody in their in their company seems to be using it most people so yeah all right all right jim well thank you for your time today i appreciate it um send me that information over uh so once i get everything uh signed and and send the i guess i'll have to fill out the credit card info and stuff online with with what you're going to send me. What is the turnaround time once I have that all in? Once it's signed and the invoice is paid, a day or two, usually like a day, they'll send the length. And then I'm also CC'd on that, so then I would put in the training ticket. That takes another day or two to get a trainer assigned, and then as soon as me and you and that trainer can connect, we get our first call on the schedule. So it can usually happen pretty quick. I may have someone step in because I'm going to be out Friday at noon and all next week. But if we can get things rolling, maybe we can get something Friday morning, that handoff call, and then I can get the trainer in touch with you next week. So we'll get it figured out. Okay, perfect. Okay, Jeff. Yeah, send that info over. I'll take a look at everything and then I'll get back to you and we'll try and get this sorted out. Okay? Fantastic. All right, I'll get it on over. Perfect. Enjoy the rest of your afternoon. You as well. Thank you, sir. Bye. Okay. Bye-bye. Thank you.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 796.593256,
    "salad_processing_time": 210.838139295578,
    "overall_processing_time": 796.593256,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Otherwise, check.",
    "job_id": "e0972f91-07c0-4a91-9763-25d8251855ce",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Otherwise, check.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3025574238037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}