{
  "recording_id": "3026323746037",
  "version": "2.0",
  "timestamp": "2025-09-21T23:08:49.723393Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:08:49",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling MainState. This is Robin. Oh, hey, Robin. This is Jason Gibson. I just had a question for you regarding my signature. I can't change the signature in Outlook. I can change it in Outlook, but the way the image works, it's all like always wonky. Okay. Let me see. Let me see what. sunset transportation remember it right i'm sorry what's your company sunset yes yeah let me see what you got uh what database are you at bgc or sunset uh sunset okay what username let me take a look at what you have right now and Jay Gibson, but I would also need to change D La Rocha as well. D La Rocha, I think it's, I think it's, I just said typo. Hold on one second. Okay, so let's see what you have in there right now. System. so are you trying to use an image as your signature um not as my signature but see the little here i'm gonna i'm gonna do this this will probably help so i just crack i just see when i try to edit the signature i can't i can't take what i have from my Outlook and just paste in there. I don't know what someone played with it before. Is it an image that you have in there? Or like what, because what happens with Outlook, Outlook has its own source code. So let's do a screen share. You want me to share? Okay. Yeah. Do you have RingCentral or? Yeah. You do? Okay. Let's do RingCentral. When people have RingCentral, I like doing it through there because then I can take over mouse control maybe. Okay, so let's see. Let me start up a meeting for you. Okay, so if you go into your RingCentral app, go to video and select join. So download for Gmail or download for Outlook? no you have the ring central app right yeah okay so in your like you're on windows right if you type in the word ring yeah just open your ring central app then you'll see video at the top left join at the right and then let me know when you're ready for the meeting id um okay i'm ready for the meeting id okay zero five zero three nine four 810. Okay. Join. All right. Now, when you join, you don't need audio because, or at least. Continue without audio. Yeah, continue without audio. Perfect. So, it's around the phone. Let's get some, like, background stuff. Okay. So, let's have you do this. At the bottom of your meeting screen, click share. Mm-hmm. and you're going to want to make sure that under entire screen you pick which monitor to show and then click share I assume everybody's multiple monitors anymore okay all right show me what's in your outlook signature that you want to copy yes okay all right here's what I would recommend right click on that image. Does it give you a right click? Yeah we want to save picture because the problem is probably with a picture right? Your guess was good. Okay give it a simple name because sometimes when you copy paste or upload sometimes it I'm going to see what happens but let's go ahead and just save it as a PNG okay okay and then hit save okay let's take what you have here like if you go into that signature area do like a control a let's see what happens there because we'll probably just have to look at the source code. So if you do control A it should select everything in that box. Yeah it didn't. Let me try this. Control A. Nope. Okay. All right. Let's kind of drag the mouse over all the text and then copy. Try that. Going all the way down. All the way down? Yeah, because you want that image too, right? Yeah. Okay. I'm going to to see what happens if we do it this way. Right click and select copy. Okay. All right. Let's minimize or close this area. Okay. Let's go to email signature. Okay. So you got the new document at the top? Paste what you have there. Oh, shit. I just hit copy. Fuck. But I just hit control C. Oh, but you had the thing before. If you right click and hit select paste, do you have any text there? No, because I accidentally hit... Oh. Okay. Now, let's not save this in case we want to revert back but see how there's the less than and greater than up at the upper right because basically what's going on is we're trying to switch this from microsoft code okay let's see that those are paragraphs doesn't get the image though okay all right let's exit out of here. Well, there's no image there. Okay, so here's what we'll do. At the end of, don't save it, don't save it. Here, I want to show you. When I copied this signature, when you had me do this, when I went to paste it in the new box, instead of hitting control D, I actually hit control C. So let me try that again. Okay. And move this out. Okay, let's do the new. Yeah, try it now. Let's see what we got. And scroll down. Nothing. And I don't know why. Not grabbing that. Okay. So what we could do is clean up the text. But then what we could do is upload that image to what's called the server image store. That's where you had your image before. Ah. Yeah. So let's go ahead and refresh my memory here. At the end of Jason Gibson, click on there and hit enter. Okay. Now hit delete to bring that other line up. Okay. Try enter now. Okay. Go hit space. You hit shift. There it goes. Okay. so if we clean up all that Q U I think you need a U there after the Q yeah I do but I'm trying to do a one letter so okay wait that's how you spell it Okay. And then that way we're cleaning up the code behind it. Okay. As far as the text, is that okay? Yeah, that's fine. Okay. Let's put an enter after your email address. And actually double check that. Does that have all of it? Let's look in the source code. Jacobson mail to oh you got somebody else's oh hold on one second after we got to fix that too so you're seeing the right text but you got the wrong email behind it so you're going to want to fix that in your outlook too see right after mail to yeah yeah fix that okay nope nope nope nope No, just click away from where it says mail to right before it. Just replace the name, C. Gregor C. or whatever that says. Oh, yeah. Okay. Put in Jay Gibson there. Otherwise, when they click it, it's actually saying email to somebody else. Because after the text that you see. Yeah, there's like a link. So there's text for the link. like you could have the link say email me but with something else behind it such as a mail to okay let's hit OK here all right let's save this okay let's go to system up at the very top and in the search box because I always forget where it is just type the word image and you'll see server image store fastest way to get there so these are how we were getting those links before that we'll use as a click so what they'll do is hit add browse find that file that you just saved Upload. And you'll see a preview. It looks like it's probably that second one. Okay. Over at the right where it says secure, we want that one. Just right-click on that link. Okay. Right-click and say copy link address. Okay. Perfect. Let's close this window. So basically what we did is we generated a hyperlink for the source of the image. So that way it's nice and clean. Let's go back to your email setup. Email signature. And then put like a little space after your email address. Looks like you have the whole email address selected right now. Be careful with that. Okay, so click at the end there and hit enter. Why is the J not underlined? That's what I was looking on that source code, but it seemed okay. Let's look at the source code again, which was the greater than less than. Mail to Jay Gibson. Oh okay. I think we're, I think we need a, you know what, let's get out of there. Remove that line. Let's just do it from scratch. And then hit enter. Maybe I'll maybe maybe it's just because of the J because in the source code it looks fine. We could test it when we're done. Let's hit enter one more time because it is within the brackets I think maybe it's just because of J and kind of see how it's like it is fine it's not like there's a bracket after like between the J and the G so I think it's just a display issue when it's a G or I'm sorry when it's a J okay let's hit cancel okay right below there what you can do see in your editing toolbar there it looks like a picture frame so right before the link option there you go paste that URL that you have into where it says source hit okay do I want to change the dimensions you know what well if your original was okay let's see what it looks like do you want it bigger than that or is that the right size? I think bigger is better. Okay so here what you can do is kind of drag it a little bit like if you go if you click on the image go I would probably go to the bottom right corner and then just kind of very carefully drag to whatever size you want it to be. That's good. Yeah, that's good. All right, and then hit save. And that is now your signature. What? That's crazy. Okay, so if I, let me see here. If I do, if I drag. Just right click. Yeah, just right click. you always get that add step. But if you right click. If I right click on this? Yeah, just select add step. Oh, I see what you're saying. Yeah, instead of dragging over. Okay. Okay. All right. Okay. I just got an email. And I can show you what it looks like here. Oh, shit. I just deleted. I just deleted the email because it popped up down here, and I was like, oh, God, get out of here. So, yeah, it worked. That's awesome. Okay. Okay. So, okay. that works so that's now my signature um and this is also part of my signature okay so it looks like that when you probably have below your signature you probably have opt-in opt-out yeah yeah okay so that's awesome i you know it's funny i did not expect to get you because it's already 4.10. I figured you guys would be closing up. I was like panicked. So I appreciate that you had the time to help me today. I really appreciate that. And you said you have another user? Yeah, Dania De La Rocha. Okay. With your permission, what I can do, because I'm pretty quick, what I can do is open up your database and then hers and then kind of do like a copy of yours as her and then edit. If that's okay with you. Yeah, yeah, yeah, for sure. It's 100% okay with me. Or if you know her password, that's fine. Okay, well, here, I can walk you through it. Okay, so let's go over to your... PCR database for a moment and go to system email setup email signature okay yeah go ahead and do like a control a Okay, copy, right click, select copy. I did the control P, is that okay? Oh, yeah, yeah, as long as you copied. Okay, let's go over to her login page. And do go to system, email setup. Email signature. Okay, let's hit the new document. Okay, let's do this, though. Let's go to the less than, greater than to look at the source code, which we now have cleared out. Right-click in there and select paste. Yep, and select paste. Actually, you know what? I don't think I – nope. Oh, hold on one second. Okay, let's do it a different way. Okay, let's do it a different way. Let's go back to your source code. We're going to copy exactly what you have. So email signature. Go into there. Select all of this. That way we get everything. Okay. And then go into her source code. I'm going to close this out. I want to see what she had listed. I don't know. Okay. so I need to write that number down. So I'm sure we'll probably have to add it back in. The number is 314-784-9918. I don't think I need to add the address information. Okay. Okay. All right. So let's go into the source code. oh see she had if you look down at the very bottom she has all that stuff that's because of an image copied or whatever so here i would just do control a and don't you do a copy just do control a but then hit delete okay now right click with what you have and paste it in Okay, so we're going to have, I was going to change Annette's first line, replace your name with her name. Right here? Up higher, the first line, which was her name. Oh, I'm sorry. Is it lowercase for the day? Oh, you know what? She does have it lowercase. Okay. Okay. And the second line, replace between those tags with her title. Just make sure you keep that BR tag in there. Okay. Okay, let's see. We'll need to change the mail to portion. Just the first part. Okay, and then right after that. Okay, let's just hit okay for now. Okay, now she only had one number and it has direct. So why don't we take out one of these lines and then change the other one saying direct with her phone number. 9918 and hit save and she should be good awesome awesome thank you so much yeah whenever there's images unless you're like right clicking on your website and saying like copy image URL it's best to probably just upload it to the server image store and then use the link, the secure one. Okay, okay. So you say it's better than to just copy what I have in the signature than uploading the image from the server store? Well, it depends who's hosting the image. So, like, if it's on your website, like, if you go over to your website, not all of them are like this, though, because sometimes it's, like, a vector image or things like that. But if you went over to, like, your website, for example, like, right-click on your logo, and you might get an image URL. But you had it, like, where it was three things. Yeah. Yeah. So, and that's really probably just going to a new window because it's not, like, image URL. But you wanted it three. so it's probably best to just put it under the server image store. But sometimes with images, you might be able to just right-click and say copy image URL. For sure. No, I agree. And that's an image that I haven't used. But I'm sending – so now I'm also recruiting for our other company, Baytech and Armada. so I wanted to be able to brand it so that it, you know, that I wasn't just a guy calling from sunset, but I also have that logo that we work for both in case there's any confusion. I did, I did have a question. So I actually was listening to a video with you two nights ago. I know you, I think you cursed Stacey a little bit. I did what? What do you mean I cursed her? Yeah, you were like, at the beginning, I think she introduced you and you were like, shut the hell up, girl. Yes, this is Robin with PC Recruit and I don't think that part was supposed to be on there. What? You told her to shut her mouth. You said something like, shut your fat mouth, Stacey, and then you're like, No, I would never say that to Stacey. I would never say that to her. I'm totally kidding, but I did have... They tell me you're kidding because I cannot ever see myself in it. I love Stacey. Are you kidding me? I got to see her last week for an unfortunate situation, but no, I totally adore her. Does she not work there anymore? No, she now has three kids, and she is very happy just being a mom. I'll tell you what I would be happy being a mom right now yeah she's you know I well I only had two but yeah it was it's you know when they're little hers are all like I think her son just started kindergarten so oh my god yeah when you get that your oldest I think is in kindergarten I mean she's doing other stuff she's actually doing like little side stuff of um like doing baking. She made cupcakes for my daughter for her graduation party. Oh my gosh, they were delicious. She's been doing cakes and stuff. She likes doing that and it works with her schedule. She can do it whatever she wants. Spend more time with her kids. If I could have done it financially, I would have for sure. I mean, isn't that what everyone's looking for? It's hard to juggle. Yeah. So she's doing something she loves. I don't even ask. Yeah. I mean, sit around and bake all day? I mean, that's, you know, when I started dating my girlfriend, I asked her what her favorite food was. And she said, baked goods. And I said, not a category, like a food. It's another food group. Are you kidding me? Sweets. Dessert. I was seriously, though, watching a video about you and the reporting. And I sent an email to PCR or submitted a ticket or something. I got an email back from Garrett Comey. Okay. He said $95 an hour reporting. And then I was – that was Monday. Let me see. I'm going to go to Monday. 10-27. And we do charge for like, you know, those sessions where they're longer because otherwise we would never have anybody available to ever answer a phone. Oh, that's totally, I'll pay it like immediately. I have no problem with it. I need the help. I would first watch that reporting video that I did though. If you, you know, now something that's different on some of those is like when you get into companies and names, I'll be like, oh, you can't use this one. Do a customer because you can't do a CFB. That's been changed a little bit. Definitely the custom reports. And actually, I kind of rewrote a lot of the documentation on it recently. Some of that's better described even in the Learning Center. Is there a certain type of report you're looking for? I'm going to start expanding a lot of reporting because since we've been purchased, they want to see the results on this. So there may be some additional reports on activity that I'm going to be running. But for now, I'm getting a request to understand pipeline reporting because they want to know who is in the pipeline that is good and how close are we. And they also want to understand how long it's taking to move them through the pipeline because people are just sitting in queues. Gotcha. So that one you might need to do a little bit more of a, like a custom, because we don't really calculate days between steps. And so that would have to be like custom written, which that would be billable. One you might want to do is since you have, it looks like you have the new pipeline. if you go to under reports and I think I have this one detailed pretty well in a new learning center it's called new pipeline report this one you have to go to reports new pipeline reports this one you can narrow it by date if you want, but if you go under where it says filters, you could just maybe, like I just want it for this job or just my open jobs. And instead of trying to pick all these steps from different templates, you just want anybody that's active where it says filter by step type. Filter by step type. Oh, yeah. If you scroll down near the bottom, once that pops up, you could just say inbox and active instead of trying to pick all these different steps from all these different templates because they see you do have multiple templates in there it says select us um select a pipeline right that would be if you yeah if but if you scroll down more yeah basically the way the pipeline stores is there's inbox and then there's active which are those custom steps names you put in. Otherwise, if you select a step type, then what you have to do, or a pipeline, then you got to pick the steps underneath it. So if you just want, show me anybody that's in the inbox or currently active in the process, if you scroll down to the bottom, it makes it so much simpler. Like, we don't really need to see people you've already placed or moved out of process. Okay, so you can see my screen right now? So, no, we were showing my, wait, no, hold on. I'm looking, okay. Yeah, so scroll down. Instead of selecting agent pipeline, then you would have to select everything in there. So don't select, go out of the dropdown for a moment. And then clear out. Go out of the, no, go out of there. Because you have multiple different templates, and each template has different steps in there. So go out of there. Clear out what you have for filter by step type. Okay. Okay. Go into the pop-out to the right of filter by step type. Go all the way down because you have all these different templates. if you just want people in the inbox or active just select those two options and then hit select and then let's say if you want a certain job you could have done that and then if you want to see all the steps a person goes through if you scroll down a little bit further you could say include students you get if you leave it right now you'll see all the steps but if you just want to know where they currently are check that box. Okay so if I this is inbox and active and it will include only current steps okay. So this would show you anybody if they're currently in box or active instead of showing every step they're in it'll just show you where they currently are and then you could take out the date range at the top and just say show me for every open position, which is already selected. So if you scroll up just a little bit. Oh, okay. You can take out your date range. So that's basically people moved in the pipeline during those dates. Okay, take that out. And then go back, scroll down a little bit below under filters. And see what it says, filter by job status, AI. that means available or internal. So what that means is if you were to like run it right now and you do the export to Excel or the PDF what this would do is show you everybody so this one only has that stacked version so if you go to export to it by export to Excel what that'll do is show you anybody that's active in your pipelines. Oh my god. But if you've already moved them out. Oh wow that was quicker than I had anticipated. Okay so this is like every. Yeah so if you wanted to if you only wanted to run it for a certain job that was one of your filters you can see that your filter by position ID. So see what it says filter by position ID. Okay so if I wanted For example, if I just wanted to filter by, the position would be, I can look in first, it'll come up here. Yeah, there's a selector to the right to let you pick which job, or you could just type it in. No, when you were in that report. Oh, but I don't know the job ID. right well if you go over to the right I think you can pick it either by title like if you go filter by position go there and there like you can narrow your list by title I believe and then hit list and if you pick that it just put should be pulling the ID number Oh Oh, I... Which one you want. Oh, you know... This one. Oh, cool. Okay. So now it's going to pull from that position. That position only. Now that's the PDF view mode. The other one was the export to Excel. I like the export to Excel better. You do? yeah yeah I just don't like the format it's too big but if you exit out of that tab yes so instead of at the top right use the second the over the top right use the export to excel one I think it's a little easier to read And then when I have, are these the only graphs that, what are these? Oh, okay. So you can see like in your list you have 49 Jeff sent, left mouse page. The main tab is where you see the real stuff that you're probably caring about. Which one is the main one? If you go over to the first tab versus main. Yeah. So here's each unique person. What's that? Yeah, that was each unique person and where they are in the pipeline. Because you didn't narrow by date, but you're looking for that job. What if I just wanted to narrow based on certain steps in the pipeline? Well, that's where it gets tricky because you have so many templates. um if i wanted if i wanted to make sure you're you could use that filter by step name activity but then you'd have to pick from each template that's fine like if i wanted to go you mean like so on the agent pipeline it's going to pull from this position and i want they've asked me hey can you send us who are in these stages Okay. As long as you're doing it for one job and you know what template it uses, it may not be so bad. Okay, so let's see if it works. That's what I would definitely... Okay, so yeah, this is a much more manageable report. Customer checks, I know Jeremy Susky is in customer check and a brand lead. But can I show, how would I show what their book of business is on this report? Is that a custom field? The only thing you do then is make a custom report. It is a custom field. So, for example, if I go to Jeremy Sesty and I pull up his profile, custom book of business is a custom field. That one, it doesn't have any custom fields that you'd have to create. I could send you instructions that I wrote on how to do a custom applicant tracking report, and then that way you could specify the field that you need. Let me get that over to you. Oh, that would be phenomenal. Report, custom applicant tracking. All right. I will get that over to you. I'll send that email right now. Thank you so much. No problem. What's the weather like in Cleveland? Today is pretty good. We've actually had a lot of warm days. Good, good. I was just in Cleveland last month or a couple months ago. We went for a game, went to some art thing. My girlfriend is a curator, and she belongs to the print club in Cleveland still, so she wanted to buy something for one of her friends. And one of her friends from New York came over, and we just made a weekend out of it and hung out and reminisced. Well, that sounds fun. Did you go anywhere fun? Well, we went downtown, and we drank our faces off. That happens down there. I stayed in Cleveland Heights, and my God, has it changed in nine years, ten years. Oh, yeah, yeah. I texted all my buddies, and I said, hey, I got an Airbnb in Cleveland Heights right off of Coventry, and I walked down here, and there are more smoke shops and Japanese and Asian restaurants than there are bars now. What the hell happened? And they're like, no one hangs out in Coventry anymore, dummy. I haven't been for like nine years yeah it's a very mixed area like you can walk half a block and it's going to be something completely different it's a very diverse area what's the name of actually one of my friends I grew up with her family owns a her husband owns a kind of like they got a lot of different stuff I think it's kind of like a smoke shop But then she also gets a lot of, like, clothes, like, leather jackpots. I don't know if they still do the leather jackets, but they would get, like, things from New York, like leather jackets and stuff. Called Sunshine 2. Girl I grew up with, her husband owns it. And it's in that area? It's, like, right, like, if you're a Coventry, you know, it's like you have, like, so Coventry, like, the main area is between Mayfield and, check out the backside, is it? If you're coming from Mayfield, walking up Coventry, it'd be on the right-hand side, about halfway up. Like, you know, like at the top, there's kind of, kind of veers off a little bit. She's about halfway up through that section. Okay. Okay. It was definitely, it was definitely like a shock. Yeah, I haven't, I haven't been down. I mean, I live like 10 minutes from there, and I haven't been down there in probably – I don't even know how many – I pass it going to Little Italy for dinner or something like that, but I don't actually go to Coventry. Well, you are close to Mayfield Road, right? I live in Mayfield Heights. Yeah. So Mayfield Road literally runs from kind of like Little Italy, like very, very, very east. So it's a very long road. Well, do you remember the market, the Italian? It's an Italian grocer, but Chick used to work there and made the best Italian stuff. Oh, Ferrara's. Ferrara's. I go there almost every week. Yeah. When I was in town, my girlfriend had meetings, and I was like, hey, I'm going to go get a sub. Yeah. And maybe some beanies. And I drove down there and it was closed. And I was like, holy shit. Sunday or Monday, I think they closed. I think it was a Sunday, actually. Yeah. They don't open on Sundays. Oh, they're so – I go there all the time. So it's still out of operation. Yeah, just the younger family runs it. I go there all the time. Yeah, that was like my favorite sandwich in Cleveland. so good but now next time you come like that's my favorite and then there's another place um it's in Mayfield but it's almost like Mayfield Village um do you know like where the Heinens is like on some but it may feel like Highland Heights it's like right by some and um Wilson Mills okay yeah yeah there's a high I don't know if it was a Heinens when I was there was it yeah probably would have been but if you so if you were like to go down Mayfield and then take like a left on some before you get to Wilson Mills there's a little shopping center next to Heinen's and there's a place in there called Village Butcher it's a butcher shop but oh my god they make some good sandwiches there too really good get like your cuts of meat there and everything yeah yeah I miss Cleveland so much they do like steaks yeah they're good for like steaks and I don't think they have a deli they have some pre-made foods but oh gosh they have this sandwich called the PLG and it's what is it let me think hold on I gotta look it up what it is it is PLG it's called the village butcher it's called the PLG I'm looking I'm going to look it up it is where's their sandwiches menus I think it's like prosciutto, saprosciutto and something else I think what the other meat is and I don't normally like red onions but for whatever reason they like um here i love that on your cap capical saprosada prosciutto lettuce tomato red onion but they do something with those red onions i think they pickle them or something that they do provolone italian dressing and it's on and i'm not kidding this description does not do it justice now my husband likes what's called the larry it's like shaved beef caramelized onions american cheese provolone some special dressing oh my god you're making me hungry he says it's really good he likes hilarious shaved and griddled beef caramelized onions american cheese provolone jock's dressing baguette oh my god like yeah i've never been here but is this over by wherever do you see like a computer store over there well micro uh no down even more a little bit more okay um i think you're thinking a micro center that's literally like almost across the street from me but if you go down a little bit more towards wilson like the next intersection if you're that same street that micro centers on you just go down a little bit more no that sounds this place looks amazing honestly this looks ridiculously good and you know i didn't Oh, this is going to sound so horrible. Do you have the pictures rotating? The pictures rotating? Yeah. What am I under? Deli Butcher. I'm under the Village Butcher. Yeah. Okay. If you're in that menu page, if you scroll up at the top, it's got some images rotating. Yeah. Yeah. Yeah. It looks really good. They're so good. I mean, it was like disgustingly good. I actually, I came to bed late the other night, and my girlfriend was like, what were you doing? And I said, I'm going to be honest with you. I got stuck in like a YouTube loop where I was just watching videos, and I ended up watching a whole series on, well, Mama Santa, and then obviously uh geracies i watched a whole documentary about geracies i'm like oh i'm like missing it bad um but yeah so we're just telling you this place is there's a geracies now diagonally across the intersection i love their pizza i don't like their sausage because it's that crumbled stuff but i usually just get their cheese it's pretty good so wait there's two geracies locations I think there's three or four. There's one in Pepper Pike. There's one now in Mayfield Village. There's one in downtown Willoughby. And I think there's one more. I think there's four. That is crazy. I had no idea. I still play cards with a lot of guys from Cleveland. It used to be our card game. When COVID hit, we went to – some people moved to Phoenix. Some people – I moved here. Some moved out to Vegas. We started playing online. I play with them probably twice a week. But I'm always like – a lot of them that are still in Cleveland, they're always – of course, they're always talking about the game. I'm like, this is just ridiculous. Why are we here? but well the next time you come if you stay over like kind of like semi-east and you go to Little Italy you gotta go to Mia Bella that's probably one of my favorite restaurants I've been I've been there's and I I wanted to time it up so that we could come for the feast but I don't know yeah that's fun it's not gonna happen this year but haven't been on one of those in a while I love those my daughter was all bummed last year because she um she started at ohio state last year and the freshman had a little bit earlier so she's like oh my gosh it's the feast weekend though so this year she gets she moves in like right after it so she's probably going to be down there every night both my kids what dorm is she staying in she's staying in baker um this year she will be in Neal? Oh, yeah. Like Neal Tower or something like that? Yeah, that's the tall one. There's two. I thought it was kind of short, like five story from when I looked it up, or maybe I was looking at the wrong one. Well, there's let me double check. I thought that's what you said the name is. Neal Tower is where you will go to do all of your registration, but they also have dorms in there. Oh, okay. No, I'm wrong. So apparently... Oh, I know exactly where she's at. It's more south than she was. She was north end this last year, and she was in Drackett Tower, which was actually pretty good for her because she's in engineering. so this year she's going to be a little bit more south but she's like i don't care she's all excited actually because i think she's over by the nursing school yeah she's kind of down i don't know why she's i don't know somehow they got put there and she said she's fine with it because they actually have like her dorm that she had this year it's like you walked in and it was four desks the tiniest bathroom and then the other little room had like two sets of bunk beds and two closets and then like this almost like ikea stuff they brought in to give the third and fourth girl closet i think it was supposed to be for two people it was really really tight so this one at least there's a common area like when you first walk in she's got a kitchen everything and then two girls will be on one side the other two girls will be on the other side and each has each side has their own bathroom so she only has to share a bathroom with one person oh that's nice she's much happier than she was last year she's right over by mirror lake but the uh west ninth and she's over by west ninth and you know i used to live on west ninth and uh there's a pizza place up by her called adriaticos which is really, really good, but it's an acquired taste. And there used to be a place not far from there called Catfish Biff, which was a really, really excellent, like, by-the-slides kind of place. I doubt it's even in existence anymore, but that's awesome. Well, congratulations on getting her prepared for a wonderful college experience. What type of engineering is she? She was going to do biomedical. she doesn't want to do that now she's like I don't want to do medical but she's really good at engineering she actually wanted to go to med school at first and then we said why don't you do this biomedical engineering it's kind of like a pre-med track because if you don't continue on let's be honest I can't afford it um at least you can have like an engineering degree and she's like I don't want to be an engineer but then she actually started doing it she found out she doesn't like the medical part she actually enjoys the engineering so she's going to do chemical engineering instead. Golly. And she's not having to like, it's not like she did any classes. She had to take chem anyway. She had to take the calc three anyway. So she's already, she didn't lose any classes. Let's just say, it's not like she's completely switching. She had to take the engineering class anyway. I had a full ride And they paid for everything, medical school and everything. And I, well, they said, what do you want to do? And I was like, well, if it's a full ride, I might as well go to medical school. And they're like, yeah, we can authorize that. And so I started out as a pre-med major, and chemistry killed me. Chemistry was my first C, and I said, how is this? I'm not doing this. This is too much work. I got out of that pretty quickly. But, yeah, hats off to her. Chemical engineering is a lot. a whole lot. The biomedical is probably the worst, she said. And my friend's son is in it and they even tell him you've got to make some fun time too. Because you're doing all the engineering stuff, but you're also doing all the medical stuff. So it's like you're getting the worst of both worlds. Yeah. So, yeah. I wanted to have too much fun to deal with that. Yeah. Oh, yeah. I'm telling you, my kid's like the most social thing ever. She's home this summer. She works a lot because she likes to have her money. But if she's not working, she is doing something with Ron. She's hardly ever just sitting around. That's good. Extremely social. Well, this conversation just like completely blasted my nostalgia factor for the day. Not only am I reminiscing about Cleveland and all the restaurants I used to go to to make me fat, but I'm also looking on my old college campus now. I'm just like, I can't believe it. I'm glad I'm in North Carolina. And the winter is certainly much better. That's for sure. And gray. It's a lot of gray in Cleveland. My girlfriend gets really, like the weather affects her mood a lot. Absolutely. I see it all the time. that it's not the snow or the cold, it's the gray skies. It's horrible. Yeah, it really is. And we didn't realize it until we moved away. When we moved to Omaha, they had like 350 days a year of sun. And she was like on cloud nine. And it was because we weren't in the gray skies of Cleveland, but we just loved Cleveland so much. I have to ask because he works for the city of Beachwood. So when he comes home, if it's summer, he wants air conditioning. If it's in the winter, he wants to be warmed. And I'm always like, I need to get out of the house. So it's not always a good mix. No, no. And honestly, I love the snow. Like when we left, when we left Cleveland, we lived right over near St. Ann's Church right on Cedar. Okay. Is it St. Ann's? That's the one. The church where Dean Martin got married. I know I've heard of it. You know where Marchmere is and all that? In Mayfield? Isn't it like up Sam? More like Cleveland High Shaker. Okay. I'm not that familiar with that area. So when we left, though, it was our neighbors gave us, like, we didn't even really know them, but they knew we were moving, and they knew that we were kind of, like, down about it. So they went around town on, like, one of the most beautiful snows ever and took pictures of the city, took pictures of our place, and they framed them all and gave them to us as a parting gift. and it was such a sweet gesture. But like I actually miss the snow, especially like when it's just like falling and quiet. It's just like the most beautiful thing, especially with all the trees and shaker and Cleveland Heights area. It's just a beautiful thing. But I don't know. I have adapted to warmer weather, but I do miss the winters. maybe uh maybe when i come for christmas it'll be or thanksgiving it'll be snowing as long as it's sunny out when it's sunny and snowing then it's pretty it does i actually prefer it when it's gray like especially at night i like a a quiet big snowflake snowfall at night and just walk outside and just like listen to the snowflakes hit the trees. I mean, it's just, I mean, that's like peak, that's peak, that's peak fall winter weather for me, but yeah, I don't know. Hopefully I'll strike, I'll strike gold when I come home for the holidays and there'll be some snow on the ground. Well, listen, Robin, I am going to jump, but I appreciate you helping me and you're always such a help. So thank you. And I will be at the Village Butcher at some point by God. Definitely got to try it. 100%. Very cool. Well, thank you so much. And hopefully, hopefully we'll talk soon. Okay. And if you get that sandwich, let me know. Oh, I mean, if I, if I get the sandwich, I'll, I'll make sure to drop, I'll drop one off at work for you. is it still pretty much the same crew um no we've kind of moved things around recently really so yeah yeah i i've been wanting to toy with your ai product um but i just have not had time and i'm like trying to learn uh co-pilot do they integrate at all do you know i mean No, actually, our AI, you actually have to train it. So, like, our AI, like, if you're composing an email, it kind of connects to something in a way. But, like, for certain things, you have to train it. Like AI searching, I will be honest, I think it needs more. It's kind of like initial stuff. But when it comes to searching, I think searching is not so difficult anyway. And I think you get a lot more flexibility than relying on AI for searching. but it is nice if you're just like composing an email, you can let it, you know, help you do that. Also, if you want to write a summary, I don't know if you use that summary section on a name record and you're presenting people, it takes things like from like, what's in their resume and stuff and tries in certain fields to help you come up with a summary. Sounds like a lot of work. Yeah. AI, any AI has got to be trained. So, you know, a big huge company like Microsoft and all of that, well, they have loads and loads of people dedicated to that. So it's definitely more robust and like chat GPT, things like that, you know, it's been in development using a ton of different sources for years. So if anybody lets you try to oversell, sell you on their AI, I know some competitors try to do that. And then we come back to like, yeah, they oversold the AI. It's not there yet. Most, most aren't. no no it's not i mean even microsoft co-pilot um is vastly different today from what it was seven eight months ago like it's it's night and day and initially i was like this sucks this blows but um a couple weekends ago i was playing around with it and i thought damn this is actually pretty good um what's the here's another random question for you i was talking to mike um keys and he is down here in Raleigh. I didn't know that. And as we were talking, he's like, yeah, I'm in Raleigh. And I think his wife was going to the Pearl Jam show and I was going to the Pearl Jam show. And we ended up talking about that. He's like, we definitely should get together and grab a drink. And I was like, yeah, for sure. And maybe two weeks later, three weeks later, I was like, did I connect with him on LinkedIn? I went to his LinkedIn and it was completely gone. and when I called the number it went to someone else and I left a message and someone else called me yeah he's been around with us forever just kind of like me a little bit longer than me and he's kind of had every little role and we were going to have him because we don't have as many conversions because he was doing conversions and we were like why don't you come over to support he wasn't very fond of doing support calls all day so So he's like, I think I'll just do it, like just do the conversions when we have them. So he's still doing our conversions. He's just not. Yeah, he just he kind of like he did this before and it just wasn't his favorite thing to do. So. I get it. I get it. It happened. All right. Well. I probably shouldn't say it that way but yeah he just he just you know wasn't a fit for him anymore he just didn't want to be on the phone all day so some people can do it some people can't yeah like a recruiter so you know I'm sure you've hired people and they don't want to be on the phone all day yeah no and and those are usually like I have one like that now and it's because she's bilingual and I'm like look that's why I changed her title of sourcing specialist I'm like you just update my shit and we're good you know like pull some stuff off of linkedin organize my shit and we can we can work with that but yeah no it can be exhausting you're on the phone all day it can be exhausting it's yeah he's just kind of like and he preferred it like kind of just you know he's kind of settling down. He's been doing this for so long and stuff. He's kind of wanting an easier life now. I mean, I think we can all relate to that. I would love to be retired right now. Well, if I do stop at the Village Butcher, I'll make sure to grab you a PLG and drop it off at the office there for you. well we actually um just kind of working from home now so you'll just have to call me before you go yeah i always work from home but i'm right around the corner so you'll just have to call me up for sure for sure um i'll give you a call okay all righty well have a great week and um i sent you that link for the custom applicant tracking report you might find that helpful i think i it's pretty detailed about like what each filter does and stuff like if you wanted to create a custom one so it's how to create it and then how to run it i'm looking at it right now and i think i does it have the new um i'm looking at it so i and i'll be able to put custom fields in there to track? I'm sorry, wait, what? It'll, will it pull custom fields? Yes. Yes. So part of the setup is you'll go through and you'll pick like, you know, like how the report that you just ran, how it was like position stuff. And then below it, like name person. So when you set it up under position by you'd only pick fields that come from the company or position. whether they're predefined or custom. And then under where it says interview body, you think of any time you see the word interview, just think of a pipeline step. That's where you'll pick fields from either the person or their pipeline step, like the date, the time, the person's name. But as long as it's a predefined or custom field, you can pick it. And the interview body rows. Correct. Yeah, so in the first section where it says, yeah, there's position body rows. So in there, you only pick company and position fields. And then below that, where it says interview body, that's where you pick things like first name, last name. You know, like, and anything starting with interview is related to your pipeline. Interview was kind of the old terminology that's been relabeled as pipeline. but what if it doesn't show in the pipeline or like if it's a name record the custom field that I've created that shows their book of business would that pull from there as well if it's a custom field you can pull that in there what their book of business is okay okay alright yeah I'm looking at it now so I can I will play with this probably next week. I think this will be sufficient. I'll just give them an update of who is. Now, if they ask for a more sophisticated report, I'll certainly just call him back and purchase a block. A block of time. All right. But I think this should be sufficient for now. Yeah. Yeah, the documentation hopefully is pretty detailed. If not, I didn't do my job well, so. No, it looks good. It looks good. I'm just going to have to, like, I'll have to go through it very slowly and read it. And I don't have a ton of time to do that this week, but next week I will. Okay. All right. well um think of anything else just let me know okay I will it was good to talk to you yeah it's always a pleasure alright I'll talk to you later alright see you Robin alright bye bye bye bye Good.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2588.29898,
    "salad_processing_time": 867.9644877910614,
    "overall_processing_time": 2588.29898,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling MainState.  This is Robin.  Oh, hey, Robin.",
    "job_id": "40d130ad-c592-4409-b7eb-b97ecc8896d3",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling MainState.  This is Robin.  Oh, hey, Robin.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3026323746037.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}