{
  "recording_id": "3027512786036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:40:54.991347Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:40:54",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hello, you've reached Mackenzie. How can I help you? Hi, Mackenzie. I'm Connie Rose. You will have me listed under Connected Services, I believe. I was then a Raymond, but you probably have it under Financial Improvement International. All right. How can I help you today, Connie? Well, it's a simple thing, but not so much. I'm trying to learn a lot of software at the same time, and so I make a regular call. Sometimes two or three a week, Andy, you guys. I created an email and saved it in draft yesterday. And so I found it. I found the email. I've got three different email addresses with this company, so there's some of the confusion. But I actually addressed the email to a vendor of ours. and so where I found it was under the personal area not really under financial recruiters and not under Alexander Raymond I'm not sure why it was there but there are no drafts anywhere else I've looked in the other two email addresses and don't find it and that's not a problem because the send to email address is correct this is simple but difficult for me I can't seem to get these emails to open. When I try to open it, I double click on the email to just review it before I send it. I get a no matches found and I'm just trying to click on it to open it. So what am I doing wrong? I mean, I'm looking at them. It might be best for me to see your screen. Do you mind if I send you an invite real quick to join a meeting? sure all right give me a second to put that together are you sending it under alexander raymond um i was going to send it as myself my name is mckenzie and uh it's just going to be like a google meet is that okay i can't hear you very well what was the last thing you said i was just going to send a Google meeting over. Is that okay? Okay. Okay. And are you sending it via email or? Yeah, I was going to send it via email. I'm just creating the invite right now. One second. What email do you have? I just want to know where to go look for it. I was going to ask you that, actually. I was going to say, where should I send this to? Hang on one second, because, you know, I don't know why this is. I have to investigate further, but I really hadn't had time to put my mind to it. You know, I have Gmail, right? I have three email addresses. And so occasionally, even though it's pinned to the toolbar and it's also pinned to the phone times, it will just disappear, right? And I have to put it back up there, which I just did. Email address for me. Thank you. Let me make certain because, like I say, I've got a bunch of emails and that's part of the problem. Okay. It should be Connie, uppercase C, D-O-N-N-I-E, at Alexander, uppercase A, Raymond, R-A-Y-M-O-N-C, uppercase R, dot com. It might reach me without it. Alexander Raymond R R-A-Y M-O-N-D dot com so the uppercases are C on Connie A on Alexander and R on Raymond okay Connie at Alexander Raymond dot com it says I'll just do it right now. Alright, I just sent you a meeting request via email. All right. If you'd like, you can turn your microphone and camera off. We just need the screen share capability of the meeting. We can't see this right here. We just have to go share our screen. This should be the right one. Are you seeing Chrome? Yes. Okay. Yeah, I see. I'm still kind of... Nope, that's not it. Where did I leave that? I just had it open. Okay. You might have multiple Chrome instances which all have multiple tabs, perhaps. If you hover at the bottom of the Chrome icon at the bottom of the screen, you might see multiple show up there. No, not at the bottom of it. I'm on PCR, so maybe it should be somewhere. Yeah, the Windows 11 interface has a bunch of icons along the bottom of the screen. Right, right. With Chrome, just hover over Google Chrome. Um, and you'll see, okay, so you have, okay, no, no. Okay. You only do have one tab. Nevermind. Sorry. I thought you, I thought you might've had like another one open. Um, okay. Right. I do that. I do. I do that sometimes, but I had, I had email opened and now it's gone. Oh, you can just open it again. Right. Uh, just go up to the top right corner and click PCR mail. Or are you talking about like clicking on an actual email on this am trust financial services record? I guess I'm asking you like, yeah, like show me an example of what's not working yeah well hang on one second i'm trying to get it straight in my head why i had pcr email open and now it's not open i don't see email there okay let me just make this think this through and see why this is now gone it'll do this it'll it'll just disappear and I'm like what the hell then I have to find it and try to reload it so basically I'm trying to get to an email that I did inside PC going to one of our partners offshore and now I don't think it is taking me back to this original basic search I I don't really want to send an email that's inside to one of these candidates inside Antrust Financial Services. What I want to do is send an external email to one of my partners. I would draft an email going to info at offshore, recruiters.com, and I was attaching emails to them to offshore to, you know, make sure that I do that. I'll send a batch of emails with resumes attached. I'll send an email with a batch of resumes attached. I've already entered the resumes into the system, but she's kind of a false safe since I'm new to the software trying to make certain something hadn't been left out that it shouldn't have been left out. You see what I mean? and so now how do I get in to just if I go up here to email and hit that you get that message the very thing that sat here even overnight in sleep mode is now gone and I don't know where it's at I don't know I know it was saved in draft because I saw it I saw two of them saved in draft so I don't know there's a there's a a PCR icon in the top of those tabs it's like purple and green and blue it's three to the right of the tab you're currently on what's that what's that show you okay I can barely hear you your voice the volume's down I can barely hear you okay sorry I'm checking my phone to see. Clicking my phone to make certain volumes all the way up. Yeah, it's all the way up. So what tab should I click on up at the top left, you said? Very top of your screen in Google Chrome. There's like a bunch of icons. You're currently on the PCR one. Can you go to the right three tabs to the right of the one you're currently on? That's a PCR icon. Is that a tab of PCR open? You're talking about this right here? Okay, no, that's the capture tool. That's the capture. That's Gmail, Gmail. Are you looking for the screen that opens when you go to the cog wheel in the top right corner and click email? Well, I've done that. It's the first option. Let's see if it will pop back up. Okay, let's see where it is. So here, no, that's photo school. Hang on one second. I need to get... Here we go. It was just personal. And you see where my mouse says draft two? Here they are. I'm not sure because I'm not sure how Kevin, he's the owner of the company. I know I have a Gmail. I have two Gmails under Alexander Raymond and then also Financial Insurance Recruiters. Okay, I have that. And then I have a third one. But when I did the email and I did it to the extension, financialrecruitersinternational.com, you can see it there on the screen, right? Can you see that? Yeah, I'm sure you can. I can see it. I can. In the window. Why did it throw it in personal? That's my first question because I would never have looked there. I went into financial recruiters. And then we dropped this ticker error, and then you hit draft there. It doesn't show. So I'm just curious as to why that happened. Because I would have never, if this hadn't happened, I would have never went to personal looking for it. In fact, I spent quite a bit of time. I understand the confusion, and I can explain. so I actually before I start explaining though I do have to take a look at your like actual setup on other screens I'm just going to pull you up on my end just give me give me like one minute please take a couple minutes to look at like your settings that you have so I mean I'm I'm basically going to log in as you and take a look at your email settings if That's okay. You're in Connective Services Database? Yes, Connective Services. What's the username that you've logged in as? I can't see it on your screen right now, unfortunately. If you go to back. My email or username for what? Oh, shoot. Now you're going to see why I've got things put up here like that. I know an easy way to get it. Connie. It's just under my first name, Connie. Oh, okay. Thank you, Connie. All right. Heather made it easy for me. She put everything on the spreadsheet, and let me tell you, I went to that spreadsheet more than once. Yeah. There's another easy way to get it. You can hover over the tab of PCR and it'll tell you your username and database that you're logged into. Not the PCR mail tab, but the other one. You just hover over it in Chrome, like at the very top, the PCR icon, 1, 2, 3, 4, 5, to the left of the tab you're currently on. You can hover over the tiny little PCR icon there. Yeah, it'll say it says Connie Connective. That's a username slash database that you're logged into. That's a quick little trick. Okay. So, all right. So I'm logged in as you, and I see your box is there. I'm going to look at your mail server here. It is an IMAP account. Okay. We have two different ones. Are they both set up? That's good. Okay. Okay, great. And I'm not sure why two were there. I might have went in and tried to add more resumes, but I'm not quite sure. But four or five resumes on this email. Okay, so the personal inboxes. Let me explain those. So the personal section is kind of there by default. When you create a new username and like the first time the user goes to the PCR mail, they kind of just create themselves by default. And the reason why they're there is so PCR can put things there if it needs to. And in this instance, those two drafts, it felt the need to put them there because it didn't actually send them yet. It's kind of a weird explanation of how email works and the evolution of how PCR worked over time. Because the PCR mail screen is, I guess, quite dated. and so like the UI just looks kind of dated at this point but like the way the folder structure works is kind of held over from older versions where they needed to have like these defaulted folders there by like by default because there are certain commands in PCR that put things there and they just like need to be there and the reason why the drafts are there is because they haven't been sent yet like if you actually sent these they would how can I open them how can I open them and how can I open you should be able to select them and then maybe there's like an option in the action menu to open them is there a in the hamburger menu like a right above that not that one the one up right above that one is there no there's no open there's not even an edit if I could get an edit I could do it oh there's no action to open up the email which blows my mind. You can't double click on it or anything there. Yeah, I've been clicking. I did it for probably 30 minutes last night. No matches found. Go ahead and click that one. Click this one. No matches found. Can you click on the subject line of it? I know that doesn't seem very intuitive. What subject line are you talking about? Here? Yeah. Okay, that's where it opened. I didn't try that. I don't have any email, and I got a lot of emails from my company that I had formerly. These three emails I've got here, I've got four or five emails. never have to double click in the subject line. Never. Not complaining. I'm not dissing your software, but I'm just saying that's kind of crazy. I know. That's what I was saying. It's like a dated screen and sorry about that. And here, I don't see any attachments in this one. So let's close this one. It does not look like they have attachments. There's the attachment section on the left. There's like a little paper clip. Hang on a second. Let me make sure. It doesn't look like they have them. I attached five resumes to this email. And by the way, there's no body here. There's nothing. Nothing. Could you tell me how you saved them as a draft? Can you go through the process of how you saved them as a draft? I'm trying to remember, but I really can't remember. I must have had an option to do it or I wouldn't have been able to save them. This is crazy. This is what I'm going to do. Now that I know that I've got to click in the subject boxes, it's definitely worth a call. I'm going to delete these two, and I'm going to go under Alexander Raymond, and I'm going to send an email to offshore straight from there, and I'm not going to do it through PCR. are just simply because I'm having to double work and make a phone call and the time wrapped up in all of it you know it's just I just don't want to do it again you know I'm just and now so I'm going to flip both of these and I'm going to hit delete if that'll happen okay good so now we'll go here it'll still track it through PCL so now I'm in here, Alexander Ramis, he's got the Gmail, which is fine because I check Gmail. I'll just make sure I'm doing this right. So I can reattach the resumes, send my little blurb, and hit send, and we'll be off. Yeah, down here, save as draft. That's where the draft option came in with the other two emails. so but fortunately I have learned a rule over the years that before I throw the resume in the trash I keep them in my folder and I make certain that that resume went and it was received because if I don't I will not remember anything about who I sent I probably won't because there's one, two, three four, five, six. I'll just reattach them and do my little thing and send it. But I appreciate you sharing screen and helping me out because I learned a few tricks here that I didn't know. Could we just test it real quick so I know that it'll work? Like if you add, go to the attachments on the left. Yeah, let me go ahead and... And just save it as a draft. And it's not quite as, what's the state of the art is like Google, where it'll just kind of save every keystroke. It'll like after a pause, you kind of just, it'll save. You actually have to hit save like after every change. So right before you close it. So if you're saying that the body's not there and the attachments aren't there, that might be something we need to like fix. So I'd like, I'd love to see you try again and save an attachment and see the attachment save to the draft. because if that's not happening then there could be a potential bug that I could report and potentially let me just okay the first one I decided to wait and send because his resume was outdated I have to stop and think because my counterpart over at Offshore, make sure the date on this is the same she just does not want pds she wants all word attachments for some reason now i have to remember that things going here I would. Usually it's the other way around, right? People don't want tone. Word. I would say yeah a lot of when I was applying it was like PDF was preferred. Yeah for obvious reasons right. I don't question offshore. I can't question them. I just do what they ask me to do. You know. You need like paid tools to edit them at least. With PDFs at least. And there's like better formatting or the formatting doesn't like change yeah I'm gonna see if I can run down Todd the word formatting is not a university whoops her name's got a funky spelling always here we go just make certain that that's what I want yeah I bet let's see we can get one more in there odd Okay, you've got a lot of attachments on here. Well, it's not really that many. It's not that many, but for me, I've got 20-plus thousand resumes to come over, data from my previous company I had for 22 years. So we've run into a snag, okay, with that. Meaning I went back to my IT provider, Wolf Technologies. I told them exactly what I needed. I need candidate resumes and client contact information in an Excel spreadsheet. Boom, send me a quote. They sent me a quote. I said, boom, send me a way to pay. They sent me the QuickBooks I paid. What I got was not an Excel spreadsheet. It was thousands of documents covering candidate, client, everything, notes. I didn't need all that stuff. I didn't need applications. I didn't need I-9s. I didn't need all that. I didn't ask for that. But the real thing that bit me, they sent it all in folders. You cannot convert a folder into a spreadsheet. You cannot do it. And it's like 20-something thousand folders full of resumes, two or three resumes at a time inside one folder. I mean, it'd take like seven hours just to extract them. And you can get it extracted, which I couldn't. I sent it to offshore. They couldn't get it extracted. And she said, if we could get it extracted, it'd take me seven days to get it all in here. That's how much data it is. So now – That is just kind of the nature of the beast when you're dealing with a lot of attachments like that. It's hard to quantify, you know, 100 different types of documents. Well, the thing is, when the resumes are saved in my system, resume, blah, resume and the name. And then, of course, the system, you know, dates it. You know, you can hover your mouse and get in. So it wasn't like it was just a bunch of resumes piled together. They were named individually in the system, individually. Okay. And it does require a parsing tool to parse resumes from a folder. There's a special kind of technology, right? but they've been more work they work with me for 15 years they don't know who they're working with of course they do now after i've paid the money to ask for the owner and the developer are into a fight about how they he didn't charge me enough and it's very hard it's not easy that's how it's in our system we can't you know i'm not going to spend any more time or money in that direction because you've already proven that you sent me my data, but I can't extract it. What use is it? So I want to give you more money to screw around with me another two, three weeks? No, I'm not going to do that. No, no, no. The tool that you have had like an exportability like PC Recruiter where you could like put, you know, some like five records, or sorry, five fields that you want to export, and you just like export. I can't speak to the software they had on their end. That'd be perfect. Right? I can only speak to the software on my end. I had the ability to search, whatever it was, commercial lines underwriter, you know, aviation underwriter, commercial lines account manager, whatever it was, I put that in, I put a location, and I'd get a sheet of things and resumes attached in the system as it came across on my website. That's what I do now. Now, if I can do that on my front end, they can do that and then some on the back end. I'm no IT expert. I'm not going to profess to be that. But I'm not happy. And I don't trust they can have me in this vortex of money and time until Jesus comes. And I'm just not going to be there. I'm not going to be there. I've gone to two more IT companies that specialize in parsing. And I also went back to GoDaddy because they were my host. They would host the URL. and I spoke to one of the lead developers and he goes, I'm not going to help you with that. I said, well, if you think you can do it, I'll send you over some of the folders and you show me that you can put that in a spreadsheet and then I'll let you have the job because I've already been burned. It's like I'm being extorted. Oh, well, I can do this, but it's going to take me X amount of days and you're going to have to pay for 25 or 30 hours more of work, blah, blah, blah. I'm just, I'm burned and I don't want to. Are you asking them to take like, for example, this that I can see on your screen right now, PDFs, DocXs, Excel, all these different file types, and then make a spreadsheet of it? What I'm asking them to do. Is that what you're asking them to do? What I'm asking them to do is like, now what I have in here in my PC, it looks vastly different than the website. Okay. The data that's in that website, each name, say John Brown, everything that goes to John Brown, resume for John Brown, application for John Brown, exams for John Brown, notes on John Brown, all that's all associated with that name, the resume. And they all have either a Word or a PDF or both resumes in their file names. the resume is all I want to catch and as the resume comes over in a spreadsheet if you've got your field mapping right first name, last name, etc it'll pull from that resume and drop it in is it going to be 100%? maybe not but it'll be close and the things that need to be cleaned up I could clean up myself that's what I'm asking that's really the most important part is the resume because you can pull candidate information from a resume. You can pull that really. That can be pulled and extracted fairly quickly because I've been on phone with IT before sharing screen with them and watched them do it. So with the number, with the volume that you have, it's going to take more time. And I'm okay with it taking more time. I just know that you can do it. and at the end of the day I can take all my data that I worked all these decades on and bring it here to Alexander Raymond right now I can't do that you're seeing my screen right I'm going to show you something yeah I can see it oh here we go you see this right here all files all files zip yeah but that again then you got candidate for question and for your job so let's go to canada see all these folders goes down about 21 something thousand it just goes and goes you can you can tell so when you open let's just pick 36 you got two documents in here uh oh did it attach that you're looking at uploaded 36 files hang on a second I'm looking at my email I need to delete this oh yes right that's what it's called 36 so while I'm in here let's go ahead and how can I get back to my main screen where I can type something in there that was the other thing see what I'm saying How can I get back to the body of my email? If I close this out... On the left. Don't close that out. That will lose all your progress. There you go. Okay. And before you close, you'd want to hit save as draft, and then we're just going to make sure that it keeps all the things that you added, right? Keeps the subject line, keeps the body, keeps the attachments. Let me make sure I got her name spelled right. A-R-C-H-A-N-E. Yeah. Okay. So I should always save as a draft before it hits in? Yeah, if you want it to be saved as a draft, you've got to hit save. It's not going to automatically save like Gmail would. It's not as state-of-the-art as that. So if you want it to be saved, you definitely have to click it. All right, so now then let's see if that's saved correctly because it would be an issue if you were to go to the draft in the drafts folder and it wasn't there or it doesn't have all those attachments. That could be like a bug that you need to fix. Should I return to mail or close? Either one is fine. I think actually. Oh, I guess you'd have to close this one. So I guess close. Yeah, you can close that too for now. Unless you want to send it, you can send it too. Yeah, I want to get it sent because I wanted it to go yesterday. So let's see now. Let's see. Get it to this folder. I don't know if it will update automatically on the left. It might periodically refresh that. You might have to just click drafts. Even though it says zero next to drafts, it might still have one in there. There it is. It went. I'm just not understanding. Mm-hmm. Yeah, see the date, 7-24? What's curious to me is... Why is it pulling personal? I'm not quite sure. I don't care, really. I didn't know. It's kind of like a quirk, and it goes back to how the screen kind of evolved over time and also how email kind of works. If you can click compose email, it'll help me explain a bit. Just open up a new email. I hit the compose email screen. It's like the little letter icon in the action bar. the other action bar a little bit down further in the top frame. Not on the main toolbar, but yeah, that one right there. Okay. So when you open up a Compose email screen, the From field has a little drop-down arrow. If you click that From field, you can switch between who you're sending from. So if your username has multiple email aliases set up, you can switch between them there. So before PCR actually sends it, PCR is not making any assumptions on like who you're sending from, even if you have one set there. And by the way, a lot of times when you open up the screen, it just pulls the first one. Like the from field will just pull like the first one you have set up. So, like if you haven't touched it at all and there's maybe potentially four options, we don't want to make any assumptions on like who we're sending it from. And in order for the email to actually make it to the draft folder of your actual email provider, I don't even know if we have that capability because the draft is sort of like a different thing, right? It's like we didn't actually send it. We just kind of have like a thing that the user might want to send as. And then like when you actually go to click send, we'll know who you're sending it as. So that means we can take the message you would like to send to the intended server and tell that server, hey, we want to send this message as this person. And then that will go to your actual email provider and that will actually send from there. And then they will create their own like version of that email in the sent folder for you. Okay, that makes sense. default. And then like kind of over time, the screen evolves or whatever, but those kind of stay there. And then the fact that we don't really know who you're sending it as. So we just kind of put it in the personal draft folder and actually send it. It will go to like the actual email provider that you chose and everything. And then, you know, it'll show in the sent folder there. So that's just a quirk about the draft folder, but it's a good eye that you notice these things. Like you're very astute and you know, it's kind of PCRs. kind of has weird quirks like that. But that's my best explanation as to why it goes there. That's just kind of specifically for drafts, really, I think. Yeah, I mean, there's lots of ways to send it. I can do it in PCR. I can do it in Gmail. I'm just tracking. Tomorrow when we have our morning meeting, we have like an hour morning meeting every single morning. I'm going to ask the team, hey, what do y'all do? Do y'all send them through PCR and let it track through there? because I do know Gmail is tracking through Prove-A-Score and all that. It's tracking through the whole system. What are y'all doing? If you have Gmail set up, then you can do something in Gmail and eventually it'll make it to PCR and PCR's activity writer will look at the email and write the activity for it. You could do it in theory in either one. You could ask the team what they like or prefer. It's an unusual thing. Normally people don't call you up and say, I got, you can see I got three emails here. Gmail, Financial Recruiters, I was in a room. And then I got a fourth one at EmpireRecruiters.com. And now, so you can imagine with this transfer of power over here, transfer of data, and people getting notices sent out on LinkedIn about my new position and what I've done and all this kind of stuff. It's a zoo. It really is. but I'm trying to navigate it. It's not going to be like this forever, but it is right now. I wish you the best of luck. I appreciate it. I need all the prayers. Anyhow, I'm going to let you go and get back to your next customer. I appreciate your time, and you've been very helpful. Have a wonderful day. All right. Well, thank you, Connie. Have a wonderful day as well. I appreciate it. We're on two different things. We're on the Google Meet and also the call. Right. I'll pull off both. close both. Yeah. Thank you so much, Connie. Have a wonderful rest of your day. You too. Bye-bye. All right. Thanks. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 881.450008,
    "salad_processing_time": 98.45236611366272,
    "overall_processing_time": 881.450008,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hello, you've reached Mackenzie.  How can I help you? Hi, Mackenzie.  I'm Connie Rose.",
    "job_id": "3048bd9b-1288-43e8-b8fc-0cc750f84f74",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hello, you've reached Mackenzie.  How can I help you? Hi, Mackenzie.  I'm Connie Rose.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3027512786036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}