{
  "recording_id": "3030621263037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:42:48.859525Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:42:48",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is Garrett. How may I help you? Hi, I have an open ticket with you guys, and I'm just wanting an update on when I should be able to get support. Sure. Let's take a look. What's your name and what company are you with? So I'm creating a ticket on behalf of one of our clients. My name is Lainey. It should be under my name. And then their company is Qualitech. Qualitech. Okay, let's see. All right, let's see if there's any tickets open under Qualitech. Let's see. Okay. So I see a ticket open here, PCR Outlook Plugins. No, that one was resolved. This is a different issue. Do you have a ticket number at all for that? Oh, I found one. Let's see. This one, what's this topic here? Jason replied about three days ago. He said, can you provide me an email address from the bounces that are sending? So this one about bounces then in Outlook? Yeah, so the client, he sent an email to about 300 people. from PCR and he's only seeing three bounce back messages in his Outlook. Usually it's like way more than that. For bounces, okay. All right, so let me take a look here in the database itself. I'll just log into the Qualitech database. Do you know the database name? There's a few under Qualitech. Let's see, there's Banking, Engineering, Houston, Optics, QTSI, a few more. No, I don't, but I can try and get him on the other line. Okay, yeah, let's try that. All right, do you have a direct line in case I lose you? We don't have direct lines anymore, but you can call back in and ask for Garrett if you use that same phone number you called. Okay, let me try and add him now. Just give me a second. I'm going to put you on hold here. All right. Thank you. Thank you. Thank you. . You have reached the office of Mike Vineyard. I'm either on the phone or out of the office. Okay. I can leave him an email real quick. He usually responds pretty fast. Gotcha. All right. What was your question, though? Maybe I can just… So, yeah, if I'm trying to log into PCR as that user, they'll first have to select a database. There's maybe about 14 or so databases under Qualitech. I just need to know which one. Okay. Let me look. Do you see one titled Qualitech? No, yeah, so Qualitech is kind of like the overall account, and then there's about 13 or 14 databases underneath that. Oh, I think it might be under like Pinnacle FES. Oh, instead of Qualitech. Oh, I see. Okay. Let me look up Pinnacle. Yeah, I believe I just recently had to find this out for helping them with their Outlook PCR plugin. I think it's under Pinnacles and then it's Qualitech. I don't know if that's the one he uses specifically, but you should be able to see him in there or not, right? Yeah, I could log in and see if there's... So, what did you say the company was, Pinnacle? What? Was there extra words there at the end? Pinnacle FES, no space. F-E-S. F as in Frank? Yes. Okay. Okay, so we don't have an account with Pinnacle. We have Pinnacle Search, LTD, Pinnacle Sales Recruitment. Yes. Pinnacle Search Professionals. Pinnacle People. Okay, what's the customer's name? Maybe I have their first and last name in our system. Okay, so it's Mike Vineyard. M-I-K-E-B-I-N-E-Y-A-R-D. Okay. Okay, he's coming up under Qualitech Group again, that original database there. Okay, try Houston then. Do you see that? Oh, yeah, I see the Houston one. Okay, let me try that. And I can log in and get a customer list to see his or a user list to see his exact username. Put something like in there. So it doesn't have Mike Vinyard listed in here as his own username. Let's see, is there any other database you would guess? Maybe SEL. Okay, let's try that one. No, yeah, not seeing them. Mike Vineyard listed here. Okay. I could actually just kind of start going through them. Yeah, I believe it's going to be under that. What is it called again? Pinnacle FES. What if I give you the exact name? It's C-O-B-C dot P-I-N-N-A-C-L-E-F-E-S. Okay. Okay, so is that like the database ID there? Maybe I can try this. Let's do ODBC is going to be Pinnacle. There it is. Okay. There, yeah, I do have Pinnacle FES as a part of a web address to get to the login screen. I got that. And then Qualitech is underneath that. Okay, this is getting us in the right place. Okay. Okay, and this should be under there. The usernames I have are admin, copy, Gina R, and Sam R are the only usernames under Qualitech. there is a second database there's only two databases under Pinnacle FES one's called Qualitech and one's called Config maybe he's in Config no okay nothing Config so he might be just under the username okay a different email he uses but this is not what that mass email was sent from Yes. Oh, Mike Vinyard at QCGLP.com. Okay. Yeah, I'm not sure. He's not listed in the user list here. So yeah, basically the information we'll need from him is his PCR login web address, the database he uses, and his username. And then we can check all the settings for email and make sure it's all connected and look at some of the email campaign issues. Let me make a note in the ticket here. Or I could actually just reply to the ticket and then you'll reply to that support ticket you have open. And then we can just ask Mike next time you get a hold of him. And I'll just type that in here. So we will. OK, so it's the database he uses, his PCR login. And what was what else? Username. Yep. I have access to his computer, and I've gotten permission from him to hop on anytime. Is there a way I could possibly see the database through there? Yeah, if you're able to get onto his browser, he might have a bookmark that takes you right to his PCR login screen. Okay, let me check real quick. Login into the remote software. Perfect. Thank you. you you Okay. I'm in right now. I have it pulled open. Okay. So in the web address up at the top, it should say something like if you're on the PCR login screen, it should have like a ODBC period and then the company's name. Yeah, it's ODBC period Qualitech and style sheet. It's logged in already. Okay. Let me go to that login screen. And so if you're logged in already, at the top right, there's like a profile picture circle. If you hover over that, does it give you – it should give you the name of the database and the username. It's – when I just hover over it, it's saying mbv.org slash engineering percent 202. Okay. So engineering... Okay, so yeah, there's two databases. So yeah, we're under the Qualitech web address. There's two engineering databases. One's called Engineering. One's called Engineering 2. And it puts in like 20% or something weird whenever there's a... Let me see if it's going to show me the same thing. Okay, no. So let's do engineering 2, I think, based on how you described that. Yeah, okay. Engineering 2, percent 202. Okay, so that means his username is the MBV. Yeah, MBV. Good. Okay, so we got to the right place. Yeah, he's verifying right now. engineering. Okay, yeah, so the engineering two database and the MDV is the username. All right, let me check his email settings, make sure they're set up correctly. And okay, outgoing mail is set up correctly, that's good. Incoming mail... Okay, so his incoming mail connection is not working properly. He needs to reconnect. So it might pop up where you can just hit next and it'll already have his email username and password saved on the browser. If you don't know that, we could try that first to reconnect that, but then check another spot as well. Okay. Am I able to, do you guys have a remote software I can give you access to the computer? I can, we could do, go on a RingCentral meeting and I can, you know, look at your screen if that helps. But we would just basically need your, his email password. But it might already be saved in there. Autofill is what we're hoping. so you don't have to find that. So basically, we'll have you go to the top right of PCR, click on the little gear icon that's next to that profile picture circle, and it'll give you a drop-down menu. And then select email? Yep, select email. That'll open up PCR mail in a new tab. And then go to configure at the top left, another gear icon. Okay, I see that. configure. Below that, go to mail servers. Okay. And then in the bottom frame where there's a little action drop down on the left next to Mike QCJLP IMAP, click on that to edit the little action drop down. Okay. And then it looks like his email provider is Office 365. So if you click on sign in with Microsoft the black button we're hoping that it'll kind of autofill the password and let you connect and sign in the passwords inserted but just go ahead and hit sign in with Microsoft anyways yeah it looks like it's the incorrect password the connections been lost so we'll have to reconnect to Microsoft so yeah just click the sign in with Microsoft button Okay. And then I think what could have happened is I see his email as Mike Vineyard QCGLP, but he says that he sent the email from at Qualitech. So maybe the different emails. Oh, okay. So yeah, you can exit that pop-up then. So, all right. So in that case, let me check his outgoing mail address. Yeah, his outgoing mail address is what you just said, the mvineyard at qualitech.com. and that connection set up properly. The incoming connection is under mail server, so what we were just looking at. And he has Mike Vineyard at QCGLP. That is kind of the set of folders that PCR is scanning on the incoming. Do you know if the mvineyard at qualitech.com Just four words over to MikeVineyard at QCGLP.com. Is it kind of the same, just like an alias? Or are they two separate email boxes? I can log in and check, but let me see it because we manage their Microsoft accounts. I can take a look. Let me see if I can get him on the line. Maybe now he's looking at the screen so I can text him out here. Okay. Okay. He's giving me his direct line right now. Okay. This is Mike. Hey, Mike. This is Lanie with the consortium. I got Garrett here on the line. He's helping us out. We just got a question for you. Do you know what the main email is? And it is, like, at Qualitech, is that your main, or at QC? GLP, is that the main one, or is one of them in Elias? I think the main one is mvineyard at Qualitech.com. Okay. Hi, my name is Gary. So basically, we're inside of your PCR account, signed in under your username, and your outgoing mail is set up with mvineyard at Qualitech.com. But your incoming mail that monitors things like your email campaigns and things like that is your other email address, the mikevineyard at qcglp.com. So without having those match, we really can't investigate email campaigns and see what went wrong with them. will need to have a mail server or your incoming settings set to the same one you sent from, the nvineyard at Qualitech. And this is just a refresher. We're looking at the issue where you said you didn't see many bounce backs on a certain email campaign you sent. So, yeah, that's what we're just trying to fix at the moment. Yeah, I mean, it seems like for months I'm just not getting replies to emails. But, you know, nothing's changed in the however many years we've been with PCR. I haven't gone in and changed it, unless somebody else has. Do you know if mvineyard at qualitech.com just kind of forwards all the email over to mikevineyard at qcglp.com? Maybe it's just like it forwards all the mail to that older email address. You know what? Honestly, I don't know. I've got a couple of different emails, but that M Vineyard, that's the only one that it's only used through Microsoft. Gotcha. So everything else is – everything is Mike Vineyard, either at Qualitech or QCGLP. Why that – no. So I'm looking on his outlook now and we got the M Vineyard and at Qualitech and QC GLP connected. So perhaps it's being sent to QC GLP and he's seeing it there. Mike, can you kind of navigate to where you saw those last three bounce backs? I want to see what domain they went to. We're seeing that his email in that server is QCGLP, but he's sent from at Qualitech. So let's see where these bounce backs went to. Okay. Looks like it would have been the 23rd. I believe we talked on the 24th. So the 23rd, maybe it's under Qualitech because I think you're looking in the QCGLP. Let me see if I can go back to... These are the bounce backs. Okay. Okay. Let me take control here. This is a more further back one from July 4th. Let's see. Looks like QCGLP email. So that was from my previous emailer and that showed all the ones that bounced back from the previous. The one after that, I'm not sure what date I sent that. I don't think it was the 23rd though. So, yeah, I think moving forward, we should, inside of PCR, connect your newer email address, mvineyard at qualitech.com as an IMAP connection so that we can look over email campaign metrics and see that it's sent, things like that. Let's double check here. If there's anything you can go. Background. Okay. Do you want to, Garrett, do you want to be able to see his screen so we can kind of show you the way his emails are set up and see what you best suggest for connecting to PCR? Yeah, we could do that. Let me check with the Qualitech group to see if email campaigns are part of the account. I'll just quick here because we might not even have access to that anyway. Okay, so Qualitech actually doesn't have metrics and analytics as part of their PCR package. Okay, so I guess that wouldn't matter either way. So yeah, basically inside of PCR, we don't really have a way to monitor the performance of an email campaign without the analytics part of the package. So you're saying the basis of the issue is that you're not getting incoming mail into PCR or you're not getting like replies and incoming mail into Outlook when you send out a bulk email I sent out an email that went out to 300 people and I got three bounce backs at a minimum generally get at least 10% okay so closer to okay I mean then that's I mean you can see by that previous mailer that I sent out on the fourth how many you know bounce backs I had on that gotcha it's kind of you don't know what you're you know if you're not getting it you don't know if you're not getting one or you're not getting 100 right well the fact that you did get three does show that it's it is sending out and that you're you're getting some bounce backs. It might be that this set of email addresses you sent to was just lucky where you had all of them connecting, there weren't bounces. So if any of them are functioning at all with a bounce back, it seems like the process is working through PCR. It's sending, and then it's giving you those bounce backs. But yeah, unfortunately, inside of PCR itself, we don't really have any metrics turned on in your account as part of your package. So there's no way to really check on the number of opens, replies, bounces themselves. That would be kind of a higher package for the Qualitech group in general that you'd have to upgrade to. Right. But yes, I think it's good news that you did get a few bounce backs. That does show that the email campaign sent through PCR. So PCR seems to be functioning correctly. What made some of them sent? Not necessarily all of them, right? Usually if some send it all, that means the campaign did go out through PCR. So yeah, I would say that they all sent. There's just no way to really look at the metrics on that with like how many were opened or how many clicks you got in there with your current package. I know when I've done larger emails, say a thousand or so, it'll just stop. Right. Yeah. That would be closer, more related to your Microsoft account. You do have quotas and limits that you're allowed to send per hour or per day. so if you try to send a bulk email using that Microsoft account they might limit you and have it stop at a certain number okay okay so do we need to change the email addresses so that they are the same? So we have this issue, if there is an issue? It doesn't look like there's really an issue. Everything's kind of working in PCR. It would be, I think the only thing different would be, do you want to have incoming email activities being written on the records when somebody does reply? There's like an email received activity it's written on a record depending on your current setup that might not be happening only the outgoing email would be writing that's up to you if you're interested in having it. Yeah we had it set up before you know and I don't know why that changed I don't know. All right yeah so it's set up That's kind of the right now to look at. Let's see. 728, 2025. Okay, yeah, it looks like you actually do have it set up through what's called our PCR Outlook portal, which is the Outlook add-in. So that looks like it's functioning because I do see email received activity as recent as today, 728. email received don't miss the question mark on 4x miles at Apple okay yeah so it does look like you have that set up currently so you should be in good shape you'll get email received activities and outgoing email activities with your current setup so emails received should go to the proper record. Exactly. Yep. Okay. So yeah, one example, I just wanted to double check to make sure I saw one. There's a name in your database called Dale Scott, and he does have an email received on the 23rd, a few days back. So it does look like it's functioning for you there. so yeah I think you're in good shape and I wouldn't worry about that latest email blast you did I think it's working properly as long as you got a few bounce backs that means it is working and sending out and since you didn't go to such a large set of recipients not like a thousand or anything I don't think Microsoft would have cut you off or you would have hit a quota there on the Microsoft end so I think you're in good shape So, I guess in the future, if I'm going to send out a larger email to excess of 1,000 people, I just need to split it up. Yeah, I would recommend maybe split it into multiple days if you're going to hit above 1,000. You could also maybe take a look at Microsoft, maybe their help center. they might have some guidance on what those quotas are for your particular email package with them. It might be per day. It might even be per hour sometimes we see with certain providers. But, yeah, I would check on that so you get a good number from your provider so you know kind of how many can send per day. Okay. Okay. Okay, Garrett, is it going to make a difference for him to send an email through his at Qualitech or at QCGLP? Because his last email was sent through at Qualitech, and previous ones I've seen were sent through at QCGLP. Should he be sending through that rather than at Qualitech since it's logged in that way? What do you think? Let's see. So I think it depends on your. Let's see. Like he's going to I believe he'll see the responses either way because his emails are attached in the same server on our side. It's just a matter of messing any configurations up, sending through two different emails on your guys' end. So I'm just trying to see what you think. Oh, I see. Yeah, as long as you have that kind of set up on the Microsoft end where they are connected, like you mentioned, I think you should be good. the outgoing mail and incoming mail is going to be still monitored through the IMAP connection in that Outlook portal add-in. So yeah, I think you're in good shape either way, at least on the PCR side. Maybe those two email addresses might have different quotas on the Microsoft side. I'm not sure, but at least on the PCR side, I think you should be fine with either one. Okay. Thank you. Mike, are you good on your end? Yeah, I guess. I think so. As long as everything's working the way that it should. Yeah, it appears to be. I was thinking the same thing. It's probably just smaller emo and less bounce backs. But if you experience the issue again, we can definitely troubleshoot further. All right. Awesome. I appreciate it. Yeah, thank you for your help. Garrett. No problem. Yeah, reach out if you have any other questions or if anything else pops up. All right. Thank you, Garrett. Mike, I'm hopping off your computer now. You guys both have a great day. You too. All right. You too. Thanks. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 951.95233,
    "salad_processing_time": 134.76225543022156,
    "overall_processing_time": 951.95233,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence Technology.  This is Garrett.  How may I help you? Hi, I have an open ticket with you guys, and I'm just wanting an update on when I should be able to get support.",
    "job_id": "d32b5329-f9ce-476b-8207-c58c95377a7f",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence Technology.  This is Garrett.  How may I help you? Hi, I have an open ticket with you guys, and I'm just wanting an update on when I should be able to get support.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": false,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3030621263037.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}