{
  "recording_id": "3031220470037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:43:33.806193Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:43:33",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. How can I help you? Oh, hey, this is, is this customer support? Did I get the right extension? I'm having some phone problems here. Sorry, I was having a phone problem there just a second ago as well. But no, yeah, it's customer support. Yeah, my name is Mackenzie. Oh, hey, Mackenzie. Yeah, this is Gary Dorn with Corwell. I just had a quick question about, so I created a position, and I have a candidate that I want to link to the position and send out a meeting invite, and I can't remember how to do that. Sure. Um, so on the name record, if you open it up, um, you'll see in the action menu on the name, there will be link to position. Um, and that should bring up a window. Okay. Where's that again? So I've got the candidate's name up. Let me, uh, let me pull up your account just so I could be looking at the same thing you're looking at because sometimes things are different. It's so customizable that a lot of times I can't just say go to this spot because some people move things around. How did you spell your last name, Gary? Just so I could look you up. D-O-H-R-N. Thank you. Core Wealth Search. Yeah. I'm going to log in as admin. Well, I'm sorry. Which database are you in? There's six options here in the login screen. I am in Corwell Church. Okay. Yeah, an easy way to know is to hover your mouse over the tab of the Chrome browser. It'll tell you the username and password that you're logged in as. Or sorry, the username and database. G-A-D Corwell. Okay, cool. Cool. So when you link them to the position, are they already linked to the position? Well, I thought I was, but I'm not 100% sure. I created the position, and then I thought I linked it, but I don't see anything on here that shows it's linked. Can I take a look at what's the position record in the database? I'll take a look and see if there's... Yeah, it's an Ameriprise Orange County. Okay, let's see if I can find anything. Fuzzy search, Orange County. Oh, found it. Oh, I spelled it with a Z, of course. Okay, I found Ameriprise, Orange County. I'm going to go to the pipeline. Let's see if there are any names in here. There's a Paul Liu in the box of the pipeline. Do you know how to look at the pipeline? No, I can't remember. okay uh so okay then actually you're going to navigate to the position record ameriprise orange county it'll be appearing in the bottom frame after you select it like from a search or however you get to the ameriprise yeah open up the just click on the job title of ameriprise orange county wherever you do see it and it'll load it in the bottom frame and then in the bottom frame there's tabs near the top left of the bottom frame and one of them says pipeline if you click pipe okay so I pulled up pipeline so I see the see the position where there's like vertical steps of the pipeline and then Paul Lu is all the way to the left in the inbox and like the starting position here is that what you see in the pipeline well I've just got it says Ameriprise Orange County available full-time Katie Bailey zero to one. It's the pipeline. I'm on zero the first step. So I click on it. Okay, so that brings up Paul Liu. Okay. Okay, so I've got Paul Liu pulled up. Okay, so are you looking at the pipeline, the entirety of it, where you see the different colored steps from left to right? Yeah, reviewed, contacted, sent to manager, viewed by manager. That's where, yeah, I was trying to get you there. Oh, great. Now we're on the same page, literally and figuratively. And then so Paul is in the inbox. That's where they go if you just link them to the pipeline. So whatever you did before you called was successful in linking Paul here. You could also click inside the inbox, like right above Paul's name, search to add to Pipeline. There's a little box there. You can click in there and search names out and add people from right there if you wanted to. You didn't have to, if you know their name or email address, search. I think you could search on email as well in that box, if I'm not mistaken. So you can more easily add people there if you like. But you said you wanted to send him like a meeting invite, I think. Well, I want to send a meeting invite to Katie and Paul for a call scheduled for tomorrow. Sure. Okay. So I don't know if you use the pipeline, but in the pipeline, there are ways to do that. You could move them perhaps to like the contacted step or just right click on Paul's name and go to add step. And that gives you a screen where you are able to move them to another step of the pipeline. But there's a send email option at the bottom. Yep. Okay. which can send to, like, it'll pull up, you see content. Can you pull up add step first and make sure that you're on the same page as me? I did. And so I see at the bottom it sends emails grayed out. Do I click that to the right? Right, yeah, click the toggle switch. And then this screen does a little bit of legwork for you. It pulls up the contact of the position and the candidate that you're on, then you can check those boxes to send to like yeah so i just check on paul lou and katie bailey and then i can just um so that's the uh subject i'm going to say call tomorrow so the call is at 2 p.m central time 12 noon pacific time so is there a calendar or do i just type it in do you see how the send as meeting request checkbox is grayed out that's because above you have to actually schedule it so if you check the schedule box like in the section above it you can select the date time the duration and then you can send as meeting request it'll become ungraded so it's kind of okay so i go work from top to bottom 729 so what's the time zone i just want to make sure i don't get the time zone screwed up it should be your time zone. Are you working in multiple? Is one of these people in a time zone other than you? Yeah, so I'm in West Coast, Paul's in West Coast, and Katie's in Minneapolis. So I think Minneapolis is two hours. So I could just type it on the... I'm going to take a look at the username settings and make sure that you guys are set up to be the right time zone. So are you logging in as GAD? Yeah. I'm going to take a look at your time zone set in here. Pacific. I just unfortunately don't do this enough to remember. I should be doing it every damn day, but one of these days. Well, your username is in Pacific time. That's correct, right? Yep. Okay. That's good. Let me check the database. There's a database wide setting. If that's specific time as well, I'd say you just send it for your time and just assume that the correspondence will be in your time. Okay. So then I can just type. She's just the email recipient, right? So So we have no, we don't have like a way to verify the recipient's time zone. So I think in your message, you just might want to say like, you know, that time and then say Pacific Standard Time or PST at the end so that she could adjust because she knows, you know, everyone knows how to adjust for the time zones. So that's how I would, that's how I would go about it. I don't, PCR can't really verify Katie's time zone for you. I don't think just being like an ambiguous email recipient. Yeah, no, that makes sense. Yeah, so I was checking the international settings. The time offset is in Eastern Standard Time. Let me switch this to Pacific Time. I think anything from you would be from Pacific because you're your username was set to Pacific, but if there's like an automated process from the database, it might come from the Eastern time zone. So let me switch this over. And then if you send it, it should be good to go. I mean, I've sent them before and I've never had a problem. So I'm just going to put it in the, in the, in the Katie, we'll call Paul tomorrow at 12 noon Pacific time, 2 PM central time at whatever the number is. Okay. Okay. Well, that works too. But yeah, that should be the answer, right? And then if I save step, does that send the email or do I have to? Yeah, save step will confirm. You want to make sure you have the to selected, the from selected as well, because your username might have different email aliases that you send from. So make sure you select the correct one there. Change the subject line. Change the whatever you want in the letter to be. There are there is a template option if you wanted to make if you do this often you can make like a template and if you Select the template it'll load that into the bottom area. They don't have to write the email every time But yeah, that's how that's how you do That's how you move somebody through the pipeline, but it also gives you the option to schedule an appointment and like that Okay. All right Well, as I said, I should remember how to do it But it's that one step that I kind of forget is add steps You can right click on his name and just add the step because I can't remember how to bring this up But OK, hopefully they'll do it. And then I'll have another question, but I don't want to do it right now because I got to hop is am I set up to send bulk emails? I was looking at one point of sending a bulk email like over the 4th of July and it looked like there was some extra functionality that I wasn't sure if I had. Can you just tell me if I can send bulk emails with whatever the setup I have? sure sure sure let me log in real quick i logged out of admin and then i logged in as you in gad i'm looking at your email alias okay you have one it is currently verified working great that's good i go to a name search i'm just going to run an ambiguous search a couple names i go to a letter it sounds like okay it looks like yeah you have the ability to send the just normal form letters to multiple people at once. It's a bulk. You have the ability to bulk mail, but some PCR users purchase like a more expensive package and they have like the analytics and that gives you campaigns and you can send a bulk letter the same way, but basically it'll like track the opens and the replies and stuff. But you have the basic, yeah, you have the basic. You can send bulk email for sure. Yeah, it's just the basic. Okay, all right. Is there a tutorial somewhere on how to do that Or is this that I don't want to go into that right now, but should I just call back and say, hey, talk to you? I haven't brushed up on that particular article in the Learning Center lately. Like, I can find it, though. So I'm here on the PeaceHeart Learning Center. Sending bulk. Let's see what the search comes up with. I could email this to you. Maybe it's just under form right there. Are you familiar with the Learning Center? We have a website. Oh, I've probably looked at it. A lot of times when people ask, I come here and I search for terms that they're asking about, and I'll find steps. I'm not seeing send a letter. I'm seeing create a letter. It's pretty straightforward. If you run a search and you have multiple names that you want to send the same letter to, you just check them and then you click the letter icon and then you select a form letter and it'll change out the little insert fields inside the letter to the different fields that you've picked. So in the letter that you've created, you can say like, hello, first name. You've got to insert the right text to make it pull the first name field. But you can do that, create a letter, and then, yeah, you can send it to multiple people. I guess you do have to go through the create a form letter process and then learn how to send them but once you learn that it's you know it's pretty straightforward how I don't see a really great step by step on how to send but there's a whole article on how to create form letters I could send you maybe a brief step by step on how to send with the link to how to create them all right yeah that'd be great something to take a look at okay All right, Gary. Anything else? I know you said you had to get going. No, appreciate it. There's one other thing that I'm just going to mention while I'm thinking about it, which is kind of random. So sometimes if I'm typing, if I've got the browser open, I'm on a different tab, I'll come back to the browser and I'll type in somebody's name and it'll say record doesn't exist. And I'll type in the name again and it'll pull up the record. Is it, I mean, it's just kind of a weird, annoying thing. Any idea why that would happen? That seems strange. It's almost like it's timed out. I need to kind of... Maybe there's a timing issue. In my many years of troubleshooting, it feels like maybe there's a timing issue between when you come back to the screen, it loading and it actually refreshing the token or whatever it is. Because if you do... come back to a screen that you've left it will attempt to just resume right it'll and maybe refresh the token if it's not completely gone or whatever if it hasn't been so long i think it will try to refresh so maybe it tries to refresh and then it loads the page before it gets the new token so it'll say it doesn't exist but then you try again and it does work that would be that's like a minor i mean if you try it twice it works that's it is uh it's kind of annoying but That would be a bug, but we'd have to be able to recreate it consistently to be able to fix it. Yeah, it's not that big a deal. Do you know how long you're waiting about before you come back? Is it like hours or like 20 minutes? No, because this thing is set to time out after like five minutes. I mean, this thing shuts down fairly quickly. Oh, okay. That could be. Because a lot of the default behavior for most people is a lot longer than five minutes. So if you have it set to a low time, that would be actually kind of something. Could I set it to a longer time if I wanted to have it sit for an hour or something? Yeah, there is a timeout setting in the database. You can set it to, I think you could set it to minutes. So where do I find that? have like some people have like a long like hundreds of minutes yeah yeah because I'm on this thing all day and then when I'm off it I shut my computer down and I just it does shut off about every five minutes I got to re-log back in which is are you an admin I'm not an admin no I don't think it might be a database wide setting timeout. Global timeout. Yeah, global timeout is a setting. It's actually set to 180 minutes. So is there a personalized setting? I mean, mine, it seems like it's like five minutes. If I'm not on it for five minutes, it logs me out. I wonder if that could be a Chrome thing. That could be interesting. I'm not really familiar of a personal. Yeah, because your database is set to 180 minutes. I mean, that's not, for me, literally, it's like five minutes. I've never seen anything like that, like a setting. Yeah, is there a timeout setting in Google Chrome? It doesn't sound like it would be something that, no. Okay. Well, I'm not sure what to say on that one. I'd have to see it or recreate it to be able to troubleshoot that further. It may be related to the log in, log out time. So you think it's 180 minutes, but you can't tell if mine is different because mine is not 180 minutes. Unless it's a Chrome thing. I could ask some colleagues of mine if they've ever... Yeah, maybe just ask and ping me or just email me or something if you run across the setting. Maybe it's Google. I don't know. I've never thought of that. But it just seems like I could be on LinkedIn for hours and it doesn't log me out. But if I'm on PCR and I don't use it for five minutes, I have to log back in. Oh, there's another scenario that could potentially create those types of symptoms. Let me check your database settings again. Since you're not an admin, you can't see this sort of thing, but there's a what's called a dynamic IP address, which you could potentially have. I don't know what your email or I'm sorry, not email, internet setup is like, but some people have what's called a dynamic IP and it kind of switches every so often. And so PCR, you kind of have to set up PCR in such a way that it won't kick you out. Let me take a look at your database and see if there's like IP restrictions or IP setup. Because that would be if there's a bunch of stuff in there. IP restriction is one of those. Okay, that's empty. What is the other one? Security settings. No, security settings. Okay. It might not be that then. i wonder i'll have to ask i'm not as savvy in that particular subject uh but i have heard of that before where the an ip dynamic ip could potentially like pcr expects you to be connected to one and then your ip will switch and then when it tries to reconnect it kind of fails and maybe if it tries again it can like connect so i could i could ask that as part of my i'll ask a couple colleagues. I can make a ticket in your name asking about this behavior. That's fine. It's not a crisis. You've got to click a button and log back in. It's just a pain. It kicks you out. You have to do the whole login process again. Yeah. Interesting. It's just going from PCR to LinkedIn and back. Stuff like that. I've got a bunch of browsers open. A bunch of tabs open. And so if I'm working on something and then I've got to click back in, I want to check somebody's name, then I have to click, you know, log in. And because I have to refresh the screen and then click log in and then go back to what I'm doing. It just seems like I get about five minutes before I get booted out. Oh, wait, hold on. When you're coming back, are you refreshing the Chrome browser? Like, are you clicking the... I'm not refreshing it unless I get kicked out. I mean, it'll say error, no longer connected to the database or you've timed out. I mean, there's some kind of message that says I'm no longer. But if I, because I've got, usually I've got a couple different, you know, I've got one PCR on one screen and then one PCR on the other, one PCR recruiter open on the other screen. And then I'll have several individual tabs open. and if I'm kind of clicking back and forth, but if I'm inactive, I've got to go back in and it'll say, you know, you've been logged out. In the main tab or in the other open windows that you've opened from the main tab? It's the main tab because if it's one of the just like a name that I have open, it'll just say, the screen will just say, you can no longer access the screen. So I just, that window's dead. So I've got to close, or that tab's dead. Okay. All of them kind of die, yeah. It's the session. But if it's the main login page or the main homepage, then I just have to – it won't tell me the screen's dead. It'll just say you've been logged out. I've got to log back in. Yeah, the next click will tell you that you can't do that. And then you try – okay, okay. I just wanted to make sure you tried that first because if you were just going straight back and clicking the Chrome refresh, that would be – that always will – No. That will always log you out. No, that will boot me out because that refreshes the page. but I'll only do that if it tells me that I can't, that my screen is no longer active. Okay. Yeah, understood. Okay. I appreciate your help. Thank you. Yeah, yeah, yeah. Get going to what you need. Thanks, Gary. I'll ping you with a message about that. Okay, cool. Sounds good. Take care. All right. You too. Thank you. Have a good day. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 976.596992,
    "salad_processing_time": 110.88674354553223,
    "overall_processing_time": 976.596992,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence Technology.  How can I help you? Oh, hey, this is, is this customer support? Did I get the right extension? I'm having some phone problems here.  Sorry, I was having a phone problem there just a second ago as well.",
    "job_id": "92e97ae8-99ca-4e85-8f58-80cb4ae0854a",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence Technology.  How can I help you? Oh, hey, this is, is this customer support? Did I get the right extension? I'm having some phone problems here.  Sorry, I was having a phone problem there just a second ago as well.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3031220470037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}