{
  "recording_id": "3034570729037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:46:06.509118Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:46:06",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " This is Robin. Yes, hi, Robin. This is Jennifer Stanhope. I was having system issues, so I, like, logged in, opened everything back up, and now it says I've hit my number of login attempts in the PCR, which is weird because I was just logged in and just tried it once, and that was the first thing that popped up. Oh, I'll have to see here. Hold on one second. And I did change to a new password yesterday, but it worked fine earlier when I was in so I don't know what's happening okay let's see hold on one I was in the middle of us and Okay, let's see. And I'm sorry, what is your name again? BI talent search. Let's see what's going on here. I don't think it was like a... Do you happen to have anything else connected to PCR as you? Maybe that still has an old password. No. I mean, the only thing I can potentially think of, which would be really weird because it would be shut down, is I take my daughter's laptop and like I'll open it up there. But that would have been, she hasn't even been home for a week. Like you don't have like the Outlook portal added or something like that, do you? For Outlook? Yeah, there's like a PCR portal added for Outlook. Oh, I'm sure I do. And I changed all of my passwords to Outlook and everything. Okay, but I wonder if you changed the PCR portal. or the PCR password in your Outlook portal because that's still a connection. That could be logging you out. Let me see what's going on here. Okay, so it does say logged out here. Okay, so how do I log in? All right, so if you... Now, that's probably... Let me at least unlock your account. Okay, so J Stanhope, and it does have, like, different initials, so that's telling me something else is probably... your username is probably like all caps when you log in but then you have a something else logging in is you as well where it's j and then j s and then everything else is lowercase that tells me there's something else connected oh okay so that's probably what's going on let me first unlock your account okay that's that issue okay so if you open up your outlook yes and go to your peace recruiter ribbon yes okay well just as long so it's like the message it just says log down I wouldn't say it's okay so see it'll be right near that area where it says options okay click on that okay yep and does it do you have your password saved in there I mean sorta it's like a crazy long password which is probably not right. Okay, so that's what I need to fit? Yeah, put your new password into that password field. Goodness gracious, there's just like dots everywhere. Okay, let's try... I'll just start typing and see if it works. Yeah, you'll want to clear out whatever is there. Well, it's just a bunch of dots, and even when I hit delete, they're still just there. That's so weird. Okay, let me try it. What if you click in there and then, what was it, like double click and it should select everything that's showing in there and then okay wow that was like forever dot so i don't know what happened okay something yeah probably because they it probably just kind of screwed something up um okay put in your new password and then before you save it up near the top there's like a test connection okay does it say success okay make sure your save password box box is selected and while you're in there what is the version number at the top of that configuration screen what does it end in? Version 2.0.0.524. Okay so we'll probably also want to update that too and that could be so when you change your password like if you have PCR capture the Outlook portal anything connecting is you got to change it there as well otherwise you could yeah someone would still be in so that's probably what caused it there well and it caused also like i was having issues with i have call logic too and like it just wasn't like all connected i'm like what is happening i was like i'm just going to shut down restart yes if you have call logic connecting with your username and password you'll need to change it there as well okay which is all of those all of those are trying to connect your databases you So, like, if you change your password, anywhere where it's connecting is you. You've got to update it there. You knew that changing all my passwords would be such chaos. Yeah. So it could have been, like, call logic or, you know, opening an Outlook. Those would have been trying to connect. And when you hit so many, that's why you probably thought, oh, I only did it once. But it's probably other stuff taking up some of those counts. Okay. That's totally what was happening. Okay. and I need to play around and see how everything's connected. Okay. So while we're here on this one, if you save and close what you have now. Okay. I also want to make sure you update to the current version of the portal. Okay. So what you're going to want to do is go to, so once Outlook is closed, open up a new tab and type in PC Recruiter Downloads. Oh, like close all of Outlook? Yeah, just, yeah, close Outlook. Okay. I want to have you update it, and I don't like updating while it's running. Okay. Okay. So then, so open up a tab, go to Pace Recruiter Downloads, and you should see our downloads page come up in the search results of your browser. Okay, Pace Recruiter. You said downloads? Yeah, Peace Recruiter downloads. Was I supposed to do like W-W-W? Because it actually just threw me to like a Google page. Yeah, it should just give you a Google page, and you'll see Peace Recruiter and then downloads as a result. There we go. That's funny. Okay, it did it the first time. And hit Downloads? Yeah, click on Downloads. Okay, and then let me know when you're there. It's thinking. Well, I'm glad I called since I didn't even know there was a newer version. Okay. Okay. I am here. Okay, so if you scroll down, it'll be at the left. It'll be the second download. It'll say download PCR for OutlookPCRPortal.exe. You'll see that in green. I see. Okay, so it's for the Microsoft Outlook. Okay, yep. Download PCR for OutlookPCRPortal. Yep. Okay, so click that link. It's downloading. Okay. Do you want me to click on it? Once it's downloaded, you're going to open that file and run the update. I assume I just have to accept the terms. up the terms. Yes. And you kind of just hit next, next, next. Install. I feel like call logic was just like an API. I'll look in to see. Yeah, that could be. But they still have to have access to the database so some people either set up a separate username that's just used for API connections or it might be using your own username no I can't how it connects ads I connected it as an API like as its own name I believe I actually need to go back I feel like I did that I know I did that with hire easy but I'm pretty sure I did that with call logic too Okay, finished. Okay. Okay. So once that's done, let's have you open up Outlook again. And let me know if it connects. And it might be a little bit slow, like if you were disconnected for like a day. um you didn't if you have it set to write activities or stuff it didn't stop doing that it's just got it queued them up so then it's got to find them and then write them gotcha okay sorry oh i didn't look it's not even opening excuse me I click on it and no it like pops up the little ring for two seconds and then nothing okay let's go to your task manager do you know how to get there on your computer yep okay when you go to task manager let's see if outlook is still listed maybe got hung up in back on. If not we'll have to do a screen share. Okay that pulled up. Okay so you see it listed under like your applications near the top? No actually I don't. Okay. Nope. I just have RingCentral because I'm on it. Microsoft Teams is pulled up in Google, but that's it. Okay. Do you have enough RingCentral? I do. That's what I'm on. Okay, perfect. I'm going to start up a meeting for us, but I like using RingCentral in every possible case. I want to take over the mouse control. I can't do it with Google Meet, unfortunately. I love when people bring central. Do you mind if I grab something to drink real quick so I don't keep coughing on you? I'm going to get a brushy throat from talking. Hold on one second. Thank you. all right i'm so sorry about that no you're good my allergies have been driving me crazy this year and i keep doing that too oh yeah oh is it related i've been like the past week really sniffly yeah think about the scratchy throat getting that i just thought i was talking too much okay all right so I'm just going to continue with the audio okay so when you open up your RingCentral app if you go to video and select join I'll give you a meeting ID that's interesting you said when I go to video yeah you have the RingCentral app open yeah um video message text so that's normally what's there i have like a weird screen share from any phone okay how do i get rid of this i have like a start okay here start meeting no it should be video and then you go to join yep nope that is not an option right now man what has happened to all my stuff are you in the ringer like one of those kind of things like are you in the full app I'm in the full app okay the only thing I can think of is is it an issue because I'm talking to you through ring central no because I'm actually doing the same with you okay so let me do that I will say when I click on video right now it's not what it normally looks like so I must have um are you in upcoming meetings there are different tabs there's upcoming meetings past meetings and recordings like there's like three options across the top so it just says start and schedule oh and then it shows like a let here's a free featured training did you know that you could do that like that's all that's there okay here join the meeting you're invited to that's never okay yeah the i'm never okay um zero five zero three nine four eight one zero I would go to like the very top it does not normally look like that I wonder if they're rolling out some update I don't know I don't know like normally I agree it has like the boxes you want me to join by computer or just stay on here uh yeah continue without audio since we're already on the phone okay you need any camera or video and then you're in so what I'm going to have you do is at the bottom of our meeting hit share but go over to where it says entire screen. I said entire screen. Probably because I have two screens. Okay, so you'll have to click on which one you want to show me. Okay, I'll do my main one so that you can do whatever you need to do. But while you're seeing that, I wanted to show you this. this is what my ring central looks like. So normally those boxes are here. This is what it looks like. That is so weird. Luckily I saw this little icon, but I was like, where's like, this is not look like that. That is weird. What did not used to look like this. So I was like, I wonder if they're rolling out something. I just don't have yet. I don't know. But I was like, where's my button? This doesn't normally look like this. and what so you had to go over the top right show me that right here this out i'm going to need to know this it's this little icon okay like hovering over icons i'm like what in the world i don't like that no okay well hopefully oh what's your setup why is your setup highlighted let me see Does mine do that? Oh, I don't even have setup over at the bottom. Oh. Mine says app settings and help. Well, do you just have like a line or are you like also like the owner of your Ring Central? I am just a user. Maybe that's what that is. Could be. I'm the admin and user. Maybe that's how you create your account. Yes. Like I set up all my company settings here. Oh, okay. Well, that's why I don't have that done. Okay. That explains why. Okay. So let's do this. Okay. So under where it says background processes, let's scroll down there and let's see if we see Outlook there. And I forget if it's the same Microsoft Outlook or just Outlook. It might be kind of just hung up in the background. Microsoft 360, OneDrive, off right here. Okay, right click on that and select end task or click on it and select end task. Okay. Okay. All right, now let's try going back to Outlook now. Yeah, it is. It's popping up on the other screen, so once it does, I can throw it over. Okay. Drag that over. Okay. Okay. Can you just do me a favor real quick? See at the very edge of the PCR ribbon, it's got that down arrow? Mm-hmm. Oh, wait. Way over at the right. Here? Over a little bit more. Oh, here? Yeah. Yeah, go to that for a moment and select classic ribbon. Come on. Oh, I think I know what might be going on here. It like hovers for a second, but then it won't. Okay, go to file. Is this been like a while? It's putting it out. Classic ribbon? Yeah. I think there's also another setting that you might not have this right. can you do me a favor go to file up at the top left go to options down at the bottom left ah thank you that would have taken me a second oh okay this has probably been a long time issue see where it says optimize for best appearance switch that to optimize for compatibility oh if it's always been displaying weird like it's kind of hanging outside some weird toolbar that changes that the other thing while we're here might as well check it see where it says add-ins in the sidebar at the left there that gray section yep click on that okay one note in social connector first of all i have never really figured out what social connector even is those two at least social connector I know it can cause some slowness if you're not using OneNote or social connector it's probably better that we just turn those off so that way you don't have as many add-ins running all at once yeah I definitely don't have this ever running yeah I don't I can't even figure out what it is so see where it says manage com add-ins at the bottom if you click go okay go or do i just change it yeah you're gonna leave that as is let go okay turn off at least social connector and if you don't use one note within your outlook you can turn that one off too i use one note but not in outlook okay then hit okay Okay. Now let's go to file up at the very top left or very, yeah. Yes. Go to exit. Okay. Now let's go back in your Outlook. Okay. So now when you go to name or something like that, like let's go up to name up at the top Within your PCR ribbon I Clicked it Weird I don't know I could do this here. It's always looked so wonky. I don't even know this was an awesome Yeah, and one of those was because of that optimized compatibility setting. Let's go to options for a moment. Where's my options? Yeah, it's for remote control. Oh, there we go. Okay, 530. I can give you control. You want control, you said? Yeah. I'm going to peek around here for a second. Yep. Are you on a new computer by any chance? Nope. Okay. So that's good. That's good. Do I need to be signed in to PCR, like, by portal or just, okay. No, because that's why you have to have this. That's how it knows how to connect is you. Okay. I, that's just so weird. Okay, it's trying to process. That's good. Why is the stuff not displaying, though? Let me just check something else here. yes I keep moving us around with different versions of I guess I want to go here I keep finding us in different places it depends where I go yeah I might see programs Well, I'm hoping by doing all this, it will also fix my Outlook issue. So I used to have, to schedule meetings, I used to use Calendly, and all it did was cause issues and havoc to my Outlook. And one day, like, none of them would send out, and so I deleted that. And only because they now actually have Microsoft has its own meeting, like, appointment setting thing. Oh, it's so much better. Like I fought palindly, like nonstop. And I even spent forever on the phone with Outlook because they still have not been able, if I get a reoccurring meeting, it will only show that one time and it won't show. Like I have a huddle every single day and I just have to keep putting it on my calendar because the reoccurring meeting won't show up. that one I want to push it so I got that and he's got that okay so well you know what could be if you there was an older version of Outlook that if you had like recurring meetings it was getting all thrown off and after some point it didn't look like it was recurring. It could have been your portal. It could have been your portal that you had before. Save and close. Why would this not display? Let me think here. Okay, so view, I mean it's over there, reading pain right, I'm just going to reading pain, top, bottom, I'm just going to play around here. I don't like reading paint bottom with portal, but I'm just going to try it. File. Exit. Oh, how hot is it for you? My watch says it's 99. Oh, where are you? Texas. Oh, boy. We've had a really... And the other thing... Okay, so it has to be this app. We can't use it with the new. yeah i need to remove that from my little bar down at the bottom okay now it's popping out oh your ring central status is not connected either do you want to fix that while we're here yes i guarantee you it's because i've changed yeah so what happened why changed all my logins is it going to throw off because i'm on probably not right no it just wants you to authenticate. Got to love integrations. I remember the simple days of what's a roll-up list. Do I need to hit stay signed in? You can. it's just image you want to just stay signed in for ring central yeah not necessarily okay hit authorize here not necessarily just being signed in through peace recruiter okay so now you got that connection back to ring central which is good and then now we just need to close and restart well it's showing in the panel now like the yeah so that's good so let's say we were like looking up I know InfoVision and you were doing something on the record what is a little bit different because you don't have like when you go in through your browser you have the upper and lower section so when you when you are in your search results and you go let's say feel able to see let's say you did a search here your search results but then when you click on our record to open it it goes in a new tab go back and then go to another so instead of having upper and lower lower okay tab second tab because we don't have as much room to work with um yeah that's crazy and then the other thing let's say you're doing something in pcr like oh i'm in this record and things like that but then i get an email you can click on the email and i don't have to go back and search the record this is where you toggle back and forth okay looking at my email or do i I want to go back to the PCR view because they're both displaying in this reading pane. Gotcha. Nice. Yeah. So it's nice when you have like, you know, things that, you know, I got to go look up a record. I don't want to leave Outlook to go do it. And you could also come in here and see like, is this person? Well, that's you. Let's say you get an email from somebody. If you had selected message, it checks. Is there a record in the database? And then there's like the right click on a file option. Okay. updating or like if the person is in the database let's see like do you have anything good here oh all of those would have been shifted let's just pretend um if this is somebody that would be in your database if you click this say i turn to a plus this there is no record in the database with this email address okay if you click it again it opens up where you can start one okay Oh, perfect. Okay. And then if you maximize, yeah, if you maximize, it opens up better the next time. Now, if it was found, it would turn to a green checkmark. If you click it again, it takes you to the record instead of creating it. Nice. Okay. And then as far as resumes, do you have anything where somebody sent you a resume? Do I have one in here? Yeah. Oh, yeah, absolutely. It would be under probably candidates. Okay. Yep. So let's say this is somebody that is not in your database. How could I check? Did not find a matching email address. Now, that check is always based on the sender email address, not the person's name, the email address. So if I wanted to make a new record, I would right-click and say parse resume. I don't like inhale resume. You get no review screen. I like the first resume, which opens it up in that ad resume screen. So I could see how the information pulled, like see how it got a little confused on the address because there was no address. But it found some other numbers and stuff, got a little confused. Okay, so I probably want to take that out, you know, edit. And that's why I don't like the inhaled resume. So I can go through and what company record, you know, if I have a company record, if you don't pick one, it just goes in your default. You can pick your source. link it to a job put into a roll-up so that's one way now if the person was in the database with this email address but they sent you a new resume all you'd have to do is just right click instead of doing parse resume do update nice and it would go to that record now the one right above it import attachments let's say it wasn't their resume it was their cover letter right click and say import attachment but it goes to the record with this email drop okay now sometimes what'll happen let's say i uh this person gurish sent you somebody else's resume you could always listen you could always go to a record let's say they sent you erica's resume drag this email on top of the record and you'll be prompted to pick files and you want to save it as the resume or as an attachment or sometimes what happens is a hiring authority sends you a file but it's about a position you could open up the job drag the person on top or drag the email on top of the job and you could put it as an attachment to that job like they send you like a file like the job description It would be an attachment for the job, but you can also just drag on top of a record. Okay. Which is pretty cool. That is cool. no no you could do all that i've been like downloading and saving oh no when you have this that's that's really the only thing most people use it for is just the convenience of the resume getting in my email just right click just don't use parser i'm sorry if it's new don't use import resume what that does is it automatically extracts premiums your default company but you don't get it that review screen so if it didn't pull right then you got junky data as you got with that address good but it's not 100 perfect perfect so i think you are all set now yes yeah okay so that makes sense and i'll just double check with call logic make sure everything's yeah let me see if i could track a login for you hold on one so let me see if it's something still trying to connect to you okay so be I talent okay so let me go system insert logins look for today Well, whatever it was, let's see. He logged in at 2.41. Okay, so that would probably just have been this. He had a couple other things, and it's a different IP address. So I'm thinking you do have something else still connecting as you. Okay. I can't tell what it is. Can you like log them off on your end? No, because it's your username. Interesting, okay. Here I'll show you what I'm looking at. If you go to system, there's an option. I always forget where it is, so I just type user logins. because I haven't logged in for my daughter's computer in a while sometimes it's still connected or something I mean that could be it um this was me just looking looking looking at stuff don't worry about that um that was me um unlocking your account okay that's what those are for so when you see somewhere it says somebody else has named your flash that's usually us helping you or that is us helping you i should say okay um so these are the ones that i'm going to guess are you right now while we've been on the phone and things like that but see how there's some other ones here it's a completely different ip address what in the world so i'm one it's got to be then my call logic that's what i'm thinking because it is kind of frequent too. I was trying to make phone calls through Callogic and it kept like acting really weird. And I'm like, what in the world? So I'm assuming it's got to be my Callogic. That's a lot of attempts. No wonder it was like, you have reached her. Yeah. So yeah, because it'll, every time it'll do like login has failed, login has failed. And then the account was locked and then I unlocked it. So. That's so crazy. Okay, let me look at... Yeah, I would go over there like, can you go over there right now? Yeah, I'll let me go into CallLogic right now and see what's in the world. But can I also tell, like go into PCR and see if I have it set up like as an API? Let's see. Well, an API would be like another username. So let's see what you have for username. And if I delete a username, will it delete their record? It deletes their user account, but if they have activities or things like that, then it doesn't. Okay, so that's the call logic API. Something is connecting. Do you use PCR capture? What is that? That's an extension for Chrome? Not that I know of. Maybe. You know what? It pops up. I've never pasted it. When I click on PCR, another tab pops up. Okay. Let's log out here. Yeah. So I've never used it, but it does pop up when I click on Chrome and change my username the password there yeah put in your new credentials here but that usually doesn't do anything until you actually try to use it I don't think so but there's something some other site that you're using that's connecting is you it's got a call logic okay so that's at least fixed okay let's go over to call logic let's see what you have configured in there because I'm also not seeing that other username trying to make any connections so far yeah I mean it can't like that's what I don't think you're using that other username I think you're using your username over there I have to like think sorry just change all my passwords I'm thinking yeah I don't you're not using API user like nothing is connecting is what's called API user is the username okay there was where did I go to do it aha this is the problem this is the culprit so I mean you could probably you would probably be fine just updating the password so this what no wonder my call logic was like flipping out yeah and this is PCR okay that would be your PCR password how it's connecting is you okay that i guarantee you but why would it keep changing alarm uh why would it keep changing ip because they're connecting as you from their site so it would use their ip address like whatever it's originating from gotcha and i kept logging back out of call logic because it kept like messing up well no wonder it was yeah if you hit save can you what are you able to do i don't know call logic very well really I mean I wouldn't have to call and I can't be on both phones at once okay but show me again where that call was what I'll do is I'll make a few calls and see if it okay so I mean it should be fine yes go ahead and sign into your PCR Oops. Wrong one. I think I can't type. I was going too fast. Okay. So what I do is I go to system. Okay. and then go to type user or type the word logins it's this okay right here I just you do a search it's called user login and then you can put it whatever date but if you come over here and I'll just pivot for you we get your search this shows you all the IP addresses you're connecting at that's crazy okay so we haven't it hasn't connected as call logic or anything since because this is well I'm actually an hour ahead of you so that would have been my time so 255 so just a moment ago 82 so I think these are all you I guarantee you that especially since it went down to like the lower name I guarantee you that's my path login for call logic and I bet I just didn't do it all caps. And it could have been portal. And it could have been portal too. So the portal ones would probably still be your same IP address because it's from the same computer. So I'm going to guess one of these are probably call logic. Yep. Okay. Okay. Keep an eye on it. I would say maybe wait a half hour, try to do some things in call logic and then come back and check this screen. Okay, that's what I was going to do and see if I need to like fix anything else. But that is good to know. Yeah, because we log you out for security. Well, because like if you had like somebody working for you, if you change their password, you don't want them still being able to connect to your database just because they're in Outlook. Well, and that's exactly what happened. So that's why I changed all of my passwords is because I've tried for the last like 30 or so days to see how it worked to have a person help me to see if I wanted to actually like truly hire them. And then I was going to set them up like I was having them use a lot of my login stuff because I want to pay for a second license if I if it didn't work, which I'm glad I didn't pay for other licenses for everything because it did not work. And I just let him go. And so I changed all of my passwords. And, yeah. Excuse me. Oh, gosh. Sorry. No, you're good. So, yeah. Once I can get better help, then I'll actually get, you know, licenses for everything. But, yeah, nuts. Okay. Alrighty. Well, let me know what happened. Sound good? Okay. Yep, sounds good. Awesome. Alrighty. Well, have a great week. If I don't. All right. You too. All right. Thanks. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1057.963343,
    "salad_processing_time": 102.03641843795776,
    "overall_processing_time": 1057.963343,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " This is Robin.  Yes, hi, Robin.  This is Jennifer Stanhope.",
    "job_id": "a41c5a51-2671-4717-81dd-707784efd537",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " This is Robin.  Yes, hi, Robin.  This is Jennifer Stanhope.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3034570729037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}