{
  "recording_id": "3034331706037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:45:51.766047Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:45:51",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Give me one second. Okay. Hi, sorry about that. What's up? Hi, how are you? Oh, you know, another fun day of finding a whole separate RingCentral account that we're paying for that we don't really use. Oh. It's for the developers. There's like 20 different numbers on it. Oh. That's so stupid. We pay annually for that one, I guess. And the bill is supposed to be billed next month for like eight grand for the year. Oh, no. We need that money for us. Wow. Eight grand. That makes no sense. Why were we paying for that? The owner, who is the person on here? I don't know who this is. Robert Eaton? Oh, he used to be in He used to be like a QA person a while back. Yeah, JT said he used to be in support and then started the QA department. Yeah. I guess so. Yeah, he was tech support, and they moved him over when they had a QA department. They didn't have a QA department before. It was just, here's an update. Yeah. Do you know who Wayne Herrick is? About the same, yeah. Okay. Cyrus. Chris. K-I-O-U-S. Chris Kios. He was sales. David Spurko. Old sales. Rachel Golko. Oh, that one is a person I never met. was she and I think maybe like didn't last long. I'm trying to remember. Was she sales? Like it might have been around for a really short time. Yeah. Like I don't know if she ever made a deal. Like I don't think she lasted long. That's wild. Well, we've been paying for her RingCentral account for forever. For years. years yeah like i don't even know still in here and then scott orloff do you know oh my god scott orloff has been gone for like 10 years yeah okay oh my god these are like names from like very long ago was it rachel that liz pissed liz off because she was like going and getting her hair done and stuff during the day and like she just thought she was just like you know do whatever she wants right but never i don't know if she ever made a sale was that rachel i think i feel like it was coming up although as i say that when i made my hair appointment yesterday oh my god nick i don't know if you got my message last night four freaking hours i have never yeah oh my god well first of all the one girl that normally does my hair she's usually really fast i'm in and out in an hour and half but this girl she's younger and i mean she did a really nice job she really was like consulting and took her time but she took her time i literally like she did more foils probably than normal but also like she's slower doing them oh yeah because she's yeah someone who's It's newer. Yeah. It takes forever. Oh, my gosh. I was, I literally, I got there, you know, I went there at 4.15 and I was out of there at 8.15 at night. Like, that's when I left. Four hours. But she, like, so, like, she finally gets to the top and done. And then, you know, shortly after, like, okay, let's rinse you out. And I remember thinking, like, there's no way that top is going to be processed enough. It's going to look yellow. and especially because I have greys up there now which is why I really have to get my hair done anymore because I have to get those damn things covered but we go to the boss she literally like took out the foils from the side that she started and then rinsed and then did the back but then I had to sit another 15 minutes to do the other side and she pulled those out and rinsed them and then she finally did the top I'm like I have never had where it finishes processing almost like on one side before you even like finish the top and she really did do a nice job though and then i finally just got to put i go you know you don't really have to dry it so she's like no i really want to see what it looks like i'm all excited about this i'm like all right oh that's cute she was really nice but yeah it was like one of those things like I'm desperately needing it done I have two funerals coming up I have one last well I had one before but then we have two we got one tomorrow night and then I have a fundraiser after that tomorrow night for one of my good friends she's running for mayor and then I have a birthday party Saturday another funeral I'm like I cannot be seen with these root grots anymore and that was The only time I get in, if I call my girl, I'd be waiting three, four weeks. I could see now, though. That's good. That is good. Yeah, it was so much better driving home. I'm sure it was. I'm sure that was much, much nicer. Well, I don't normally leave my house too much, but driving when I'm not sure where I'm going, I can't drive home from Columbus. Like, at night, without glasses. I would, I'll die. I was using my glasses as, like, a backup, but then they broke. I glued them once, but then the glue spot broke, and then the lens popped out, and I don't know where it is, so. Oh. I should take a picture. Like, these glasses are, like, 10 years old. I don't even know. They, it cracked, like, you know when you wear glasses, like, underneath, like, the part that would sit on your cheek? You know? There's, like, this little crack. like uh gorilla glued it at one point about a month ago and then i was wearing it but then it broke again and but the lens popped out and i don't know where it went so i was like desperate and i'm like shit i can't drive that far um so question what i'm calling you about this carol personnel yeah that you tagged me and i could have sworn that there was just an open invoice for 7-1, but now it's showing it's paid, which is really weird. Could have sworn I saw that. Okay, so literally that's what I was calling you about. Why is it showing paid now? And payment 7-1. I could have, unless I still didn't know it opened. Okay, do we want for updating Mike SQL, do we want it to say, because it's already suspended, do we want to just and we paid to make the cancellation date today because the account's already off um yeah when is I mean when is her next bill um she did she already pay that one or when is it going to be the seven the seven one seven seven one was the last time yeah okay yeah then I don't want her to get charged for okay okay so we'll just do canceled for her status okay i'll do that now but i'm going to put today's date for the cancellation date that's fine does that sound okay okay yeah she requested anyway so okay i'll put uh cancellation reason where did okay retired retired months ago that she was going to do this so after being on hold since 5-1-2025. Okay, so she went on hold. Okay. Actually, what did she go on hold? Change log. Active. She went on hold. Oh, she must have had some payments behind. after going so Liz changed her status oh there's more there okay that's why she had some payments okay that's why all right how are you getting a little bit better or no or worse okay It's going to take some time to do whatever and now I have this. Okay. All right. So, MySQL is done. The account is current. Recurring transactions are deleted. and I'm going to add a note. Carol Personnel Management. Okay. Canceled 7-31-25. I like putting that in the notes. And then, now do they do anything different when it goes from on hold to being canceled as far as the server? I don't know. I don't really know how that works. Maybe we have to ask. Yeah, because if we don't have to, like, store it the same, then it might free up server space, you know? Yeah, definitely. I just don't know how it works. No, I don't either. We're figuring things out as we go along, right? I don't know. We'll figure it out. I am so sorry about that thing with the refund. I wasn't really like, you definitely should have brought it to my attention, but there's no reason why Lombardo put that ticket in in the first place. And I already talked to Phil about it. It's like you can handle that. There's like, I'm tired of, he keeps doing this thing where he talks to the customer, they tell him something that he knows like they can't have like a refund or like some other thing and then puts in a ticket and has us deal with it. And like, that's not fair. You know that they need to pay a cancellation fee or you know that they need to do X, Y, and Z. Like, you don't need to tell them like the details, but at least give them a heads up and don't like make them think like, oh yeah, I'm going to get a refund. And, like, we're the bad guys. We have to, like, go in and help them. Like, I had one where, like, yeah, it was, like, the invoice. And it's just kind of like I have a second invoice that I noticed. And I can't remember. I think somebody else had started it. Right. Say, like, it's 20 users. It's on their annual. Anything more than that is a separate monthly invoice. Oh. And then that one, I'll either have it as it's paused if they're currently at 20. as they go to 22 I activate it and say two users you know so I just kind of play with the second invoice but then the original one stays the same and then I'll update the next recurring first you know like I'll just have it do it that way but that's the one I can really think of that I've done I can't think of I can't think if I've ever been that like almost never happens and yeah um i was trying to think like did i do this before because it's a vision i think annette took it and asked me i'm like well i guess he had talked i thought maybe jim had talked to bill about it and it was like uh oh he like forgot to say that or bill forgot to tell me and then bill like didn't know anything about it and was like okay so now like that's not fair to us like now you're making like we're not in trouble but like there's that whole email chain that doesn't need to be there like why is why is that happening that's dumb um well i don't know i don't know now we know why liz was so strict with everything huh I know otherwise things get like a little haywire it's been as hard a track as it is ugh what is happening with this how's DeVisha doing with stuff I haven't talked to her lately she's good I mean that obviously well that's not her fault but that's not her fault yeah I told her that I gave her bad advice I didn't know sorry it was like i said it was not it was not totally a problem i was i was mostly mad at him because i was like when i talked to bill about it it was like well he knows we don't do that and i was like okay well then tell him that because this is like the third time that we are getting like something's happening with us and like steve's mad at me that we told them we would give this refund like that's not that's not what happened yeah go yell at the person it actually is now the one refund i had to do around that time it was legit and it was one of those um where um which is why nobody probably said anything there was another one right around that time because i was waiting for two of them but it was one where um they had changed users and then when they went into sales, how they went and they updated the recurring so that one really did need a refund because that was integrity's fault. Yeah, that makes sense. Yeah, and that's fine. The only reason that I put in that the only reason that I was like, well, I need to know about them now is because he was all bent on shape about it. I was like, okay. Damn, Robin, I don't want her touching this shit anymore. I don't know. They keep doing random stuff that doesn't make sense. Like now that we're talking about like Tyler's vacation stuff. It's like, what do you mean? Well, he just started. Yeah, I know he just started. but like he told me he got this vacation like before he started like that was part of his like agreement to come back like well he doesn't already have vacation time and i was like what are you talking about like well he probably had it from before well like he was a little he was on a little hiatus let's just leave it at that we got someone back with skills we don't have to retrain them otherwise they're going to be waiting for three months or two months for them during be effective at least. I'm just happy he's back. That's exactly, and me and Bill were on the same page with that, but I was like, I was like, I don't understand, like, what do you mean that like, what, I was like, I don't understand what's the deal here. Like, you are saying like, now that we are waiting on vacation time, like, that's never happened before. And then, like, I think what's happening is Kathy's putting in like things that are pretty standard business practice everywhere else, which I understand. But you can't just snap your fingers and all of a sudden we change like entire policies or just like all of a sudden have this like strict thing that people don't know about. Right. So it like. Well, let's let's not forget, too. And this is. Maybe we should stop recording my call. let's not forget too that the reason people were leaving is because they weren't getting paid so right for that convenience alone maybe we should be a little bit more flexible because people were pretty flexible with all this going on along those lines about it i just kind of have to call her anyway yeah mine says I have one week everybody everybody has five days in there so I don't know I have the actual sheet the problem was no one ever told me that Kathy was supposed to be in charge of that now so I've just been putting it on this like google doc thing that Liz had um when people email call off so what yeah like Liz and Gretchen never counted like my medical visits I don't have that yeah like it still it will still go through me I will just tell her and she'll put it like on your paycheck that it's like whatever time so I can still decide if like it needs to be whatever or not but I don't really take vacations unfortunately I take a day off here and there like move-ins appointments usually it's like a couple hours here or there I don't really have a week off the same thing with like I don't take sick days because well now we work from home all the time but like when I was sick before I'd be like alright well I'll just work from home like I'm still gonna like I'm not gonna yeah unless I'm like literally sleeping all day which I almost never did that thing had a couple of those well the only time that did happen was was it this year I think it was earlier this year I like, I don't know, maybe it was the end of last year. I got the flu, but it was right when we were, yeah, it was in December because it was when we were doing the December update. And so it was update week and I was like, well, half the team is off. Cool. So I need to at least be like online. Oh, I remember that bad flu. I literally worked from my bed that day, which was miserable. Oh, I remember those bad, that string of bad flus went around. Yeah. I think I had it at that point too. it's so much nicer working from home though because you don't catch all that all the time like when i worked at mri i used to get sick and the level of it would vary almost every franchise training class like right after it was over because you would have like 18 people coming into cleveland from god knows where all across the country and what they would do all the time was because I had my own office and you know I'm the main person along with the you know vice president training and working with them I would like leave or like go to lunch or go to the bathroom or go print something whatever I was doing and come back and one of them would be in my office using my phone because they the training room was like a big open room with like like tiered um seats like almost like a stadium seating or whatever so they were like they're three or four tiers. Three across on each side with an aisle down the middle. They didn't want to be doing business calls because they're setting up their businesses at the same time. They would constantly go into my office, close the door, and use my phone. I was constantly like, Lysa. Every time they would come in, I would get sick from somebody because somebody would get sick just from flying on airplanes. Maybe not every time, but very often. I finally just like, so I think I, yeah, I just, actually I think at first I was in the open area, then they moved me to an office, but then it still would happen sometimes, but not as often. But I was like outside there. Then I think I said, you got to, I remember what we did once. I said, you guys got to put a phone outside the room somewhere because I don't want them on my phone all the time. it was like it was driving us nuts like get out of her office i remember there was somebody i can't remember who it was like i remember doug like he had to like say like get out of her office like there's stuff she could be working on you know they would just like kind of go in it's ridiculous Are you okay though? Yeah. Calming better. we had a shitstorm there for a while didn't we I don't even know what I was doing some days I was just like oh my gosh just let me just kept digging digging trying to get through trying to feel a little bit better now I think that stuff should get better relatively slowly and steadily so like I said I'm hoping to get another and if people would understand how email works, that would be nice. Oh, how the setup works? Or you mean like email? No, just email. We spend so much time on email, especially the sequencing. It's like, oh, my God. I got some guy, and then he called when I was trying to finish up before I was leaving, and then I couldn't take the call. And then he called in today. I found out, like, he didn't have a delay, so we probably pass the emails 900 and some over to his gmail but then they stop sending and he thinks that oh no i have other people do it's like you probably don't it's not a restriction on us you can't send 900 emails through gmail it's like oh my god and then see fine i guess there's that other ticket i tagged it in there i'm just going to go to you directly no please don't there's already a ticket you're like you will not go directly to me because i'm going to put you right back to support oh my gosh like i you might have to wait like i don't know a little bit for something that's not even off i don't know i just i had like karen mo i had so many people emailing her i just made tickets maybe let's see from that i don't even reply to the email i just made a ticket instead on some of these. That's what I will usually do, especially, like, it depends on what it is and who it is, but especially if it's something that's just... Oh, I have frequent abuse. A couple people where they're just frequent abusers. Yeah. Well, there's, like, there's, like, ten different people I've seen who were just emailing Liz directly when they were changing their user count. And I'm like, we're not doing that anymore. That's not how that works. I'm not directly emailing someone. Yeah. I don't remember what her title was, but basically like director of operations. You're not emailing them directly to change your user count when you can submit a ticket for that. Yeah. I know. Dana Cowan, their office. They're very happy with my training. Oh, surprisingly. Her name is familiar. Where are they? Dana Cohen, like Steve Margolis always is the one that usually calls in on her behalf. Are they in a free training or something? What were they? No, they had an old billable. They still had some time left. They wanted to cover searching, but they wanted to do very, very exact things. Well, what is the first thing to do? Then you can't search it. If you make it be criteria, it has to have the criteria. so we did kind of like general like advanced like name searching and then well i have this search how would you do this one all right you could do this way or you could do it this way they're very happy um so if i pay all invoices online at once it is not that difficult just go in and hit view and pay oh the jesus these people paying invoices like we're gonna have to set up a or make a video for them to learn how to do something that's so easy oh my god oh who is the lady um gosh are you still there yeah oh okay you got suddenly quiet there for a second there's one person she can't follow pcr capture instruction including that there's a video on the page i can't it's too difficult i need to schedule time i swear people read instructions they're not that difficult there's actually a video that walks you through it but okay I tried was not allowing me to do so practical HR solutions what's going on with our account all right I'm going to get back to work here all righty um that one did I close it if anything else comes up just let me know okay all righty okay I'll talk to you later",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1048.8496,
    "salad_processing_time": 201.39434909820557,
    "overall_processing_time": 1048.8496,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Give me one second.  Okay.  Hi, sorry about that.",
    "job_id": "c67af4c6-bc82-4f5b-94ff-f63ef2a4ca71",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Give me one second.  Okay.  Hi, sorry about that.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "billing",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": false
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3034331706037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}