{
  "recording_id": "3040478677036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:51:26.325826Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:51:26",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID. Enter your participant ID followed by pound. You are in the meeting now. There are two participants in the meeting. Good afternoon, Linda. Do you hear me? Good morning, Linda. Do you hear me? Jim? Yeah. Are you there? Yeah. Am I the only one on? You are. You should be. Do you have other people on here? No. No. Is the iPhone X Max you? I couldn't hear you. I couldn't hear you when I went and heated up my coffee. So I didn't know you had come on. So I apologize. I haven't seen anything. No problem. No, I dialed in the first time and there was only this iPhone X Max showing. Is that you? The what? There's an iPhone X Max showing. You know what? It could have been because what happened, the ceiling fell on my head in my office, the sheetrock. Oh, no. On Friday. And they're fixing it now. So I'm using like a first day signed into my laptop, but my husband had set up my desktop, just gotten it done. So my laptop wasn't allowing me to get in and wasn't showing me that I had the appointment because one's a Mac and one's an Apple. And I guess they just didn't talk to each other. So, you know, I know I have this at 10 o'clock. so I apologize. No problem. I've been in and the first time a couple of times the number wouldn't take my password for Zoom so Zoom was having issues too and I tried to direct a couple of times so you have a couple of messages for me but no problem. I'm glad we're here. Okay, sorry. Not a problem. So yeah, so we're going to take a look at the PCRM today to look at that sales pipeline and take a look at that too. I want to enlarge this but I guess you'll do that, right? well let me see I'm going to share my screen here on pause it and you should be looking at my sign-in screen to PCRM right now and I think it's as big as I can make it unless I zoom in once we log in okay so let me get logged in here okay So this is the PCRM. Do you see my screen okay? Oh yeah, totally different. Yeah, so kind of the biggest thing what we've done is this new user interface for the PCRM product. And we've taken, and instead of having them the menu across the top, we put the menu down the left-hand side. So You're still going to see some of the same things, like you still have names, companies, positions, roll-ups. A lot of those are going to be the same terminology, and they do the same thing. There are a few new buttons, like the deals workflow, which we'll take a look at there. But the biggest difference, too, when I click a name – What about resumes? Because I always want the resume to be in that choice selection. Easiest way to tab through resumes is if you go into somebody's record and you look at their resume. Oh, yeah. I'm sorry. But I mean, mine is way in the back where I have to scroll over and then hit. Well, your resume. So the resumes are going to be. Hold on one second, Jim. I think so. Yeah. Sorry about that. They're doing some work in the office because of. The roof was caved in. I have a concussion and everything. It just completely cemented the lumps in my head. So I apologize. No, no, I'm glad you're okay. What caused it? Did it just fail? or i'm not they're looking for but it was just i had to move floors because somebody helped move all my stuff because it was just so hot it was you know 98 degrees pouring heat right through this directly at my desk and chair so but it was a huge hole it was like oh but no cracks no no warning. So we'll go back to this. This is a name record. But when you open PC Recruiter now, what would it look like? Well, this would be, so this would be PCRM. So remember PC Recruiter 9 isn't going anywhere. This is just a different log on to your same database. So if you log on through PCRM, you could go back tomorrow and log back on under PCR9. And so you're going to have both and eventually maybe you find that you like this and only want to use this that's up to you but this is going to give you this new interface so that if I wanted to I could create a custom workspace nice thing I can do is I can put a little version of the resume right on the front screen like you'll see I have the resume shown on the right half of the screen here so I can go through here and I can set up a custom workspace here showing whatever I want then I have areas where I can look at only the resume or if I have multiples I can have different tabs at the top here and look at multiple copies of a resume or I can look at his pipeline or I can look at his attachments or anything like that so the same stuff just a different view looking at this version of PCRecruiter okay so that's going to give me so a little bit of different configuration options there. I also am going to have, so you see a lot of these things are the same. I have names, companies, positions, roll-ups, all of that. But the deals workflow is going to be kind of your sales pipeline, which is something new that's been added to the PCRM product. What is it called? You're exuberant. The deals pipeline. The deals workflow, is what they're called. So what this is, it's essentially a sales pipeline within PC Recruiter. So you're able to set up different custom steps as you go through here. And then you can put in different companies as the cards in here. So I can go through and I can say I sent a contract to Mandalay the other day. Maybe I have Melton Logistics. I've contacted them. I got a signed contract from Melton over there. Bank One is one that I won. So I can kind of put in my different cards in here. So maybe I want to add a new deal. Does this mean like a deal? Is this the equivalent of like a contract of like for recruiting like a sales rep or an R&D? Is that what that is? It could be. It could be. So it could be. What else could you use it for? Let me show you. Okay. That you're working on a deal? Yeah. Yeah. So what you can do is I could put in here as a specific company record. So I can put in like ABC Company. So I could add a company into this workflow and I could move them through. Or I could add maybe like here I put in specifically a position at one of my companies, the VP of product development. Maybe I put it that I know they're hiring for that specific position and I'm trying to move this through a workflow to try and get that listing, get that posting from them. So you could put a job or a company in here. I think most of the time it's designed to put the company in there that you're looking to develop a contract with. So I can look at ABC Company and that's... Where did you put that company ABC to pull that up? Because I'm looking at the deals and when I see it... Did you type deal name in here? What I did is I went up... In the upper right-hand corner, I hit create a deal, and I can give it a name. Let's find a company name in my database. Where did you go again? You went really fast. Create a deal. In the extreme upper right-hand corner. Let's create a deal. I'm going to put Abacus Environmental, and I'm just going to call the deal Abacus. so I can put something in there. So I give it a name, and then I'm able to link it to a specific company record in my database. So that's going to kind of connect it back to that company record. And then if I want to put a contact name in there, if I had any names associated with the company, I could even put a contact there. And when I create this, if I want, I can put a projected close date. So maybe I can put kind of when I think it would close, when I think I should get an answer. I can put a value in here. So maybe I know the fee will be $30,000. I can put that in there. I can put a confidence level. I know it's a 50-50 shot or I'm pretty confident I can put 75%, do some different things in there. Is it on there, Merrick? Yeah. Well, right there it is, but there is, I'll show you somewhere else that's not. I can assign it to my name. I can put a note in there. I can even put a couple follow-up tasks in. So maybe if I wanted to do a call, and I want to do a call by next Monday, I can do that. And then I could add another, and I could kind of do some different things. Powerpoint or something. Present PowerPoint. So I can do the email follow-up the next week. So I can kind of create those in there and add some different things. I can also attach something to it. Will those automatically add to your calendar? I don't believe they do. I think they're only going to show up in the deal here. Oh, okay. Because that would be really helpful if it worked with your calendar so you knew to follow up. I think what happens though is up here you can look at next task date so you can pick a date for the next task and then search by that date and then when you do it's going to tell you within that day what tasks do you have I have one with that because and it's a call so it's found me there I don't think let me check I don't think the schedule to your programmers if everything could get But put, you know, once you put that down on your calendar to, you know, make sure you like, even if you want to put day before or week before, get in touch with, you know, for a Zoom call or a presentation. because if you don't necessarily go back to that, you're going to totally forget. And if you're overwhelmed with a lot of things, which we are, when we have to cross-reference upon different tech stacks, it just gets like, you know, having simplicity is the easiest thing, I think. For sure. And that's the hang-up. Why don't we go in here? Let me look at... Can I imagine it can't be that difficult? Add event to schedule. I can do it if I want. So maybe I want to, yeah, let's do it. Let's call to follow up on PowerPoint presentation. Let's see, I'm going to go on the 15th. Check that. So I think I can. Let's go here. oh yeah yeah it does it does so you can put that on the script you just have to check a little box and it shows right there called a follow-up on presentation so I do have the ability to put it on there I figure they put because that just makes sense and you can if you deal from that scheduled item that'll take you right into the deal the deal card there and then you can go through and check the checkbox when you did it or uncheck it whatever might be so so that is going to interface with your calendar. When you do do it and then you, is there a place like to show completed and results so that you can write the notes that they have chose a different vendor or they push the field back or something like that? Well, you could check it off in as you made that call. I could check it off right there. You have a notes area or an activity log. Go to activity and see right there. Let's see, that's showing the activity. I don't know if we can add an activity. What I would do is I would actually go into the company record and just log that activity as I did. And I'm checking to see, I don't know how you get into it. Oh, that's fine. Let me go into here and see. I'm going to go back into my main workflow and see how I go to the company. Because you can put it in the notes of that. specific area. Okay. Activity log. Okay. So the best I can say, I can... Is this in essence a little bit like creating a pipeline, not for a job, for your history with a client and possibly working on deals with them? Yeah, yeah. It's essentially a position pipeline, but for a client. So you can move the client through this pipeline. Kind of similar to what we've done, we actually internally, we use PC Recruiter. We created a position pipeline showing people that we've demoed PC Recruiter, that we've sent contracts to that have had a second demo, discovery calls, stuff like that. So we had for years been using kind of a position pipeline with everyone I've gotten, people I'm attempting, discovery calls, demos, first, second, third proposal, who purchased, everything like that. But with the PCRM, we actually added it as a company-centric pipeline. So you can actually have a pipeline of companies here. and in this area you can also here's where you can put your temperature which is more of a non numeric confidence level so you can put whether it's hot warm cold cool whatever it might be so you can go that way so you can go through here you could add a note right there so the results of the call maybe I put it in on August 5th so that's going to go there and then if I go into to Abacus if I actually go into their company record. I go right there at you now. I should be able to see some activities relating to what I've done and then I'm also let's see if it shows up under the notes there. Okay so the notes looks like it only shows so the notes in the deal are different than the notes in the actual record but some of the activities would show over there. So So that deals workflow kind of. What do the keywords look like? The keywords you can actually select. Let me get back into there. So if I go there, the keywords is going to let me select various different keyword tags that I want to add. So I can add from my different skills, specialty, equipment, education, user-defined codes that I can pick. What are those numbers? PH1, were they numbers you assigned those? See you. Oh, yeah. Yeah. These are just an old list of numbers I imported years ago into this list. I don't even know where they came from. These are just kind of just random data that I put in there. But when you create these lists, you could call these codes whatever you'd like, and you can actually apply them to the company and or the name. So candidates are going to have this too. You can also actually, maybe I know they're in numatic, I can tag that. That's going to actually add that up at the top next to where the company name is. You'll see it tagged. I can tag up to three keywords next to my company name. That's something new to the PCRM product. Okay, so that's going to give you the ability to keyword tag. It's also cool if I'm looking at a name record there, and let's say that I was working with Leslie and I wanted to tag her a couple of keywords, I can put some skill-related keywords in here so I can say maybe I know she's in biotech and computer CAD and defense and I can apply those so I can add these maybe I know she's great biotech I can actually tag that to her name so it's always going to show at the top of her record there so I can keyword tag her and then I can take up to three tags and and apply them to her main header up there, up at the top of her screen there. And what would that do? If you wrote her something, it would have, or is that just to identify her top skills? Top skills, and that's going to show, just tag that right at the top of her record any time she might come up. And, of course, when she comes up over here, it doesn't show up, right? No, it doesn't show up over in the left-hand side of the screen. just when you click into her specific record. Okay. It's going to tag it up at the top. What is this right here? Like, what does that do? Send a message or a text? Where's that? This? Oh, I can't see your cursor. Can you see mine now? Nope. Which are you looking at? This right here. Next to biotech, biotech. See the, like, it looks like, right, contact. Oh, that's contact. What that does, yeah, that's going to let you send an email, call, or a text. So that's going to let you, if you have RingCentral, that will enable the call and text, or if they have a phone number, that will enable the call or text option. Or if you have an email address, that will let you email. With your SMS through RingCentral, I have RingCentral, and the problem is, like in 2019 when my dad was dying, I had somebody doing my website and they basically took off with my money. So I didn't finish it. I had never gone back up. I did get it back up, but I used like, I don't know, GoDaddy. It wasn't what I wanted. So I basically didn't pay this year because I wanted with all the AI, there's so much new technology. And I was getting quotes of $4,000, which I can't afford with all my health bills. So I'm just using all this AI to start creating it. But if you wanted to send group texts across the board, that is something that has to be on your website, from what I understand, in order to send SMSs so that they can opt out on your website. Do you know anything about that? Not a whole lot about that. But I do know sending bulk text is a pain in the butt with RingCentral, really with most because of all the laws and the guidelines you have to follow as you're sending that. I think that what RingCentral did for a while, and they may still, if you want to send bulk text, you do have to have all your recipients opt in. and that opt-in could be I think on your website usually it's a bulk letter that we have someone send send that bulk letter and then they can opt in from that capacity and that's the only way you can bulk text people so a lot of people I don't know a lot of people are really bulk text anymore because it's such a hassle so instead what people will do is so use our sequencing tool and using the sequencing tool you can essentially make one step in your sequence send a text and when that happens yeah so when that happens maybe the first step is going to be an email and then you can say when they open that email then send a text or if they click this link send a text so that's not bulk texting that's individually texting them based on something that they do thus they don't have to log in and you're not blasting out a whole bunch of texts at once you're sending them out individually as that person kind of does that step so it makes it a little bit easier to use so the texting can be part of a sequence and if you have the sequencing set up the sequencing actually looks the same in both PCR 9 and PCRM because it was designed after PCRM was already in production so if I looked at templates and I just and I I don't know if you use this at all, but you could say. No, because I never was able to set up a sequence because I felt like every time it was too constrictive because I try to contact people, whether, you know, by phone. It didn't seem to follow what I needed to follow. and um you know i might try to call somebody six times and no answer or spoke to them said i'd send an email and so mine was more like not linear mine was more like a family tree you know within sprouts going different ways didn't answer you know yeah so what does there were just a lot of yeah you could set that up yeah so I could say that if I hit left message that is then going to jump to the next step which is send an automatic SMS so that of these only if you selected left message would it send that text you could select interested or you could select nothing as you go there maybe your step is to give them three calls So what you could do is... Is that going through the RingCentral left message? Yeah, in here, this requires RingCentral to send text through sequencing, but it doesn't require the ability to bulk text. Okay, so do you know if you have to have your website up and you have to have that? I don't believe so. I've never heard of that requirement. I don't believe so. Yeah, I have it here somewhere, but they threw everything from upstairs, downstairs. I'm looking for it. Yeah, I've not heard that. I swear my concussion is really bad. I can't even think. But I can circle it and send it to you if you have any other callers requested. But It's not an easy thing to do, but I understand. Yeah, so you can go through here. If you wish, if you had the RingCentral, you could put in a script, and you could click the little dial button, and that would automatically dial it, and then you can read your script, and then you can go right here. Then you are able to say what happened. So you can choose whether it's left message. That might go to a different step. Maybe no answer just leaves them at this step. maybe not interested, puts them out of the process. So in the setup, you can kind of pick what's going to trigger or what will be triggered by each of these various different selections. So you can kind of pick that. Are you able to pull up mine, my screen? I can't, but I can share it so you can share your screen if you have it pulled up. Let me see. Let me see if I can. I should be able to make you host. How do I get back to that? You are the host now? Yep, yep. Click that and it should then give you the ability to share. Okay, share. Okay, I was going on. And it's not shared yet, so there might be something else you have to click because I just see, oh, there it comes. Okay, now I see. I see the Zoom screen, so you are sharing now. Okay. And this is where I get a hang up. A, I can't, if I don't remember my passcode, and I can never use PC Recruiter on my phone. But when I go to manage passcodes, it'll say, let me just. Okay. I don't think this is it, but see if it works. Oh, it did open it. Okay, it told me on my phone that it wasn't right. Always make sure that you're trying to log into the correct database in the drop-down if you're logging on from the phone. Sometimes it'll have a wrong database. You know what? Let me grab my phone because it's saying it's the wrong database, but I don't see where their choice was. Let me really look for it. Are you in the mobile app? Is that what you've got? Yeah. Yeah. Okay. Yeah. There's a place. I mean, PCR recruiter. So I'm looking at it now. It says invalid HTML login is failed due to username and or passcode. So it says username. And mine is admin. I saw that. And the password was, what, lion? Do you remember if there was an exclamation point? I didn't see it. I only saw the dots. and it's not when I do select database it doesn't it's not showing any other database it just says select database ID there's no little drop down or hamburger button or anything like that looks like there's a drop down but it says wait a minute it says cop oh shoot let me just send you I hate when that happens okay Let's see if this is it. It disappeared again. Okay. It says select database ID. And when I try to do that, it says copy, select, select all, speak, sentence, autofill. But I don't, it doesn't give you choices, but at the bottom where it turns gray, after right below the select database ID, it says sign in, change login URL, and then it goes to a completely light gray area, it says select database ID. The select database ID is not scrolling up or down to allow me to change the database ID. The only thing I could suggest is maybe update your app. And I don't know much. Like, I'm already logged in as mine, so I can't even get to the login screen because mine's always logged in. So I don't know. I did that, but maybe next time I'll get somebody who's in, like, the tech and have them if it doesn't work. Because I did delete it and re-added it, and I still had remove app. get one of my texts on the phone if you want or I can put in a ticket if you want and have one of them it'd be great if you could put in a ticket yeah I can do that um yeah I'll put that to you to have them help you with that app but if you look at my so if I when I maybe I do things best afterwards but say I have a company and I'm working a position. You know, I look at roll, I'll create a roll up, but see how like, I don't know how to delete these. I mean, some of them are like really old. Is there a way to delete them? I think you can check that checkbox over to the left side. So if you want to pick one to delete, check that checkbox. And then in the upper right hand corner, see that red trash can? Yeah, I think that will delete the roll-up list. And you have to type delete in there. We've done that just so you don't accidentally delete something that you don't mean to. And then that will delete the roll-up list out. Because what seems to happen is, you know, we have so many in here that go on forever. And, like, marketing manager, you know, this one has nobody in it to delete it. But when I want to put something in, you know, it's limited to certain categories like those. And it's just too short of a category list. User selected, okay, that's show private roll-up list. I don't really have any private, but show recent or show all. but if I it's hard for me to search because sometimes I might do WL Gore Gore cardiovascular or just Gore I mean this is easier but sometime I might do East Coast and then the company you should just go to hit like hit East coaster and just hit search or hit enter and it should filter it down to just those like even if i'm looking for something else and then i hit search like nothing but if i hit you know maybe it might come up with regional manager but see it's That's the area, Chicago, description. Uh-huh. I don't think you can search by description. I think you can only search a roll-up list by the title of the roll-up list. Description. Yeah, I don't think you can search by description. I don't use category or description. Oh, yeah, description. Yeah, I don't think you can search by description. I think you can only search by title. There's no way for you to be able to search by year, right? Like they created? Yeah, because maybe I want to go back and compare something I did. three years ago, so you mean the guy just left? And I could go back and look at that search three years ago. I can't remember. I can't find it in there because I called it something different. But is there any way to search what you created like these years? Like if you were going to do a, what is it called? Microsoft, is it Sheets? And you can just go, you know, organize things by, you know, year or month or city. The role of list menu doesn't sort by date created. It shows it, but you can't sort by it. Like if you do a keyword search of names, you can search by like last activity date or date created if you show it there. But the role of lists don't do that, unfortunately. The role of lists are only searchable by name, unfortunately. I can't read. That's something they could consider adding just a little bit more, just as a more, an easier way. Because say I want to like look for somebody that's been active recently. And I want to, you know, I'm going to look up name. And this is where I have a really difficult time using the database. because rarely, you know, a lot of times it doesn't bring in the person's, sometimes it doesn't bring in the person's state and zip code when they pull in the resume. But say I'm going to do keywords and I want to put, should I put, does it need to be done like Boolean or does it need to be, let's say laparoscopy and or how would I do that? If you want or I think you could just leave a space or type the word or if you want and you have to type A-N-D so if we typed in that word A-N-D and then another word that's searching for both of those words But you don't need commas? No and you want either and or or you don't want both and and or and or minimally invasive so is that wrong yeah because you have an and and an or together so you want to hide it so if you if you want all three of these just make sure that they say and so laparoscopic they won't include all of them because laparoscopic and minimally invasive are rather tied in. I'd make it an or. You would say or? Because the NET's going to look for either of those. Yes, so, and usually if you want any of these, it's just best to put OR in between each one. Oh, but won't it... Will it knock out the other ones? No, it shouldn't. Or it's going to look for all of them. If you put ors in between, it's going to look for one or the other ors. So anybody that comes back could have any of these words, or all of them, or three of them, or one of them, or anything like that. Yeah, so you've got all of your oars. And I would say when you put that in highlight and copy it, and I'll show you a different trick here. And do what in copy it? Control-A and Control-C. so highlight all of that thing that you just typed in and copy it because I don't know if when we come back I don't know if we can back you want me to copy it copy yeah copy it so it'll be on your clipboard if you need it now hit search and you're going to get some results and it's going to bring back everybody who has any of those words and it's going to show everything that's going on with them So it should bring that back. And you've got 24,000 people. And you'll see the score is showing you RNP for the first couple people. That's showing it was found in their resume, their notes, their profiles. And you can, of course, click on the R. It'll show their resume in the bottom frame, and it'll highlight the words. Okay. Right. But I wanted to look up and find out when the last time I talked to them was. Is there a way? I know, but there's no way I can click a down button or an up button. Click right there right now. I think that does sort, maybe. They told me they were doing that, but I don't see it. 24, 2011, 24. Let me try something here. I'm going to try it in my database. And I'm also going to add the state. Okay. I don't know can I go back you can you can that's why I had to copy that so if you where it's not a search where it says basic search up at the top that's a link click back to that and that should right there that should take you back you can add now things to it okay so you could also in any of those hit the drop down, select state, and then type in the state abbreviation to add state there. I'm just going to do FL in case it's both. It should include both, right? Would it include both Florida and FL? FL? Yeah, if you put just FL, that's going to be a good way to do it. So now I just want to get. Now, if you would click on the last activity, mine's sorted. So just click right there. Just click once. Right next to last activity. We'll see. Because I can sort my last activity and it doesn't seem to be doing it. Let me have you do one more thing. Right below where you clicked basic search, click advanced for me if you would. click that and okay you need the search upgrade uh so see in the upper right hand corner it says keyword version two okay that's an older search engine we are now on a lucene search where i can't use my database to search anything and actually the good news is we're upgrading people to lucene at no cost now because there's not that many people left not on Lucene, so there's no cost to do it. But let me retake the host. I want to show you what that should look like for you now. Let's go through here. You want to take both of my screens? Oh, I'm going to take my screen back. I'm going to go through Reclaim Host and share. Whoops. Share the screen here. Okay, are you looking back at my screen now with PC Recruiter? It looks like my picture's at the top. Okay, let me share it one more time. Do I need to accept analysis? Oh, wait, I might have to. Could you hold one second? Yeah, I'm letting the guy out of the door. Is that what I think it is? Okay. Okay. Do you see my screen now? Maybe I need to reduce mine. Maybe, yeah. I think I'm screen sharing in the Zoom right now. I don't know why this is here. Show meeting, remote control, and you are screen sharing. Chat, participants, video, audio. I've got... Somehow... Okay, let me see. Okay. Yeah. Viewer screen sharing. It says Zoom, ProTip, Accomplish More with Zoom. Is that you? No. Let's see. No. I'm trying to share my screen here, but I don't know why I'm not able to do it. Let's see. How will I know if it's you? Well, it's... I'm going to share right now. I have shared my PCRM screen. So go back into your Zoom, and you should be looking at it. It's my record on my PCRM screen. Oh, wait. Wait. I think I figured it out. It was telling me. I hit share. Okay. Okay, now. I see my record. Okay. Somehow it was set to multiple people can share at a time, which that seems confusing. I don't know why you'd ever want to do that. So I'm now in my PC recruiter. Do you see my sign in okay? Or my search screen here? Yes. Okay, so if I go into the search with the Lucene search, if I go here and I say I'm looking for sales and marketing, so I type in what I want there, let me show you what the Lucene is going to do. When I run this search, it's a new search tool, essentially, for PC Recruiter that's going to allow some additional areas to be searched. But also, you'll see if I scroll over to the right and I see my last activity, it's 718 on that top one. I can click the header just like that. It's now going to be 8-5. You know, and that's what they told me before. I'd have to take all the people from the group that I wanted to add. Then I'd have to go sort them and do it by year by sorting them. And I'm like, oh, my God, that's ridiculous. Yeah, you need to upgrade to Lucene. So what that is, the index, the ability to search the database, you have the older version. It's called Keyword Version 2, and it's simply an older search version. Nothing wrong with it. It just works a little different than the Lucene. The Lucene is a little bit newer. I really barely work in PC Recruiter because I feel like I use LinkedIn to search my people because I don't have, like, I find it so hard to find people and then do a search and do a roll up and then check that or do keywords and get scroll. I have to scroll through activity, so I'm glad. How do you guys let people know that this is available? No one ever, like, I've never heard this. Well, this one was a bit unique because it wasn't something that we, most updates of PC Recruiter are just applied directly to the database and you get them. This one we couldn't because this requires a reindex of your entire database. So this one, people had to kind of request it. It was probably mentioned or posted about, but it was never anything that was really, like we couldn't move everyone to it. So we still run into people who are on the keyword version 2 now, and there's nothing wrong with that, but the leucine is better. And the leucine is going to be actually, if you did decide to go to add PCRM, leucine is required because the PCRM only runs on leucine. So that is something that what I'll do is I can put in a ticket, have you re-indexed into the Lucene search sometime this week. So that will happen for you automatically. If you look at my use of PC Recruiter, it's like nil. That's probably why you never noticed you were on an older search. Well, I just didn't know you had anything newer. because I would call and they would just, you know, you can't look up by last activity. What you can do is group those people like clicking on them and then add them to a separate roll up and then sort the dates. But I was like, that is just so much work. It's so beyond the point. And so many of these other, you know, ATS systems don't do that. And they have so many other systems that integrate to make it, you know, more user friendly and not have to do so many steps to just get to, you know, taking notes and keeping yourself in order. Yeah, so I'll get that. So that'll also give you the ability to search some additional areas of the database as well. So you see my score column over there? it actually has the ability now let me move my slider over oops wait a minute it's not going hold on a second results 15 59 zero selected where is the score so the score is going to be this green column over here so that's going to give you yep so that's going to allow you to search just like you do now resumes notes keywords but this one also adds all attachments your summary screens your profiles so you have some additional searchable areas with the lucene search as well too Let me ask you something. When you've got, you know, resume, I mean, I like this, that you've got all that. Usually I can only see if there's a resume. You know, I add notes. And one thing I hate is that, you know, when you have a new LinkedIn, I mean, PCR, and you're on LinkedIn, and you've got the LinkedIn recruiter, so it's supposed to like inhale or whatever. that person you're looking at on LinkedIn and LinkedIn match. What happens is there's a place for notes, but you can't really type a boatload in there. have it come up. There's only one phone number you could put in. So it turns out, say I'm using Lucia at the same time and it has two phone numbers, I'm putting the number in notes. And unfortunately, with the way PCR works, if you go make a phone call and say it's the wrong phone call or the email and there's a work email and there's a personal email, it's only going to use the first entry or it's going to come back unusable. So my, you know, I don't have great results with that. And the other thing is using the LinkedIn tool, it doesn't, you know, when I look at the best information you can put in. And I'm just going to show you. I don't like the, you know, the keywords. I think between all the people that work for me, I mean, I have like stuff like, and it was probably set by you guys, but like this specific industry code, like cement, HVAC, Stuff that's, you know, totally out of my field that I have to go through a million different. How do I say this? I have to go through so many different keywords or key like numbers. What is it called? Like a CNIS number or a whatever the government considers that industry. let me see while you're doing that if I roll down this now that's like a mark I was just doing a little setup in the capture tool that if you want you can have more than one email or phone field in the capture. So if you want to, that might help parsing a little better. Right. But you didn't do it on mine. You did it on yours, right? I did it on mine. Yeah. Yeah. Yeah. So that's, that's where I get confused because in the actual contact record itself, it has like two email addresses, cell or, I mean, yeah, I'm sorry. Yeah, your cell or your home number. And then your work or your personal email address, your location. Yeah, you could have as many as you wish. Like I added the contact information cube and I added cell phone, work phone, home phone, or you could add two or more email address fields. So you could kind of handle those in here and update them. And then when you go back to the record, if you're looking at a record, you could have more than one phone field in here. You just pick which one you want to use or email. So you can do that, too. If you look at mine and then also if you look at what I was looking at is. Attachments and activities. Shoot. Let me just look at my resume notes. Are you able to bring mine up behind yours? I can't. Well, I could if I could log in. What's your username and password? It's admin. Let me get to the link. And then it's Lion, King, the L, and the K are both capital. Okay. Which database do you go in? Medical Recruiters? capital L I O N capital L and then I O N capital K I N G. I think it's exclamation point. If it's not, it's dollar sign. I knew that one and it might be dollar. Try not Lion King 9 1 8. I didn't like that either. Hold on a second. Let me try to put it in. I just entered it. Oh, you moved it. I just entered it. Let me try it. What are you doing? Jim oh I'm in mine yeah all right I'm in my screen I'm sorry I thought you were doing mine no no no I can't do yours okay Lion King let me try to fill this in I think it's I don't know you might have to backtrack it why can't I have nothing this is just like that's all this says so I don't have anything in there. Lion King 918 try exclamation oh that's not exclamation dollar sign Let me look on my laptop, my phone. I just changed it. And that's something like when you get in there, I wish they had the eyeball so you could look. I think they do that because it's encrypted. that it's encrypted for security, so you can't ever, like not even system admins can see it. Okay, I'm just loading up my Apple. Does Apple work better or worse with your platform? Nowadays, about the same. Okay. Because this is a Windows 10, and I need to get the new one because they're not going to support it. As of either November or October. I'm just so used to using, I have a Mac laptop. And I have Microsoft. Why can't I find it? Trying to get into PC recruiter, right? And the database is the medical recruiters database, correct? Correct. not medical recruiters restore, just the plain medical recruiters. Plain medical recruiters because... There it is. Lion King, just the L and the K are capital. The number 918, dollar sign, exclamation. Oh, well, now I've just excluded. Let's see. Oh, yeah. Now I've exceeded the number of tries so it won't let me go right now. Right. Let's try. Yeah, so I can't go in now. What was the question you were having? Well, when mine comes up, what I normally say, one second, I have to unsign in. now just that I exceeded mine I just went in the first time I can't get in either I can get on my that computer the one we're on now but I guess it's not going to let me but when I open it is such an old tab I mean it looks like Terry Stidham you know first name initial identical, you know, but like, you know, all the, all of these, I don't know if you can slide it up at the gray part. No, from the top. Yeah, I can do that. At that area, right. Well, yeah. And then, oops, down. Yeah, yours is so much more, there's so much more content. But anyway, the, oops, back up. If you do this and then look at mine, it has, you know, name, middle initial, last name, and then it'll have, let me see if I can pull it up. Oh, because you sign in. Maybe it will, maybe it won't, maybe it did. Let me see. Maybe it don't. So mine has, if I can send you a screenshot, how long does it take to, when it takes you out, how long does it restore? I don't know. I don't know how long it will make you locked out. But yeah, you can change this. So you can add additional fields and stuff like that. So you could add multiple fields, add multiple groups of fields. There's some different things you could do. I'm thinking time with the trainer might be good to kind of help you to configure what you need there. And they're going to be better than I am at a lot of this. When I signed up, they had given me unlimited training. And, you know, I, then when I changed, because I paid like 30 grand for it because my ex-husband was like, you know, you had it. what was it, gold mine you had? You know, I had three others that all went bankrupt, so I lost everything. So it's like you don't want to take a chance and lose your data again. So buy it. But I never knew for like five, six years that changes were being made and it automatically updated if you had the online version. so all of those things maybe for eight to ten years were stuck in the old version and we weren't able to change them so we never kind of got any idea how to to do it and if you look at mine they're so out of date they're so limited so i am trying to get on to that um but if you looked at mine, you'd be like, what? Because you can only do by like codes, like their keywords or their, and most of them don't fit. They're nothing in my industry. And they might have been an old pre-populated random list that came with the software. You run the self-hosting. to, you know, make it, you know, I'd have to go through probably 3000 codes and hundreds and hundreds of different titles because it goes from gravel to gypsum. I mean, it goes plastics and everything I'm not in. So I don't know if there's some way to narrow all that down and then allow me to add what I need to add if something's missing. But I don't have like a three-page screen like this. I mean, this would be great. Mine is two pages and it's just too limited. Yeah, it can be changed. So we can get in there, maybe get a trainer in there with you to show you how to change it and change it as you go. That might be a good thing to do. In the meantime, let me get a ticket in to get you upgraded to Lucene. a ticket in to get you some help on the app so we can get those two items underway. Did you have any interest where you think about adding the PCRM? That comes with some training, if you were thinking about it, or do you want to think about that a little bit more? How much is it? It's $3.50 to set it up, and that includes four hours of training, and that it would bump you up $10 more per user per month. So instead of $75, you'd be at $85 per user per month. Oh, absolutely. I want to do it. When I looked at, oh, God, what is it? Yesterday on, not Chetch, maybe Chetch EPT4, what things I need to integrate to be able to use, because I use Lucia, LinkedIn Recruiter Lite. what else do I use the tech stack I would need to better work with my LinkedIn I mean my PCR and it gave me you know many but here it is the best tech stack to use with PC Recruiter LinkedIn Recruiter Lite bring central and to integrate your website. It says core tools already in use. And then it says recommended actions, fully integrate or complement existing stack, website plus branding plus content, platform of Webflow or WordPress Elementor. I don't know what you guys prefer, I prefer brand support considering 99designs or River Pro, content creation tools, Jasper, Writesonics, Canva Pro. I mean, I have a subscription to Canva. I just find it hard to use. SEO and site optimization, Yoast, SEO, WordPress, or Ahrefs, webmaster tools, lead management and outreach, Apollo, IO, or Instantly.ai for cold reach. Zapier automates tasks between PC recruiter, Lucia, LinkedIn, email, Google Sheets, and auto-log candidate activity for client responses. Do you recommend Zapier? Is that how you say it? It does work with PC Recruiter. I've come across people using it in the past. What it's a good thing to do is if you have something else that you want PC Recruiter to integrate with, Zapier will act as a bridge between PC Recruiter and another product. so like link like for linkedin you know you guys already have the inhale yeah that's what i mean the capture but if i wanted there's no place on that capture like say i have a new candidate that i'm trying to suck in and i want that person right there to be linked to a roll-up list. There's no way to do that. I have to reopen the candidate, then click a roll-up list, add them to the roll-up list, check that, you know what I mean? So it's a lot more tedious. You can add them. That's a setup in the Capture tool. So if you're looking at Capture, you can actually make an option, add them to a roll-up. right on the caption, along with add a note or link to a position. I do that, but if I do add to roll up, okay, on mine, mine doesn't come down like that. Let me just see. I don't know if I can sign in. It's just not getting me. It should be your drop down. It should be a searchable drop down. So you can kind of search what roll up list you wish, even just type in the first letter. or if you can kind of keep going and search it that way. Mine keeps coming up. Let's see. There. Is there any way I can just... I'm on... Let me see if I can click PCR and it'll just not be this one that says book a demo. They keep saying book a demo. I can't sign in from there. Okay. Try one more time. You have exceeded amount of login attempts. Dear God. I don't know how long it is. How about that? I think it's a security issue, just so they don't have people trying to guess passwords and everything like that. I don't know how many it takes to lock it up or how long it stays locked, but I can't imagine it's more than 15 or 20 minutes maybe. I've been trying to get on my laptop for a couple days. So I don't know. Well, let me, I've got to get going here. I've got something else scheduled coming up here. But let me get at least our tickets in for the Lucene and the App Help. And then if you get someone on the phone helping you with the app, I'm sure if you have a couple other questions, they can help you with those as well. Kind of get you some things figured out. And then did you want me to send over the paperwork to upgrade to add the PCRM? Please. Okay. And is your, just to make sure I've still got your company name and address correct, is it still, I've got you as Bailey Search and Associates. Is that your current company name or is it Medical Recruiters? But Medical Recruiters is my website. Okay. So I'll put on Medical Recruiters. Okay. And then is the address I have, 7745 Southwest 143rd Street, still the right address or no? Uh-huh. That is. Okay. Very well. Very well. I'll email that over to you. Get that underway. Let me know if you have questions on that, and then I'll check back tomorrow or the next day just to see kind of where we're going, get those tickets in. and kind of take the next step from there. All right. Thank you so much. My pleasure. We'll talk to you soon. Thank you. All right. Bye-bye. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1234.4216,
    "salad_processing_time": 395.7744650840759,
    "overall_processing_time": 1234.4216,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID.  Enter your participant ID followed by pound.",
    "job_id": "9aeabcf6-683f-47c2-b09c-fdf22c6703da",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 1
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3040478677036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}