{
  "recording_id": "3041175135036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:52:15.969364Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:52:15",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID. Enter your participant ID followed by pound. Otherwise, just press pound. You are in the meeting now. You are the first participant. Please stand by. Thank you. Good afternoon. This is Jim. Hi, Jim. Neil Marshall. Hey, Neil. How are you? I'm doing good thanks for that self I'm all right I am all right glad we could connect today yes I wanted to wanted to talk a little bit about what you're looking for in a software package what you're using now what's working what's not working and see how I can help if we'd be a fit and I have allowed time to take you through a demo if you wish or we could schedule a different time if that works better that's all on you but just wanted to uh kind of see what you're looking for? Can I open the dialogue? Sure. So let me tell you this story, Jim. And I'm going to go and maybe give you some details that won't seem pertinent at first, but I think as we evolve, I think it'll end up being pertinent. So we started HealthSearch Partners about eight years ago. It was actually three firms that came together to form Health Search Partners. Two of us rolled our firms into Health Search Partners. One of them, Faith Search Partners, just moved their healthcare practice into Health Search Partners and kept their faith practice separate and as a going concern. FaithSearch then became our back office. They did all of our database work, billing, collect. I mean, all of the back office stuff was done by FaithSearch partners. Fast forward eight years, we've decided to split from FaithSearch and so we will be needing our own database solution. The split comes November the 11th and so we'll need our own solution and up and running by then. FaithSearch, the solution that we've used has been Salesforce, but we will not be moving forward with Salesforce. Okay. For a variety of reasons. If you'd like the reasons, and I don't know that I can articulate them, except that to me, Salesforce is a big, I don't know, it's like a big Ferrari, right? It goes 200 miles an hour, but it breaks down. It needs a whole team of people to keep it going. And we need something that'll get us from A to Z at 70 miles an hour, not 200. And we need something that we don't need a team of people to keep it running. Okay, excellent. And what do you use right now as an ATS? Anything? No, Salesforce. Oh, Salesforce for everything. All your tracking and everything is done in Salesforce. Yeah, yeah. Okay. But I will also say that, you know, we're an executive search firm, Jim. We're not a, you know, we don't have 10,000 open requisitions or anything like that. I mean, we've got eight or 10 at any given time. We're less about the applicant tracking and more about the database management, if you will. Although, you know, having an applicant tracking system that works really well and is really intuitive and, you know, is built kind of for that executive search function would not be bad. Okay, okay. And are you looking for what basic main features are you looking for in the software? What are the main problems you need for it to solve? I think the first is a place to house our database. Number two, a function that we can easily manipulate such to come up with a group of candidates that we can send solicitations to and then track the progress intuitively through to the end. Perfect, perfect. Excellent. Are you looking for any back office at all? Billing or invoicing or anything like that? I'm sorry, to do what? Billing, invoicing, anything like that? Are you looking for anything? Not really. I mean, we do all of that kind of, you know, by hand, and there's not a whole lot of it, you know. Excellent, excellent. And are you looking to convert any Salesforce data? Are you looking to take a copy of the database, convert it into something new? Yes. Okay. And that is up on 11.11, or is it you're separating the companies as of 11.11? I'm not sure I understand the distinction. Does your sales force have a drop-dead date? Do you have a contract end date that sales force goes away? No. But November 11, our access to it will go away through this other firm. Perfect. So they're keeping it, and you'll – okay, so you're done then. Right. Good. Okay. And about how many people would you have utilizing a system? Eight to ten. Okay. Perfect. Hey, Jim, out of curiosity, are you going to be up on camera, or am I talking to your white name the whole time? No, I am in here. I will pop it on now. Yeah, for sure. I normally don't keep it on when I'm doing a demo, which is mostly what I do, but I'll pop it back on now for sure. I've gotten to the point where I like to know who I'm talking to. Oh, for sure. Yeah, usually I'm just doing a demo, so I'm looking down, taking notes, and rather than look at the top of my head, that's why I leave it off by default, but I turn it on. I'm not averse to turning it on at all. Good. Okay, so 8 to 10 users, I know that time frame. Did you want to take a look around a little bit at the system? Yeah, I mean, I'd like to kind of – I mean, part of the reason that I gave you, you know, what we're looking for and all of that is I would hope that, yeah, you'd be able to kind of show me the things maybe that make you guys, you know, stand out. For sure. Yeah, let me show you around what we have and how we look. I'll show you a couple of options within our system here. I'm going to share my screen and you should momentarily be looking at the sign in for PC Recruiter. Do you see that? Got it. Fantastic. Fantastic. So I'm going to go ahead and get logged on. So this is all cloud based. So PC Recruiter is going to be something that runs on a PC or a Mac. It's going to run primarily on Chrome, but it'll work on Edge, Safari as well. So a lot of ways you can access it. We have a mobile app as well. Each user is going to have their own unique username and IP. That will get you into the system. So I can get logged in here. I can go ahead. Once I'm into the system here, this is going to be the general look of how things will work. So you're going to have a main menu bar at the top. That's going to be your primary navigation. The middle area is going to be for searching, search results and lists, and the lower portion is going to be for the records themselves. So that's the general flow of the database here. And as we go through, you're going to be able to look at kind of your main elements, your names, your companies, and your positions. Those are our three primary record types in PC Recruiter. Okay. Right. So you're going to have names. That's going to be your candidates, also your contacts, companies that you're working with, or companies you're marketing toward. So you can kind of track both in there. And then the positions, the jobs you're looking to fill. So that's going to be kind of the three primary record types in here. and the positions if you wish to track a detailed pipeline you can track a detailed custom interview pipeline showing who is at what step in each process you can easily search through your candidates so if i needed to find somebody who was a controller i can type in controller and that's going to find and that's going on searching companies that's why so i can easily go through and find everyone who's a controller or any type of skill I might wish and as I go through I'm going to have all the information here I can see how it was entered somebody put something in their notes or if they had it in their resume or anything like that many searchable data points within pc recruiter and that it's very easy to take this whole list of individuals I can just go ahead and select everyone and I could do a couple things I could write from here send them an email campaign so I could just blast about a pre-written email maybe a listing to a job and when I do this I can submit email campaign that I can see opens clicks replies unsubscribes anything like that so I can see all that data when I send out a mass email campaign or I could put them onto a roll-up list I could pick a specific list in my database or create a brand new one call it whatever I'd like and then kind of isolate this group of people maybe I want to start using something like a pre pipeline if I wanted to keep this subset of individuals working through a roll-up list I could go in tomorrow the next day call a few people talk to a few people and as I do I'm going to be able to mark them different stages statuses priorities and then maybe link them to the pipeline if I needed to so I could do a lot of different things with the roll-ups or I could leave a link I'm ready to a pipeline if I wanted to put them into a an interview pipeline I could do that from here as well. Okay so a few different things I can do. Everything makes sense so far? Uh-huh. Okay perfect so so that's going to be a little bit of the basics here. Now some of these other elements up here in the main menu you've got a daily schedule, simply scheduling meetings, phone calls, follow-ups that'll sync with an Outlook calendar if you wish and you're going to have the ability to schedule follow-ups on there. I have one on the 15th and I can see there it's a call to follow up on a PowerPoint presentation so I can kind of go ahead and see what I have on my calendar I can easily drag and drop the move them around I can mark them completed so I can do a number of different things as I'm working through my schedule here the role on list we touched on those the roll-up lists are a nice tool in PC recruiter very versatile that's going to give you the capacity to just group people together for any use So you'll see I have a number of different lists in here. I have people with tech and sales experience. I have people within 40 miles of the Boston area who have marketing experience. Maybe I have account directors, account reps. You have an infinite number of those roll-up lists. Yes. As many as you like. Call it whatever you like. They can be as big, as small. You can add to them individually or en masse. So a lot of flexibility there. And it's going to show you. like I've got 112 people on my app engineer roll-up list and if I go into that list I can also put companies on it or positions on it if I ever needed to you probably aren't gonna use positions that much with only 8 to 10 open at a time you're not working huge high volume so that wouldn't be of much use it's usually the name side of things so I can go into my list of app engineers and if I open up that roll-up list that's gonna let me open up my view here and it's going to give me the top view is going to be the lists and as I click on to each individual person their record is going to show up at the bottom so I can look at Michelle I can go down to Pete I can click through to Susan I can go right through and here's a nice way to go through if I needed to call each person look at their resumes kind of a cool thing too if they had a resume if I looked at the resume of one person he doesn't have one but anybody else I click on it's going to default to go right to their resume so that'll kind of let me flip through them card to card if I wanted to look at each resume or maybe I called Philip and maybe I spoke with him briefly and we have a call scheduled for Wednesday I might even go in here log in activity and said called interested scheduled follow-up Wednesday so I can go ahead and note something that I spoke about this is going to be essentially the journal for this candidate and then if I go through here I can go ahead and schedule something on Wednesday maybe I want to do to 4 p.m. and I might have maybe it's an interview so I can pick one of my color-coded items on my calendar here you even have a number of different activity types so maybe this is cold call contact made or maybe I just want to put contacted or maybe it was a general screen whatever it might be so you can kind of preload the different activity types and then And that's going to help to better explain what has happened when you're creating these activities, scheduling the follow-up, reporting on the details and the results. Okay. And then maybe I want to put a quick note here and put in that he is of high priority. So I can put that he is somebody that's interested, somebody that's a good candidate. Maybe Frank Cicero is as well. I can mark him high priority. So I can kind of set up a bunch of different custom priorities to icon these individuals, make them easy to find the next time I come to this roll-up list. And, of course, the roll-up list is another place where you can send an email campaign or you can launch a sequence because included in our package is a sequencing piece where you can design drip campaigns. So you could set it up so that an email is sent initially. Then if they reply to the email, maybe they go on your call list. If they don't reply to it or acknowledge it in three days, maybe they get a secondary follow-up email, or maybe if you're using RingCentral, with which we integrate, it might even send them out a text. You can do a number of different things in an automated fashion through our sequencing piece within PC Recruiter. So your roll-ups are a lot of reporting capabilities. If you wanted to look at this analytics area, you're going to be able to take a look at custom reports. So I can look at metrics, and if I wanted to look at a pipeline activity report, and I can see everything I did within the last week or the last year or this month or anything like that, Here I've chosen to show just first interviews, second interviews, and phone screens. I can break them down by job and see within that year I work five different jobs. I can look at clients and see I work with five different clients. So I can easily toggle through my data to be able to see exactly what I've got going on here. Maybe I'll even want to throw it in like business development and I can pick any type of activities here. Maybe I even want to put calls, emails date records added anything like that I can add my own custom reporting engine in here so this is going to give me a lot of easy things to be able to report upon even lets me look at my email campaigns if I wanted to go back and see the last time I sent out maybe a campaign to update your contact info I can see I had a 74% click rate 32 people clicked my email I can even see who what they clicked how many times they clicked and what they did so I have all that data available to me right there cat so I'm going to be able to report on all that sometimes that happens so I have a lot of different things I can report on here and I'm going to be able to generate my own custom reports I can do some different things in there as far as whatever I wanted to look at to see how my email campaigns are doing to see how my interviews are doing my general work in in general is doing within the system there so I guess it's full report and then what email program do you did you integrate with like Outlook yeah yeah we have now what about for mass emails we do those internally we do those with PC recruiter so you can send mass emails from within PC recruiter and you're also going to have the capability to use something like send grid it's more popular one that people use if you wanted to send any a mass email but not risk your outlook address or something like that you can use something like SendGrid so you're able to send that through SendGrid as an alias so it's still going to come from you it's just actually going through SendGrid so that you don't have to worry about getting shut off or anything like that gotcha all right guys so pretty flexible there so yes so that's kind of that's Oh, the positions. We didn't look at those yet. If we go into positions, we can take a look there, and I'm going to be able to put my job openings into here. If I go through, let's say, maybe this lead engineer, if I look at the lead engineer position, I'm going to be able to put my positions in the system. I'm going to have the capacity to put a custom description in if I wish. I can also work within a pipeline so I can go through a pipeline here and then I have a custom pipeline of all my interviewees so if you wish you can track everybody and what stage they're in are they a phone screen resume review first interview second interview whatever you're going to be able to easily then drag and drop people from one step to the next as they kind of hit that next on. Right, okay. And then that produces reportable data as well. Any questions? Does that seem to make sense? Uh-huh. Okay, now we also actually have a different interface for PCRecruiter that we also have been including. It started out as kind of a redesign of this version of the software, but it morphed more into a CRM product, but it still contains all of the ATS functions. So I I'd like to show it too since you can get it included there. What it is, it's essentially the same thing, but it's going to be a newer format. It has a couple other features. I don't know if you're looking for like a CRM to track a sales pipeline. If you were, that's going to be something that's included in here. But if I went in here, I can actually go into the same exact records. I can look at Philip Baker, who we were looking into. We scheduled our follow-up with. I could see this is a little bit more modern of an interface a little more configurable still a lot of the same stuff like I can look at my activities there's that general screening that we scheduled for tomorrow so everything is right there so we do have this additional interface there it just kind of goes more left and right as opposed to up and down a little more configurable a little more modern interface or like if I go to my roll-ups here they are and I can open up my roll-up lists and then I can go through and toggle one through next so I can look at the person and then toggle through them this way they just stay open and then I move through okay okay so kind of get both interfaces you can pick which one you kind of think you might like to use but you can really use either there okay okay and they're actually here I accidentally click over here but here's an example of my calendar within PC recruiter I use it as my tracking tool so I keep color-coded items you'll see your name was on there at yellow because that was a time sensitive call I had scheduled today. Red is important. Dark purple is just kind of a general follow-up. Not as important. So I have all of my scheduled items here color-coded so I can see my to-do list for each day as I go through here. So that's just a real world example of how we utilize PC Recruiter. Okay. Okay. And cost-wise, just kind of a ballpark. If you look at PC Recruiter, right around 100 a month or so per user. We offer several different terms so you can do a month to month, a one year, a two year. The package that I showed you today is our premium package and it's going to be 115 per user per month. That's a one-year commitment. If you want on a month to month it's 125. If you went on a two-year goes down to 105. So you can kind of select how long you want to commit for and then it's however many users you are you can add or drop users as you wish so you're not locked into eight users if you need to add them pop me an email you can add a user drop a user just as easily so you can fluctuate that monthly if you need to the only other only other setup cost there's a one-time setup of 750 and that is to create this database link so you would have the link that you would use to access your database that's created and builds all of the templates and I'm sorry I'm sorry to create a link tell me what you mean well we would create the database and the link to get there so we would create a database on our servers it's a personalized link so you don't just go to pcrecruiter.net and log in you have your own personalized link so that's going to be your database so we would create the database put in all the standard features assist you setting it up hooking it to your outlook If you wanted to set up the mass email, that's included in there. There's some sequences that are included in there. As well, you get 10 hours of training with one of our dedicated trainers. So that also includes the 10 hours of training with a trainer of the system to get you up and running on the system. And they'll train you how to do everything, how to configure everything, configure screens, build form letters, anything you can do in the system, they cover you. and they're going to be one point person. You'd go to them for everything, and they would get you trained on the system. Over the first month or two is when they like to use all those training hours, and then they'll get you all trained up on the system. And that's 10 hours total or 10 hours per user? 10 hours total, but everybody can join every call, or maybe you want the initial call to be just customization and data and username creation, so maybe that's only going to be a couple admins, and then everybody else joins every other call. it's really your your choice how you want to set that up they give you a lot of leeway about who's going to need to be on what training what you're going to cover how the training is going to go a lot of flexibility on that and then database conversion a database conversion is going to be something we also do in-house for Salesforce it'll be a thousand bucks flat and that will convert the whole database into PC recruiter those take 60 to 90 days to get done so we have time before November but it takes 60 to 90 days to get the conversion done what they'll do is they'll take and translate the system they'll translate the Salesforce into PC recruiter and they'll work with you all along so they're going to work with you to build a separate specific kind of translation so a Salesforce to PC recruiter translation tool they'll run at a time or two let you review it make sure all the fields got to where they needed to be, make sure everything was the correct name, make sure all the data was there, attachments came, all of that. And then once everything is just as you wished it to be, they'll have, you get a final backup of your Salesforce, they'll run it over a weekend. And then it's usually live that Monday morning. Gotcha. Okay. Okay. What about, we probably have a loose file of PDF resumes that are maybe, I don't know, 5,000 or so. What about importing them in? We have a tool for that called the resume inhaler. And what the inhaler does is you can install it locally on your machine and you would simply point it at that file of resumes be it word be it outlook you can say go to this folder and import all of these and when you kick it off it just runs in the background it kind of cycles through a couple of second and it'll parse each one create a record for each one attach that resume to that record in a searchable format parses out all the basic contact info and it'll parse out essentially our manual parse if you wanted to parse a resume individually or or a small group of them, it would parse out essentially this contact information, name, city, state, email, phone numbers, title, stuff like that. So it would parse out all that to build the record, and then the entire resume is indexed for searching and attached to the record so you can keyword search on anything in it if you need to. And then how does it handle duplicates? If you're importing it like I just did, it'll kind of show you the resumes already there. Do you want to, if it notices it's the same name but a different resume, it'll give you the option to update the resume and archive the existing resume. If however it notices it's the exact same resume word for word, space for space, it'll simply tell you you already have this exact resume. Click here's the record that is linked to it. So you can create it, you You can update it if you wish. If you're using the resume inhaler, what it'll do is if it finds a duplicate either by resume or by name, it'll create a subfolder called duplicates, and it'll move that specific resume into that duplicates folder. So you can go through manually, check it later if you wish, see if you want to keep it, but it doesn't overwrite it because it sees it's a duplicate, and it just doesn't want to take a chance that that's an older resume or something like that. But it will kind of separate out the duplicates. and create a separate one. Show me how you would do a duplicate. Yeah, if I went in, just bring one in like this. So if I went and I was going to parse my resume. So I'm going to go ahead. I'm going to open one just off my hard drive here. So I should be able to go to Brian Mendoza as I get this resume parsed. So you see the resume is down there in that white area, and it's parsed out all the contact info. As soon as I hit save, I'm going to get a message here. This one is telling you the resume, this resume already exists in the system. So the exact resume, word for word, space for space, character for character, is there. So I can't do anything. It doesn't even give me the option to add it. It says click to view the name it's linked to. So I can click right there, go right to, I'm like, oh, this is the person. I can look. I know I've got the identical resume. Maybe I call them, hey, thanks for sending me along. I noticed you were in there before, whatever. But it's going to know that the resume is there. if however it was an updated or different resume than you had but it was the same person in the email address you would still get a very similar little pop-up window to the one that I had but it would tell you duplicate name detected click here to update the resume and archive the existing resume so what that would do is that would also give you with that little pop-up window but the little language would allow you to click right there and it would actually attach today's resume as the primary resume to that record and take the existing resume that was there and move it into the attachments which are still searchable it's just going to move it in that attachments area okay oh we also what are some other ways to go ahead I think I might be going where you're asking other areas that you can pull data in so we do have the ability to to pull data in from any of these different sites. So various versions of LinkedIn, Indeed, Career Builder, Facebook, Zoom Info, a few versions of that, Zing, Monster, Resume Library, and a few others. So this is our PC Recruiter Capture tool. This is an app that's included in the system as well, install it in your browser, so that if you were going to, let's say LinkedIn. So if I was on LinkedIn, and I wanted to import someone into my system here okay so I'm just gonna get a list of individuals so if I went down into here and I wanted to let's say I came across someone I wanted to get into my system here so if I go into Caroline Sundman here soon as I go to her record I'm gonna have a small click to add she's gonna pop up over in the far right over in the far right it might use behind my zoom window oh got it yep and if I click that that's our PC recruiter capture recognizing that you're looking at a record that it can bring in so click to add it's going to do a quick dupe search there too so if if it was a duplicate it would tell you hey there's a duplicate record found and it would let you kind of toggle between if you wanted to update the information that it found on LinkedIn or keep the information that you have in PC recruiter this one I don't don't have her in there already so it's showing me it's bringing in her name, her photo, her title. It'll sometimes get email and cell phone if you're a first degree. Beyond that it'll only pull it if they make it public which most people don't. So sometimes you get that sometimes you won't. It'll usually pull the location. So it'll put a location there and then you can put in a searchable note. Maybe if you wanted to add them onto one of your roll-up lists that could kind of start them off into a sequence or even link them right into a position pipeline. You can do that all right from here if you wish. And then when you hit submit, that is going to create a record for her. There's even a little click right to the record that's created. I don't have mine turned on at this time. But if I go into my PC recruiter here, I can go to my dashboard and I can see there's Carolyn Sundman that I just created. I created a brand new record. And what I've done is I've created a record. I've got her photo. I have one-click access to her LinkedIn page. I have her title, her name, PC recruiter then will put in your username, the time and date. It'll tag the sources LinkedIn because it knows where that's where she came from. It'll also log in activity. We created this. Does it also add her LinkedIn you know address? Yeah yeah that's right there. Yeah I see it. Okay. Or you can click the LinkedIn icon underneath her photo that'll go right to it as well and then what I think is cool here under attachments you also now have a completely searchable copy of her LinkedIn summary in there right so that is going to be something that I'm going to be able to keyword search on anytime I wish so when I go through if I'm looking for people sales marketing I'm going to be able to search those individuals and it's going to tell me whether it found the words that I searched for in their resume it'll highlight the instances maybe in their notes because I somebody typed that in there or maybe in their profile like I can look he he had a profile he fell online or maybe it might have even been a LinkedIn profile so I like his LinkedIn profile I found it in there so I can look through that I can go right to his LinkedIn profile there now when when it creates a new person do each person in your database have a database have a PC recruiter number they do they have an identification number and I don't know that it's in a standard field that's shown but you could show it but they're assigned a unique ID so they do have a unique ID so every single record person record that's created has a PC recruiter ID okay if I have I think they used to put it in the ID field let's see if that's even feel already exists where's it let's go ahead look if it's already saying in there I don't need to see it I just want to know if you had it okay well yeah there is identification field and they are generated and identification numbers who each person's gonna have their own oh we hear versus 140. Normally they're going to be quite long, quite lengthy. I don't know why here's him because he's an old old record. But yeah, they do have their own unique ID in there. Okay. And then there's also a CSV import. So if you ever had a spreadsheet of data that you wanted to get into the system, you have the capacity to map that spreadsheet in at any time. And you can kind of drag and drop whatever fields are the header of the column in Excel. You can map that into a specific field in PC Recruiter and then Enmasse map the data in. There's even some duplicate handling. So you can say if a duplicate is found, update the information. Or if a duplicate is found, skip it and don't do anything. And you can even tell it what you mean by duplicate. It has to be the same last name and email or the same last name and cell phone. Or even if you happen to have an identification number LinkedIn address on your spreadsheet, those are also good things to use as a duplicate identifier. And it'll either, will it merge data? Yeah, yeah, if you tell it if a duplicate is found, update the information, essentially merge it, it'll merge that information into your existing record if it finds a dupe. So it does do that. Or even if you happen to find a dupe anywhere in a record or in a list there's always a merge dupe button on it so merge names so you've got a merge duplicate number record or a merge names option anywhere you see a list of names so if you happen to find a duplicate you can merge it on the fly there pick which one's the master which one's going to be the the one merged into it and you can merge your data that way gotcha um So in organizations, you've got – or you call them companies. In companies, right? So each of the people that you have in your database, their companies that they are in are in your company database now. Is that correct? Usually, usually. So every name in PC Recruiter has to be associated to some company. so of course if it's if it's somebody that works at Vandelay industries we're going to put them under Vandelay industries and they're all going to be linked to that specific company now some customers of ours choose to keep a person and they create the company and link them to the company because maybe I know that I personally like to hire people from Melton logistics so I like to kind of put people there and know who all I have working there I could do that if I wish but another big option that people do and if I do a search here a lot of people will just create kind of a dummy company called candidates just like a holding area so that maybe I don't want to create a company for every single candidate in my system I could just insert them into the candidates company or resumes or talent pool or whatever you want to call it that way they're still searchable because they still have a resume so everywhere they've ever work, I'm still going to be able to search on anything in their resume, but I don't fill up my database with all kinds of random companies. So usually, I think for trainers, usually we'll recommend that by default, just kind of throw your candidates in a candidate's company. That way, the only people linked to companies are people you've placed or contacts at your client companies or companies you're working toward. So it's really up to you, but a lot of people just kind of put under candidates. Yeah, that's not really the way that we do it. And like I said, you could certainly do it the other way. You could always, maybe you only work with 400 different companies and that's it. So you could load them all in the system or if you enter a negative. I mean, ours is like 4,000, but yeah. Yeah, you could do that or you could enter the company and link the individuals to the company that you work for. Certainly, you could do that. So, yeah, there's nothing wrong with that. And a lot of people like it because I go to Apex Consulting. I'm able to look at all my people that I know that work there. Or if I happen to go to Robin Montoni, I can see, oh, she's working for me in sequence right now. So it makes it an easy way to kind of see what's what. So you can certainly do that. And if that's how it's set up in Salesforce, that's likely how it would be mapped over into PC Recruiter so the work would be done, the companies would be created if that's how they are in Salesforce. Yeah. When you send in a mass email, right, and an email bounces, what happens? Well, it's going to come back and it's going to show you that it bounced. So you're going to have that. It's not going to automatically remove it or anything, but it will show that it bounced. And we actually kind of divvy those up. So when you see the bounce rates right there, I had one bounce there. So if I look at bounce, I can go into it. I can tell that was a hard bounce. Hard bounce means the email address no longer exists. Soft bounce is going to be maybe they had a vacation responder on or something like that. So you got a response bounce back to you, but it wasn't that the email address no longer exists. So that's a soft bounce. So Andrew K., he's not disabled or anything, but it did note that it bounced that email address in your report. Where did it note other than the report? Oh, it doesn't? Let me look. I don't think it shows. So it's going to show under bounces. I can get the record from here. I don't think it puts an activity in. Let's take a look. I don't think it does. It doesn't log any kind of an activity that bounce. So in that case, like what we have, our marketing guy will often go in, and he would delete the email address or mark an activity, bounce. Even as simple as just going, maybe I happen to have, I don't even know if I have one. But if we had an activity that was bad email, he would just kind of pick bad email, save. But none of that's done automatically. None of that's done automatically. Is there any way to get that done? Not to my knowledge. Not to my knowledge. Let me ask you this. So let me finish. So I do a campaign of 1,000 emails, right? And I get 100 bounces. I'm able to extract those emails so I have that email address. Is there any way to take that whole file, 100 email addresses, right, and do something so that those 100 email addresses then populate some sort of field in the candidate file and we can mark them bad? Well, not automatically. I will check and see what my web guide does, but what you could do is if you had 100 bounced emails in here, you could select everybody's box. So you could go ahead and check everybody's box, and you could put them on a roll-up list. Then once they're on that roll-up list, you have the capacity to make mass changes. So maybe you have a field that says that email. So show me the mass changes you can do on a roll-up. Okay, so if I go over here, I go into system. So once I have the roll-up list, I would go down here into global change. And I would say, let's say change names. Here I can pick any field I want. I can limit it to the roll-up so I can pick my specific roll-up and I might plug in a new value. so I could say maybe I have a custom field called email bad and I might then put the new value is going to be returned or bounced or yes whatever it might be and then I would limited that roll up and I would hit apply and I could then it'll change or add something to that field on everybody on that roll up list yeah that's not what I want to do yeah I'll see if there's anything more automated for my web guy what what i want to be able to do jim is mark an email address as a bad email address not get rid of it because you know whenever you're dealing with situations where you you're dealing with a lot of people and you you know you're trying to find people and all of that sometimes you can find an email address right or you've got a program that creates an email address or whatever, right? So you try it and it doesn't work. But if you don't keep a record that that is a bad email address, you might do it six months from now, do the same thing again and again and again. Well, I don't want to do that. I want to keep all the bad email addresses and just mark them in such a way that they're bad, but we just keep them. We know we're not going to send to them, but we at least keep that bad email address. There is something that happens. I think that it draws a line through the email address. Let me talk to my team and see exactly what that is or how that happens or if that's an option or what, because I've seen something in the past that it would, for some reason, it would like draw a line through the email address that would denote it was a bounced email address so that you could, it was still there, but you could see if the record came up, you would see it just noted there with a line through it that it was bad. I'll check and see if I can find out more on that. All right. Yeah, I will check on that and see. Okay. Anything else I can show you? Any other questions? I was just going to say any other areas of the system. We've looked at the capture. we have job posting capabilities I know in your situation we don't do that that's why I didn't go there thank you yeah that is I really think PC Recruiter I'll check on that last question we had to learn more about that but anything else I can show you let me think here you know So as you look at PC Recruiter, I mean, you know, I realize it does a whole lot of stuff, right? But if you look at the market, what's one or two things that it does that nobody else does? If that exists. It might not. We have a tight Outlook integration. So if you want it, we even have a piece on this version of PC Recruiter that you can utilize PC Recruiter inside of your Outlook. So that's a little unique. Another cool thing that a lot of others still don't have is our profiles. So you can actually build profiles in PC Recruiter, like web forms, for any use. So that maybe I send an email to someone that has a little link to a questionnaire that I'm asking them to fill out. Or maybe I even open it up as I'm doing a phone screen, and I fill out a profile right from here. And I'm going to say, oh, I want to do his leadership questions. I want to open this. I want to ask these questions so you could build in kind of a blank form that you could open up and fill out as you Talk with someone online or you can email it out to them and have them fill it out online Either way whenever it's filled out and hit save that is a searchable attachment It can even auto fill fields So maybe if you had a field call management style it would plug in whatever he selected as soon as he filled it out So this is a bit of a unique tool the candidate profiles there and then also the sheer volume of software you get because we're now including both our standard PC Recruiter and our new PCRM product. So you have two interfaces. Why do you have both? Why don't you just convert to the new one? Well, because it's not a total replacement and we had so many people utilizing PCR9 that they really didn't necessarily want to switch right away. and it was originally going to be a replacement interface, but then they decided at the beginning of this year to not make it a replacement interface, to make it kind of a separate product. And a new code, huh? Yeah, yeah. And maybe eventually it will take over and more people and everyone will just start using PCRM and then PCR9 might phase out. But right now they made the decision to run both. So we've kind of been giving anyone new both versions to kind of see which one you like the best, see which one you feel like using. I'm used to the old one, but the new one has some things I like in it, so I like both. But really, they're adding to, just kind of making it a little bit easier to use, a little bit easier to pick up in this new interface here. So they just kind of decided we were going to do both versions, and we've been including it for everyone for now. Thanks. Um, you know, this may be a different question, Jim, but I ask it anyway. You know, if I were your brother-in-law, right, and for whatever reason, I just couldn't use PC Recruiter. but I'm you know run a search firm yada yada and I said Jim I can't use PC Recruiter what should I use probably tell me good I would say Top Echelon's product I think they're called TE Recruit I'm I'm sorry I uh you you cut in and out um as soon as you started answering that question I was going to say, I would say probably Top Echelon's product. I think they call it TE Recruit. That's a nice product, a good price point, a nice looking piece. They used to have Big Biller and they kind of have replaced it with their TE, I think it's called TE Recruit. So that's a nice, nice piece, good solid company. and there's a few others out there the one and i'll just candidly share that i get very bad reviews from is loxo uh that's one if there's one i always hear a bad review of it's usually them the others you hear good bad otherwise everything but loxo a lot of people don't really use what they were touted when they bought or they didn't like that they were sharing the data or anything anything like that. So that's one I would eke you away from, but TE recruit is probably a pretty good one. And then always there's, there's a recruiter flow and recruit soft and crelate. And those are some of the other ones we run into from time to time. Okay. Alrighty. Well, where we're sitting, I'm still trying to kind of figure out maybe the top three or four that I'll advance to my team who will look at it and probably do a presentation with the top three or four and then go from there. Fantastic. What I'll do as soon as I can collect the answers to the couple of questions I had, I'll let you know on those. Should be within the week. Then I'll touch base and then kind of from there, maybe figure out a follow-up time. Or if we don't, maybe check Check in a week or two. Is that reasonable? Yeah, that's fine. Good. Very well. Very well. Well, thanks for the time today. Thanks for fitting me in. And I'll get back to you with those questions. And anything else you need, feel free to reach out to me anytime. Will do. Thanks, Jim. Thank you very much, Joe. Take care. Bye. Okay. Bye-bye. Goodbye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1260.698707,
    "salad_processing_time": 283.1966073513031,
    "overall_processing_time": 1260.698707,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID.  Enter your participant ID followed by pound.",
    "job_id": "6a190a4f-19b1-4bed-9e18-f54f908f789b",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 1
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "billing",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3041175135036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}