{
  "recording_id": "3042344681036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:53:10.551010Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:53:10",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is McKenzie. How can I help you? Yeah, hi, McKenzie. My name is David Hill down here in San Antonio. I'm almost 20 years with you guys. How are you doing? I'm doing fine, David. How are you? I'm doing great and I was trying to solve this problem it it's one I had a long time ago but now my wife has it and I can't remember why I think we let our server company that holds our account or something like that go a day late and it screwed up the tie-in to PCR email and so I think hers is goofed up because it's not downloading properly her her emails any longer so I was hoping you could help me with that Mackenzie maybe even share the screen with me uh sure give me a minute here let me pull up your account and get logged in as you Okay, it's under Riverwalk down here in San Antonio. Riverwalk, two words. Okay. Thank you. Hold on one moment, please. Let me catch up to that. Riverwalk. Executive search. yes and you probably can see me working I think it might have been with Matt or somebody a while ago when I had the same problem and I think it's the same problem now for her I believe but maybe not I'm just guessing I'm not a techie guy Mackenzie but you know it's something with the whatever that acronym is, STP, blah, blah, blah. It starts to connect everything, and it doesn't seem – I think that's the issue. Okay. Okay. One second. There's two databases. Are you on the MR Riverwalk or the restored version of MR Riverwalk? Or she, sorry. Well, we're both on the same one. I guess the most recent one is what it is. The restored version. The restored version, okay. I'm pretty sure. And what's the username that she logs in with? She logs in with K-H-I-L-L, Kay Hill. All right. Thank you. I'm trying to log in. What's going on here? Oh, I was just taking a second to load. All right. Okay. So when you log in, you're going to PCR mail, right? You go to the top right menu and click email, and then that opens up a new tab, and you're in PCR mail. Okay, I'm logged in as Kay Hill, and I'm looking at her connection, and it says the password's invalid. Oh, password's invalid? Well, you want me to tell you what it is, the password? You don't have to do that. Maybe, maybe, not yet, though. Okay. I mean, I've got it because I just signed in, but it populates it automatically in my Google, but I can find it in Google. so for her username i think if i think an easy fix is just her to go in and re-establish her password i don't know if she changed her password or anything like that but it's saying the password is in there well here here's what i do know i'm looking at her email right now and the last email that she got downloaded from her Outlook that it's tied in from would have been 7-3, July 3rd. So she's had this problem about a month, and she's been bugging me to help her, and I'm just now getting on it. I'm not a good husband. Okay. You just mentioned Outlook for the first time. So is this in Outlook or PCR mail or both? No, it's just in PCR mail. She gets it in Outlook, but it doesn't convert it to PCR mail. Okay. Yeah, it looks like the most recent email inside the PCR mail is December 1, 2016. That's quite a long time ago. No, her thing is all messed up too, and I don't know. we had some consultant a while back screw it up you got to go under if you can see in the left hand column of her PCR mail where it says in bold it says christy.hill at high quality leadership at the very bottom of the left hand column of the folder list I don't see a Christy in the folder list. The last thing that says Texan Hills. Are we not in the same place? Oh, you know what? Maybe that's not. Maybe you're in the wrong PCR. You should have gone to the other one, I guess. I gave you bad data on that. No Texan Hills on this one. Okay. I think I do need a screen share because I think we're in different places. Yeah. Why don't you screen share? You want to screen share? Just tell me what to do. Sure. I use Google Meet. So if you could please go to meet.google.com. Okay. And I'm going to start a new meeting here. And then for you, you'll have to enter in – there's like a – A code? It says enter in code or password. Yeah. And you go to meet.google.com. I'm going to give you 10 letters. Okay. Get my phonetic alphabet in case I need it. Okay, so, all right, we got 10 letters. Are you ready? Yep. Do they have to be alphabet? I mean, uppercase or lowercase, it doesn't matter. Just lowercase is fine. Okay. So we have U as in uniform. Okay. T. X. Okay. Okay. D as in Delta. Okay. W. Okay. C as in Charlie. Okay. Q as in Quebec. Yep. Another Q. Okay. And then W-N as in November. Okay. And then just hit join? Yeah. And then it'll ask you if you want to join. You can mute yourself in the Google Meet. We don't need to hear you twice. And then you could also hide your camera. And then at the bottom of the Google Meet, there will be a present button or share screen button. It's like a little rectangle with an up arrow. When you click that, you can share your entire screen and pick the screen that you would like to share, and then I'll be able to see. All right, I can see your screen. So yeah, could you... Hold on, I did stop sharing. Do I stop sharing my screen? No, no, no. You could just go to the tab that you want to show me. You don't have to... Ah, okay. Hold on. Can you see that? Yeah, so I'm looking at Cahill, PCR mail. Okay. Yeah, you have a different... And do you see the... Do you see the... Date, 7-3-2025. I do. Okay. That's her mail. That is her daily mail, but it's a month old. Okay. I went to the wrong database. I see what happened. Could you please go to the tab to the left of the tab that you're on? It says Cahill Riverwalk. Yeah. Yeah. Okay. It is just Riverwalk. Oh, okay. For some reason, maybe I clicked on the wrong company or something. I went to a different database entirely. Okay. Sorry. Let me catch up to you. I went to MR Riverwalk or F underscore MR. Oh, yeah. That was our old one. That was our old one. Okay. Well, that was why there was some confusion. Okay. So scratch everything I said before. I'm now looking at it for real for the first time. Now that we... Okay. Okay, now I can see what you see. All right, let me go to configure Mule Server. Okay, all three of these are active. Okay, you have a Microsoft account. Okay. I don't know. Both of them are Microsoft. These are different emails, right? Christy.Hill at Riverwalk Search and High Quality. Yeah, she's got two that pop in here. She's got Christy.Hill at RiverwalkSearch.com, and she's got Christy.Hill at HighQualityLeadership.com. They both go to this, yes. Those are the only ones that you need to work, right? Correct. There's a third one that's active, but the password's wrong, so it's currently not working. Yeah, what's that, the MR Riverwalk? I think it's just a duplicate of Christie Hill. You know what, I'm going to deactivate this one that you don't need here. Yeah, I don't think we need that one. We just need those two that we just talked. Okay. I'm going to just turn that to no because it's throwing a bad password anyway. All right. So I'm going to look back over at what you're doing. Okay. So at the top of your screen, you see the configure gear icon? Yes. Can you click on that for me, please? Okay. And right under that, there's mail servers. Yeah. And that should load. Oh, sorry. Yeah, you need to expand that up. So in the bottom frame, you'll see that there's three. I turned the top one to active as no. So that one you don't need. But the two on the bottom there that have active Y, I think the issue is going to be that you need to reauthenticate with Outlook. I think you're right. I think you're right. If you click action on the left under the I want to column, you're going to have to do this for both of these. But, yeah, one by one, you can go to edit there. And then try to sign in with Microsoft here with make sure to pick the right one, though. OK, no, that was David. OK, hold on. Hold on. Hold on. Cancel that. Close that. Don't close that. OK, don't save that. Yeah, hold on. I want to make sure that that didn't just overwrite it. That would have been bad. Hold on. Edit. Okay, it didn't. On my end, it's coming up to what it was before. Okay, so your credentials are saved for your personal Microsoft account, it looks like, in the browser you're using. So whenever you click that sign in with Microsoft button, it just completely overwrote whatever was in there. So we don't want that. We want to sign in with her Microsoft account. Should I go to her computer? Would that be better? You could do that, but that might take a long time. Maybe instead we just – can you re-log in but in an incognito tab so it doesn't have anything saved in your browser? Oh, yeah, sure. Yeah, yeah. I can do that. So in the top right of the Google Chrome, there's three dots next to your little icon there, your little picture. And just like three or four options down from there, new incognito window. Okay, there we go. You're going to have to log into PCR again and open that up again. Okay. But if you do that this way, it shouldn't just automatically log you in. I got you. I see what you're saying. Yeah, yeah. and then I'll put her log in can you see what I'm doing right now you can see it right yeah I can so now I'll go back to her email and then I gotta I gotta go back to this funky thing like I said it's funky I don't know why she does it this way but somehow it's set up this way it's under junk mail if you can believe that inbox. I mean, it's stupid, but that's what it is. But that's how she does it. She knows what she's doing, so whatever. Okay, so now you can see we're back. Yeah, could you go to the configure option? Okay. Mail servers. Okay. And expand the bottom again. Oh, that's right. Yeah. Then you can try to log in with Microsoft again. now it's it's not it's not letting me hit edit yeah it is sorry sorry it is okay and there it says Christy Hill yeah hit sign in with Microsoft again alright now you can actually log in with the right one that was the Riverwalk search or was it you want to override it with the right one Yeah, Christy Hill, yeah, that was the right one. Okay. See if this gets me in. I hope it does. Confirm sign in. Yeah. And then hit save on that. Okay. All right, could you hit test connection for me to make sure that it's... Oh, yeah, yeah. This is exactly what I did before, I remember. But it says it failed. Yep, I see that. Okay. then I think what needs to happen is that we need to get you a app specific password. That might be Microsoft Outlook 365 has upped their security measures over time. And they now with like PC Recruiter is a third party software that is trying to use your Microsoft credentials. And I think they I think it might be mandatory now. So let me try and find the right link. Hold on one second. Okay, thanks, Mackenzie. See, you're brilliant. I don't know anything about this stuff, so thank you. That's why I stayed with you guys 20 years. You're great. Thank you. Let me make sure to find the right instructions I'm looking for on my end here. Have you ever made an app-specific password before? Like an authenticator thing? No, it's not quite an authenticator. It's something you'd log into your Microsoft account and create a password just for PCR to use, basically. No, never done that. Her Microsoft account, like on actual Microsoft.com? Yeah, like Outlook.com? Yeah, I think I can. How do you create an app-specific password? So Outlook.com, and you're saying sign her in as – oh, wait a minute. Wait a minute. Riverwalk Search is not Outlook. It's a different thing. oh the other one high quality leadership is outlook but riverwalk search is not maybe that's where i screwed you up oh interesting okay well uh in the in the um in the settings that were there it was already it was already it said outlook.office365 for the server name so i thought i guess i was i don't think that no it does but i don't think that's right you're right uh let me show you i see hold on okay let me show you what how i get into hers her regular riverwalk it's it's this way let me just show you it's mail at river maybe it's web mail. It's this. See that right there? It's that. Web mail login. Then I log in and now you'll get all of her updated mail. See? It's all through today. Okay. Interesting. But I don't know what this is. I don't think it's Outlook. It's not, I don't think. No, it's not. Definitely not. But this is where her Riverwalk comes from. This is where Riverwalk comes from not out not high quality leadership but Riverwalk gotcha okay well then yeah that's definitely why that didn't work so well I'm not really familiar with this but we can kind of look around if let's try to click on that top right menu they have the hamburger man yeah hovering over is there yeah that ain't maybe yeah try settings let's see what's in there we're looking for SMTP server credentials or I guess the server that we need to find. Security maybe? Is this... it's not that. Just click on them, click on these one by one and... no, nope. Next. Oh, try forwarding. No, okay. No, that's like a major... Oh, okay. So now I do see this. It automatically is forwarding to high-quality leadership. Okay. So it's high-quality leadership that actually gets this. And then the whole high-quality leadership forwards to PCR mail. Okay Well We could establish both Or Why don't we just establish The HQL The high quality leadership Let's just do that one I think that's easier And it keeps the system clean Because everything goes The high quality leadership And then dumps into PCR Okay Well then for that we would go back to pcr mail two tabs to the left yeah exactly you can keep that open we might all right well oh well i can get back in but okay all right so instead of going to the bottom one go to the the middle one yeah yeah this is that one okay and you said this one is a microsoft account right yes okay uh try to hit test test connection for me let's see what happens there authentication failed okay try to re-log in with your microsoft account or her high quality leadership microsoft okay so sign in with microsoft right here this yes oh nope nope cancel that you're not in the oh yeah yeah yeah yeah okay when did we leave that um so now I'm going back to her again but again I'm not in I'm not in the incognito does that matter well yeah because every time you hit sign in it will take your credentials let me go back to that right in that menu there the three dots incognito window okay yep yep yep so now let me sign in this way again configure oh okay mail servers and then the middle one And then try to sign in with Microsoft now with the christy.hill. Yeah. At high quality leadership. Yeah. Yeah. Hold on. Yeah. Hold on. No. Hold on. Hold on. Thank you. now go to this I think I think I can find it on this but you know the passwords and auto-fill Google manager passwords if not I can you No, I don't have it built into mine. Hold on. Let me try another one here. Hold on one second. I'm going to take you over hers real quick. I just want to see. I think she has and then hope will be with you. I had two, three. That's not it. Let me see. Hold on. Thank you. Thank you. Hold on. I'm working on it. Oh, I'm here. It's okay. Okay. I'm looking for the old ticket you mentioned. I think you worked with Garrett like three months ago. Yeah, I did. That was about right. Garrett, not Matt. And I think it was the same problem, actually. it was a very similar very similar issue yeah um this is an incoming male issue it looks like you had an outgoing male issue with him but very similar steps to fix it Okay. Now I'm going to go back over here. Hold on. Thank you. Thank you. Thank you. Thank you. That's interesting. Yeah, that's weird. Why is it closed? I don't know. It's all the way on the left. Oh, it's all the way on the left? That one? Yeah. Maybe it's that one. Okay. Okay, let me see. See, I don't even know what I'm doing, and you're looking from Ohio and understand better what I'm doing. Okay. Okay, now – there's her outlook now, okay? All right, so we know – We know that we know her password. That's good. So now do I want to go back to those things? You know, there's an interesting thing happening here where Microsoft Office 365 accounts will require an app-specific password. but you have Office 365 through GoDaddy, which could be slightly different. So before we make an app-specific password, I kind of just want to try the new password again. So, yeah, try that email, the second one there, edit. Try entering that new password. Okay, now it says be expired or something. I don't know. Okay, yeah, I think it's because you logged out of the main tab of PCR to the left of that. I'll just do this and get all this crap. go on and I don't know what that is I guess I could do that one let me see I'm afraid you called the Google meet and I can't see the screen anymore yeah try to log in as her again in that the PCR email tab and see if the test connection is a success first and then if not we'll get back on the screen share okay yeah because now I'm kind of able to you've taught me a little bit anyway let's see yeah I did click you out I'm really sorry about that it's all right um I was trying to clear it up I clicked the wrong thing but okay here we go loading PCR I'm getting back into hers okay I'm now in now get back into her email and then I'll go to configure email servers go to edit sign in with Microsoft or should I test the connection first I guess sign in right with Microsoft maybe yeah try try that that and use your password that you just created and see what the text button tells you. Yeah. Christian, I call it leadership. Next. Okay, so now I should be signed in. I just did sign in. So now should I hit test connection? Yeah, let me know what that says after you hit that. It says, okay, authenticate completed. Oh, that's what we wanted. Okay, so the GoDaddy version of Microsoft doesn't require an app password. That's interesting to know. so it sounds like it sounds like that middle one that we uh you you did log into like the second one in the list right there was three in the i did i did yeah okay cool so it looks like that one is good now and it should be after like maybe a minute or so it should refresh it should start downloading uh yeah you should start hearing the the little like ping sound and it should if you find her inbox, see if anything new is coming in there. Yeah, I'm kind of looking at it right now, but I don't see anything new coming through. Hold on, let me see. Boom. Not yet. I have it on my end too. I'm going to close and reopen it. It always does take a few, sometimes a few minutes to transfer. I've noticed that with mine even. Yeah, there's a service that kind of scans and crawls through everyone, and it'll come back around every so often. Yeah, exactly. Yeah, you're right, because sometimes it scans and does it quick, and sometimes it takes like five minutes. Yeah, so we can hang out for a bit and see. It looks like I see the test connection is good, too, on my end, so it should be good. Okay, now it looks like it's giving me some, well, giving me some. I don't know if this... Okay, there it goes. It's doing it. You can check it to see, but you can see some new stuff now. Okay. You check to see if you see it. I'm going to refresh here. What, uh, what, of, which one of the folders are you... Oh, yeah, you got to go all the way down under Christie and under junk. It's inbox. Oh, right, right, right, right. Oh, look at that. Yep, August 6, 2005. There it goes. And I guess it'll dump everything. It'll dump whatever she's got in there, I guess. I don't know what she's cleaned out manually. She might have cleaned some out. But we know it's connected. We know it's connected now. Yeah, it looks like you got stuff from today, yesterday, and then it jumps back a month. That's kind of odd. Yeah, because maybe she deleted everything in the old one, you know, I mean, in the direct GoDaddy one. She cleans out a lot of stuff. She does that. Okay. All right. Well, then it looks like it's working. Make sure to verify with her. And if not, I guess you can call back. Yeah, I'll call you back. But, no, I think you did another nice job, Mackenzie. You did a great job. Awesome. Well, thank you very much, David. I appreciate that. send me a survey and I'll give you all 10 stars or something and give you a way to get your way send those I don't know if we send those I don't know I I think at one point you did now I don't know I can't remember but I think if it is sent it's a kind of like an automated thing that um my like bosses would trigger to see how we're doing I don't think I send them myself I think any survey you've ever gotten was um well if you want to just send me a note if you want to just send me a note just saying hi david you know pleasure helping you and then i'll send the note back to you saying you're the best please forward this to your boss or something oh that that doesn't i appreciate that so much but that's not necessary i don't think well i'll do it if you want to do it just send me a note oh well thank you um i think that uh we can uh we can just we can just chalk it up to a win and go about our day. And if you need me again, you call back. That's fine with me. Okay. You're a good guy. I like you. I like you, Mackenzie. Thank you. Thank you, David. I appreciate that. We'll talk to you soon. And when you do have a cup of coffee around your boss, just say, Hey man, people really comment on our customer service. And they know that already. Cause that's why everybody loves PCR. But, you know, I've, I've seen statistics from you guys and, you know, But you guys do a great job of customer support. I mean, it's always been the best. So that's why I stick with you. Because I'm not a techie. You know, I'm not a techie. I need help. And you guys are always great at it. Well, thank you. I can't say thank you enough. Well, thank you. Likewise. Right back at you. All right, McKenzie. Well, have a great day, okay? Thank you, David. You too. Okay. Bye. Thank you. All right. Yeah, God bless. Bye. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1288.839063,
    "salad_processing_time": 171.5519368648529,
    "overall_processing_time": 1288.839063,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence Technology.  This is McKenzie.  How can I help you? Yeah, hi, McKenzie.",
    "job_id": "c036387b-56af-43e1-816a-c4fd818feb19",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence Technology.  This is McKenzie.  How can I help you? Yeah, hi, McKenzie.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3042344681036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}