{
  "recording_id": "3042439002036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:53:22.440659Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:53:22",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your participant ID followed by pound. Otherwise, you are in the meeting now. There are two participants in the meeting. Hello, do you hear me now? Hello? Hello? Hello, do you hear me now? I can hear you now. Awesome. I got kicked out. My call got disconnected. I don't know why. I don't know if an Internet hiccup or a RingCentral issue, but my phone just went dead, and I was still in the meeting, and the Internet doesn't seem to have hiccuped, so I don't really know what happened. We kind of lost you right before that keypad appeared. At least that's when I noticed there was no audio. Yeah, the keypad was, I was, my ring central, I was dialing back in to get dialed back in. I don't know, yeah, my phone kind of got disconnected, but nothing else did. And I'm sitting here at the table and nothing changed. I don't know what happened. But anyway, anyway, so kind of finishing up here to talk about the job board. You heard I was talking about, You can post jobs to your website. You can let candidates apply online. You decide what information they're going to be asked to provide. And essentially, this is going to act like a job board. Cool part about that is you can also set up a feed to Indeed, Zip Recruiter, or if you have, I think you can set up a feed of some portions of LinkedIn, too. So you can feed your jobs to be able to get those fed out. And then the applicants can come back to your website and apply online. Okay, so you can do some different things with that. So that's going to be something, it'll interface with any website, it'll match well, you're going to have no problem doing that. And then you're also going to have the ability to work within the pipeline. And the pipeline is going to be a combination of everyone who has applied online. Okay, so I can look at this pipeline here and the inbox is going to be everyone who has applied online. then I can move them on through my custom interview process. So you have up to 18 steps here. You can redesign, pick your own color, pick your own terminology, put them in whatever order, and then you're going to be able to just drag and drop people from one step to the next as you move them through your process there. So that's going to be a nice, easy way of tracking who's where in the process here. So you're going to be able to just kind of very easily move them on through. and that interview process can differ so if you have more than one process I can go into a different job opening here and if I go into pipeline that's going to show me a slightly different process that I have for this job you see it's a little bit longer my colors different some different terminology different things like that so you're able to take it just very easily move them on through when people apply to the job is there any sort of ranking that's being done in terms of like most suitable candidates for that job based on who's applied? Not by default, but you can set something up to do that. So when they apply online, you can put in what we call a profile. So that might be a little questionnaire of your own design. And you're going to be able to set that up with any number of different questions. You can even, I think there's even a way to score the questions. So if everyone that applies online fills out the same profile, You can kind of score them against each other to see exactly who was the best fit, who answered the most questions in the best manner or something like that. So it would take a little setup, but you could do it. It doesn't automatically do it, though. But I will show you something else along those lines, and it will actually give me a chance to show you our other interface. So if I look at the PCRM piece, I'm logging into the exact same database, the exact same data, but through this interface. So this is actually a different interface. And it adds a few CRM features. So if I go on into here, I can see I have my names, companies, positions, roll-up schedule. Same exact stuff. It's just down the left-hand side of the screen. Now, I'm going to go into a position here, and I'm going to see it was just released about a week ago, and I was out last week. So I don't know if it's where it is. But if I go into Radiological Control Tech, I should have an ability somewhere to match. There's an auto-match somewhere, and I don't know where they put it. So I'm just going to look around at a few things, see what I can find. Okay. Let's get that out of there. I don't know where it is. There is a button somewhere. So like I said, I haven't seen it. It's very new. There's a button somewhere that I can auto-match, and it'll pull up the closest 15 people that match basically the information found in the job description there okay okay okay so that's going to be something that you can do from there hang on just quick okay Okay. Okay. So kind of back into here. So, yeah, so there's an auto-match feature. Like I said, I don't know where it is. It's only been around a couple of days, and I haven't seen it. I don't even know where it is. But that is something part of our AI suite that's going to allow you to do that there. So what you're going to be able to do as you're working within the pipeline, you're going to be able to move people through that process dragging and dropping them through you're also going to be able to report on all of those activities so if I look at my analytics let's say I can pull a custom activity report I can go to metrics pipeline activity and I'm going to be able to pull a custom activity report in this specific report I only chose to put in first interview second review and phone screen but I could put in every step of way if I want. I can go ahead and look at it maybe for last year, this quarter, this week, last year, whatever. So I can do a custom date range if I wish as well. And I'm going to be able to see all of my interview detail there. I can also split it up by job. I can split it up by client. I can split it up by recruiter if I wanted to do that. So all this data is real time. So I can move it around very, very easily. And these are all custom. So I could even build one that's more of business development so I can go business development I can see all the different details there all my different options and I'm going to be able to do okay so I'm a lot of custom reporting options there and then I also am going to be able to report on if I were ever sending out mass email communications or anything like that I can also go and look do a report on my email campaigns in here so I could see a detailed report of everything that I happen so the last time maybe I sent an update your contact information I'm going to be able to see I had a 77 percent click rate so I can go down here look at my clicks see who clicked what how many times and when they last did so I have all of that information right at my fingertips I'm able to easily see what's gone on there no automated are the email campaigns like can you send that can you set up something like, for instance, email someone on their birthday or before they start their shift, things like that? You can. So with the email campaigns piece, it's kind of a one-off send, or you can kind of queue it up tomorrow. So that's kind of like a group email campaign. We also have a sequencing piece, like a drip campaigns piece. That is a little more customizable. I don't think it's anything that you can have it know, like, do you go one day before they start a new job or on their birthday or anything like that. I don't think it's quite that advanced, but the sequencing piece is going to let you build custom sequences and essentially start them off with an email. And then from there, it's going to let you create a template. So I can go into one of these here. So I can see that my very first step is going to be a specific form letter is sent. If they reply to the email, my sequence is done. But if they don't interact in three days, move to the next step. That could be another email, or maybe in this case it's a call, or it could be a text if you use RingCentral. RingCentral is the phone system with which we integrate. So that's going to give me some different opportunities to set up some straight up drip campaigns, or I could include some other things like call lists or texts or anything like that. So RingCentral, it's phone calls and text messages or just text messages? Phone calls and text. So it's going to give you the ability to click to dial. So any record you see in the system, there's going to be next to every phone field, there is a little dialer, a little telephone icon that you can click to dial. That'll dial RingCentral. It's nice because it's going to put an activity in the time date and who made the call incoming outgoing or missed or I can click my little text balloon and that's going to send a text so that's going to send a text and that is sent through ring central but it's nice because it records an activity of the text all the details of the text that's all sent there so that's going to be a nice interface with the ring central that covers click to dial and click to text. Okay then I'm also going to have the capacity to query my database so if I needed to search someone's with a certain skill I can go to advanced I'm going to be able to go to advance and maybe I want to look for sales and marketing. If I go to do sales and marketing I can use straight Boolean logic in here specific words this and not that this word and that word and even way I want to do that and as I type in what I'm looking for I'm going to be able to click a search and search the entire database just that easily so then I'm able to see I can tell that Terry was my best match I can see at the top I can tell that I have all of these different letters in the score column so I can tell that I have the word was founded his resume his notes his his key word tags, his summary, his profile, his attachments. So I can see all of these different areas that have the words. And what I could do is I'm going to be able to go ahead and click on any of those if I wish. I click the R for resume. That's going to show me the highlighted resume. Okay, so I can see the resume. I can see my highlighted words. I could click on that little N. That's going to be some notes that I've entered. and I can see all of the notes that somebody put in the system those are searchable I might also have something at some attachment so I could see that I have an attachment right there it found the words that I had searched upon in all of these different attachments and then I'm going to be able to look at my profiles these are going to be those questionnaires I was talking about that you could have them fill out when they apply online or might also either LinkedIn profile so I can see their LinkedIn profile that's going to be that summary that was brought in from LinkedIn if I brought like imported or updated their information from LinkedIn so that's one of the ways we can get data into the system as well I have we have our capture tool which is going to be a means by which you can import from any of these different versions of LinkedIn indeed CareerBuilder Facebook zoom info saying monster a couple others so all of these different services you're going to have the capacity to import from if you just go to LinkedIn you find someone you want to import there's going to be a little click to add button that'll pop up on the screen you just click to add and that's going to go ahead and add that person into the system and it's going to parse them in it's going to create a record it's going to attach a searchable copy then of their of their their LinkedIn summary so you'll have that there as well. And then of course there's parsing if you have a resume to parse you can parse that resume in should someone email your resume you have the capacity to just right click on that and Outlook and parse it right in or highlight and copy it and parse it right in. You can drag and drop a larger group of resumes and parse them in. So a few different ways that you can parse data in the system as well that's going to certainly give you those an ease of data entry into the system there very well. You can track your placements in here too so as you go through and you're moving someone through a pipeline you can track placements, permanent placements, contract placements, both in the same database no problem there. And then the contract placements are nice because you can automatically set it up so that when a placement is made it'll automatically schedule a follow-up on the start date and a week after or something like that so it'll automatically put a follow-up on the calendar it will there's a little button where you can click to send an invite to the contractor to download the contractor app the timesheet app so a little bit of automation involved in that as well and then we also have a whole automations section so that if I go in here and I just look at automations I can build any number of different automated activities within the system so I can look at like this one sometime after an applicant applies to a position send this form letter so that would let me queue up maybe a day after my online application send them a specific form letter or all the if a field is a certain value put them onto this list or all these different things so these are kind of your standard if-then statements you can pick what time after the contract placement is made and what form letter is to be sent. Or you could also build your own. So you could say when this happens then do this and you can build your own trigger based on all sorts of different things. Placement is made and all these different things. So you're going to be able to kind of set up a lot of custom automations within the system too. So a lot of flexibility on the automations in the system there. And looking at our PCRM interface I kind of talked about this interface a little bit this one it's gonna work kind of the same but looks a little different so if I go to my name record or my name search I'm going to be able to see the same last names that I looked at this gives me the ability though to edit a line so I can edit in line I'm going to be able to do that I also have some quick actions here so if I wanted to contact them with an email or with a call or with a text I can do that right from there maybe I want to add an activity or add a search note anything like that I can do that too so I can kind of work with a lot of my data right there I can go into a record of course and then in this PCRM version it's going to slide in from the right-hand side of the screen and it's going to go through and it's going to allow me to build a custom workspace maybe I want a little image of their resume right there maybe I choose to show activities and then what I can do is from there I can also go into any of my other things. I can look at every interview, everywhere Terry's ever interviewed. Or I can look at all of his resumes. Or I can look at all of his attachments. Any number of different things I can do right there. And I could even go through here and I can move around. Maybe I want activities to actually be over here next to details. I can snap it right over there, move it live. And now I can... full screen this to take a look at the activity and see what we're doing with Terry what his last activity was who did it what it was I can start called left voicemail I could see when it was scheduled for follow-up all that detail is going to show right there and then this version also adds a deals workflow so if I wanted to go on my deals there I can go into deals workflow and I'm going to be able to move people through these are like companies that I'm marketing toward so I'm going to be able to take and drag and drop them from one step to the next right through here depending on where they are so I could see if they need a cessative contract was sent and then I can kind of move them on through in a card format so this is going to be more of a CRM heavy piece within the system there that I'm going be able to work with very easily. Now any questions on anything that I showed you here, anything we've looked at, anything you haven't seen but wanted to, or anything you wanted to delve a little deeper into of that nature? When moving people through the different phases, and let's say we want to, someone that's applied to one of our jobs, we want to hire them, do you have a whole onboarding forms piece of your system as well? Not a proper onboarding module at all, but we do have the ability to kind of move them on through, drag them through, and then you can make them, you can create a little checklist that you have to use. So you can put a little checklist, but there's nothing that's going to send paperwork or anything like that. So not really an integrated DocuSign or onboarding anything like that. Okay. And would you be able to show us the time and attendance piece, that app you were talking about? Yeah, well, I can email you the video because it's an app, so I can't do that. I'll email you the video of that, but I can show you kind of what it will look like on the inside of PC Recruiter. I'll email you the video of the app, but what would happen? if the individuals are going to be submitting their information through that app you'd be able to go up here to let's see there is a contract area option so if you go to the contract this is going to allow you to see everyone who's currently on assignment everybody who's available all of my hours so I can look at hours and I'm going to be able to see I'm going to be able to see my my week by week so I can pick a specific week that's going to let me list off everyone I might have on assignment. If they were to submit their hours through the timesheet, that's going to let me click into the timesheet. I can see it so I can go into I believe click timesheet and that's going to let me see any timesheets they might have submitted or I can go right here and I can put one in so I can submit a timesheet. This is also very similar to the interface that they would see on the app so it would allow me to put in the hours in and out times or just put a total of hours and once i put this in so if i ended up throwing in just straight hours there so on the app they're not like clocking clocked out they're just putting in like they're filling in a time sheet no the app is clocking clock out so the app is clocking clock out and it kind of even GPS tracks where they are when they clocked in so the app is is almost a proper timesheet app really and like I said I'll send you the video that my web guy put together a little video that outlines how that works okay yeah that'll show that but this is an area where you could put in the hours because before we had the app well there's also actually a portal for the website so there's a web portal that they could log in with their email and a pin and they could put their information into the portal through your website and then it's going to be stored in this capacity okay okay so you can do something like that and then all of the timesheets once they're stored in PC recruiter we're going to be able to see all the timesheets and then we could pick them all and right up here we can then transfer them out to QuickBooks so we can transfer it back office and that's going to transfer them out the quick books okay so you can push it up to QuickBooks or paychecks but I think QuickBooks is the more proper one that everybody uses okay so we don't actually do the the billing and the book sync we do it through QuickBooks there and I think there's even a way you can mass send out little reminder through here I think you can kind of send out a reminder for anyone who hasn't yet submitted or anything like that so you can do that as well Anything else that I can show you? Not that I can think of. Okay, so talk a little bit about pricing. The PC Recruiter, it is a cloud-based, so it's going to be something that is cloud-based. It is per user, so it's going to be about $115 per user per month with a one-year commitment. If you want to go month to month, we do that for $125 per user per month, or a two-year commitment is $105 per user per month. So you can kind of pick and choose how long you want to commit, and then that will dictate what the monthly cost is. You can add or drop users at any time. So if you started out with eight, you could add a few more, drop a few down. There's no limit or anything like that, and it will just kind of bill monthly, so you can increase or decrease as needed. There's also a one-time setup of 750, and that 750 is going to be, it includes the setup and creation of the database, both types, the PCRM as well as the PC Recruit Classic. And it's also going to include assistance hooking it into your website, assistance setting up that timesheet piece, working, hooking it into your website if you want, and 10 hours of training. So it's going to be 10 hours of training included, again, in that setup, and that is going to be with one trainer. So you have one trainer on our staff who would work with you start to finish, get you up, running, trained on the system. And it's a custom training piece, too, so you can kind of decide what you want to cover, how you want it to work, who you want to be in on the trainings, and that's all included there. Also, if you were looking to convert data, we can convert data a couple of different ways. I'm not familiar with the staff track. I don't know if our guys have ever done it. I'd have to check and make sure to get a cost quote on that. But usually, they're like $1,000 to $1,500 for a data conversion, and they take 60 to 90 days to get the conversion done. And it will pull out pretty much all the data to do that. Alternatively, if you wanted it a little quicker and you didn't want to spend money, you can also take that data, push it into a CSV because PCRecruiter has a CSV import tool as part of our base package, and that's going to give you capacity to import any spreadsheet. Just map it right into the database, mapping fields into the fields of PCRecruiter. So that one you can do with the guidance of the trainer on the first training. That one's, like I said, much quicker and no cost. Okay. And do you have a timeframe for any decision that you're looking to make? Or maybe does your other software have an end date or anything like that? There's no end date, but we're looking obviously, you know, as soon as possible. Do you mind a question regarding the time and attendance? Yeah. so what you showed us was our view of seeing someone's hours um is their ability to approve hours and if so is it just from us or does our client have access to approve hours oh excellent question yes there is an approval process and when you make a placement you can select who the approver is going to be and it could be someone internally to your organization or probably more than likely it's going to be someone at the client's site. So you're going to be able to pick and choose who's going to be the approver when you make the placement. Then when that timesheet is filled out, it's going to automatically send an email to that approver with a link to the timesheet that they then have to open up and they have to click to approve. So they would then click to approve or correct and approve or not approve or anything like that. So they have a few different options all handled with email. So it doesn't need to be someone who's inside of PC Recruiter. It's anyone with an email address. So there's also going to be, if you have a timesheet in, let me refresh my top page here, see if this will refresh it there. So you'll see this one's in process. It's not yet approved. So the approval email was sent. So once this is approved, that is going to put change to I believe it switches to approved. So you're going to be able to see who the approvers were as well. So you have that right in there. So like there's my approver right there. It's Jimmy. So I'm going to be able to kind of track and see who my approvers are. And those are all going to be approved through an email approval process there. okay and then when you were saying okay you were saying that this is through an app right the employee signs in through an app to sign in and sign out yeah the employee and i said i was i'll send you a video of the mobile timesheet app that's what the employee would put on their phone they could sign in they can clock in clock out their hours are then pushed in for approval there Since it's an app, I can't demo it, but I'll send you the demo. And then if you have questions, let me know on that. But we have a nice video that we'll send over at the conclusion of our call today. I'm definitely looking forward to seeing the video. Just a quick question about that. When the employee signs in and signs out, it's geofenced where they're signing in and signing out? Yes. Okay. And is a selfie taken of the employee or any type of other way of recognizing that the individual is via a code that they have to enter, anything of that sort? No selfie. I don't know if they have a code or not. Once they download, I don't know if there's a code. I'd have to check and see. everything's done through their email though like the they sign up through the app to their email yeah they sign up through their email i believe their apple id it goes to their specific phone so that's how that's coordinated i'll see if there's a code what happens if someone shares someone shares their email with someone and then an employee signs in through someone else's email what prevents someone from doing that I don't know that it can sign in through email. It's only going to be through their, through the app on their phone. But like I said, there's no way it doesn't, it geotracks where they are, but it doesn't take a photo of them. Okay. Sorry, I misunderstood. I thought you said they sign in with the email, but it's just strictly through the app. Yeah, just strictly through their app. So they have the app on their phone that they click in, and that's how they sign in and out. And that'll be explained in the video. Okay. The users, you said $1.15 per user per month? $115 per user per month. Yeah, $115. $115. And that's going to be like recruiters or people that are doing what we've been doing here, not contractors. We don't charge by contractor or by placement or by record in the database. It's by recruiter. So that would be $150. Breakaway employees. It wouldn't be our associates that we send out to work. It wouldn't be our clients that need to approve timesheets just strictly. Okay. Yes, none of your contractors, none of your approvers, none of those people are build users. It's just people that are going to be working in the system, moving people through the pipeline, coordinating the hours, moving them to QuickBooks to be processed, stuff like that. So those would be the proper users. Got it. Thank you. For sure. We're looking forward to seeing that app with the time and attendance. Yeah, that's a nice piece there. And like I said, once I send it, take a look and if you have any questions, let me know on that. But yeah, I'll send that over in a little bit. Great. Well, thank you for spending the time to show us this, your site, Jim, and explaining everything. Was there anything else that you needed to show us before we depart? I didn't have anything on my mind, and I just wanted to check in and see when would be a good time for me to follow up to kind of see about next steps or further questions or anything like that. Caitlin, what do you think? Is it in a couple weeks? Yeah, I think that would be great. Two weeks. Perfect. I will put you down for a two-week follow-up to touch base then. And then if anything comes up sooner or if you have any questions around the timesheet piece that I'm going to send over, let me know. Will do. Thank you, Jim. Great. Thank you. Thank you both for the time today. We'll talk to you soon. Thank you. Bye-bye. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1295.157526,
    "salad_processing_time": 75.87518668174744,
    "overall_processing_time": 1295.157526,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your participant ID followed by pound.  Otherwise, you are in the meeting now.",
    "job_id": "84818573-4ac4-474b-8eed-5ef10ded0f32",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your participant ID followed by pound.  Otherwise, you are in the meeting now.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 2
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "billing",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3042439002036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}