{
  "recording_id": "3042500837036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:53:36.717461Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:53:36",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is McKenzie. How can I help you? I'm sorry. Did he get the name? McKenzie. McKenzie, how you doing? This is Warren Sharp. I got a new, I got a new crop top and I've got to get BCR installed in the inhaler and anything else I need. and I got that email, whatever the hell that email thing is that you guys have. I'm trying to think of what it's called. I don't know. In Outlook? It kind of works with Outlook. Right, the portal? Yeah, that's it. Yep. Sure. Okay. Give me a sec, Warren. I was wrapping something up right when you called, and this seems like it's going to take a bit. You want to call me back? No, just give me like 30 seconds if you don't mind. I just want to make sure I'm not missing something. I was in the middle of doing it. Yeah, go ahead. Okay, hit save on that. And I just need to add a little note on this notepad here. Make ticket for adding a user. So that's good. All right. All right, Warren, let's do it. There's going to be a bunch of stuff we've got to do, it seems like. Setting up a whole new laptop. All right. So are you on the laptop right now? Yes, sir. Good. Step one. And that would be probably a good time to start a screen share. So if you could open up a browser and go to meet.google.com for me, and I'll give you a code to enter in, and you can join my meeting. page.google.com Yep. Okay. Video calls with anyone. Okay. Yeah, in the center of the screen-ish, you should see a box to enter in a code or nickname. Yep. All right, I'm going to give you a 10-letter code to enter. Are you ready? Yes. All right, I don't know. All right, I have my phonetic alphabet in case we need it. All right, so we have B as in Bravo. M as in Mike. And then another M as in Mike. And then a B as in Bravo again. S-O-G as in golf, S-C as in Charlie, and then D as in Delta. And that should be 10 letters. B-M-M-B-S-O-G-S-C-D. And click join. And when you do join, mute yourself because I don't need to hear you twice. And you can hide your camera as well. Okay. So continue without microphone and camera. Yeah. Yeah, because we just need the screen share capability of it. Okay. It should ask me to let you into the – there you go. I see you there. I'm letting you in. And then on your end, you're going to want to go to the bottom of the Google Meet, and there's a share screen option at the bottom. When you click share screen, make sure to go to the entire screen tab so I can see things more than just, like, the tab you're on. Pick whatever screen you're looking at, and I'll be able to see that after you click share. Chrome tab. chrome tab no you want to go to the right of that where it says entire screen I'll only be able to see the one window which is I'm going to need to be able to see more how come it's not how come it doesn't have a thing for share you haven't clicked what you're sharing yet there will be multiple screens my bad it's all right i'm bad so now uh make sure to keep this open um you can minimize it you could also hit the little hide button in the um bottom of the there's like a little me.google.com is sharing your screen you can hide that so it's not in your way um and you could minimize the tab if you like i think it's your mouse is hovering yeah you can minimize that and then see the bottom it says a blue button that says stop sharing to the right of it it says hide you can hit hide so you don't accidentally click stop sharing okay alright hold on for some reason it doesn't want to go back there okay okay so you haven't done anything yet you haven't downloaded any of the stuff you need yet no Okay. No, because I'm an old man, and the only thing that's going to happen is I'm going to screw something up. Sure, sure. All right. Well, oh, wait. What's that start menu? Are you a Windows machine? Looks like you are. Yeah. Your start menu looks like a shell. I don't know. I've never seen that before. well that's because the guy put a he put a thing I'm 68 years old I should have been retired 20 years ago so the guy that set up my new machine you know one of these local tech companies he I asked him to put a thing in there that it's a it's an app to make it look like the older version instead of windows 11, because I don't want to, I don't want to have to learn a whole new thing. It's just, Oh, interesting. Too crazy. Well, that's cool. Um, well we're going to go to the start menu in the bottom left. Okay. And I just kind of want to see the programs and features. Um, we're going to install a couple of things here. We got to install the launcher. I think you mentioned the inhaler, the portal. So I just want to see the list of things you have installed just in case one of those is already installed. So in the start, try and search out programs, just the word program. Yeah, I already did. Oh, okay. Programs and features, one of those options there. Yep. Can you see it? um it might be lagging or something like that i'm not really seeing much movement okay that's not good or wait no i'm sorry in the search bar um oh i see you clicked on programs i see i see i meant to actually type in the word programs into the search bar sorry if you can click on the little search bar in the bottom left and just like just programs and see what comes up add or remove programs came up that's what we want so the first one in that list okay great so these are in alphabetical order can you scroll down to the like the peas PC recruiter okay great yeah you don't have any of them great so we're gonna minimize this we're gonna come back to it Oh, okay. Just to verify that they get installed correctly. Yeah, you can bring it up and minimize it. All right, we'll come back to that to verify. So now you're going to want to go to just go to your normal PCR login screen. There's a download link on the bottom corner. We're going to click on that. So wherever you go to log into PCR Recruiter normally. Gotcha. All right. Yeah, that URL looks like it. All right, awesome. So in the bottom left, you see the launcher install colon Windows Mac. I don't see anything yet. Oh, I do. Yeah, okay. Sorry. Click on the Windows button. My bad. It's all good. That'll download. It'll take a brief moment there. You can see it in the top right downloading. It looks like it just finished. You can click on that. That just popped up. or you can click on the down arrow that is in the top right corner next to your little silhouette. You can click on PC Recruiter Launcher. It looks like there's already one on there, but it's all right. You can delete it after you're done. So this is going to install something. It looks like there it is. Oh, okay. We need to install Java. Yep. I didn't know if Java was already there or not. So just hit okay and hit cancel. We're going to have to install Java first. That's fine. Hit finish. Okay. Open up a new tab, top of the screen, the little plus, and go to just Java downloads. Actually, you know what? Make sure this – I'm going to do the same thing, Java downloads. I want to make sure that we go to the same or the right place. Yeah, that looks good. Java downloads and then hit search. Okay. I'm on my end for a sec. I want to make sure that our learning center still recommends that Because I think over time we might have changed to the Amazon Coreto, which is like kind of the same thing. One second. Just give me a second. Sorry. Let me go to the downloads of our – on PC Recruiter's website. Java runtime environment. Oh, okay. All right. I misled you. Let's click out of the Java download search. We don't need this tab. and instead search out, open up, sorry, open up another one and search out PC Recruiter Learning Center. Yeah, you can hit down arrows if you like and hit enter for that. The second one. Yep, and then in the top corner under technical info, right next to book a demo, go to downloads. Yeah, and then scroll down. It's going to be on the bottom left. It says Java runtime environment, Amazon Coreto. You want to, yeah, you want to click on that link right there. This helps the launcher work properly and the launcher is basically for moving files back and forth between your computer and PCR. So let me see, where is this? Find out the right thing to click on. Okay, yeah, so there's going to be a bunch of different options to download. scroll down a bit if you don't mind and okay you can stop there and then in the center there's like a table with scroll bars can you scroll down inside that table well actually it's showing I think you just want to click oh no you do have to scroll down a bit sorry see the little scroll bar up into the right of your current mouse position. Yeah, right there. Okay, that's good. Go back up. Back up a bit. All right, you can stop there. All right, perfect. So it says Windows x64, and then there's JDK and JRE. You want to go next to JRE and click that one right there. That one. That's the one you want, because you're using a modern Windows operating system, so it'll be a 64-bit operating system, which is what you want. So you should have just downloaded something. It's currently downloading in your top right corner. Once that's finished, we're going to run that. While that's going, you can go back to the other tab where – actually, you know what? Hit the back button in the browser. We want to go back to the PCR downloads. Perfect. And then scroll up a bit. We're going to want to get the portal. Yeah, PCRecruiter for Microsoft Outlook. It's currently on the bottom left of the screen that's showing. You want to click that. Yep, right there. Click that. That'll download that. And then you could even download the inhaler, which is to the right of that. You said you wanted the inhaler, right? Yes. Okay. Okay. So it looks like we have everything downloaded that we're going to need. So then it's just a matter of installing it all in the right order. So once those downloads finish, we can start that. Okay. Yeah. If you want to click that down arrow, you can. You can kind of see the progress of it. Okay, so the portal is... Oh, it looks like you already had a couple of these on there, but that's okay. The Amazon Corettos finished. You can run that. If you want to click Amazon-Coretto 842... Yeah, click on that. So this will... This is first, then the... Then the launcher will work the next time we try it. So yeah, just install that. I don't think you really have to mess with anything here. Basically, it's all the standard default options are going to be what you want. Yep, nice. All right, so yeah, the Java runtime environment is, or this is Amazon's version of the Java runtime environment. We've tested it over time and found this to be a better one. It doesn't ask you every day to update it like Java does. Oh. All right, so we can hit finish. And then now we can go back to what we tried before with the launcher, PCR launcher, 1.exe. You can run that now, and that should not fail this time. PCR portal? No, it's the fourth one down. It has an L in the PCR icon. It says PCR recruiter launcher. Oh. Yep. So now you can, now when you install this it won't fail because we have the, you want to hit accept? The Java is in there. Typical is fine. And install. This should be relatively quick. Should be. Awesome. Launcher's installed. All right. So the launcher's there. So now let's check on the other downloads. Okay. Before we install Portal, could you close Microsoft Outlook? do you have any work that you need to save or yeah make sure yeah make sure it's closed completely um sometimes when you close it it kind of runs in the background um there's a little down arrow or sorry there's an up arrow in the bottom right of your screen like part of the ui of windows there's a little up arrow that's like the system tray of things running in the background. Yeah, that one right there. Click on that. Do you see? No, okay. It looks like Microsoft Outlook is closed. That's good. So now we can install the portal. So if you go up to your downloads again and click on pcrportal.exe. This one shouldn't be anything crazy, just hit I accept, next, next, install. Yep, yep. After this is done, then you can reopen Outlook and we'll verify that it's all in there. then we'll have to establish your connection to your PCR database too. All right, awesome. Finish. Sweet. You can open up Outlook now and we should be seeing the PCRecruiter tab now in there. Nice. Okay, you need your serial number. Give me a second. I'll give you your number. One second. I have to find it. Unless you know it, but... Yeah, I wouldn't know it either. We have it. One second. Warren Sharp. That was your name. Warren Sharp. Going to Sharp Solutions. I'm going to copy and paste this into the meeting the meeting notes so if you open up the google meet that we're in the chrome tab if you can find it yeah click on that it's the yep that one and then in the bottom right there's a little text box with a little like gray circle on the top of it right there yep copy and paste that number and paste it into that little pop-up box that came up when you were in Outlook. And that should be good. Yep. Alright, sweet. So for this you want to click add connection. This is going to be Now, the portal's there, but we need to establish a connection between the portal and your particular database. So, yeah. Okay. I also use SendGrid when I'm doing multiple, like when I'm doing the mass emails, I use a thing called SendGrid. I don't know if we have to set that up or not. I don't think so because it's already is it already set up in PCR your SendGrid account I think I think it is I think that would already be in PCR but we still need to connect okay so in this little box here you want to paste the login URL to your to your PCR database so you'd want to paste that same URL that you clicked on to log into PCR. Yeah, you brought it up in an email earlier. It ends with sharp solutions, I believe. Uh-oh. www.pcrecruiter.com It's not allowing me to open it. Here, give me I can just copy paste it to you again in the meeting notes if you want. You're going to want to copy this URL. Yeah, open up Chrome. And it's on the left. Tab on the left. What the fuck is going on? Yeah, click on it. It looks like you just were hovering it. When you hover, it'll show, but you want to click it. It doesn't seem to want me to do anything other than finish this. When you click the Chrome thing in the bottom, does it not come up? Over Microsoft? Like actually click. Hold on. Yeah, click on that. Click on that. Click now. There you go. All right, now click the tab. It doesn't, oh, it doesn't stay, huh? No. It's like caught in the middle of. Huh. Well, that's odd. I don't know why Microsoft would lock you away from accessing Chrome. That's new. all right try to maybe no that's fine that's fine to be open can you hover over the microsoft outlook one on the tab there or on the bottom and see if there's like more than one thing there yeah close that since we're having trouble because this is up apparently close that out and we'll just we'll come back to this save and close this too because apparently this is making things weird. Okay, so now you should be able to access Chrome, right? Yeah, there you go. You can go to the Google Meet now. Can I just copy this? Oh, yeah, you can do it that way too. All right. All right, it's on your clipboard now. So then go back to the main tab there and then go to log in or sorry so sorry it's a green wrench that says options oh it looks like you clicked on appointment or maybe you clicking the calendar or something went to the appointment tab if you click to the pc recruiter tab to the right of it yeah There you go. There's a little green wrench icon that says options. A little bit to the right and down. A little right and a little down. Yeah, right there. Add connection. Right here? One below that. Yeah, right there. And then paste that link. I don't know why that fills in with about blank. That's weird. That's annoying. But anyway, yeah, hit go, and then that should allow you to – it might take a second to load. Then you can log in to PCR with your username and password once the screen loads. Oh, you've got to select the database. It just loaded the login screen, and it currently doesn't have a database selected. You must select the database first. Do I get out of here or wait? See, it's loaded. See, a field appeared below that. It says database. You got to pick one. Okay. Keep that open. Keep that open. We need that. Oh, sorry. Yeah, we got to do that again. Hit add connection. Hit go. And then you'll see in the, okay. I just loaded a field called database a little bit below that. Yep. Select the database and drop down. Sharp solutions. Okay. Then enter your username and password for PC recruiter there. Oh boy. I don't remember that either. I don't know. I hope, I hope you do because getting, giving your password out over the phone is a no, no. We need to like, I have to have you sign a form or something like that. Because anyone can call and say, you know, I need my password. I can't just give out passwords like that. Oh, it says, oh, the password's right there. Nice. Have you changed your password over time? No, no, no, no. I just... Oh, yeah, W-sharp. Yeah, that would do it. Okay, it looks like it's good. If you want the calendar to synchronize between PCR and Outlook, click yes. If not, click no. And then if you want activities to write for your emails in PCR, click yes. if not click no and then hit oh it didn't okay can you hit remember my password it's a checkbox a little bit above where you're hovering your mouse right now yep and then enter your password one more time for some reason it didn't put it in there it should but I don't know why I did not and then after that you can hit save and close. That looks like it did it. Sweet. Can we open up Outlook again and make sure that we can just verify that it connected and you can see records. There you go. Click on a name, like name company or position in the top left. What is this thing right here? This site is trying to open. That's the control loader. That's something that's good. That tells us that we installed the launcher correctly. You could hit always allow and hit okay, or you might want to drag over that so you can see it more. between where it lists your emails in the reading pane. You can kind of drag the thing left, yeah, and then you'll be able to see more of that, and you'll be able to... Open? Yeah. It's just asking you if you want to open the launcher, which is something we already just installed. So it looks like it connected. I mean, if that's happening, it looks good. A newer version of the launcher is required. Yeah, it'll automatically update. update hit allow there and then that should be good so it looks like oh give that a second but it looks like portals installed we connected it to PCR your launchers installed that's working so the only thing left now is the inhaler okay after that's completed Do I minimize this? Yeah, you can minimize that if you like. And then we'd want to go back to your download. Yep, set up PCRinhaler.exe. What's going on there? Microsoft.net framework. This is not PCR related, but it looks like it's legit. I think .NET framework seems legit to me. I would go ahead and hit download and install. I've heard .NET framework many times in my career in tech, and yeah, you need that. So I don't know. I don't know. Your computer must be very new. It needs some updates, I guess. I guess that's going to take a bit. Oh, okay. It might not take that long. I'll give it a minute. I'll be right back. I'm going to go throw something away. Okay. Banana peel. I just want to go throw it away. There you go. Okay. Did the installer for the portal open or this opened instead? Bear with me. I wonder if the portal – or sorry, the inhaler install triggered this. Maybe Windows needs something. Let's see. I'm sorry. Don't be sorry. That's why I'm here. Okay. Okay. I can juggle a little bit. I can do that one thing I was trying to do before. While that goes, no problem. User right before you called in asking to add a user, so I just have to make a quick ticket for that. it just takes a while, huh? It appears to be that way. I'm not too sure, but it's all good. I can manage my time here. I'm keeping an eye on your screen share while I just finish up something I was working on right before you called. No problem. Okay. Thank you. I knew my network was slow. I didn't think it was this slow. Are you on the Wi-Fi? Yeah. Yeah. Wi-Fi connections, that's just the nature of the beast. Well, I have DSL. because of where I live I can't get fiber well we deal with these things it's okay that's how it is man I'm not worried about it Thank you. It's like it's shaking a hell of a long time. What is this that we're doing? What is this thing? Windows prompted you saying you need some updates to your .NET framework I'm not exactly sure what that entails but it definitely is okay and probably needed it's just like a Windows update thank you Thank you. Got to trust in the process. It'll be okay. It does take a while, but if you cancel it or whatever, it'll just make it take longer. Oh, no, I'm not going to cancel it. This did pop up when we tried to install the inhaler, so it could just be something required for the inhaler. What the hell is the wrong one? I just want to sign up for that already. Robin Montoni. Yep. Robin is an employee here at Main Sequence. All right. That's a legitimate email. I wasn't reading it. I just, I just heard it. Well, you can read it. Thank you. Thank you. If you hear me typing, it's because I'm writing a ticket for that person I was mentioning. No, it's multitasking. What's wrong with that? You young guys are good at that stuff. I try. I don't know about being good. Well. Quite many distractions. So do you guys all work in the office in Cleveland? We did. Until recently, actually, we went fully remote. So I'm actually at home right now. That's cool. Yeah, it turns out saving money on rent is good. What do you mean? Oh, we were paying for an office. We were paying for a very large office. You know, like pre-pandemic, all of us were working in the office, right? And there was like 40 of us in the office. But after the pandemic, about half the team worked from home. And then slowly, you know, over the years, just more and more people work from home. And then it got to the point where like five people were coming into this huge office where we didn't need all this space. So we just cut the cost of the office. We don't need to pay the rent, you know. Do you still have a little do you still have a little office or no? Currently, no, we do not have an office. We might be relocating in the next couple of months to like a much smaller place just to have a central location for, you know, like the I guess the higher tier employees to kind of meet. and manage the business, but probably even at that point, most of the employees will be work from home. Well, I know big bill ain't going to come in from Hawaii. I mean, he comes in every so often. We saw him, we saw him plenty. He, I was actually amazed. I was like, man, this guy goes on. He's long flights. Like every couple of months I'd be, I couldn't do that, man. He's rich. Well, I mean, yeah, Maybe. I'd assume. And he's living in Hawaii. It's not that bad. Right, yeah. You know how many PC recruiter licenses I've sold for you guys over the years? No, I don't. Probably 250. Oh, wow. Well, thanks. Yeah. I love Bill. I think he's funny as hell. Yeah, he's a good character. I think he's a beast. I wish I'd gone into business with him. He's a good guy. I'd be in Tahiti. When needed, for sure. Yeah, the other guys are pretty cool. The other guys were... I can't remember who the other guys were. Were there a couple of brothers? Yeah, Michael and Martin. What's their last name? Snyder? Snyder, yep. Mike Snyder, Martin Snyder, Bill Kubitschek. Yeah, they're good guys. Kubitschek. Those are the four of them. Gretchen is his ex-wife, right? Correct. Yeah, they have two kids. So they're cool. They must get along to some extent. Yeah, no, they do. Where does she live? Does she live in Ohio? Yeah, definitely. She would come to the office. She was one of the few employees that would actually come to the office. on a daily basis. Nice. Yeah, it was nice having one of them around. Well, Mike's always at the office too. He was like the main developer. He loved coming into the office. I think it helped him focus on developing, not being at home. Oh, well, yeah. I mean, if you've got a lot of distractions at home, man, that sucks. if you're a headstand developer, I used to be a developer in a mainframe, but I hated every second of it. I was good at it, I just didn't like technology. It wasn't for me. The AI tools that are coming out are really changing the game, man. Like, I feel like anybody can develop now because you can just have AI do it. You can be like, hey, AI, I want this. I want a bit of code to do this. and it'll just spit it out for you. It's kind of wild. Oh, it's between AI and robotics, half of the jobs are going to be gone in 10 years. Yeah, I don't doubt that. I feel like young people should start doing that. Once you can get these robots sophisticated enough where they can, they've already got some of them who are over 100 grand that are pretty sophisticated now that can actually watch people, you know? So it's just like any new tech, right? The wealthy people will be taking advantage of it first. I mean, I remember when I had, whatever those things were, the VCRs when they first came out. I had some rich friends in New Jersey, and they, you know, their fathers were surgeons, and I remember them back in either the 70s or whatever getting a VCR. And it was back then, it was $1,200. I mean, the only people that could afford it were rich people, right? And then economy of scale. and then, you know, seven, eight, ten years later, they were like 50 bucks. So it's going to be the same thing with robots. I mean, it's... China's already selling a model right now, a very cheap model for $6,000. But that's what China does. China floods the market with cheap shit and it loses money, but it grabs market share and then in time it just, you know, the prices go up. But, you know, the bottom line is it's, I mean, I'm 68 years old. I can't imagine being a young guy today. I really can't. I think I'm half your age. I'm 34. So that's a little scary to compete with something like AI. You can't compete with it. Yeah. How do you compete with something that's got photographic memory that has access to every bit of information known to mankind and can put it together, put the whole thing together? You know, I mean, they already have quantum computers. I mean, quantum computing is going to change the game. It's already changed in the game. And he's going to get to the point where, you know, imagine quantum computing that can solve a problem that a supercomputer takes, you know, thousands of years. A supercomputer takes a thousand years, and a quantum computer can do it in a matter of minutes. And then how do you have any kind of IT? How do you have any security? because it'll be able to go through every freaking thing in seconds. They're going to have to worry about it. Yeah, well, I mean, it's just I've been paying attention to this stuff. Like when I'm getting to the point now where I'm selling my properties, my real estate, and once I do that and I get my head out of my ass with all the stuff that's going on, okay, I'm going to start taking classes in AI because I want to see what this stuff is all about and maybe do some consulting with it, you know, because it's, from what I've heard, it's pretty incredible. And, you know, I mean, the train's leaving whether you like it or not. Yeah. I don't know if you saw what Zuckerberg did, but he just made an offer to a guy who's a 24-year-old AI freaking genius. And he just gave him an offer for, I think it was a four-year contract, for $250 million. So just like the high-paid basketball guys and baseball guys, now these guys are like the all-stars 24 years old kids got kids already started different companies and everything i mean hopefully he's a good person does something good with that money man well uh four-year-old man that could that could ruin you or you could change the world with that well he's look he's destined he's destined to make that kind of money anyways because he's He's already got companies that are being funded. He's got two or three startups already. I was just reading about him today. And, you know, guy looks like a little dork, but dorks rule the world. Huh. You know, I mean, whether you like Bill Gates or not, and, you know, Steve Jobs and Michael Dell and all these other guys at, you know, Zuckerberg. I mean, I hate Zuckerberg. I think the kid's evil. But, you know, oh, well, you know, he knows how to make money. I don't trust any of them. I don't think too highly of any of these guys. I think they don't give a shit about people. You know, people to them are just ants. you know I think some people there are some people that care I think when you start becoming a billionaire and you're worth hundreds of billions I think that your mind changes and you start looking at people like meh you know you reach a godlike status you know and you start drinking your own Kool-Aid that's just my opinion it's very difficult it's very difficult to be keep your head together when like what you said you know the younger you are especially the younger you are the more that could really screw you up if you gave me that kind of money when I was 24 oh my god I'd be dead in two weeks I know right there's so many vices there could really do a lot of damage if you die oh ideas i i would have i was a psychopath that's why i'm still working That's why I'm still working at 68. I wasn't smart like Big Bill. I know. I'm trying to get my daughter to start investing her money, like, soon, you know, sooner rather than. How old is she? She's 14. I had a child when I was 20 years old. Holy Lord have mercy. Yeah. So I'm like, hey, if I invested $1,000 when I was your age, I'd be a freaking millionaire. in, you know, Bitcoin or something, you know, I would have been crazy. Like all she's got to do is make one solid investment in her teens and that could carry her. One of my sons invested in Bitcoin. Way too late. Yeah. One of my sons invested in Bitcoin. I think it was over 10 years ago when it was like nothing. Yeah. And, and he, uh, the following feature was successfully installed. Okay. You may need to restart apps that require this feature. Okay. Okay. We can just go to the installation of the inhaler. Okay. But, yeah, I don't know if you remember the Mt. Gox exchange in Japan got hacked and everybody thought it was an inside job. I do too. He'd be worth $100 million today if he still had his Bitcoin. Oh, man. Yeah. That hurts. I'm serious. Oh, yeah. Because you didn't know in handler setup. You did not know back then to get it off the server and bring it into a thumb drive or whatever the hell you were going to store it. You thought it was safe on their servers, which obviously it's not. I know he would at least give me a mil so I lost too no he wouldn't yeah he's hopefully he would have bought everyone a house oh he's he's fine he would have been a good guy alright the inhaler looks like it's installed but we want to establish a connection to your database just like we did with the portal So if you could go to the start menu of your operating system, bottom left, and then just search, like, inhale, and it should pop up. Yep, PC Recruiter Resume Inhaler. it's going to be a similar process to the portal where you got to add connection type in your url and then log in with your username password another instance of the process is already running oh okay uh hit okay and then in the bottom left or sorry right bottom right oh okay you might have clicked it twice okay it appears cool um in actions yep there'll be connection settings and then you want to click click here to connect the database you're already hovering over it and then the same deal you got to enter in your your url oh shit i don't think this one okay down your screen like the other one did yeah it did it shouldn't there you go yeah you should be able to yeah hopefully copy that URL and log in oh son of a bitch What the hell is this? What am I looking for here? Where was that thing I was working on? Sorry, I was multitasking. It should be the inhalers. The inhaler icon is that little yellow and green N next to the Outlook icon on the bottom of your, like where it says your... Oh. Yeah, that, and then, yeah, one of those. Okay, got it. My last name might be sharp, but I'm not. You seem sharp enough. I'm all right. Database. Sharp solutions. Do I do admin or my, which one? Yeah, you want to probably log in with WSharp. Unless you, I mean, whatever you inhale through this, connection through this inhaler will have this username connected to it. So if you kind of want just like, you know, if you just want admin to be on there, you can have admin, or if you want your username to be on there, you can have you, but if you're inhaling it, it'd probably be W sharp. Okay. Is there anything we need to do? Sorry. You can hit test. Make sure that the test button gives you like an okay. Success. Yep. Awesome. Cool, cool. hit okay there and then hit okay again there and then there is still something so were you inhaling from a folder or were you inhaling from outlook or both or i do both okay i've done both okay we need to establish those there so it's on screen right now um do you have a folder already created on this new laptop where you are going to be putting all your resumes i do multiple things so I mean I know how to do the find it oh okay yeah so yeah just basically set up these where you're going to be putting water because it could change at any time oh okay and then do you have the monitoring on or do you do it manually I don't know what you mean well the inhaler has like a there's um you could have it do it automatically like you don't have to touch it it just if you put it in the folder it'll take it in right or or you oh no i do it manual okay manual okay so that's that's currently what it's set to do the monitoring off is checked you see in the bottom right of that screen so yeah monitoring off means that you will only import things when it tells you to or when you tell it to sorry i used to have a i used to have a license i used have a license for Monster. This is the first year of me doing this for over 20-something years that I'm not using Monster because Monster is filing for bankruptcy and I don't trust they're going to stay in business. Okay. So the bottom line is I used to have a scraper. I used to have a software that would go out and scrape Monster. You'd put in certain parameters and keywords and it would bring back resumes. Then I would dump them into a folder and then use the PC inhaler, the inhaler program to bring them into the database. I'm not doing that this year, so I don't know how much inhaling I'm going to be doing, but just in case I need it, it's there. Yep. all right i think and i'll definitely use the email one definitely i think that does it then um unless there's any other that's everything you mentioned when you started the call i uh i was writing down what you were saying and you said got to get pcr installed inhaler and anything else which you mentioned the email thing which we established being the portal so you have yeah we installed java the launcher the portal we established connection to the portal we installed the inhaler, we establish a connection to an inhaler. I think that's mostly everything, unless you know of something else that you were using. Or do you use the capture tool, PCR capture? If you go to LinkedIn, there's like a button on the side that says capture this profile. I've got to be honest with you. I've fooled around with it, but, you know. You know, like one of the guys, I don't know if he's still there, Matt, in tech support. You know, I bought some training hours, and he showed me about that. And I was like, okay, but what, I mean, really, what good is it? What good is it if I'm only bringing their profile into the, like if I don't have their email address or phone number, it's really of no value to me. Yeah. Unless I'm missing something. You could have it bring in, like, if their LinkedIn account lists a phone number, it will scrape that too. But not everyone publicly shows that info, so a lot of times it might not. The capture tool can be used to just capture their LinkedIn profile in general. and it'll capture their like history, their work histories and stuff and it'll create a attachment on their record and that attachment is actually like keyword searchable. So if you do see an email or you do see a phone number, you get much more than that. You kind of get a keyword searchable document attached to their record that you can, you know, perhaps search for like, I need somebody with experience in this field and then it could perhaps find that person if you captured them because the LinkedIn profile kind of gets like scraped and snapshotted and it's an attachment on the record. So that is one aspect that you don't really see when you go to the name record, you have to go to the attachment section to see it, but that is a, one of the benefits. Anyway, it's, it's not too hard to get. If you go to the app store, you can just search PC recruiter capture. and when you download it, it's similar to how we connected to the portal and the inhaler. You could just type in the word. Or should I grab it now? You can if you think that you might use it. I think you closed the Google Meet, but I could probably walk you through it verbally. All right. You can just open up a Chrome tab and search PC Recruiter Capture Tool. Capture tool, okay. And then the one you'd want to click on is the Chrome Web Store URL, PCR Capture Chrome Web Store. Chrome Web Store. The Chrome Web Store will open up. It'll say PCR Capture. You can add it to your Chrome. Okay. Should I add that to Chrome? Yeah, that'll just add an extension, which you could remove at any time if you don't like it or don't use it. But once you add it, you got to do the same kind of thing where you like type in your URL and then log in with your username and password. And then you can go to like LinkedIn and so add the extension. Yeah. Yeah. If you want it, you got to click add extension. OK. OK. OK. Yeah. All right, so that installed. So in Chrome, there's like a little puzzle piece in the top next to the bar where it shows the URL that you're at. Extensions? Yeah, the puzzle piece is the extensions. If you open up Capture, you can log into it. and it'll be the same process of typing in your URL, username, password, and then it's done. Then you can use it. Okay. And then that would be, I think, everything. All right. Good deal. Good deal. All the bells and whistles, as they say. All right. Well, listen, man, I really appreciate your help. Yeah. Awesome. Anything else? We good? No, not for today. Awesome. All right, Warren. Well, it was nice talking to you. Have a good rest of your evening. It was nice talking with you as well. Thank you. Okay, thank you. Yeah, you're welcome. Have a good rest of your day and week and everything. Good luck out there. You too. Thank you. All right. Bye-bye. All right. Take care. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1302.175825,
    "salad_processing_time": 151.19546389579773,
    "overall_processing_time": 1302.175825,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence Technology.  This is McKenzie.  How can I help you? I'm sorry.",
    "job_id": "041ceac1-087c-4c2a-a37b-a28021818418",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence Technology.  This is McKenzie.  How can I help you? I'm sorry.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 2
      }
    ],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3042500837036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}