{
  "recording_id": "3043535468037",
  "version": "2.0",
  "timestamp": "2025-09-21T22:54:13.885055Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:54:13",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID. Enter your participant ID followed by password. You are in the meeting now. You are the first participant. Please stand by. Thank you. I'm going to go ahead and start the recording. Thank you. Thank you. Thank you. Thank you. I'm sorry. you Thank you. Okay. Thank you. Yes, Tuch. okay well I'm on the phone so I can't wipe okay it could be an hour you can do it good morning Blake how are you Hey, how are you? I'm well. Are you a robot? I am not a robot. Oh, I can't see you. Oh, you know what? My camera's off. Let me hop that on there. That's okay. I didn't know if you wanted to do video or not. Sometimes I do, sometimes I don't. I think it was off by default because it's something I was doing the other day. But I am not a robot. Just messing around. Oh, no. A lot of times people are shocked. We have a chat for support on our website, and we'll chat people back, and they're like, wait, you're a human? We're like, yeah. That's awesome. Because it starts out with the AI chat, but then it dumps it to one of us, so then it switches over, and it's actually a live person texting. It surprises people sometimes. Yeah, yeah. Very well. Well, glad you could join me today. Yeah. I tried to dial in. Yeah, sorry about all the back and forth, but I can do another 30 minutes here. They moved it to 10, and then I got an 11. And if we have to go over, happy to reset, but let's kick it off. Kind of show me what you're working with. For sure, for sure. So I wanted to learn a little bit about what you're using now, what you're looking for in a software package, kind of main elements, main features that you really need to have. Sure. um honestly the reason i reached out was we just hired a gentleman uh his name's nick and maybe i probably could have had him on the call but um he he's in my office so he can kind of hear our chat but he said at his old firm they used pc recruiter and he thought it was pretty beneficial for his business i've never used it i've never really needed it um so i'm more or less kind of wanting to review. I want to see it myself and then probably be able to answer that question better for you after I see it. But he liked the tracking part. And what else? Tags were really helpful. Tags, tracking, imports. Just the node system. Sounds like overall, he just liked having PC recruiter for his old company. And just to give you a little knowledge in us, We are a five-person company founded about 20 months ago, doing some good things. We brought on Nick to start our construction vertical. We, for, I guess, technology purposes, full transparency, I am developing an ATS on the back end. It's just not ready, and it's nowhere near what PC Recruiter is going to be. Right now, we're manually tracking everything in a spreadsheet. That's how we've lived. Obviously, that's not going to sustain as we grow. We use Aviante Bold for our temporary staffing business unit. That's a whole nother division that is 50x the size of our direct hire division right now. We live in Bold for invoicing, but we do not put our candidates or anything in there besides the client. And then when we place the candidate, the applicant tracking system, we are developing on the back end, the interface. I'm probably giving you too much, but this is good for you to know as you kind of look into what pricing or what this might look like. But the interface doesn't, it doesn't, the company we work with, they're doing it for temp staffing. They'd have to create a whole new interface for direct hire. So I'm living in it as if it were temp, but not using some of the stuff. and that is nowhere near where it needs to be for the next couple years so that's a long-term does that answer your question i know that's kind of a lot but no that does certainly absolutely so yeah so let me show you on pc recruiter some of the various features functions kind of what we do and how we work i'm going to share my screen here to get us into a sign-in you should be momentarily looking at my sign-in screen right here Okay, there we are. Do you see that all right? Yes, sir. Perfect, perfect. So we are all cloud-based, so it's going to be something that will run on a PC or a Mac. So no matter what type of machine you have, you're going to be able to run it. There's a mobile app that's going to run on pretty much any browser as well. So real flexible on how this is going to be set up. Getting myself logged in, I'm going to be able to log into the system. Each user would have their own unique password. So you'll be able to see who sent the email, recorded the note, scheduled the follow-up, talked to the candidate, whatever it might be. Everything's tagged back to their username. So that's going to make it really simple for reporting and tracking and everything of that nature. Now, once you're in, the main menu bar at the top is going to be your primary navigation. And that's going to be where you'd go to get to your three primary record types, those being names, companies, and positions. So those are kind of our three main records. The names obviously going to be your candidates, also could be the contacts of your client companies. Companies could be client companies or potential client companies. So this could have a bit of a marketing arm to it. So you kind of track companies you're talking to or marketing toward. As you get new contacts at those companies, you can attach the name to the company, kind of build yourself a contact record for them as well. And then, of course, positions, the jobs you're looking to fill. So you're going to have a whole separate area for positions. They're linked of course to the company that they're for. Cool part about the system is when you put in the positions into PC Recruiter you can interface this into your website so that the job would be automatically posted to your site. Candidates could then apply online, put themselves right into the database, do all the data entry, upload resumes, answer questions, anything like that. So we do have a job board piece that will interface with your website no matter where it's hosted or what it looks like. So you're going to be able to have your jobs posted directly to your website from PC Recruiter. Also in our main menu bar up here, in addition to your names, your companies, your positions, you have some kind of just various elements of the system such as your schedule. That's a daily calendar. You can put meetings, phone calls, follow-ups. I can click on the 6th and see what call I had to Philip Baker. I can click and see what I spoke about. I could even jump right to his name record from there if I needed to call him again. We support auto dial from RingCentral as well as Google Voice or Zoom Phone. So you can click the little phone number, the little phone icon next to any phone number to dial them. It'll record an activity if you're using RingCentral, which is nice for reporting purposes as well. So full schedule in here, that calendar will sync with the Google or not. Do you sync with Apollo? We do not. That's not to say maybe with our API you couldn't write something, but we don't have any sync with them out of the gate. Okay. And so you're going to have your schedule, your calendar. You're also going to have roll-ups, which is a list creation tool. So you're going to be able to build lists of records within PC Recruiter. Some people use these as a pre-pipeline. Some people use them as a means by which to mass communicate with someone via email, sequences, drip campaigns, all of that. So you're going to be able to kind of build your different lists here, and you can kind of put different groups of people on the list. So if I look at my maybe application engineers, I've got 112 on them. I can click right there. That's going to show me all 12 people, or all 112 people. They're going to open up in the top frame. So at the top, you're going to be able to configure kind of what fields you want to show. You can give them a different stage or status or anything like that. And these are candidates that we, in theory, you've talked to that you're just putting into here? Could be. Could be candidates you've talked to. Could be candidates you, maybe you just saved the search. A few different things you can use the Rollup List for. so I just put these people onto a list and maybe this is people that I'm calling and then as I talk to them maybe I mark them at a different stage status priority whatever so I'm going to be able to kind of track that I have a lot of configuration options in there I can search my database as well if I need to go to names I can go over here to advanced and I'm going to be able to look at sorry for the cat anytime the cameras on he does this that's okay I actually love it. So as we go through... When I work with Bull, my dog thinks he's a German shepherd guarding the door. You get all kinds of loud bark and everything. Yeah, a UCS driver pulls up and he thinks he's going to go kill him, but he'll just probably lick him and run away. So if I'm going to be able to keyword search, I can put in my Boolean search logic here, type in what I'm looking for. Then I also have the capacity to, when I do my search, what's cool about it is it searches a number of different areas. I'm going to be able to see that score column over there is going to tell me where the word was found. So I could see under Terry, the first person, he had the word in his resume, his notes, keyword tags, summary, profile, attachments. So I have a number of different searchable areas in PC Recruiter. so I'm able to go through if I click the R that's going to show me his resume and that's going to highlight every instance of the word or if I looked at his notes this is where I have the ability to either paste or write in searchable notes throw in a little bit of a description or a summary there all those words are searchable so that's going to highlight kind of where the words were found likewise keyword tags so I can tag him out of predefined lists I could tag I can apply these tags and then search the tags as well. So I have a lot of different searchable areas. Any attachment, this is usually archived resumes. When I've updated this resume, it archives the old one. Those are stored. And the attachments area, those are searchable. And then I'm going to be able to look at also profiles, including maybe as LinkedIn. profile because we have a tool which is going to let you import records from these various versions of LinkedIn indeed career builders zoom info Facebook a few others so you can just if you're looking at anyone on zoom info or LinkedIn a little button will appear that you can click to add to PC recruiter what it's going to do it's going to create a record import their name their photo import a copy a searchable copy of their LinkedIn summary so that that is now an attachment in PC Recruiter and it's all indexed and searchable. So you're going to be able to kind of pull people in on your own from social media and career sites there. And then you're also going to be able to look at your summary. That's just a big empty area. There's an AI generator to generate a summary on the candidate. You can save that as a searchable piece as well. So a lot of different searchable areas within the system. You can always jump back, add another word, add a zip code radius, anything you might need to. And then if you wish, you can select using the button over here. You can select page or set or anything like that. That's where you're able to save them to a roll-up list. So you can put them on a roll-up list and then start calling them from there. Or maybe you send them a mass email, an email campaign right from here. Pick a letter. That's going to let you send everyone a personalized, blind-carving, copied email. You can click opens, what they clicked, how many times, when they opened it, if they replied, unsubscribe bounced what have you you might even kick off a sequence so you have the capacity to set up a sequence like a drip campaign so initially it might send out one email then if they open that email it'll send out a different email then if they don't touch it for three days that might send it yet another email so full sequencing drip campaigns you can even link them right into a position pipeline from here if you wanted to start them through an interview process so you'll be able to work with that as well so when you're doing your searches you can search on just about anything in the system any predefined field custom field any of these attachments resumes notes all of that is searchable so your candidates very easy to search if I go to names if Jim Lombardo calls and I can just type part of his first and last name pull them right up I like to even sort by last activity if I know I spoke with him just the other day I can go and get to the correct person right from there so it's very easy to work with that also if you go into name it's going to hold on of the last 50 records you looked at. So you can kind of scroll through and see the most 50 recent records you looked at. Same with positions. So if I looked at positions, I'm looking at the last 50 or so that I was working with. If I go into my radiological control tech, that's one I was looking at just the other day. The position screen, entirely configurable. So as many fields as you want in one to 10 columns across. So that's all up to you. And there's going to be a pipeline for each job. So you do have pipeline capacity in here. So you can actually design your own interview process and workflow. So you're able to put up up to 18 steps, call them whatever you'd like, pick whatever order they're going to be in, pick whatever color you want them to be. And then you're able to take your group of candidates and very easily just drop, drag and drop them. And this is for one position, correct? Yes. Can you go back to the beginning of that for me again? I want to see that again. back to the position or back to where I got to it yeah what did you click on to get there so right now we went we're at position you clicked on radio whatever okay and then that shows an actual one company in the bottom okay so this is where you would put all of your open positions in theory mm-hmm yeah the positions are actually linked to a job you'll see this one is linked to the Idaho National Laboratory so each position is linked to a company record So if I go into company, I can go into, there's the Idaho National Laboratory, and I'm going to be able to look at, I have three open jobs. So you have to create the company, then create the position. Yeah. So your company is kind of a parent, and then any name must be linked to a company. Every position must be linked to a company. But usually if it's a client company, you're going to have had that record in there since you first started talking to them. And then you just add the jobs, add the people, so you're going to be able to have a set of contacts and a set of jobs linked to that company record. Can you go back to that position, the company and then the positions and then that screen you were just in? Oh, yeah. So if I go to company here, I'm going to be able to look at the main company record. I just scroll down. There's all my positions. There are all my names. Yep. Or I could click names and positions in the header here too. I happen to have my screen configured to show them all on one so I just scroll down there's all my jobs scroll down there's all my people what's cool if you're looking at the positions too you're gonna be able to see if they have a chain link that means if there's a pipeline for that specific position and if I click on it it'll take me right to it pops up a new tab and it's gonna go right to the pipeline for that specific job so I've got all and then how do you move someone from phone screen to resume the first interview all that drag and drop you drag drop them right and it and as you do that creates a searchable trackable reportable event tagged to your username so if I looked at I think it was let's take Victor now could a client look at this screen a client doesn't because they don't have access to your database you can send them a report of what's going on but they don't have access to look at the screen there we used to have an older piece and we're kind of working on a new piece to be able to allow a shared individual pipeline only the client but it's tricky because you don't want to give them access to everything you only want them to see certain so usually what that report look like if I hop into here one of my reports I can look at applicant tracking report and that's going to be something that I can pull it in and I could maybe even limit it to one specific job so if I wanted to filter it by see position ID and I don't know the idea of top could you send me one to my email real quick so I could see it or could you show me on this I'm gonna pull it right up so I'm gonna go ahead and I'm gonna pull it just for one company and I'm gonna pull it for this this year perfect so I'm gonna do 131 so I'm gonna do that so what I can do I can either export it to Excel, Office, CSV, Print It, PDF view, or a Google Sheet. So I have a lot of different options that I can do. I usually like to pull it out to like an Office 365. So what it's going to do, it's going to pull this report. I would simply save it as an attachment and send it over and this is going to give me a report. I remember I did it this year for one client. There we go. So it's going to pull it out there and I'm going to be able to look at it so it's going to take a look at for the lead engineer job there's everything I've done for the radiological control tech job here's everything I've done so I'm going to be able to look at all my applicants in order so it's going to put them in date order here but I can also toggle over and look at my interview status distributions so I can see how many second-in-person first-in-person reviewed contacted anything like that so this is going to be a hard copy report you can send in Excel or a word to share. You're also going to have a more interactive report that I think you can also email out to a client as well. You can go into analytics and you would be able to take a look at metrics. Oh, I think interview activities is what I want to do. Nope, pipeline activity. Here, you're able to put in every step. I only put in first interview, second interview, and phone screen because I built this real quick on the fly. But you could put in all of your interview stages you could of course go up here you could filter to position title radiological control tech apply that filter now I'm looking at only that job so I'm going to be able to pull it over I can see first interviews second interviews phone screens I could see when everything happened I'm going to be able to of course it's only one job but I could look and see which one of my cruders worked on there so I'm going to see all the detail there and you can print a report of this to send over to them as well and that's going to automatically kind of pick up on every activity okay and then if you're looking like I said so you got all these different reporting options you're also going to be able to go into the name record and when you look at the name record for let's say Victor if I look at his activities an activity was recorded for the first interview where I made that drag-and-drop for the I know national lab showing today's date showing my username I've got all that detail that was automatically recorded time date username stamps also he himself is going to have his own individual pipeline so this candidate is going to show a screen here showing everywhere he's ever been connected how far he got which user did it when it happened so you'll be able to see just kind of a snapshot of everywhere he has ever interviewed and how far he has gotten along that process for each job so I have a couple of different ways and I can look at that as well. And then I can again configure my screen if I want to put in fields like what language does he speak or specific certifications he might have, experience, anything like that, you can put in your own different fields. You can have your activity showing here and this is going to show every email, every interview, every follow-up, every time you spoke with him. Maybe I can say talk to him today, interview went well, follow up Friday so I can even put in that I spoke today throw in a quick follow-up Friday morning and I can do something like that maybe I even want to make it a specific no contact made just to note that you can put different activity types in there and you can add and that'll connect your email to remind you to follow up at that time basically if you set an alarm to it yes it'll pop up a pop-up alarm on the screen so you could do something like that so it can be hooked into your outlook it'll hook your calendar so you've got that and then I just scroll down beyond my activities maybe I show if I had a resume I can show that right there I can see show notes I can show interview history all of his attachments summary so really however you want to set this up you can do it so it's really really very flexible Okay. Now, I just see we're kind of running six minutes left. I wanted to see if you had any questions. I've kind of given you my general walkthrough. There's tons more in the system here, but anything you wanted to kind of revisit or anything you hadn't seen yet or anything of interest you wanted to kind of take a look at? What is – do you guys work with companies as small as ours? Sure. Usually our target client is going to be anywhere from two to ten users. So we work with many people your size, but we have customers 100 plus users, some single users, so a little bit of everyone. We will grow with you too. So PC Recruiter can grow. So if you started with five users, you can add users without affecting your contract. So you can just add users month to month as you go. If you need to drop a user, you can do that too. So it is very flexible, easy to put different usernames and add and remove if needed. Okay. No, I mean, I think you definitely know the system. It looks good. I don't just make the final decision. I have two other guys with me that kind of say, hey, let's do this. But I will, at the end of the day, say yes or no. Let me regroup with Nick and get with the guys. Now, from a pricing standpoint, look, I'm in sales too. I don't always love to talk pricing right away. Are you guys flexible or how does that work? Well, we are. We are. So the price point on this is approximately $115 per user per month. That is if you were with a one-year commitment on the premium package, which is what we're looking at today. So $115 per user per month, $750 to set it up. $750 includes all your setup, 10 hours training, help hook it into your website, your Gmail, installing the capture piece, Pretty much all the setup and training is included in that. But we are flexible. Also, if you need to add or drop users, you can do that. That doesn't affect the contract. We offer two-year terms, one-year terms, month-to-month terms as well. So we have some different things we can do as far as that. So it's not carved in stone. So basically, like, if I had two seats for Nick and I, I could remove mine, and it would reduce that monthly charge? Yep. are we can we remove it completely if we didn't like it within three months yeah yeah well we actually we have a 90-day acceptance period in every contract too so even if you signed up with a two-year contract you have 90 days to utilize it and if for any reason it didn't work out you can pull the plug no early termination you can drop everything uh and and we just cancel the deal so we have that 90-day period after the 90 days though there is an early termination fee there is there's a i think it's 80 of remaining payments to if you're still under contract. 80% of remaining. So if you had one seat and you were in a one-year agreement, you're paying basically eight months of that, not seven months. Yeah. Yeah, that's what they do. Okay. No, thank you for doing all this. Let me get with the team and kind of regroup on this transparently. I don't know if we're out of position yet to do this. So for your knowledge, Jim, this might be more of a 2026 play, but I'm glad we got the ball rolling. Will you be my point of contact, you know, if we put a brief pause on this going into 26, assuming you're still there? Yeah. I've been here 26 years, so I probably will be. Oh, wow. Well, I can tell. I mean, you know this thing like the back of your hand. Yeah, I've been doing this a while. But, yeah, what I'll do, reach out to me. I'll ping you maybe a couple weeks just to kind of get a feel if I haven't heard anything. That's totally fine. Let me actually ask you this. You've been there as long as you have. What are some complaints you hear from clients the size of ours, and what are some things that they're like, oh, my God, we absolutely love this? And be honest with me. Well, complaints, a lot of times people think there's too many ways to do things in PC Recruiter. There's too many options. Like if I want to go to a position, I could go right to position. I could look it up. I could scroll through my recently active. Or I could go to company and go to position. So there's a lot of different ways to do things. If I want to add a name, I could go to any name record, hit the name add from there, or I could do it from the main name screen, or I could do it from the quick add. It's almost too complex. Like there's too many things. Almost too many options. So that's why people. And then some people don't like the interface. They think it's a little older looking. We do have, I include it too, a new interface, which is more of a CRM product as well. So this is our newest interface. It was released earlier this year. And this is called PCRM. So it's a new interface. It contains everything the PC recruiter does, but it adds a deals pipeline. So if you wanted to use this different interface, you could do it. Here's Victor Grum's, the same candidate we were working, shares the same database, just gives you a custom workflow. You can look at resumes, activities, a little bit different type of setup, a different type of look. It adds a deals pipeline like a sales funnel too. So that's something we've done to address that people, some people love the format. Some people thought it looked a little old and complex. So we simplified this version here. PCRM is included in the pricing as quoted. You can use either version. So that's another thing we did. Okay, so versions are the same. It doesn't matter what you use. Okay. Yeah, same database. So they both point to the same database. And you could even, one of you could use PCRM, one could use PCR9. No problem. It's a real-time update because it's sharing the same database. So it's kind of select that way. A lot of people like that because you have that flexibility. And a lot of people like the configurability of PC Recruiter. Some people like the ability to set it up any way they want, put custom fields, redesign screens, set up different automations. Our sequencing is really nice. We have a simpler version of it in this PCRM piece, too, that you can even build on the fly. So a lot of options within the system. Awesome. Yeah, actually, I kind of like this interface a little more myself, too. So glad you brought that up. Yeah. Okay, Jim, I appreciate it. Yeah. Follow. Let me get with the team. A lot of guys are kind of in and out over the next week or two. So bear with me, but I just wanted to be transparent with you. This will probably be more of a 2026 thing. So let's just stay connected and I appreciate you carving out some time for me. My pleasure. Thanks for fitting me in today, and I'll talk to you soon. Talk to you later. Bye. All right. Take care. Bye-bye. Goodbye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1321.137885,
    "salad_processing_time": 240.0358600616455,
    "overall_processing_time": 1321.137885,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID.  Enter your participant ID followed by password.",
    "job_id": "b6221abf-81a5-4b39-890f-9b454763e5f8",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID.  Enter your participant ID followed by password.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Billing",
        "confidence": 0.7
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "billing",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3043535468037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}