{
  "recording_id": "3045645419036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:56:47.978486Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:56:47",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Integrity Bookkeeping. This is Melissa. Can I help you? Hi, Melissa. Is Kathy available? Just one second. Okay. Thank you. Thank you. Thank you. Hello? Hi, it's Robin. How are you? Hey, Robin. I'm doing okay. Do you have a moment to chat? Or are you in the middle of something? It's okay. Yeah. What's your name? So I'm kind of getting my ass chewed up. but a little bit of an ass-chewing about international cut. Well, not really. It started sounding like that, but then I don't know if it's really me. So Bill was saying we have to get this stuff addressed with the international. And I'm like, well, I don't really know some things. And it was kind of like, it's been three months. You should know by now. So when I said, well, some things are like a little weird, and you're like, I don't care about that. you know so don't want to hear about how anything was done before and I just have to learn how to do it right it was kind of the tone I got in so many words so let me pull up what did I need to ask you so as far as um these international people when it comes to somebody wanting to pay international because like most of them i'm finding now like the country drop down is throughout so i think i've got a good handle on those except for that gabby i don't know maybe it was just her card didn't like us i don't know yeah but for other people i it's better than it was like remember how country drop down was missing in many places so so far those are okay now let me see what was i supposed to ask you about though Not that one. Next up. This is it. Okay. So this Laboratorious Saval, S-A-V-A-L is the easiest way. I guess they normally would like to pay by wire. And then what I was saying, well, if they want to pay by wire, I think Kathy has to generate that. And it's like an encrypted link. Is that correct? Yeah. Yeah. Because that's what I've been doing recently because we have to actually send them the actual bank routing and account number. And it's not safe to just send that in a regular email because you're basically just opening up your exact account information to the World Wide Web, basically. You know, anyone that can intercept that message from here, you know, to their place and anywhere in between. then can get your banking information. So I've been sending it with a secure and an encrypted email. I don't know if you can do encrypted email on your end or not, but my secure document management allows me, you know, to send encrypted emails through Outlook. And so I've been sending them that way so that I make sure that I'm not exposing main sequences account information to somebody that, you know, could intersect a straight email. Okay. Is it possible, I guess? So, I mean, I don't know the limitations. And I'm like, well, I think some of them were because of the situation. So I'm just kind of like going blind here. Okay. So is that like for every payment unique or is it just like one thing that's? like no i just have to send it i just have to send them the the the banking information so they can set it up with their bank to send an international wire okay so so once they have it they have it would okay once have it now we can also though we can also send them um if they had paid previously in QuickBooks, we can send the invoice directly from QuickBooks with a link for them to pay. And QuickBooks doesn't seem to have any problems with international payments. So we can switch those. Now, I guess they were always a wire. Would that have been done? Because I never took care of the wires before. Yeah. And this is where I start getting in trouble. Well, you've got to figure it out now. Like, I never did the wires. Like, I don't. Yeah. That's not your, that's not your, that's not your, you're not in the finance. you know, stuff. That's not something you would have had or been responsible for. So I hear that they're, you know, they're kind of grouping jobs and stuff like that because they're just trying to, you know, to get through. But you don't have access to the account. I'll see, check on those things and things like that. And why would you want to place that burden on you? I don't want to either. Okay. I'm just trying to, like, not be in trouble. because I had to do a call with Tino who does some of these international accounts and I'd be like, well, what's the email I'm supposed to be sending it to? I don't know. It's not the most pleasant call. What was that one with L? It's a name. Yeah, just say Saval, S-A-V-A-L, and then you'll find it. Laboratorios, I don't even know how to say that. I know, I don't either. so yeah they're bouncing from like one to another I'm like they were making me dizzy in the call I'm like no let's talk about one at a time yeah okay yeah this one overdue partially paid forty dollars and then so I'm not the and then then I also brought up I go and I think she was also wanting to do something about the wire fee because otherwise, like, oh, Bill, you lose $20 or something with every wire transfer. And I'm guessing that's why there's a little bit of a balance on one of them. Let's see. So, yeah, that's the problem is we can't see, like, when a wire comes in, we can't see if they wired the full amount in their funds and it was an exchange rate difference or if the bank grabbed 20 or 40 bucks before it gave it to us. And sometimes they will charge us a wire fee, like our bank will charge us a wire fee after the fact. But if the international bank charges a fee as well, like how are you supposed to see those things? So I have to like guess. And I'm like, okay, well, let's see. This payment we got was 1,020.04. And let's see. Well, they really owed $1,040, you know. So one of them, like I asked them because I said, you know, we got this payment, but this was the invoice. And they sent me like a confirmation from their wire that they had sent like the full amount in their currency. And then there was a fee that came out. But we don't always see that. So like with this laborious whatever, it has, let's see, it has. It was $520.02 and then we got $480.02. So we got shorted $40 it looks like. Yeah. And so I think that's probably an exchange in wire fees. So technically when that happens, if it really was in transit and things like that, we have to give the full credit to the client and then back out the fees because technically, you know, they paid it, but we got shorted either through the bank fees or an exchange rate. And those are very hard to see from the bank because it doesn't tell us what the actual initial, you know like payment was coming from the other country to see if some of those things are in it so that's not a part of the description and things like that in the wire so a lot of times I will have to assume and sometimes I think I don't know I don't know who recorded the payment I'll have to look and see it could have been me it could have been one of my staff and that you know Well, we got 480, so they put in 480. But most likely that's because of a fee that shorted it, and we should have given the customer the full credit. Let me look and see who did it. Oh, it looks like I – well, I don't know if I did it or if one of my staff, because a lot of times it uses my name. So I don't know if it was me or one of my staff. But one of us recorded that deposit that came by wire in May. most likely I don't know I don't even know if I can go back and look at that one it went into account account did it go into trying to see what you count it got to pause in May it probably went into like one five nine nine or something and so if it's in if it's in key I'll be able to possibly I can possibly look it up again but if it was Huntington I can't it's gone can you since you have that link so it's not a link there or something we could add to just their one invoice their invoices I mean right maybe like in the notes area or that's not safe to do, I assume, either, right? No, if you're going to send it by straight email, again, you're putting your bank information. I don't recommend it. With all the stuff that goes by email these days and all the ways people hack emails and intercept them and things like that, I don't recommend it. But if they're going to freak out and want to, you know, throw caution to the wind and just do it, well, that's up to them. But I wouldn't make that call. That international wire stuff is different than the ACH stuff that I have, right? Yes. Okay. Yes. Okay. Because the ACH, we have like a masked number. So we can give that out. It doesn't matter. Nobody can get to our account with that information. You can't write a check with that information and steal money from our account. You can't, you know, pull money out, you know, things like that. You can't do any of that with that number. All you can do is deposit to it. If somebody gets the actual numbers from Wire, they could take all your money. They could, you know, they could write checks on it. They could, you know, pull money out. They could use it to pay other things. that can do anything they want with your entire balance in that account. Okay. So, yeah, I don't recommend it. Okay. Let's see. I'm making my notes here because I'm also going to tell Bill this too because I'm going to tell him which risk to account. And since the majority, since 90, 90, 95% of your money lives in that account, you're playing Russian roulette with your entire balance. If you just, you know, if you just start sending that account information by email to people, you're playing Russian roulette with 95% of your dough. Okay. So, I'm going to have to explain this because you're acting like I'm stupid. I'm just like, I didn't know. Yeah. Well, we can send things through QuickBooks. We can, you know, try to help them in the Biller Genie. And we can, you know, if none of that, you know, works and they just, you know, they absolutely want to wire, then we can send that encrypted. And if you have a way to send that encrypted in your Outlook or something like that, then, you know, then that would be one way if you wanted to get around not having me do it. But I wouldn't do it through straight email. I would not. Okay. So let me see. Okay. I'm going to fix this one because I'm pretty sure this one from the Costa Rica place, I'm pretty sure that that payment in in may i included you know some bank fees that came out so i'm gonna i'm gonna fix that one and they're coming like they're they're bouncing like from one you know tino especially and then you got you got you got so value delayed and then i'm like women one at a time because i felt like the conversation was bouncing from one to another i was going crazy i'm like listen one one at a time um Deloitte I said well we've sent the invoices I go I found another email person that's logging in they don't reply like who were we invoicing because he's like oh yeah well they change people a lot well then they have to let us know they're behind I don't know what you want I don't have a billing email I don't know what you want me to do like who do we talk to I don't know well I don't know either that's why they're getting invoiced and that's why they're behind now Recluda that one they are not as behind as they were saying because they did they did pay May and June there's just a set with July one but they're going to be fine and then that Gabby paid by wire so I'm going to add this stuff about the wire because I'm just going to tell Bill, like, no, you're risking your account. That's why we don't have wires. Because he's like, well, you could send it through QuickBooks. Now, if I send it through QuickBooks, what are my options there? Yeah, I can. send a link I can send a link through through QuickBooks and it's and it's secure because it's the payment link it's not I don't have anything in the body of it it has a link to pay through into it where they put their information in and then into it charges it so we can do a card though right that's not why No, it's not wire. They can do, they can, for international ones, they probably all card. I don't think international can. ACH is not something that can go internationally. And so I would imagine that the only option would be card. So it sounds like for the vol, they are going to have to. If they want to pay by wire, then it has to be where you send them a link. If they want to pay by card, I could try with Bill or Jeannie as an alternate route sent through QuickBooks, right? Does that sound about right? Yes. We can do it through QuickBooks if the Bill or Jeannie is problematic for them. So if they can't get their information into there, then we can do it either through QuickBooks or we can send them the wire details. But I think we really should start, you know, charging that $20 wire fee because you're losing, you know, $20, at least $20 every time they pay by wire because our bank charges $20. And if their bank charges anything or has an exchange rate, you're going to lose funds from there as well. So you're bleeding from some of the international things there. Okay. All right. And then he was mentioning, and then the 200 people that are not being invoiced. I don't know what he was referring to that. Do you know what he might be talking about? um is that the thing you just say not paying or is it not the ones of those sales receipts those are mostly done i think you only have like four more customers yeah so i don't know what he's talking about i'm thinking he's just talking about people not paying or maybe like the on hold collection people i don't know he's referring to that but he's like i've got you know two hundred thousand dollars of people that were not even billing i'm like what i was very unclear on that one. I probably would have asked him for more information. I'm not sure what you're referring to because I don't... This was at the end of the other call, so it was kind of like... Okay. He's got a boatload of stuff that's junk. There's so much junk in there. How you could tell if you've got fees missing would be really hard because you've got so much junk. right I mean when you look at the if you look at the invoices so if you go to if you go to customers and you sort it by by balance I've got a whole bunch of things that I'm trying to flush through and some updates and different things so you're going to see a big balance with this main sequence name so don't let that throw you. But there's... Oh, like these people that have been billed forever that haven't been around forever and they just stop paying? Yeah, so there's... I mean, so you've got... We've got some money in Intuit's holding, but then the next one is... The largest balance is Essex Group, which is $9,900. But that was just billed in June. But guess what? They haven't paid. So... And I'm like, I thought, that on these big ones that you know bill was following up on those for the ones that haven't paid that were you know big ticket items so this one's got six oh it says 20 users at 75 and extensions at 85 and if it looks like you're billing for six months at a time maybe and it was built in june and it's 9900 those people have not paid it is now august so what's the deal with that do I have them on my list? it looks like they bill in December they bill in December and June yeah it looks like that okay I started going through a lot of these that are like more than I think like 60 days because that invoice in June they didn't pay for four solid months they did not pay their December invoice until April 1st and now they've been billed in June and they haven't paid again for two months so they're just living on your stuff for free for months on end yeah i do have them on my list and what did i do i what are my activities here and there's no late fees on their account so it's kind of like hmm but they have been a they have been a poor payer for a long time usually it takes them two months to pay. In December it was $4. Looks like they have, oh, this might be one of those where they have like this weird site it has to go to or something. Who else did I email? Looks like I emailed on August 1st about the status. There's no, no, sorry, so I didn't. Jen Ryan would have been copied. Accounts, payable activities, email. all right I'm emailing again why is that the accounts payable AGM core this is the AGM.co, whatever this weird email is. Do I have this in here? That was in March. All right. I'm going to email them again. How do they normally pay? Is it check or card? I can tell. It doesn't say. Let me look real quick. Let me look for a previous payment. Maybe it's payment. Go back there. Looks like check. Yeah, it was a check in April. Okay. I mean, come on. Who sends a check for $10,000? I mean, come on. um maybe i should send them ach or just let them know that it's overdue oh no i would send them ach and let them know that you know there are there are late fees you know that um you know as a courtesy they didn't get a late fee last month but but they're gonna they they're gonna have they have a late fee now or something you know because it's uh they're they're only billed every six months. They're already into the new period where they haven't paid. I'll say, can you please let us know when we can expect payment? You can either... For your convenience. Here's our ACH information for your convenience. and to avoid late charges or disruption to your service, you know. Yeah. Okay. So on that MLR, we had talked about it a couple times back and forth. They canceled it on January 6th. So I did not create that separate January 1 invoice should that have been done because they didn't pay November and December. And on 1-1, they should have had a new invoice, and they didn't cancel until 1-6. Wait, let me see. This says MLR. Mm-hmm. What was this for? Let me see. They're invoiced and paid. What are these amounts? I wish I could, like, view more details without clicking all over the place. Okay. So they were invoiced. What was this other invoice then? 124. Did you look at MLR? In Texas? because they only had one invoice in October that they paid. Oh. And then they didn't pay November. They paid one separate invoice. Is that a better return, the $500? Or is it that training? Oh, this one, you know what? Screw them. Keep it open. Let the late charges rack up. Why did they get 12 and then 1 and they canceled? Yeah, that one should stay open. 11, 12, 1. So they canceled within the 90 days, but that's in their 90 days. And they had service. So that one needs to remain open. And the guy's like, yeah, he was looking at a different company for like a really long time. And I don't know if he was doing some shady stuff or employees hated him. Little history, because I remember it was like, oh, my God. He called in in a panic because an administrator, someone that had admin rights to the database, went and deleted a whole bunch of stuff out of the database. And I think deleted usernames. So he must have pissed somebody off that worked for him. So as the person was leaving, deleted a whole bunch of stuff. So he called in and we had to get databases, whatever. And then he kind of did a whole new account. And then he was going to have all these users. But then he's like, only set up one user. but then he was constantly calling in for a user change like i need to change the password i'm like they're they're doing something so i can't remember if we fired him or he quit within 90 days there was something about that but that cancellation date is um january so that one that's in there that's what his contract is or whatever so leave it open and and i don't know so just don't but don't create a january one just the november and december right right which I think is how it is because the one is let me go back to it I don't have one yeah yeah they canceled one six so the the 12 one basically take them to for that month of one one November mm-hmm so don't even bother with like we're talking about five days so I wouldn't do it for January but keep that that one open just to piss them off with nothing yep because he was he was I mean calling like the activities were crazy I kept going why the hell is this guy calling again asking for another password reset and like he's doing something shady I think he was trying to get like a ton of people to like log in as the same person but then didn't want that person logging in again so then he was like swapping it out like every couple days it was really weird Oh, my goodness. Yeah, you get some weirdo. So some of this is like, you know, dude, it's not all me. Yeah. Yeah. We got some special cases, we'll just say. And they take a while to go through and figure it out. It's like, oh. Like, I saw one that was like that, oh, Tina had emailed. He's like, why is he getting this invoice? And I'm like, well, they canceled in August. that's like an April invoice or whatever it was before they canceled then I'm looking at it and I'm like there's like two and there was like a gap and then there'd be like two invoices each month and I just said Bill's like just void it just move on I'm like they might have been double paying you for a month I'm like I can't figure this crap out I don't know how some stuff was done yeah it's not that well a little crazy yeah So, all right, so I'm going to compose this. I'm going to email the one guy and ask him, okay, who is the other one? Essex Group, right? Yeah, Essex Group is the one. Essex Group, I got to follow up on and offer them either ACH or going card, but you need to pay it. Otherwise, you're going to start getting late fees. And then the other one I need to do is the Saval. the lapse of all we'll call them for short do you want to do wire ask bill about what we want to do with a wire payment like add fees for it or yeah at this point they're probably just hoping to get their their money and they're not going to do the a fee but they have to consider that because it does add it does you know take away from you know from their bottom line for wire payments but um i'm going to take my little notes that i was jotting down because some was probably repeated i'm going to run through chat gpt i'm going to send it over to bill but i'm going to copy you so correct me if i did give any wrong information please um you should run it by you first then send it to him i just I've got to wear it simpler, otherwise I'll go out. That's fine. I'm sure you know I'm speaking up right. All right. So I'll work on those two for now. Okay. Thank you so much. Okay. You're welcome. Bye. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1395.546455,
    "salad_processing_time": 187.4888310432434,
    "overall_processing_time": 1395.546455,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Integrity Bookkeeping.  This is Melissa.  Can I help you? Hi, Melissa.",
    "job_id": "f64d1ff2-7b8f-4a36-80c8-1c5a9be63f47",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Integrity Bookkeeping.  This is Melissa.  Can I help you? Hi, Melissa.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical",
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3045645419036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}