{
  "recording_id": "3048740582036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:58:57.807090Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:58:57",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID. Enter your participant ID followed by pound, otherwise just You are in the meeting now. There is one other participant in the meeting. Good morning, this is Jim. Good morning. Oh, Hans, do you hear me? Yeah, I can hear you just fine. Excellent, excellent. Sometimes Zoom puts me in under mute initially, but not today. Fantastic. So, yeah, so I wanted to show you around, and I did get your RFP. I can take a look at that and fill that out later today, if that would work. Of course. Perfect, yeah, so I'll kind of go through there. So I wanted to show you around a little bit around PC Recruiter a little bit today. I wanted first to talk a bit about kind of main needs. What are your main requirements in a software package? What are the main things you really want to see? So I can make sure to cover those as we look through here. Yeah, so let me kind of give you an idea of what it is that we're looking at. So I'm not sure if we're going to have Maggie from my team on board. She might be busy with somebody right now, but I'll be more incapable of taking care of this myself. So Maggie is the person that's going to be using this the most from our company. So just to give you kind of a rundown, we are a plastic surgery clinic located in the U.S. We have multiple locations throughout the U.S. We're at 13 right now. And we have a lot of things in place on the HR side of the house for staffing. Right. So we use Paylocity and we use a whole, you know, a couple of other softwares, et cetera. But that is specifically on the HR side for staffing. So mostly it's there for the regular agent staffing needs. So our agents on the phone and, you know, et cetera, et cetera, our IT departments, anything you can think of that goes to our regular HR group. Maggie, on the other hand, is a solo person here who is in charge of recruiting and hiring just for our doctors and our CRNAs, which those are the anestheticians, in a sense, that are putting you to sleep during surgery. Okay. And that's a very, very, very different set of rules and things in place for that than HR. So our HR team at Meaesthetics doesn't handle that. It's only done through Maggie. I know that she uses very different methods to look for doctors and CRNAs. For doctors, I know she uses Doc Cafe or Doximity, if I'm not mistaken. For CRNAs, she uses a program or a company called Gas Work, which makes sense, right? The gas for everybody. But that's one of the locations. So the thing with us is we do get a lot of doctors that want to work for us. Just word of mouth at this point, we do get doctors that want to come work for us or see our needs, but we're not in all locations. We've got 13 locations company-wide, you know, just all across the U.S. Some doctors might be interested in joining us, but they want to work out of Ohio or California or a location where I yet to have a location. So we currently keep a database. Maggie is doing that, but she's doing it manually. So, I mean, she legitimately has notebooks of information or Excel documents with information. But as you can imagine, over the course of three years, it's a lot of information to have to dig through when you're looking for something or looking for a specific CRNA that's available on certain days, et cetera, et cetera. So what we're looking for is a platform that's going to make this easier for her. So a platform that can help with getting all the information together, helping with follow-ups and updates and keeping conversations together. So in some of these, we've noticed that it's able to retain emails and retain text messages and retain follow-ups and notes and everything on the one platform, which makes it extremely easy. Workforce management would be great if the system has it. So example with doctors less so because they do operate on a traditional Monday through Friday. The CRNAs don't. Some CRNAs are literally only available to work Wednesday and Friday every other week. And another one might be only able to do Monday, Tuesday, Wednesday once a month. And so we have to be able to categorize that kind of what location are you willing to travel or not to our different locations. And if you're not, what are the dates you can work? Because it's extremely difficult to hire CRNAs in today's state. Right. So it's more of like a, you know, that's kind of like a big end of what I'm looking for. A suite that's capable of handling all this kind of information and assisting with the hiring. Sure, okay, excellent. Yeah, so we are going to be something that would allow for that. So, PC Recruiter is going to allow you to track all of your candidates, pretty much everyone you're talking to. You can create different lists within the system. You can track follow-ups, notes on your conversations, activities. You can put it on a calendar if you need it. And then you can also put in custom fields and areas showing when they're available, what locations they can work at, anything like that. So, a lot of customization is going to be available within the system. You can kind of search for it and track everybody. So it's going to be very simple to do that. Sounds good. And are you looking to track the actual open positions, or is this more for tracking talent and candidates? It's more for tracking talent itself so that we can come back up and find these guys later on. in some of the companies that we've looked at their software they have there's been two specific companies i can't remember off the top of my head which ones they are i think one of them is monotal and the other one might be crelate if i'm not mistaken they have databases with a somewhat of a token system is what it really looks like where we can buy a set of tokens and then And if we decide to go through their database and pull from anyone from that database, then it costs a token, which is the equivalent to maybe 50 cents per person, give or take. That's Monotau. It's different with Crelate. I think with that one, you buy a package, like say 100 users for a certain amount, and then you can use it that way. So I don't know if you guys have something similar to that. But the way that I've seen it, it seems interesting and not so much with Monotau because it seems like what their system really is doing is just pulling from LinkedIn. That's not going to help a lot. With Crelate, it's different because they did have access to databases, which is different. So their system did connect to databases with doctors, et cetera. So that's a little bit better than just LinkedIn. I could do that myself. But I don't know what the capabilities of your system are in this case. Well, we don't actually. Although I'll tell you, we've been pretty excited to see you guys because you're one of the top three that we had in mind. To be quite blunt, I'm just going to let you know. But PC Recruiter came recommended very highly along with another brand by the name of Tracker, which we did like quite a lot, to be honest. Sure, I've heard about that. Yeah, so we don't actually have any way to pull and search data from other databases. We don't have any interface like that. And like I said, like Manital does, I think Crelate is probably one of the only ones that does work with outside sources. So within PC Recruiter, you're going to let PC Recruiter – Yeah, that's what I think. I think Crelate is the only one that really had that. Yeah, I think that's something unique that they do. We are going to let you pull people in. So we do have a capture tool, which lets you pull people in from – of course, if you happen to be looking at someone on LinkedIn, Dice, Indeed, Resume Library, Zoom Info, and a few other sites, you can pull people right in from there. so that'll put a little click to add the PC recruiter you can also import spreadsheets of candidates so if you happen to have any spreadsheets of people you can pull all their data in you can parse resumes in to create records as well so those are all the different places that we can get the candidates there so okay maybe a little more limited than some because we can't go search outside of the database but once you have your database within PC recruiter you're going to have a nice easy way of accessing your data so you're going to be able to kind of get into search, sort, group, find everything. So let me show you around a little bit. Okay, sounds good. And I'll show you our new interface here. And by any chance, can we record this so I can get a recording of this afterwards? Oh, yeah. I can do that right now. I would really like to be able to share this with Maggie afterwards. That's perfect. Thank you. Let me try it again. It didn't take quite yet. Where is it now? I'm going to try it one more time because it said my speaker wasn't working. Now it should be working. All right. All right. So, yeah. So, we're looking at the PCRM, the new PCRM product. So this is going to give you the ability to track all of your individual candidates in the system there. Now, on the left-hand side, you're going to see a menu bar. This is going to be something that you really – like you probably wouldn't use companies because you're not recruiting for other companies, so you wouldn't have any use of that. Wouldn't have any need for your primary. You're only going to be concerned with names and probably roll-ups, schedule, some of that style of information there. So the names is going to be all of your candidates. So each one of your people, it's going to show me here's the last 50 that I was looking at. And if I click in any one of them, I'm going to be able to build a custom database here. So I can actually build a custom workspace showing whatever field I want to show. So in here, probably going to be some basic contact information, as you see here. Maybe you choose to show the resume. Maybe you even put some custom fields as to what days they are available. If they're a CRNA, you can put in days available, have a little checklist, Monday through Saturday, Monday. Saturday or Sunday or whatever and you can check off the days they might be available What location they might be willing to work at or anything like that? So this workspace is going to be entirely a customizable data set And then you're also maybe you even have activities showing here that I called him that we updated this information Maybe that I sent him an email or a text through texting We use RingCentral to send text so you need RingCentral to be able to text out a PC recruiter We don't support it natively. Okay, so that's a good leeway question for you real quick. So we do have RingCentral in our tenant. We use RingCentral. It has capabilities for both talk and text through RingCentral, which is fine. Our email tenant is Microsoft, so we do have a full Azure suite. So that means Outlook is currently what we're using, and those two can be tied into this program, correct? Absolutely, absolutely. So using RingCentral, you're already a step ahead of most others. because with the RingCentral piece, it's going to put in a little incoming call, outgoing call, missed call. So those are going to be tagged automatically in the activities. Likewise, if you should happen to send a text, and you can do so looking at the – there's a little phone field there or some of the fields. Like if I go here, I can go into details. That shows every field I have on the candidate. I can instantly search all of my phone fields, and I can go ahead, and I can hit the little pencil. Actually, somewhere, I don't remember where it is. Somewhere you can click the text icon. That's going to let you dial or text out of PCRecruiter and it's going to actually keep the text in the activity or it's going to record that a call was made or received. So that gives you the ability to click to text or click to dial out of PCRecruiter. It's going to log that activity. Also, any activities you record in or out as far as emails sent or received, those are going to be shown directly in the database here. here so you'd be able to see you can click there you could see the details of what the email was when it was sent who it was sent to all of that there so you can kind of go through and see scrolling through here I might even limit it I might even maybe sort by username maybe I want to filter it see only emails I sent this person so I can go down here and I can see emails now I'm going to be able to look at all emails and I can see everything that I sent them got it if I click and click right there you see the whole thing so so the emails are going to be sorted here I think there's even an email option here that's going to show maybe not because all your emails are already recorded in the activities here so all your emails are going to be recorded here this activity is like your journal kind of everything you've done with that candidate so if I wanted to add an activity and I wanted to so I can go ahead and add activity I can actually add up here maybe I can say talk talk to Terry today I can put what we spoke about so so it's good to follow call on Thursday so I can go ahead and note what we spoke about when we're gonna call again maybe I didn't want to put this on my calendar to follow up on Thursday. Maybe we're going to do a 9 a.m. call. So would you do that there or would you do that with a scheduled follow-up? Scheduled follow-up is actually a quirky option they put for people that wanted to have two items on there. So I always recommend use this date and time to schedule your follow-up. Okay. Okay. So you could do it either way, but I'll, so I'm going to be able to pick my time. So 8.14 at 9 a.m. And I might even make this, maybe it's going to be a general screening call so I can pick a specific activity type I can have it added on my calendar I can add an alarm on there if I need put the details we're going to speak about if I do it this way I'm going to hit save and that is going to add to my activity so now my most recent activity is going to show I have a call scheduled for 814 at 9 a.m. and I'm going to be able to see in there I did it at 812 at 11 17 a.m. so I'm going to have one activity recorded showing when it's scheduled if I went ahead and added that other schedule follow-up here when you scheduled this way you could certainly do it so maybe if I want to also schedule a call on Tuesday I can do it that way call them on Tuesday as well and maybe this is going to be a follow up so I can schedule something like that follow up in here maybe it'll just be recruited call so I can go ahead and I can schedule my follow-up down here when I save that when I go into activities that actually creates duplicate activities so it created one activity showing when the follow-up is scheduled for and then a separate activity showing when it was made so it's got a different way of doing it I don't like it at all I find it confusing I like to just create one master activity everything's in one area but you could do it either way okay okay couple of options there but that ad yeah that's going to let you add that activity to schedule that follow-up or maybe you can add a note so a note could be a little bit of searchable information a bit on Fridays only so I can put something like that available on Fridays only, or maybe a specific skill. He's licensed in a certain state or something like that. Yeah, that one can be very handy, actually, making sure that what license they have, because especially with surgeons, they could be cosmetic surgeons, they can be plastic licensed surgeons, board certified. So yeah, it helps a lot if we're able to have that written down. Yeah, so you can put in there, and that's going to be in your notes, but it's also going to be something that could be searchable. So if you wanted someone licensed in Virginia, you could search that either from a note here or I could put it in a field. So I could do that as well. So I could kind of add that searchable bit of information to their record. I could also put them on a list. So maybe I happen to have a roll up list, just a group of people that have a specific skill or working in a specific location or something like that. I could add them on a list, pick one of my lists here, and maybe I know that it is people that are in the Boston location, that are in the Boston region. I can add him to that list, put him on that roll up list. he was already there so he was a dude that's why he didn't get at it but I could kind of let these individual people on roll-up lists too so if I happen to go to roll-ups I can keep different lists of individuals and you see I've got all sorts of different things here but maybe I have people within 80 kilometers of Toronto or maybe I have people with a certain skill or a certain availability or a certain license or a certain state or anything like that you can build as many of these lists as you want and then you can go into that list If you needed to look at each person, maybe use this as a call list, kind of communicate with each person. You can see their name. You can kind of go ahead and contact them. You can even send them an email call or a text right from the list here. So this helps if you want to just hit call that'll dial up RingCentral that'll make a call to that person Here you can add an activity to schedule a follow-up put them on a different list Do some different things right from this roll-up list. You also have capacity to send a mass email So if you wanted to send an email out to everyone on this list to see who might be looking or who's available or anything Like that that also may help with with kind of scheduling and tracking Your CRNA. Yeah, you can keep a list of them throw out a quick email at the beginning of the week hey I need someone Wednesday in this location let me know if you're available with our bulk email email campaign piece you're going to also be able to look at that email and you could look at an analytics report and you could see who opened it who clicked it who replied so I can look at my details and I can see the last time maybe I had your update contact information and I can see that several people open my email who clicked it I can even see if somebody clicked to look at the open shift I had I can see who clicked what right there and how many times hmm that's pretty good so we have a nice email campaign piece within here as well you're also going to have the ability to search so if I wanted to search like Jim Lombardo called in I can type in part of his first part of his last name search that that's gonna find him right there or I can take those chips out of there and maybe I want to do a little more advanced search and And maybe I happen to have a state of license and I want someone who has Ohio license. So that's going to be a custom field that I'm tracking in PC Recruiter. I can add that search and that's going to find everybody who happens to have the state of Ohio in their state of license. So if I go into his record here, I'm going to be able to look at details and I can filter down my search. State of license, Ohio and Michigan. So I was able to find that right there. Excellent. Yeah, that's great. License number, expiration date, state, whatever. So it's very easy to keyword search on any field. And maybe I could put someone who is, maybe I have a days available right there. And maybe I want to say Wednesday so I can pick a specific date. So I can add that. So I can now look for someone who's licensed in Ohio and is available on Wednesday. I can run that search. I don't have any of this. I didn't think I would but you can kind of see how that will work you can kind of go through and filter down search your individuals throughout the system there so that's going to be very easy yeah that makes sense okay so you have a nice number of different ways you can search you can search by location zip code radius you can search by any field you can keyword search their resume too if you happen to keep resumes on people there's actually a nice all content search so if I wanted to search all content I could find out and I could look up see see if we have any resume so I can actually search CRNA in my entire database and I could see I didn't think I would have anybody there too but I'm going to be able to keyword search I got all content let's do our end just because I think I do have some people in there that have RN there. So if I run my search in this capacity, I'm going to be able to search RN, and I can see it was found in their profile, in their resume. I can even click on the resume. It's going to highlight the instances of the word that I searched for if I found any in there. Am I highlighting it? I just turned it on today. It's just an update, so it's not pulling anything from me right there. No, this is still pretty good, yeah. but in the notes you could see it was entered on January 17th 2024 RN was found in the notes so it's going to kind of take me to the matches of where that word was found once they shipped operating room nurse so I can kind of go through and I can see who has what words and then I could maybe I want to hit right here select all records and I could go ahead and put them on a roll-up list so I could actually add them to a roll-up right there and I could save this whole group of people and maybe I even want to go see if I have an RN create new roll-up list RN I can create a new one on the fly confirm now I've added that record or I can do or I can add to roll up down here I can find that list I just created right there I can add them all so I've now saved this whole search onto that roll up list now I have those people up I'm going to call them tomorrow any which way I want to do that there so I can work okay and you can you can you can set up like nurture campaigns things of that sort where I say hey once once every 30 days we shot to everyone for an update see how this is doing yeah we have a sequences piece so like a drip campaigns piece and PC recruiters you're right right build a template and it might be like a candidate reach out and maybe it's going to be this one starts with a call but maybe it might be an email wait 30 days send a second email if they open it maybe they get one email if they don't open it in four more days they get a second different email so you can build along and involve sequences and once you build it once you just apply it to a list and then anybody added to that list is going to go into that that sequence so you can kind of build your different sequences in there as well okay okay something unique about our sequences you can edit them anytime and you're also going to be able to integrate like a call list. So if you maybe send a sequence to 50 people, and maybe you set it up so that when they open my email and look at it, they're added to a call list. Now I have a little to-do list of people that have looked at my email. I know they opened it. Maybe I go into them record, and I can go through. I can dial their number with RingCentral, pre-populate a script in here. Once I talk to them, I can pick what happened. That will then kick into whatever that next step is, and then it will roll right to the next person. so that'll interface to dial out of ring central and I can kind of go through a call option to right there I got it integrate even integrate the ring central text as a step in this sequence there so the name records are nice because so configurable so like I said I look at Terry I have all sorts of different fields on him so I can see all these different fields here you can have whatever you want to show in the workspace so I can show all sorts of different things I have my activity history that's again my journal showing everything I've done maybe I even want to attach a resume I can attach a resume here that's going to be indexed and searchable so I can search on the entire resume there I even have an area for other attachments older resumes recommendation letters anything more than I want to keep concerning this candidate I can upload it as an attachment make that part of my database I even have a keyword tagging area where I can tag him out of specific lists. So I can actually build different lists and I can tag him out of my custom list. So you can tag using your own terminology and then search off of that as well. Or if you want to see all the different lists that he's on right now. These are all roll-up lists that Terry's on. Yes. These are all the ones that he is on. Okay. I like going to any one of them if I just click in or somehow I've never gone to one from here actually somehow you can get into I might not even have it configured up right but you can see he's on many different lists I could go in any list from there okay so I have a lot of different things that I can do within here now now any questions on anything no pretty clear so far on this plane As far as implementation, if let's say we decide to move along with this, normally I know that during implementation there's support or there's normally going to be one or two people from a team that are going to help with the onboarding, especially during the learning curve. Is that something you guys do or pretty much we're on our own since the beginning? No, that is where I was going to head next, actually. So with PC Recruiter, we include the setup. So our pricing is structured. It's a monthly cost per user 115 per user per month And that is going to be with a one-year commitment So 115 per user per month you can add or drop users freely So if you started with one, that's fine If you needed a second just pick up another one you can add a second user It'll be 115 times two and you can drop that person at any time and then there's a one-time setup of $750 and what that one-time setup includes is the creation of this Lincoln database it includes also Also, help hooking it to install a sync to your Outlook calendar. If you want to set up a capture to pull people into LinkedIn. Also, configuring the database, setting up your workspace here. And it includes 10 hours training with one trainer. So you'd have one trainer on our team who would help you start to finish to get up and running on the system. They'd be your point person. All of your trainings would be with them. And you have 10 hours to be used over the first six months to get up and running on the system. So they would be a point person. they would be able to kind of help you get up and running a trade on the system very easily you'd also have me as an account manager if you needed anything but you're gonna have that point person that's going to be your trainer and then we also have phone call support email support we have a help desk we have chat online on our website so there's a lot of different avenues that you can go to get support for a system okay Yeah, pretty straightforward. Yeah, pretty quick setup process. And even if you happen to have a spreadsheet of data, if you happen to have a spreadsheet of data that you needed to map into the system, we can do that. The trainer can assist with that on the first training. So they could guide you through mapping that data, populating the field in the spreadsheet into the various fields in PC Recruiter. It'll even create custom fields if you have a field in your spreadsheet that's not currently created in PC Recruiter. so you can do that too. So very easy to work with in that capacity as well. Okay. And were you thinking, do you have any kind of a timeframe to make any kind of a decision? Relatively quick. So we started demoing products last week, Thursday. I more than likely think that I might be done with all of the other demos that we're doing today, to be frank. So I'd like to have something put together in the next day or two. So maybe by Wednesday, Thursday, I'd like to have something together so that I can move on with our final three, which right now, as it's looking, I'll be very frank, I think this is a great product. I think Maggie's going to like this one a lot. So I definitely want to be able to show this demo to her whenever you get a chance and you can send it over. because right now, as it stands, I'm thinking you're going to be one of our top three, including the Crelate and Tracker as the systems that seem to be meeting our needs and what we're looking for the most. Okay, perfect. Yeah, so what I'll do, as soon as this, it takes a little bit to process the recorded demo, but I'll send that over to you. Yeah, that's fine. And then I will also fill out that form, just kind of comment on those questions in the RFI you sent. So I'll fill that out probably later today. So you'll have that by tomorrow for review. And then if there's any other questions or anything like that, feel free to let me know if you need more info, if you want to set up another call, anything like that. I can help. Yeah, I mean, we're planning on moving pretty quick with this. So more than likely within the next 24 to 48 hours, I'll reach back out and see if I can probably schedule something as a final with the rest of the team. And I think we'll just move from there real quickly. Okay, perfect. Yeah, I'm here and I can get something set up short notice too. So I'll send that info over and then I will circle back with you like Thursday late in the day if I haven't heard, if that's reasonable. Sounds good. Sounds perfect. Very well. Very well. Well, I will go ahead and get everything sent your way and anything else you need, let me know and we'll talk to you soon. Anything else I can show you today or any questions? No, that's perfect, Dan. I appreciate you. Fantastic. Fantastic. Well, thanks for the time today. We'll talk to you soon. Thank you. Thank you. All right. You take care. Goodbye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1460.357038,
    "salad_processing_time": 188.7170810699463,
    "overall_processing_time": 1460.357038,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID.  Enter your participant ID followed by pound, otherwise just You are in the meeting now.",
    "job_id": "3a13973d-482d-4fa1-a34a-1959a63ee8e6",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID.  Enter your participant ID followed by pound, otherwise just You are in the meeting now.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 2
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": false,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3048740582036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}