{
  "recording_id": "3049107486036",
  "version": "2.0",
  "timestamp": "2025-09-21T22:59:21.404894Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "22:59:21",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling me. This is Gavin. Yeah, I had a question about my PC recruiter. I'm not sure if you can help me. But it has to do with the capture function. Yeah. So I'm logged in. I haven't used it for a little while, but I'm logged in. I'm in there. And then when I basically am trying to get, you know, names from LinkedIn into their system, like into a new job. And I'm not sure why, but I think like the capture tool, I'm not sure if it's no longer working or not on my computer. I'm not really sure what the problem is. Okay. Probably best to do a screen share. Bear with me one second. I was just finishing up an email to somebody and I just literally got a copy of something. and send it off and then I'll what I like to do is a screen share okay okay okay and I'm sorry your name is Ed Welsh, W-E-L-S-H. With Prime Talent Group? Correct, yes. Okay, all right. And is your email ed at primetalentgroup.com? Yes, it is. Okay. I'm going to send you a screen share link. Okay. For an instant meeting. So it's going to come from me. It'll come from Robin at mainsequence.net. Okay. One moment. That should be on its way. Might take a moment to get to you, though. Okay. Okay, I just got it. Just a join call? Yes, go ahead and join. And then what you don't need to do, though, or like when you are in, you don't need to join the computer audio since we're already on the phone. Okay. And you don't need to show your camera because they're going to be watching your screen anyway. Okay. Okay. I'm trying to admit you. Okay. So let's have you share your screen. So at the bottom of your meeting screen, the icon is a rectangle with an arrow in the middle. Click that. and then when that screen pops up, go over to entire screen. Okay. Yeah, I hit entire screen. But then it's not allowing me to share. It just cancels the only one I can use. Okay. Is it showing you like a preview of a screen? Yeah, it is. You might want to click on that first. Okay. Oh, here we go. Okay. And then if you can mute, or I think I can mute you because I'm just giving a little bit of interference. Let's see. Okay. Okay, I'm going to mute you. Okay. Yeah, let me see if I can mute. Yeah, I got it done for you. Okay, so this meets tab. We need to keep it open, but we're not going to use it. So what is it that you're trying to do? So let me get back to Easy Recruiter. Okay. Can you see my screen? Yes. Okay. Okay. So basically I have these projects in LinkedIn that have all the candidates for a specific job that I'm working. So I'm basically trying to get the candidates from LinkedIn into PC Recruiter. So usually I would, I'm not sure why it's so slow, but usually I would, there was like a capture tool, which is this little icon up here. Correct. Okay, let's click on that. And this screen has never come up before, so I'm not sure what this is all about. So here's one thing I would recommend. When Seward says basic mode, turn that off. Mm-hmm. Take it off? Okay. Yeah. I think you've got a lot of settings here that change. See all of these LinkedIn options? Turn all of those on. Okay. Okay. Do you ever use Indeed? No, I don't use it. Okay. I think all the LinkedIn ones have to be on, though. Okay. Now, when you capture somebody, do you like to get their company or just have them go to the default? Usually their company as well. Okay. so see where it says captured a default company let's turn that off take it off all right yep okay let's exit out of here okay let's go back and reload this page and see if we get to pop up again so if you yeah there we go and go over to somebody's name now Should we maybe go out of LinkedIn completely? It looks like it's kind of locked up there. Yeah, let's try him. So normally when I go to someone's – I don't know why this is running so slow, but normally when I go to someone's page, from what I remember, there was like a little icon thing would pop up down here that would allow me to try to capture it into PC Recruiter. Yeah, it could have been those pages being off, which is why I had you turn those off or those back on. Also, when you're in basic mode, you don't get the review screen. I think we got something here, though, too. Let's just go out of LinkedIn completely. Let's see if there's anything. Oh, here we go. Yeah, like usually there was like a – I think there was like something over here that allowed me to capture it. What if you go to public profile? on that go back to go back to here um there's actually quite a few things open here let's um what is that tab that looks like this spend it starts with gen and you also that's just the just close it out if you don't need it might help okay let's go over to your linkedin tabs again because you've got like multiple here. Can we go out of anything we don't need? Yeah, I can just, this was some video I was watching. I can get rid of that. Okay. All right. Now, sometimes, especially with LinkedIn, they like to change their URLs. Sometimes that throws things off a little bit. Okay. So let's kind of start, and then let's go over to where you were before. Where the recruiter, where the candidates are? Yeah, let's try LinkedIn recruiter. Okay. Because what they do, based on how you're in, it says LinkedIn.com slash talent. And when that URL changes, that can also cause issues as far as us pulling things up. But why is this taking so slow? Yeah, I know. It's weird. Here we go. That is really slow. Yeah. If you just go to regular LinkedIn, let's see if there's even an issue there, and just go to somebody's page. Let's see what happens this way. Yeah, like it's running, I don't know why. It's something with my computer. But this is separate than the issue I call about. I don't know what's going on with this. Because if this is getting so slow to load this, it might be taking us, your browser might be taking a while to load other things too. Why don't we try this? Let's try clearing your cached images and files. Let's go to the three vertical dots at the top right of Chrome. Up here? Yeah. Actually, let's first see if they have the version. down to help and go to about Google Chrome let's see oh I saw it did pop up though okay let's update this and then I'll save you clear cache I did think I think I saw it just pop up though but it might be best to do all this just to get things running a little bit better too yeah sorry I'm terrible with technical stuff with computers. But I want to be able to use PC Recruiter again and I can't get the names into the job. I guess this will update. Maybe this will help with the speed of the internet. This should not be taking that long. While this is running, let's go back over to I don't know which tab it was. Try those LinkedIn tabs that you were in. Your second, third, and fourth ones. Okay, not that one. Not that one. Here's where the names are where I was trying to. Yeah, let's go to that first LinkedIn tab. Because see, there it is. Now it is over there. But it took a while just because of something with your connection. Oh, right here. I see. Okay. So we've got it at least showing there. That's a good start. But it took a while even for the pages to load. Yeah. Should I try one in Recruiter to see if it pops up? Not yet. Let's try getting this Chrome, see if anything improves this way first. It's only at 13%. This should be really fast. You might also have some network connection issues or something like that. Is your Internet always this slow? No, no. But it's been weird. It's been a little choppy recently, so I don't know. I think something's wrong with my computer. Like sometimes it'll occasionally will like freeze a little bit and then it'll just be a little bit slow. I mean, I can try to restart it, but that's not really going to help us right now. Yeah, if you go down to someone's page, let's see if it eventually pops up. I'm just more concerned with these pages are taken from. Yeah, it's crazy how slow this is. Yeah. Now, do you work from home? Yes. What you might also want to consider doing is, one, making sure your browser is updated, restart your computer, maybe also restart, like, your modem or router. Mm-hmm. Just to kind of clear some things. Sometimes things get kind of hung up. See, now, I don't see it. Oh, here it is. Click that. It is here. Should I try to see if it works? Yeah, it was probably that once. Well, it's not even displaying all their information yet, so I would wait. Yeah. But it is popping up, so that's progress. So I think what was going on is you had, like, LinkedIn Recruiter Lite. I think it's really LinkedIn and LinkedIn Recruiter Lite. So I think it was just having some of those sites off. It was just the settings weren't right. Yeah, I believe that's what it is. All right. How are we doing on the update? Where'd that go? 22%. Okay. Should I try to add her to see if it works? Try it. I think it's just going to be really slow. Is everything on display now? Yeah, so this whole thing looks different than before. And it's better. The other one, what it does is it'll let you add and go, but it doesn't give you any kind of review. So here you can see, like, we didn't have a match for the name, but we read from her profile that she works at ADC Therapeutics, which appears to already be in your database. Yep. So what you could do, if you hover on that card, you'll see a checkbox. Where, with ADC? Yes. Click on that, down at the bottom. and that see how it's got a little let's click on the checkbox instead there's two different things you hit the checkbox it means pick it and put the person that we're about to create into that existing we're going to click on the card itself not the checkbox so it's really a hover with the checkbox versus clicking on the card if you click directly on the card when you advance you're updating that record which i'd rather you just update from within PCR, but here you can pick it. And then when you hit review. Now, her name, should that go in here? No, that's just looking for potential duplicate. This is just duplicates. Okay. Yeah. And if it didn't find the person or the company, then you wouldn't even see the screen and you would just be advancing to who you see now. So now you can go in and you can fill out any information that it cannot pull. like she's a second connection so you don't get like the email address or phone number yeah linkedin doesn't share it but if you scroll down you'll see like the location that it pulled just got to be very careful some profiles it might say like um greater atlanta area in no state just make sure you put like a valid city and state in um you could even add a note to the name record if you're using this review screen. You can even customize your configuration and do things like add to roll-up, link to position. Yeah, that was my... I usually add them to a roll-up as I put them in. Okay, so if you go at the very top right, it's got like a little piece of paper with a pencil. Mm-hmm. Click that. So here you would have like field groups. So like you got a group title called contact information, And then you could add more fields into that group. Then you've got your add note group. So see on that green header where it says add group? Mm-hmm. Click on that and select add to roll up. Oh, I see. Now, does the roll up that you add them to vary, or is it almost always like the same list? Well, I do it like per job, so this would all be the same roll up for all these people. but you know there's probably like 20 or 30 different roll-ups so it just sort of depends on what job I'm working on okay so at the top right where it did have a field configuration it's now a save option click on that oh I see okay so now when you're bringing somebody in yeah so make sure so now I have the roll-up added um yeah hit save Okay, so now when you scroll through the green section, which is all related to the person, you have your add note. and you also have to add to rollout. Oh, I see. Whatever list you want to put them into. You just start typing the name of the list. Cool. Yeah, I just have to create, I actually have to create the rollout, but now I'll be able to add it to each person. Right. You can add a note, put them in a list. There's even a link to position option in that configuration. Let's see how we're doing with your browser. Oh, yeah. Where's the link? That's the other thing is link to position. That's the other thing I'm going to want. Same configuration option. Edit it. Yep. Add group from the green area. You got to go to add group first. Oh, okay. Link to position. Okay. And then save up at the top right. So now in your green section, you have that group as well. Oh, nice. Okay. Okay. Let's see what's up in your settings now as far as the progress of the update. Slowly getting there. Yeah, I would say let this update. I would also probably clear cache from your browser. Maybe let's go over, probably do that now. Let's go over to one of the other tabs. Just the new tab? Yeah. And then go to the three vertical dots. And go to delete browsing data. Okay. It's about halfway down. Okay. Here I'm going to be very careful where it says time range. Change that to all time. Uncheck browsing history and uncheck cookies, leaving only cached images and files selected. And then hit delete. What that does is basically like your browser tries to store things about a page so that it's faster to load. The first time you go into PCR, it might be a little bit slower to load, but that's basically refreshing a lot of stuff too. Okay. Things that maybe shouldn't be remembered. So that might help with some things too. Now let's also go back to, let's see how we're progressing with this update. Oh, did we replace what we were doing? Wait, where are we at? I did a new tab. Oh, it's weird. Oh, okay. It's apparently didn't like doing it both of these at the same time. Yeah. Let's go to about Chrome, which is at the bottom left. nearly up to date relaunching chrome to finish okay hit relaunch now this will probably kick you out of my meeting okay it's going to relaunch chrome for you let's see if this helps otherwise i'd say let's have you restart your computer too should i just should i leave site? Yeah. Okay. Okay. Let's go back to Chrome. Oh, you joined the meeting for Edge. So that's good. Okay. Let's go back to Chrome. Oh yeah. It actually took it off my, oh, here it is. Yeah. That's the other thing. Like my D my default, it always tries to take me to Edge. is chrome your default browser yeah but I I changed it I thought I changed it to chrome but I did you start from outlook though because outlook will pretty much try to use their own yeah I think that's why because it's through microsoft yeah um like I don't know what what is going on here yeah if you're starting from outlook a lot of times outlook will basically call their own browser okay we're back in chrome okay um let's have you go over to your database so see this first time it's going to be slow so you're still having slowness yeah i i would recommend restarting your computer probably yeah but also probably restarting your network now this first time it's going to be a little bit slower but usually shouldn't be this slow even my computer like it's a laptop like it almost like here's like i could hear like a fan like it sounds like a little bit like noisy oh i just got rid of one of those yeah so maybe it's just maybe i just need a new computer i don't know okay i mean i usually don't have this many problems with it like i'm able to work on it pretty good but there there are times where i don't know what this means not found okay Okay, say don't show me again. And then skip. See where it's at the top right where it's got the gold number one? Click on that number one. Click activate PCR browser notifications. Click here. Okay, click allow. Okay. I would first try restarting the computer. Okay. And then if not, maybe also restart like your modem and router just to kind of free things up and see if that works. Yeah. Well, if we deleted all that, the cache stuff, that should help. That'll help, but we also updated Chrome too. Yeah. So it might go a little bit faster, but if it's still kind of slow, like if you're, you know, even because on LinkedIn it was like really slow too. Let's see if it's a little bit faster on LinkedIn now even. Let's go over to somebody else. It seems to be a little bit. I think it's a lot faster than it was. Yeah. Let me go to another person. I just want to make sure that I still get that capture feature. Yeah, click that. Let's see what happens. So basically every time I do this, there will be a duplicate company because they're all like with big companies that we have recognized. So I always click that. Yep, and then review. Because otherwise, if you see how it just says it'll be added to the existing record, other than that, you have the green heading, which is related to the person, review new name. If you didn't select a company, you'd be on that purple heading. You'd see review new company, which means you're going to be creating another company record. Okay. You don't want to be doing that because then you get a bunch of duplicates. All right. So I just linked her to the right job. I have to make a roll-up. Okay. And then submit. Yep. Now that one actually might have been a good example. It said Greater Boston. You might not want to state with that. So that one you might want to fix the state before saving. Oh, I see. If it says Greater City, then you won't get the state. Yeah. All right. Let's see if she's in there. Should be the only candidate in there. Yeah, see how you got Boston, but there was no state on the product. There's no state. Okay. All right. So you just put it in manually when you see that? Yeah. If it's not, yeah, they can't pull the data because there could be many different, there could be different city names that are in different states, like same city name, different state. Like New York City metropolitan area? That you'd probably get New York City, but you would not get New York as the state. Okay. Because there is no state. Here. I see. This one's for Philadelphia. Diana Simonson. and then hit review so see if you go down to the location section I just have to change her last name because it pulled up like the sometimes Yeah, she's got too many characters in her. Yeah. They don't really have like first name, last name. It's kind of like, I'm going to get confused. Oh, okay, because we're connected. It pulled in her email address. Yes. Now, it pulled Philadelphia, but it doesn't have a state. Yeah, okay. All right. Well, at least it's working again. That's good news. This is actually better than the old one because the other ones wouldn't pull in their email, I don't think. I don't remember it doing that. Well, the other one, the basic one, you didn't see it. You would just say add and go, but this is going to be better, especially when there's people that maybe you already have in your database and you want to update. Like you can review and like next, let's say the title, let's say you had a different title on their record. It'll pull, the capture will pull what's on their profile, but you can toggle what's on that title field between what it pulled from the profile versus what's on your record. So basically this version of capture is like a whole bunch of things that people were asking for, like all of them, which is, makes it not always the easiest to learn initially, but it's got a ton of flexibility. Yeah. And I just realized I forgot to add her to the job. That's why she's not in there. But she should be in the system. Yeah, here she is. And one of the things you'll easily find, people that you've added today, if you go to My PCR, up at the very top left, the one that says New Name, that's any name record that you created today. Gotcha. Okay. And you can jump to people. So I can add Massachusetts for her. Yeah. That's not just, you know, people you captured today, but at least anybody you entered today. So sometimes that's very helpful just to jump back. Yeah. Okay, great. All right, cool. Thanks so much. I have a call too, but I'll restart the computer later. And yeah, hopefully I'll play around with it. But if I have other questions, I'll call this number again. Okay, great. It sounds at least faster than it was, so that's good. Yeah. I still think I'll probably need to get a new computer, but it seems like it's better than before. All right. All right. Well, have a great week. Okay. Thank you. Bye. Bye. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1472.277806,
    "salad_processing_time": 150.4628758430481,
    "overall_processing_time": 1472.277806,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling me.  This is Gavin.  Yeah, I had a question about my PC recruiter.",
    "job_id": "4d77e235-d99b-415a-9cbf-35c2c7dbe0cd",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling me.  This is Gavin.  Yeah, I had a question about my PC recruiter.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3049107486036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}