{
  "recording_id": "3050656618036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:00:55.004612Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:00:55",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling me. This is Robin. Hello. We have an account as a company with TC Recruiter, and I'm having one issue that I wanted to check on. Okay. What is your name? Yep. My name is Christy, C-H-R-I-S-T-I-E. Can you hear me one second there? Yep. Can you appear in your last name? Burgess, B-U-R-G-E-S-S. Okay. with connective services yep that's correct okay what can i help you with yeah so i sent out a mass email yesterday and it's showing on all of my candidates that i sent out the email but i didn't get any bounce backs and it's not showing in my sent email so it's showing it went to candidates but i have no responses or anything which is typically uh you know an issue so where do you Yeah, we'll take that. Let's see. Is this in the database called Connective Services or FinTech? Connective Services. Okay. And what username do you log in as? Christy at FinancialRecruiters.com. Or FinancialRecruitersInt.com. The PCR username. It wouldn't be a full email address. Okay. I'm in my PCR. I don't know what you're asking. So if you, so like when you write an activity, for example, what are those 10 characters that it writes? Okay, hold on one second. Let me go back to that. Okay, activities. That's like one way to tell. Okay, geez. Or if you're in Peace Recruiter right now, like your tab for Peace Recruiter, it'll say Peace Recruiter. And then right after that, on the actual tab, it'll say your username slash the database name. Okay, so I'm in PCR, and I am, okay, so I see my PCR company name, position, schedule, system. Where am I supposed to go for that? If you just look at the top, the actual browser tab, it'll say PC Recruiter, and if you hover on it, it'll tell you which username and database name you're logged in as. Okay, well, this says Connective Services and Style Sheet, so I'm not in the right place. It'd be the tab right above that. Okay. I don't really know where there's a tab above that. So I'm in the very first stage PCR, PCR or PCRecruiter.net. So what am I going to ask? It'd be the tab right above that, the actual tab, like how you can flip through tabs in your browser. If you hover on the tab of your main PCR screen, Okay. Okay. Sorry. I'm not. Let me start over. Okay. So I just logged into now PCR Recruiter. Okay. What was that username that it? So it's my capital, capital, my name, C-H-R-A-S-T-I-E backslash Connective Services. Okay. Christy. Okay. Yeah, sorry. It wouldn't do that until I started over. Okay. Yeah, normally, like, when you're in, it'll say, and then when parentheses, that's just one way without making you go out. Yeah, it didn't do that way unless I started over, but that's okay. Okay. All right. So, let me see one of your email alias list, which is what you're using to actually send the email. Yep. So, I see you have three. Yeah, you've done this before with me and you guys are amazing. It just keeps showing to all of my 200 candidates that it went through, but then it's not showing anything on my email or anything. So yes, I'm going to let you help me trouble. So I see you have more than one email alias list, which means when you go to send an email, your from is actually a dropdown that you could switch from. To bulk. Okay, so it is the bulk one. So that would be your send grid. Yeah. Let me test that one. Because it showed, because I tested all the candidates and they all got it. But then I didn't get any responses or out of office. And I was like, something's going on. So that is passing it. If you're using that second one that says Christy Balk, that is passing it directly to SendGrid. Now, I see you do have analytics. Was this sent as a mail campaign? Yes. Tell me where I should go so I can follow with you. So do I go to my roll-up list? Do you want me to go to a candidate that I would have sent this to? What do you want me to look at with you? If it was sent as a mail campaign, what you can do is at the very top right of PC Recruiter, there's a gear icon. Yep, got it. It'd be like hovering on the edge. Yep. Click on that and click background cash. Got it. Okay. Hold on. I'm opening that now. And I've done this with you before, but typically I get a bunch of bounce backs or responses, and I know no one's responded. So there's something going on. And I don't know if I just. show the beginning stages so let's see what's going on here was it the one called atl am and e ae yep okay and i just opened background tag and then it's not really it's all kind of gray it's not showing anything so i'm on right okay so that's so that you're probably under queued which means the ones that are actually running currently okay two completed so those are the ones that sent. Okay. And then those are the two that you've done according to the filters that I see for your username this month. Yep. Okay. So when you click on the one that with the name and it has 147. Yep. So here it's showing that they were sent. Yeah. Which means we did connect it to the mail server. But I haven't had one bounce back or one response, which is unusual. okay so let me see so that's just like the process because sometimes like you use like a gmail they don't let you do too many so sometimes you'll see where things stop sending so it looks like they all hit the mail server now let's see what else we can look at um and then I have the one now if you go to analytics okay so hold on I'm on your the screen you told me background task I'm at ATL AM and AE yeah so that one's telling me that they did hit the mail server okay now let's go to analytics on your main toolbar so hold on am I getting out of this yes out of that tab it's a go back to your main pcr screen and then click analytics got it hold on i'm going to open that in a new tab okay i'm in analytics and okay so you're going to go to email campaigns and then click details okay got it email campaign details got it so this is the last one that you sent so when you select it you're going to see some data about it at the right um it looks like 140 it was sent to 147 people 42 people opened it two people links okay sorry so real quick i'm in analytics and then i've got august 10th 10th 10th it all says not available not available not available not available and then it says on august 10th recruiting presentation or marketing presentation. They just say not available to me. And so under analytics, go to email campaigns. I did. And then click details. Yep. I'm there. Okay. So click, it should be on the one for email, A-M-A-E. I already did that. Okay. Because this is the campaign in question, right? Yep. Yeah, that's absolutely right. Okay. So I'm on details and now it says campaigns, ATL, AM and AE, 812. And then there's a bunch more. 28%. Okay. So that's, so those are your different campaigns. Once you have selected on ATL, AM and AE, you're going to see over at the right and even down below details about that particular campaign. Got it. So 42 people opened it. Yep. Two people clicked a link, but nobody has replied, bounced, or unsubscribed. Yep, mine says click six, opens 42, recipients 147. Now, let me check something on this. Yeah, it's okay. Yeah, so I'm under details. Like you said, I'm at the ATL AM and AE, sent 812, and it says open rate 28%. which is 42 out of 147 and then click six and there's nothing which is just unusual because typically I get at least 10 to 20 percent of people responding or not interested or whatever I have no reply rate which is weird so this is going to back to Christie at financial recruiters calm okay and answer financialrecruiters.com. Okay. Yeah, there's nothing in here saying that it's... Anyone's responded or even an auto response. I'm on vacation. And the way your mail server is set up, that if somebody replied or anything, it would go back to Christy at financialrecruiters.com. Right. And that would go into your Gmail account. Okay. and I've got nothing. There's something not right. I'm not sure what it is. I just know that, you know, after two years of this, I know I either get a response or I'm out of office, and there's nothing at all. I see that I'm in your database. I'm going to add myself to the same campaign. Sure, sure. And once again, you see there's just something off, but I'm not you guys, so I don't know what it is. Yeah, and you might have to look in your stats within your SendGrid account, because I mean, I like we can really tell is that it did go. Well, if we look at the past ones, I don't want to unclick on what we're working on, but I've never had this happen. And then when I checked in with you guys, we may have had an issue and then it was all great. But the fact there's not a single reply, even a bounce back, there's something not transmitting. I think for bounces, you might have to set it up within SendGrid that they get directed back. I've never done that before. So is this something new we need to set up? Because obviously there's other people at my company. I have changed none of my... That would be something within SendGrid as far as bounces. As long as it's going back like a normal one. nothing to come in nothing okay so I read I received the email okay now that would have been sent it from that though okay let me create another name record for myself yeah and it's still showing no reply rates well again the the data pulls data every 15 minutes so that could be something else too so let me just try something else as well I'm going to do I did one from your default email alias okay um I'm going to try one I'll have to do it as a different record and you're doing it right to the email address field is that correct yep okay I've been doing everything exactly the same. That's why I want to know if there's something I'm missing or that changed. And it could have been an update or something, but there's no reply anything at all. Unsubscribe, bounce, reply, click, says 1%. Yeah, I don't see anything in the details yet as far as anything failing on our side. and it did track at least one people clicked a link, which means it got to somebody. Yeah, but I don't have any out of office. There's something not going. I'm going to add this to the same campaign, but this time use your bulk account. Okay, I'm going to wait till this comes in on my personal email. Hold on one second. Okay, and I'm so sorry. do you want me to stay on here or do you want to call me back in a minute? Just cause I'm going to prepare for a few more meetings and I can stay just checking. Cause I know you're troubleshooting right now. Yeah. If you want me to call you later, that's fine. Oh no. Well, I, I definitely want to solve it. Cause I'm, cause I'm going to call on these people and if I'm not seeing the, you know, they're out of office or they're not returning, I definitely want to know before I, you know, call on all these people. This one did not come in yet. Sent through the SendGrid mail server. Okay. You might have to look within SendGrid to see if it's getting there. Okay, I don't even know what that means, but if that's what I need to do... So SendGrid is your bulk mail server. I received it, fine, sending it through your default one, which is your Office 365. So what we're doing with your email is we're passing it over to SendGrid for delivery. And then SendGrid takes it from there. Now, on my personal one, make sure I did that. I was just going to say, so now do you see that email coming through on SendGrid? I'm trying to look. I don't know where to look for that. This is just all new. I'm not sure why there's an issue now is all I'm trying to figure out because I want to solve this for me. and my teammates, but we go through SendGrid or anything like that. So if there's a change, I need to pause and we need to figure out. So we don't actually send the emails. We pass it over to the mail server. So from there, it's up to the mail server. Now, with the Office 365, when I used that alias, it came through. Okay. Now, did you send me anything? I think I noticed here. Let's see. images are hidden. Stay and connect with me. One thing I believe Centrigrid does require is that there's an email opt-out link. Okay, but once again, I've been doing this for years, so something has changed. So what do we do? Yeah, so I'm looking at the content of the one that I did receive, and I'm not really seeing an, I'm not seeing an opt-out link here. So it could be that we passed it over to SunGrid, and maybe they didn't actually send it for some reason And one reason could be that there is no opt-out link. Let me see the form. Okay, real quick. Did you reply to my email? Let me just see that. No, I have not yet. No. Okay. Because this is much, all I'm saying is this is much bigger than me just having an email issue. Like, this is going to affect our whole team. So I want to make sure that we know what to do because this is different. you know a week or two weeks ago I sent an email and didn't have any of this so if it's new I mean these aren't really our rules or send grid mail server I believe they're going to require like your opt-out link so I again I'm trying to know yeah I understand that I'm saying I do everything through PCR and then they solve it and then we're good so right now we're talking about this has nothing to do with PCR. This now has to do with SendGrid. Could be. Could be. Let me see. What was the name of the letter that you used for this plan? Account manager and account executive opportunity Atlanta. Is that it? Yep. Okay. Yeah. In your content, you didn't put the email opt-out link. So that could be something that maybe SendGrid did not do? Okay. I've never done that. I need to tell my team if we need to do that. So, so how do I see that real quick? Because I've never done that ever. Okay. I mean, that could be a reason. I'm not sure, but that could be one thing. Do you, but if you go into your SendGrid account, do you see where it's giving you any information about about the send okay i don't know what sender grid is to be clear again so i'm in pcr where am i looking for that it would not be with mp recruiter at all so it looks like you have an account which is used for like a bulk mail server so somebody must have signed up for send grid from your that's my ceo and stuff we we've never dealt with anything but pcr okay so send grid is where we're having the, that we need to look into? Is that what you're saying? Yeah, I would look in the SendGrid account because they also can give you stats. So basically what you're doing with your mail campaign, when you're using that second alias of yours, instead of using your Office 365 account to send it, if you flip it to that bulk one, what that means is you're not using your Office 365 mail server to send the email. And probably because they're very restrictive how many emails you can send. So it's going through SendGrid's mail server. So we're sending it to SendGrid, and it seems like SendGrid is not sending it. And I believe one issue can be is they require that you have an opt-out link. Okay. That could be an issue. It could also be something else, but that would only be something that you could tell within SendGrid itself. Okay. But this must be new because I've done this for two years. So it's just now there's some issue, I guess, is what I'm trying to figure out before I call my CEO to say that. It looks like it's through SendGrid, the bulk email that goes through Office 365. There's an opt-out link or something. Do you see any of my other people at Financial Recruiters that have sent out bulk and had this issue? It may have just been me. I'm not really a child because I didn't receive the one. So as far as PCR knows, we're passing it to SendGrid. So the hiccup seems to be one that's getting send grid. Got it. That's what I need to know. Okay. Perfect. I think you've answered all my questions. But the main thing. What I can do is a test. Now, this would not affect your existing campaign. What I could do is go into that form letter, add the opt-out link, try it again as a new campaign, if that's okay with you. Oh, yeah, yeah. Let me see if my. Yeah. Actually, let me check my, because I'm checking my personal email on top of it. So let me see. Oh, yeah. And I've done that, too. I'm just brand new. But, you know, if we have eight other employees, I don't want them to not know why nobody's responding, because right now I have no responses. I know you've got the open rate. I'm not really seeing it in here. let's see did it go to spam maybe oh okay actually I did get it but it went to spam I think that's where it is let me I'm also checking on my phone so let me go over to my actual Gmail see where it went and again Keep in mind, I have Gmail, so they're a little, they look at like words in there and things like that. Sure. If you sound very recruiter-ish, I'll just say, like my Gmail put it under spam. Yep, absolutely. This message isn't authenticated and the sender cannot be verified. Okay. Okay, so thank you. You're so great for doing troubleshooting. I have to get on a call in about eight minutes. I just need to make sure. So what should I tell my CEO? You said that SendGrid might be, there might be a hiccup there. And then we need to test a couple because it's not with PCR, correct? Yeah, I did get it through the SendGrid account. It just went to my spam, which can be one or a couple reasons. It could be content that it just sounds recruiter salesy. It also saying, now my Gmail saying the message isn't authenticated and the sender can't be verified. You might need to make sure that within your SendGrid that your email accounts are verified. I know sometimes there's like an error like you might get, but you might actually have to have the email verified. Sure, sure. Okay. So that would all be kind of stuff that would be done within SendGrid. It did actually send. It just actually hit my spam folder, which is why I wasn't seeing it. Okay. And then can you respond real quick just so I have that? And then in about an hour, I'm going to check in with my boss and just tell him that it looks like we may have a hiccup with SendGrid. But I think I'm the only one that sent out a mass yesterday. And then I did two weeks ago. So I think something may have changed. And they may, like you said, that it's not authenticated. Maybe we need to do a little bit more looking into that. And you also said if you're not using Office 365, right, you need to do something with an opt-out link. um i mean well i think senders just has their stuff they want to make sure that your email is verified so that can be something you might need to do within send grid um i believe they also require that there's an email opt-out link so like for example in your letter now you can like insert signature um to go to insert fields near the bottom i usually type the word opt and jump to it faster, there's what's called an opt-out link. So if you put that in your letter, that might also help. Okay. Okay, perfect. Thank you. So, yes, I'm going to prepare my next meeting, and then I am going to talk to my boss about this and let him know of your troubleshooting, what you found. And then real quick, what was your name again? I'm so sorry. Robin Montoni. Thank you. Yeah, you might just want to, like, check within SendGrid. I mean, it could be that it's getting to people, but maybe it went to their spam as well. I think that's what you're after right now because this is brand new. But I'm one of the only people of our team that's utilizing this maybe in the last couple of weeks. So there's definitely something that's also changed as far as authentication. I think you're right on for that. So, okay. So we'll look into it. And thank you so much, Robin, for your help. You are welcome. Have a good day. Okay. You too. Okay. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1518.228219,
    "salad_processing_time": 133.12867426872253,
    "overall_processing_time": 1518.228219,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling me.  This is Robin.  Hello.",
    "job_id": "3f549af7-bb2a-40cd-ac77-2df94df72524",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling me.  This is Robin.  Hello.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 1
      }
    ],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3050656618036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}