{
  "recording_id": "3052115548036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:02:16.614570Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:02:16",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Enter your participant ID. You are in the meeting now. There is one other participant in the meeting. Testing, can you hear me? I do. Hey, Jim. All right, good. Sorry, I had some audio things. We have new PCs and I hadn't used Zoom on this laptop just yet. So hold on. That was very good. Very good. Yeah. Thanks for doing this and kind of jumping on. Sure. I guess Josh isn't there anymore. So have we worked with you before? I don't remember. Apologies, because I don't. You may not have. I don't know if you have or not. I've been here 26 years, so I've worked with many people, but I don't. Maybe we have. Maybe we haven't. I don't know. Okay. No, that's fine. I'm sure we've interacted at some point. We've been using you guys since 2019. So, yeah. No, thanks for jumping on and doing this demo. Just some quick background. I mean, we obviously don't have the product, the PCR product that has the sequencing. I've just been doing a lot of internal work with our recruiters and we need to figure out something with regard to some automation and we've been exploring some AI tools there's just so many right and so it's a little bit overwhelming and there's just some I've got some curiosity in terms of some of the sequencing options that we could have with PCR I looked at the the demo that was on your guys' website. I don't know if it's the new version or the old version, but yeah, so wanted to get kind of a real live time kind of walkthrough of what this looks like and some of the benefits of it. Oh, for sure, for sure. Yeah, you all have, so you have the package that sequencing can plug into, but it looks like you had it before sequencing was released, so you don't have the sequencing piece. So the good news is to add it is no additional monthly. It would just be a one-time little setup of 250. So it's just a one-time setup to turn it on. That includes a couple hours training, but there is no additional increase to your monthly to add that, which is good. Okay. That's good to know. But yeah, let me share my screen here and I will show you around kind of a little bit about what it does. And by the way, is this, do you record these, like the actual video of these, just in case I want to replay this for staff? Is that possible? Let me do it. I will record it and I'll send you over the link that you get it from. Okay. And it'll record the audio and the video, correct? I believe it does. Yeah. Okay. All right. Cool. All right. All right. So, yeah. So, what the sequencing does, so it kind of adds it onto your existing package of PC Recruiter and it would actually add a whole new button, which opens a whole new area of PC Recruiter. So, I'll get logged into my database here. and then once I am in so the sequencing is actually it'll just turn on this new button up at the top here you'll see sequencing up at the top so what it will do it'll be a whole new sequencing piece and that sequencing button is going to be where you will go to build your templates where you also would have a to-do list of all the sequences you might have running that's going to be your to-do list and we'll talk about how those are going to are going to work once the sequence is running so essentially what a sequence is going to it's going to be like a drip campaign of sorts that is going to be tagged to a specific roll-up list. So once it's running on that roll-up list, you can either kind of build the template of the sequence and then select a roll-up list that's going to run on and turn it on. Right then, everyone on that roll-up list gets, let's say, the first email and starts down the road of that custom process. So it's going to run off that roll-up list, but if you add people later to the roll-up list, each one is going to start that new process as they are added to the roll-up list. So So you could have a sequence just kind of hanging out on a specific roll-up, and as you add people to it, each one starts the sequence as soon as they're added. So the sequences, if I go into sequencing here, this is going to show me kind of my different elements. Jim, are you able to expand your dialog box to make that bigger? If it ends up making it complicated, then no, don't worry about it. I have it full screen, so I can't do it. I don't know if you can, but I'm already full screen. Yeah, I can't get any bigger. Let me see if I can just – it's not the worst thing in the world. I'm just going to zoom in a little bit, and hopefully that works. I zoomed in just a little bit, too. It doesn't – no, it doesn't help on my end, so I'm going to go back to 100%. All right, go ahead. That actually is better. Thank you. Yeah, cool. So what I can do is if I go into my templates up here, this is going to be essentially all of the different templates that I have. You can build as many as you like. I think these two actually come with it. So when it is added, you get these two basic templates. It'll add a few form letters and it'll add the template that you can then kind of build off of. So if I go to, like, let's say my business development template, I can go ahead and edit my branches. This is then going to open it up where I build my template. So I'm able to kind of pick and choose, for example, what the first step is going to be. So step one is going to be sending this specific form letter, BizDev letter one. So I'm able to simply assign that it's going to be an automatic email, it's going to send a specific form letter, and then I'm able to pick up to, I think there's three or four different conditions or results that you can put in there. So you could say if the email is replied to, in this case, the sequence is done. That's what I was going for to get a reply, then I can open up a dialogue, they're done. But I can also say if no interaction occurs within three days, or I could make that four days or five days or two days, I could say continue to the next step, which is then going to be a call. Or maybe it's another email. So the unique thing about our sequencing is it could be a straight-up drift campaign, only emails. So it might be an email. If they answer it, they get email B. If they don't, they get email C. If they don't touch it in three days, they get email D. And then everybody maybe gets four days after that another email. So it could be only emails or in this case it could add things like calls or texts with RingCentral. So this one is going to say if they don't interact with it in a few days, continue to the next step, that's going to put them on my call list. And that's actually going to add them to that to-do list that came up in my task list when I first opened up the sequencing piece. We'll go back and take a look at that in a couple of minutes. But then for the call in here, you're able to say what happens if they're connected? What happens if I mark them left message or no answer? You can kind of pick and choose what each result will produce or what it will send them to. So if I put left message or no answer, it's simply going to continue to the next step. And then that next step is going to be, I think it's another email. Yeah, another email. So this is a real simple sequence, just a three-stepper, but I'm going to be able to kind of build my different steps in here. Now these could be more steps. So I have, maybe I have this, I think the candidate sourcing one. This one might have a whole host of different steps. Maybe it even has a reminder to send a LinkedIn in-mail. That's another sort of step we can put in the email campaigns here, in the sequences here. So you can actually build your templates, picking your different actions, your different results, and then redirect depending on results to the next step. And as these are running, another cool thing too is if you go to the activate sequence, this is where, oh, I know this one's got an error in it. What it does is it kind of does a quick search. It sees that this is missing a specific letter. Or if you've directed it to another set that doesn't exist or something like that, it is going to tell you kind of, hey, you have a little error here. Fix that before you activate it. But when I activate my sequence, I'm going to be able to pick it like a begin date. So I can begin on a specific date. I can put an end date if I want. I can send it only on certain days. So if I wanted to only include it on Monday through Friday, I could do something like that. I could even say start sending my sequences at a specific time and stop at a specific time. So I could maybe only have them set during business hours on weekdays if I wish. So a question for you on that. So if you've got a roll-up and it's attached, it's linked to a sequence and you can set up. So the minute you add somebody to a roll-up, you can have the sequence doing an automatic. Now, I guess that's the other question is, is it an email template that's automatically sent or is it just a reminder to send an email? It could be either. Most of the time it's an email template that's automatically sent. But you have another option that you could say, I want a manual email, to which it puts it in one of my reminders in my task list, and then I click and I can compose a personalized email. But most of the time it's going to be an email template that's automatically sent. Right. And what about text messages? Same thing? Text messages, yeah. Well, I don't think you can manually do a text. I think those are only automatically predefined text messages. okay so like you know because in my mind i kind of had an idea of you know what a what a sequence a drip campaign sequence could look like is all right so i'm doing you know one of my recruiters i'm doing some sourcing in the evening and i add you know 15 people to a roll-up um ideally i would like assuming that there's contact and so also aggregate in there um an email and a phone number I would like an email to go out, you know, that evening. And then the next, the next morning for no response for somebody that hasn't engaged a text message referencing like that email. So I can, I can have an, I can have an automated text message say, Hey, fill in the name, John. I sent an email last night. Did you see it? Question mark. That would be kind of step two. And then And a reminder would be, the next one would be, you know, the next thing would be send a follow-up text. Hey, just following up on this text, please advise, something like that, if you can. So, like, those are things, like, that's kind of what, we're not looking at, you know, really, really complicated sequences. It's really just a couple of, you know, probably non-LinkedIn sequences for now, especially if we have contact info. So LinkedIn would probably be like our last resort at that point. But what I just described to you, that's obviously something that just handles and is pretty basic, right? Yeah. Oh, yeah. Yeah. You're going to be able to. Yeah. It could be an email and a text. And here, like this is where you build the text, what it's going to be. So you put the text in here. It's already set up. So that's going to be the text that would be sent. Your email template and you could have it. Yeah. First one goes out. Wait a day. second one goes out or maybe if they open it a different second one goes out and then they could start down a different branch of the sequence okay so you could certainly do that and a nice option too that we have done is if you happen to be looking at your list of roll-ups when you're going to add someone to a list anywhere you see like you'll see the sequencing logo the same logo is is on the button is next to the name of any roll-up list that has a sequence running on it so what's cool if I can tell if I add someone to that roll-up list they're going to start in the two candidate sourcing sequence down here they're going to start to my candidate reach out sequence so I can I know that if I put someone on that list they're going to start that sequence as soon as I put them on so it puts a little icon they're showing that sequences running gotcha gotcha so so that so that's good to know so there's an option or even if it's automatic that's fine a group is like I would tell my team if you're putting them in the roll-up that means you there that you are reaching out to them. And within a minute or so of that person going to roll up, PCR is going to recognize, and the sequence is activated, PCR will recognize there is the first part of the campaign, it's an email, will go out the minute you put them in there. Okay, cool. Absolutely. So it's going to start right away. And then if you're in your sequences again, or over sequences, if I had something a little more manual, like I wanted to put a call option in there so maybe in my sequence I was running once they open the email maybe it puts them on my call list I have a list of basically a to-do list here so I can go into each person as I click their name it's going to open up a little window it's going to show some basic info about them it's going to show a little bit of their activity you can actually put a little button there that'll automatically click to dial their mobile number using your ring central if you use ring central you can even load a script in there so all they do is click to dial read the script mark them whatever happened, that'll move them on, it'll jump right to the next person. Then you're able to click the dial, read the script, mark them whatever happened, it'll move to the next person. So you can just kind of card through these individuals if you had them on a call option as well. And this is where also maybe you want to schedule a call with them. That's another option. If X happens, then Y is schedule a call so I can have a bunch of people I need to just schedule a call with, and that'll give me a little task scheduler right over there too. So a few different things you can do. Can you show me – oh, sorry to interrupt again, Jim. Can you show me the roll-up that this particular sequence is tied to, what that looks like? Oh, let's see. Candidate reach out. Yeah, let's go over here. Yeah, because right now you're in – you clicked on that little icon, right, just now to get into that page? When I click sequencing, it opens a whole new tab. So I can keep that tab open but toggle over into PC Recruiter. So it keeps a whole sequencing world open here in a separate tab. Gotcha. Gotcha. And so I'm just looking at this to kind of see what I can. So right now, what this was, so that call that 18 number, those are eight that in the sequence right now, it has prompted you, did you have 18 calls to make per the sequence that you developed? Correct? Yep. Yes. Okay. And then zero text message prompt to now that you've got to send a LinkedIn message to wherever you have it that are still out. The two that you still have to do. And then there's six that are whatever, however you decide schedule, whatever that is. I'm reading all that correctly, right? Yep. Okay. Gotcha. Okay. And then that's going to be, I can tell that it is the candidate reach out specifically that I'm looking at now. And if I go over here, I know that the candidate reach out is running on my account manager candidates roll up list. So I can go into that roll up list of people and that's going to be the people that have that sequence running. And some of them, let me open it up here, some of them are also going to have activities if if something has happened with regards to that sequence you'll see sequence he was marked complete no answer when i called him so i can kind of see there's some sequence related activities are recorded in the in the uh user record as well so you could tell send connection request i completed that when i called i got no answer thus i said my connection request then he's complete so i can see some activity is going to be recorded out of a sequence right there too and then there's also reporting on the sequences in your sequencing as well you can look at some metrics some results so as you look at that you're going to be able to kind of look at your different sequences how many people were at each step i think the results gives a bunch more different little graphs so you can look at maybe that candidate reach out that one i was looking at and it's going to show me how many move to the next step how many are at the call step That's the 18 we were looking at, incidentally. And I could see kind of when everything has happened. So I had some detail there kind of showing the report on what's going on with my sequence there, too. Got it. And then going back to the – you mentioned something like you can look – looking at the activities, there are – there's going to be continued need for putting in manual activities like call no answer. That's the only way the sequence will be able to identify. it it'll it'll track an outbound I'm guessing that a call is made but which happens automatically with the ring central integration but the call no answer that's still that that is obviously a manual input correct oh no that this no answer that was automatically entered when so let's say I was in my calls if I went through and I called Megan Wilds and had no answer I I can just say no answer. As soon as I do that, that creates it. Oh, okay, I see that now. Gotcha. Can you hold it over the mark as again? I just want to see the options. So there's left message, no answer, not interested. Okay, got it. Okay. Okay. Yeah, so that'll kind of show you there for sure. Yeah, so that pretty much in a nutshell is the sequencing of what it does. anyone can use the templates so you can share templates you can build as many templates as you wish you get a couple hours training to show you how to build and work and work within a sequence and everyone can everyone that needs to can work within that sequencing piece take a look at that okay yeah i mean i think our need for this i mean i think we're we're behind and how we just because we we're such are we're not high volume right we're you know really we don't represent hundreds of people a week or a month or even a quarter. It's very small amounts. We haven't really looked at sequencing as something that has been a need, but I recognize some of the saving of time and process that are, especially as we onboard new recruiters and some of these younger recruiters that are going to be used to more automation. That's why I wanted to looked into this. And also we've had a few of these AI tool companies that have reached out to us. They're like, oh, we, you know, you, you know, you, you purchase our tool and it does all the sequencing for you. It sits on top of your, your CRM or ACS and LinkedIn. And you know, that's been a little bit overwhelming trying to figure out if that's something that we need or not need. You know, like I think the one company, I don't know if you deal with those integrators or not, but like pin, I don't know if you've dealt with them before, but they've been, we've been talking to them about their product and how it, I think it now integrates with PCR, but so yeah. So that's why this is something that I wanted to address and it's a lot simpler than I expected. So that's good. And yeah, the candidate reach out candidate engagement is kind of really what we're going to be using this for. and that's a good use that business development and candidate engagement are kind of the two biggest uses for it most people most people do cool and so basically if we're like hey look let's get this let's get this added to our our current product there's a couple hundred dollar kind of onboarding fee that's because you know that includes training and and whatever upload or change management needed. And then it's, then, then we're good to go. Yep. Yep. I put in a ticket and we get it turned on and then we get it over to the training team. And so when we reach out to get the training going and it's pretty quick setup. Okay, cool. Great. Yeah, no, that's I'm, I'm terrible at this stuff. Like usually like trying to figure out, like we've had PCR for five years and we probably use 20% of what it can do. You know, we're, we're not, you know, we're not doing talent acquisition. We're not in-house, but it's, you know, we still don't use what it needs to be doing. But this is the biggest ask from the team is some of this drip campaign sequencing automation. So really, really good to know that this won't be too much of an extra cost other than a change management fee, basically. So that's really good. So great. If you end up getting that link sent to you automatically, I want to share what you just went over with the team. and I'm going to advise that we go ahead and move forward with this and get this implemented. What I'll do, I think it comes within the hour. It'll process it. It'll send me the link. So I'll send you the link to the recorded demo. Take a look at it. And then if you want to go ahead and get going, just let me know and I can get everything underway when ready. Awesome. Cool. Man, we actually did that in less than 30 minutes. That's amazing. Very well. Yeah, it doesn't take long because it's a bunch to show, but it kind of flows real well. So usually pretty quick, but I'll send everything over and then let me know what you want to do. Perfect. That sounds good. Thanks, Jim. Thank you, sir. We'll take care. Bye now. Thanks. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1559.38807,
    "salad_processing_time": 87.91040706634521,
    "overall_processing_time": 1559.38807,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID.",
    "job_id": "674cacf2-1e42-48ed-ad76-9c946c561d7f",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3052115548036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}