{
  "recording_id": "3052312865036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:02:40.630728Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:02:40",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence. This is Robin. Hi, Robin. How are you doing? This is David Hill down in San Antonio, Texas, with Riverwalk Executive Search. How are you? Doing good, Robin. How's it up there in Ohio, right? That's where you are? We're warm. Yeah, we're warm for now. What's warm? Because San Antonio probably thinks it's cool. what is it what is it today today it's 82 today oh my god that's not warm yeah well actually we've been actually we've had um for several weeks it's not too bad today been very humid and pretty hot like around 90 and very humid okay well we're about 10 degrees well i mean we're just normally 10 degrees hotter than that. I mean, our normal is about 98 right now, 99. And then heat index is about 101, 102. So it's hot. You know, it's really hot. This time of year is hot. You don't want to visit San Antonio at this time of year. It's terrible. Terrible. It'd be like visiting Cleveland in the middle of January, I guess. Oh, you don't want to do that. No, exactly. It's about the same extreme, just opposite. Well, Robin, I've got a question. I know I've had this problem before with mine and I think it was Garrett that fixed it. My wife now, Christy, she's having the same problem and I don't exactly know how we got into it, but somehow what she's doing when she goes to send her emails it's indexing to my email it's under her name christy hill but then it's my email address so okay let me see something with that stmp or whatever it's called i'm not a techie i don't know but i know that they got into like you know that that stuff to fix it okay what is her username let me check her alias and see how it's set up yeah her her username is k like christy k and then h-i-l-l okay let me see what she's got for her sometimes if somebody doesn't have one it uses what's in the outgoing mail settings as a backup which if it was yours for that then that could be an issue let's see well maybe i mean you know and i don't know i mean i can fix it if She'd tell me what to do and I'd get in as her or you could share my business or whatever. Oh, okay. I see what's going on for some reason. Oh, that's really weird. She has some drop down that she's had for 15 years where she could drop down when we used to have sticky IT back in the old days. Because we've had you guys for almost 20 years. And there was some drop down. You could, like, change how you wanted to send it. Yeah. Okay. Yeah. Well, for her username, she's got three email aliases set up. Now, is it Office 365 now? Because that one, which is her default, actually, it's not set up correctly. No, it's not. It's not. It's not. Well, let me say, if she's sending it out of high-quality leadership, yes, that is Office 365. It is. Okay. Yes. So that's her default. Now the problem what I see, and maybe, did you maybe authenticate as yourself trying to do it for her? Maybe pulled over your credentials? I think I did. I think I tried to pick it up and screwed it up. I think I did. So is she at her computer right now? I'm signing, she's in the kitchen, but I'm signing on as her right now. Okay. So if you're at her computer, okay, let me know when you're there and ready, and I'll walk you through the steps. Okay. Thank you, Robin. No problem. I know it wasn't that hard, but I don't know how to do it, you know? Yeah. Sometimes what happens if you're, like, let's say you're trying to help her from your own computer and you try to sign in. Sometimes you're already signed into your own account, and then it tried to pull your credentials instead. That would be my guess. I think that's what happened. I do think that's what happened. Yeah. So in that case, if you were trying to do it for her, you would either need to log out of your Office 365 or you have to open up your browser like in an incognito window, which doesn't recognize that you're signed in. Then you would be forced to put in like the username and things like that. So let's see if we can, if you're at her computer, let's see if we can get this resolved for her then. Okay. I am. So I think I went to like configure or something like that. Yeah, I'm going to first take you, let's see, I think, well, the incoming, let's see if that's still good. Well, I just fixed that. I fixed that with, who was it that I talked to the other day? Well, that one, wait, hold on one second, because that one has two setups, and I'm not sure why. Let me see, why do you have two setups? because well here's why because she gets she gets one feed from uh home page universe which is her riverwalk search which is forwarded but that's forwarded to that's actually forwarded to high quality leadership so really she only gets it from one yeah now i see um the office 365 set up twice her K Hill or Christy Hill. Let me just, I don't think we need both of these. I don't think so. I don't think so. We could test it, but if you want to get rid of it, yeah. Yeah, it seems like we just want to get rid of one of these. I think you're right on that. We probably just left it. I remember doing this the other day because that was messed up for her too. But then when I started to fool with her computer and I said, Christy, you're sending under my email address, so I should have done both, but I only went on the inbound. I didn't do the outbound. Okay, so the one that says Office 365, that one's failing. But the other one. I think the other one goes through. Yeah. Yeah, well, these are two different things. So I'm going to turn Office 365 on because that one is like a duplicate of the other. okay oh no when is the Riverwalk hold on one second but the Riverwalk but here's how the Riverwalk works it actually forwards to I think it forwards to high-quality leadership before it bounces into her PCR mail okay the Christy Hill high-quality search where is her inbox here though where is her Oh, it's hard to find. I can tell you she's got that kind of messed up, too. It's crazy. You got to go down. Oh, yeah, it's under junk mail. Okay. It's under junk mail. Yeah, I don't know why she has it under junk mail, but she does. I don't know, but that's where she wants it. So it's like, okay. okay so that one's fine okay all right so that's fine um christy hill is the one that we want this okay that one's connected the riverwalk one is not passing the test but we could just do does she use that riverwalk one then she does but she uses it directly okay go right directly into it like you would outlook but it's it's home page universe but it's it's available and then indicating for for incoming well to see what's going on so let's for now let's fix her sending if you go to system okay system okay I don't take email setup okay okay okay then you'll you'll go to email setup and then you're over at the right you're going to go to email alias list email alias list okay there it is right there yep okay so she's got three setups for sending an email the first one called Christy Hill click the pencil icon on the corner of that card yeah cuz that's got the long email address that's why she yeah there's a couple A couple things. Yeah. So the from address has to be her email. Yep. That makes sense. The reply looks okay. That one doesn't automatically populate, which you have to have it match your account anyway. Otherwise, your mail server is going to reject it. And then because it says david.hill, I think you probably signed in as maybe yourself somehow. I think I did. But now I just got rid of it. Now, what about this SMTP user? Should I make that a little also? in order to get the X, you're going to have to generate her secure password. What you're going to have to do is where it says sign in with Microsoft, you're going to have to click that black option. Because you've got to, otherwise, yeah, they make you sign in now for security. You can't just, like, type the password. You've got to go through their sign-in process. Right. Now, I hit that. It's already signed in. It might go really quick and then return it back. Otherwise, it might actually be wrong. It does. That's what it did. That's what it did. All right. The other thing that's very important to do with an Office 365 account is make sure you put a delay between emails. Because let's say you were sending an email to 40 people. It's going to stop after 30 because they have a permanent restriction. Oh. So what you're going to want to do is put the number, let's go with 3,000. and what that'll do is if you're doing a bulk email it sends one waits three seconds and then sends passes the next one over i like that yeah i think that's how mine is yeah you have to do that otherwise you'll probably get marked a spam maybe even get your account blocked and stuff right when i you still want to do a smaller batch when it comes to office 365 but if you try to do let's say 40 and within a minute it'll stop as soon as it hits 30. ah okay that's good to know yeah that's okay so go ahead and hit test connection and let's make sure it passes it says test completed status test completed okay perfect exit just that little test screen to uh say that again so that test screen go ahead and close out of the test screen oh close out okay I closed out. Yes. And then the email alias screen, make sure you hit save. Okay. Save. Now, I saved it, and it still has my David Hill high-quality leadership here on this left-hand thing under alias address list. Okay. We might have to do this another way. Well, it says my SMP. Oh, wait a minute. No, there it is again. It popped it back in there. She must be signed in as you. Okay, so let's do that. She must be signed in as you from her computer. Well, maybe I should cancel her out. Should I close out her computer? Let me do that. No, actually, let's do this instead. If you, so are you in Chrome? Yes. Okay. Your Chrome icon at the very, very bottom of your computer. Right-click on it. but select new incognito window. Ah, yeah, I think I did that the other day with your guy. I can't remember who I was talking to. It wasn't Gary. It was Tyler or Jason, maybe. I think it was Jason. Yeah, I think it was Jason. Okay, so now I'm in the new incognito window. So now sign back on. Yeah, you know what? Maybe we should do a screen share. Here, I'm going to send you an email. Yeah, do a screen share. What email address should I send it to? Send it to david.hill at riverwalksearch.com. Well, send it to david.hill at highqualityleadership.com, highqualityleadership. Okay, and you can get those emails from that computer? Yeah, I can. Okay. Oops, I think I'm in the wrong window here. Didn't want to go there. I didn't want to go to drive. I wanted to go to meet. Okay. Bear with me one second. New meeting. Start an instant. I will add you. Okay. I'm so sorry. What was the email again? David. David. Oh, and high quality leadership. Oh, you came up. High quality leadership. Yep. That's it. Okay. Dot com. All right, let me know when you get that. Okay, though. and sometimes it takes a little bit to sweep it into pcr mail now i can go into outlook if you want me it's a little faster should i do that to get it or should i just wait for it to come into pcr mail I'm sorry what was that well it takes a little while to sweep it into PCR mail do you want me to just go to Outlook and get it yeah you can do that yeah just so I because it's just hooking me up okay here we go Well, I always, always something. Thank you. I think it just came in. It did. I think it did. Hold on here. Okay. So now I join the call. Is that what I do? Yes. now when you get in the meeting you don't need to join with like the microphone or the camera because we're gonna watch your screen but we're already on the phone so don't use the microphone option okay like or at least mute it otherwise sometimes you get a lot of background noise and it gets really annoying yeah a lot of feedback so just go ahead And join. Yep. Okay. It's prompting me to admit you. I'm going to admit you in. And I see you there. Okay. So what I'm going to have you do is at the bottom of your screen, there's a share screen option. It's the rectangle with the arrow in the middle. Yes. Yes. Click on that. Okay. And then you're going to go over to entire screen. Okay. And it's going to show you a preview of your monitors that you have. Click on which screen to show me, and then click share. Okay, got it. That's the first time I ever figured out how to do that. It always gets confusing to me, but I'm glad you did that. Okay. So now, can you see my screen? Yeah. So let's have you do this. Let's have you right-click down at the very bottom on Chrome. So down at the very bottom of your computer. Down here? Down over at the left. Over here. So you're two spots over. There you go, right there. Right click on it and select new incognito window. Oh, okay. I'm prepared. We've done that before. So what this will do is not recognize that you're signed in as you. So we'll get the full prompts. so it looks like you do have your PC recruiter shortcut up there so let's go there yes okay now do we want to sign in as Christy or we want to sign in as me probably yeah the sign is her yeah you have to sign in as her okay there we go boom signed in okay and then what I'm going to have you do is go to system go down to email setup this is also in the PCR mail section but there's just another way and then go to where it says email alias list okay yeah so these are her three setups so let's go it's back to that first card again the the first one yeah here let's click the pencil okay and there's all the David Hill stuff that we know is not yeah so take her email drop put replace David under the from replace the up Christy okay okay and then now try sign in with Microsoft it should prompt you to sign into her off Office 365 account because we're in incognito window. It does, yeah, it looks like it is, sure. Okay. So now sign into her email, which is crispy, right there, okay. Okay, hit next. now it should take us to that okay so go ahead and put in her go daddy password yeah and i guess it's this right here okay sign in so she must be signed in as you and that's probably what happened okay why is it still okay try replacing try to replace yeah but the username is still showing her try replacing that portion yeah why is it should have replaced that hit test connection for me test connection yeah okay exit exit the test that's really weird that it didn't replace that hit save save now let me just check because last time i had saved it didn't do it didn't do the right thing hold on let me see this again okay let's go back and look at that one more time everything i just want to verify yeah i don't want to give you a call back not that i don't want to talk to you no now it's working now while we're on this while we're on it i just it would be nice to be able to send from the riverwalk this right here you know as a drop down we can get rid of this this sticky ip bulk that we can get rid of that okay so for that third card hit the x that yeah so get rid of it okay so now let's go on but this would be nice to drop this down and send from this one instead sometimes yes that you should be able to do now what i would here's what i would recommend on the first card let's go back to the pencil okay and see where it says description just put the words high quality there oh i got you yeah and the other thing i just noticed that three thousand went away we want to make that yeah i don't know maybe maybe it didn't save before so it says delay between emails let's save that three thousand okay it's a very now the next card over let's double check that one let's hit the one that's right now it's saved it's saved now but I'm not test connection just for the hell of it I don't just you know now you taught me how to do it yep that work okay good so I'm gonna say it's a that was good okay so I'm gonna get one hit the pencil there because you really don't need to just get first description it's just internal it's an easy way to tell one account from another for someone like where so where it says description called this one Riverwalk because she's gonna know it yeah yeah no that makes sense yeah it's her account so you know now I would also get a delay here as well because you also don't want the recipients mail server you know let's say you're sending to a bunch of Gmail posted things. You don't want Gmail saying, oh, here's the same email coming over from the same sender, same subject, same exact time so the space is out a little bit. Let's hit test connection. Let's make sure this one works. Yeah, because this is the one. No, I don't think this is the one, but now Riverwalk isn't coming from Microsoft. So, yeah, we'll see here. So, let's hit test connection here. Loading error. Yeah, so that one, so this one, either the whatever that mail server is. Now, is that not an Office 365 or is it? No, but I can get to it if you want me to get to it. I know how to get to it. What did she have? Hold on. Let me check her incoming here for a moment. I'm going to clean up that too. Let's see. Mail server. Impact server. I mean, I'm not sure we can even do it anymore, but if we can, it would be nice to, is what I'm saying. It would be nice to do it. So I wonder, the Riverwalk, I'm going to make this one here. Now, was the Riverwalk in Office 365 as well? No, it's not. It's not. It hasn't ever been. It's been a part of this. I mean, you can see what I'm doing right now, right? You can see this. Let me flip over. Okay. Look at this right here. It's HomePage Universe. It's this. Yeah, her incoming isn't even right. So maybe it's sometimes. Let's see. maybe I should go back into the regular one because it signs on with the regular one really easy hold on let me close this out and go back to a regular regular one here homepage universe login web hosting here this is it it's this one here Okay. And that's her right there. Okay, mail service rack space. Okay. Is there a place, email? Okay, let me see if I can Google what their mail service is. Yeah, because her setup for that account is really not right. Home page, universe, SMTP, and IMAP settings. Okay, I think we need to fix this. Yeah, I think we do. I mean, because it's all screwed up. Oh, they use Outlook. Okay. They use Outlook, apparently. Oh. Yeah. I did a search and they're coming up that's not a comment GoDaddy does the same thing like you know when we use the sign in of Microsoft GoDaddy does it too apparently Homepage Universe does as well okay so here's what we have to do so let me go back to the same Tognito thing here's her again so let's go to the Riverwalk one this one okay Yeah, let's hit sign in. Hopefully we get the prime in with Microsoft. Yeah, let's try that one. Oops, hold on. Hit cancel or close. Okay, let's do a new incognito window because now she signed into her other account. Okay, so new incognito. Go to this. Go to this. Go to that. I wonder if doing a new tab is going to be enough. And then go to her email. Here's your email. So we're down here under junk. Yeah. So we got the high quality. So there's two things. There's incoming and then there's sending. So there's the high quality. and then there's the let's just say in PCR mail because we're going to have to be over there anyway to fix incoming do what? let's go back over to PCR mail because you can get to that alias from here too it's just we're going to do the incoming so let's go to configure configure yeah okay I got you and then go to mail servers okay mail servers okay why is it not doing anything um oh you might have your bottom bar kind of stretched down right now see like see how it's like pulled all the way down like you pull that up okay oh yeah yeah you're right you're right okay so I think let me see I think I saw where the The high quality one I think we now have good. Yeah, we do. I think so. And then this mailriverwalksearch.com, N-O-S-S-L-L-O, I don't know. Okay, so the second one, let's go do the riverwalk one. This one here down here at the bottom? Yeah, the third one. Yeah. because the high quality one, everything looks good for that one now. Right. So what do I do? Just click on it or something? No, here's edit, delete. What do I say? No, no, you're going to go. So next to the river walk, you're going to go to action over at the left. Sorry, I was looking at something else. Okay. And go to edit. Okay. try sign in with microsoft i'm hoping it doesn't replace it though we're gonna have to test before we save anything hopefully we get a prompt see it's still trying to remember okay do not save this let's exit out okay okay let's exit this incognito so just use the black x over at the top right? Okay. I might have to go to a whole new incognito window. I think doing it a tab is not enough. Let's go down at the very bottom, right click on Chrome, select new incognito window. Okay, there we go. Now go over to PISA recruiter again. Okay, I got you. I'm hoping this time it doesn't remember now that she signed into her basically GoDaddy. Okay, hit login. Let's go over at the top right and go to open a PCR mail. Okay. Let's go to configure. And then this time I'm going to have you start under email alias list because it's easier to tell what's going on when we are doing the authenticating authenticating for sending so mail service is for the incoming aliases for sending let's hit the pencil on the corner of the Riverwalk yes okay let's try this just supposed to be Riverwalk wait a minute okay that's no remember your last attempted sign in okay let's take the Riverwalk address and put it over to the from so if you copy from reply from oh I got you well yeah okay now let's try sign in with Microsoft and hopefully we get prompted to sign in with the Riverwalk email. Okay, put in the Riverwalk option. And then that one's wanting a pin. I got that, yeah. Okay, now if it prompts you about staying confirming, about staying signed in, let's just not do that next time. Okay, hit confirm. Say no. that's what's kind of throwing us off there okay okay let's hit it can I change this one down yeah now our change okay let's hit tough connection I think we're going to be good now for the for sending authentication oh no no no it's unsuccessful sorry gosh don't okay let's exit out why Christy dot Hill at Riverwalk search Christy dot Hill at Riverwalk search let's hit save for now and I'm going to have you do something else let's go to mail servers okay sometimes with a setting like you might get like SMTP is disabled we might have to check some settings within that universe account let's go to the river walk one let's go action edit that's this bottom one here yeah let's try sign in with Microsoft and hopefully we're going to get prompted to sign into this river walk account again okay Check that, click on that. The test connection. Test connection. Failed. Failed. Okay. Do we go back to the homepage universe? Let's try, yeah, let's try signing with Microsoft. One more time. Let me just see. Sign in with Microsoft. You put that in. No account. Okay. Sign in with your past key. And that should be your... Yeah. Only confirm if you're using your personal. Is there anything that can you move that um here it says hide where the Google Meet is there anything going on down at the bottom of that window maybe we're not seeing. See where it says hide right after stop sharing. Oh here I guess. Yeah. Terms of use okay. It's got a little triple triple triple dots here. okay let's hit confirm I guess only confirm to sign in if you're using your personal it's not a personal account right no no it's not never has nothing give us any other option so I guess I'll hit confirm yeah I guess I guess you just yeah I don't know okay so I hit confirm I think we're going to have to look at what's going on within the Riverwalk account. Let's go over to the Universe site then. Okay. Keep this open. Okay. So is she signed in as herself here? Well, do you – yeah, she is. Okay. Yep. where would you typically go if you were creating an account? Yeah. Create an account. Yeah. You'd go here. You'd go here. You'd go. Hold on. I just did this the other day because I created one. Is there like an admin area or something? Yeah, there is. There is. Yes. Okay. Go down to office 365. I would assume. Okay. Well, I don't think that's what I did. Hold on. I went to enterprise email. Is this what I did? No, that's not what I did. Hold on, hold on. Here's how you get into the email. It looks like this. And this is her. But then you go like this. I can go to settings it gives me all these things but I don't think I have anything to do with setting up another account or anything all right I would assume are you the office 365 administrator no she is she is okay try going to let me think what the URL is bear with me one second trying to think what is it there was a way try admin dot Microsoft comm for the website oh now here we go this is different this is different now I signed in as her Right here. Can you see? Can you see? Here's the domain servers and all that business. I don't know. Hosting portfolio. Yeah, where do you go to see the user accounts that you have? Oh, yeah. There is a place. Hold on. My account. Geez, I was just in here the other day. Hold on. But I know we're on the right track. Don't get frustrated with me. Is it going to be under email maybe? Let's click there. Yeah, I think it is. I think it's under this. No, it's not under that one, though. Maybe it's under this. I think it's under this. I think it's under this. I think it's under this. I think it's under this. I think it's under this. I think it's under this. I think it's under this. I think it's under this. I think it's under this. I think it's under this. I think it's under this. I think it's under this. maybe it's under enterprise enterprise email well enterprise email admin login This is it here. See? All mailboxes. There they are. Those are the three mailboxes. Okay. Let's click on either Christy's name or manage over at the right. I'm not really sure. I don't know the site here. Yeah. We'll do manage. Just alias and all that. Try first name, last name, and display name. Christy.HillettRiverwalkSearch. That's exactly what we're putting in. Yeah, I don't know if it makes a difference, but let's try it. And then the display name would be what, Christie Hill, I guess? Yep. And then there's sort of... Okay, let's scroll down. Update just in case. Okay. Let's kind of just go through each of these tabs. Let's try the Contact Info tab. Oh, I see what you're doing, yeah. Okay, try the Alias tab. Okay, try the Groups List tab. Okay, let's go to settings. IMAP SFL. This has got the IMAP web page and all that business. Yeah, that's okay. How about setup? Open client configuration tool? I don't know about that one. Hmm. No, it just gives you something like that. How about more? Okay, so this is Homepage Universe. this is our email hosting page my account my profile here's your profile I don't mean but multi-factor again now wouldn't be that I guess and admin administration there she is it's coming up Now, Homepage Universe is saying that your IMAP settings are like yoursite.com. Does that sound right? Should be what? Your site.com? Yeah. like it's like whatever your site name is which is Riverwalk search I mean if I go here you can see Riverwalk that's our that's our webpage right there Riverwalk search. What we might need to have you do is reach out to them because I don't know how you had anything come into that account. I mean, granted, it's really, really old. No, the way we have it come in, oh, you mean, well, if I, I mean, we come in this way through just webmail. People, if you sent a note right now to Christy, it would pop right in here. right at the top how it says webmail email server comm I'm wondering if even though I mean I could have gotten some bad advice from uh tell me was at Microsoft Office I was seen like it was set up with Office 365 at some point but I don't doesn't feel like that maybe is correct I don't think it is I don't I don't think it is Office 365. Yeah, it was somebody you saw on the homepage universe. I think you saw it on one of these pages. Setup information. What about this? Riverwalk. Here's the setup. What is Enterprise Domain Mail Setup? That's what we need right here. There we go. There it is. OK, let's try this. See there on the box, outgoing mail server? down near the bottom yeah this one here out this one this one that one coming let me see what we do okay let's try secure server up at near the top secure server comm just not the whole thing just right after it says SMTP just No, after that. Oh, I got you. SecureServer.com. Let's try. And then don't. Yeah, just that portion. Let's copy that. Not the portion. Okay. Let's copy that. Let's go back over to her login. So her PCR mail. Make sure in hers. I think that's yours. Yeah, that's mine. Yeah. Yeah, listen. Okay. um not uh so this is supposed to be what let's exit out of here because i think that this um yeah go to pcr mail let's go to pcr wait a minute this this one we got rid of so i think that was a because we were that hasn't refreshed yet that was like your main page just hit like company your name in that screen so we don't confuse ourselves no stay in no no no no no yeah just hit like company like make sure going somewhere else just to refresh it we changed another place okay let's go up to the next tab up at the top where it has our pcr mail okay let's go to configure and let's first focus on the alias address list to see if this could be it um let's go to alias address list Oh, it's down here. Sorry. Okay, let's go to the Riverwalk card. Put what you just copied. Yep. And then I think we probably, yeah, and I think we went colon 465 after it. So paste that in there. colon 465 colon 465 yeah let's go back to that page that was showing those credentials Okay, because that one was for six enter your user Email username is your full email address. Okay, so let's go back over to the PCR mail tab So two tabs, there you go So that should be that put in her the, what is it called? The universe, her password for that. Homepage universe? Yes, put in that password where it says SMTP password. Oh, okay. Now I don't know what it was. Hold on. Okay. So, I've been doing this for a long time. So it'd be the one with Christie Hill, the top card. It would be, you think? Well, see that's the email address. That's the one you want. Oh, okay. It looks like a variation of Sherwood 3. So you can hit the copy icon just to the right. Oh, that's a good idea. Okay, got that. Okay, let's go back to the PCR mail. Let's give this a shot. Okay. Put that into the password field. Yeah, you have to clear out everything in there. Do not save this because we don't know if it's correct. Just hit test connection. Failed. But maybe sometimes when you do that cut and paste, it misses stuff. Hold on. Let me just see. No. I don't know what to do on this one. You might have to confirm with somebody at Homepage Universe exactly which credentials you should be using. Let's look at that page again. Secure that email server. Maybe we want to use... That one. Yeah. Let's try that one. And that one will be port 587. How do you know that? Just I'm curious instead of all of these. Yeah, usually for FMTP, it's either 465 or 587. Ah, okay. That's easy. And incoming to 993. So let's go back over to our PCR mail. Way over at the left more. Oh, yeah. I think you can't use. Put that under server. Then we'll just have to clean up the end of it though. And 587? Yes. Then take out the word port. It should go .com colon 587. Okay. There we go. Test connection. yeah they don't accept it unfortunately I don't know what to suggest here because I don't know what the credentials are well maybe it's not that important you know so she would be able to send it just won't go through because they can't authenticate it so I would probably just kind of get out of this for now her high quality is now fixed can we try mine just to see mine for a second yeah let's go over to yours It looks like yours is the second tab. Right. And I think mine has a drop-down, too, but I don't know if it works. But hold on. Let's just – Yeah, let's go to configure. I just want to see something. So see if I wanted to drop it down. I can drop it down to that. She can, too. It just won't go is the problem. Right. It just won't work. And I don't think mine will go either. Let me go to my Gmail. Just say test my drop down. Okay. So let's just see if it goes. I don't think it does. I'm not saying it's not. It would have gone. Oh, it's trying. Yeah, yours isn't going either. Please set check system email. Yeah, that's the area we were just in. Do we want to see what mine even says? Yeah, let's go to configure. configure go to a nice address list I can get rid of this okay I'm here real sure I don't mean that get rid of that okay now here's this go to clear Riverwalk one see that also knows office 365 yeah it does but but it's not working so I don't know if that is real helpful but I mean which is basically what I mean I could talk to home page universe to find out what this thing's supposed to be the what what the or what the server port is like yes and never use their name and then yeah is it a sign-in with Microsoft or do we have to type a password usually if it's sign-in with Microsoft it's literally a sign-in it's office 365 is the mail server that they're using for their stuff though. Whatever the sign-in with Microsoft would mean, see what happens. This one might be a problem because you're probably already signed in to don't save it. Go ahead and get out of there. Don't save it. Don't even test. Oh, no. Don't save it. It's recognizing your other account. Right. Well, I can call Homepage Universe and then call you back if I get enough data. You can't figure it out. I can do that. Yeah, we don't really know. But let me ask you this. Let me just make sure this works. Because this is the main reason why I called you so that she could send stuff under her own name, you know, because she was sending them as me, and I didn't like that. You know, she didn't like it. Yeah. So now. She can be fine now, at least for, you are both fine now. Yeah, she's fine. Right there it is. Yep. And she has the drop down, as you see. It's just she doesn't want to use the other one because it won't work. Right. So if she uses this one, though, and I go to, let's just say I go to my Gmail here, and I do test from Christy, and it'll go right into Gmail. So email being sent, there it goes. And then I go into my Gmail account right here, and it pops in there. And there it is, test from Christy. right there came from high quality leadership so it worked that fast it's just the riverwalk i don't know how to do yet we got to figure that one out yeah you got to basically say so we don't really send the emails we connect to whatever mail server so we're not we're not able to figure out how we're connected we're supposed to connect for that one right well you solved the main problem which was getting her to have the right name So now she does, but the second point is it would be nice if she could send them the Riverwalk because we use both companies. Yeah, that one. I'll just have to call Homepage Universe. Well, I'm satisfied. I'll give us a copy of it when you give us credentials. And then we'll have the mail server, if it is not the Office 365, the incoming mail server, we'd probably have to redo. The alias for sending, you can really type over. Okay. We don't allow, like, kind of typing over if it's going to be a different incoming mail server because it really screws things up. People are trying to do that, like, oh, let me just swap it out, and there's already folders downloaded. you can only like delete it and redo it or make it inactive and redo it but your quality leadership one is fine it's just the Riverwalk and that's good and the Riverwalk one even gets forwarded to high quality leadership and it works it comes in the PCR mail through high quality so people sending to Riverwalk get it to her, but we can't send from Riverwalk for her or me, for that matter. So that's the issue. It's trying to send from Riverwalk in PCR mail. We can get into the homepage universe mail, just the webmail and send, but it'd be nicer to do it because you're doing it through PCR. You can track activities and all that stuff. Yeah. So now it all should be going correctly. Yeah. Yeah, it'll all go correctly, and then I'll just figure out the river walk then. Okay. Well, good, Robin. Thank you. You've been helpful. I mean, you accomplished the main goal. I was sort of giving us a curveball there trying to get the other thing, but that wasn't the main reason why I called. You solved the main reason. All righty. Well, give us a call back when you got the stuff, and we'll help you out. Sound good? I will. I will, Robin. Thank you very much. Great. I've talked to you before. You're really good. Thank you. I appreciate it. Thank you so much. Okay. Bye. Bye. All right. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1571.67294,
    "salad_processing_time": 373.589674949646,
    "overall_processing_time": 1571.67294,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence.  This is Robin.  Hi, Robin.",
    "job_id": "163be9fc-3088-4196-899e-3489bc177a8a",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence.  This is Robin.  Hi, Robin.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3052312865036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}