{
  "recording_id": "3052418174036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:02:49.015559Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:02:49",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hi. Hi, Mariana. It's Jim with PC Recruiter. Hi, Jim. How are you? I am very well. How are you? I'm good, too. Thank you. Excellent. Excellent. So glad we could get connected here. I'm still on the screen share, so I can share that as needed. Okay. But I wanted to just talk with you a few minutes about what you were looking for in a software package, what you're using now, and kind of what the main things are you really needed to do. uh yeah sure so uh we're a true um here we're now using um what's i don't know what is it called um is it called zoho yes oh soho yeah and um frankly uh i i guess i guess i own this company um and we're in a in a place where we're going to start scaling our business and i want to make sure that we have a good ATS in place before I do that. I've done it before, and I did it without an ATS, and it was a big mistake. That was years ago, and I'm not going to make that same mistake. Yeah, I did no investigating into Zoho before we kind of purchased it. It was through an assistant, and basically what we found is that it's just Excel, which is we already use Excel. It was very cheap, but it was also sort of just a waste of money. We want something a little more comprehensive, something where I can pull analytics, see what recruiters are doing and how they're doing it, and sort of point out. It'll kind of help me manage probably called a small team of like five people, seven people. help me manage them with like real numbers. And then the other piece of it, and I don't, I don't know if PC recruiter offers this, but is there any sort of AI candidate based sort of system that we could potentially use for marketing and business development? Oh yeah. Yeah, we do actually have this. So we would, we have kind of a sequencing piece that you can utilize for business developments. You can kind of build sequences. so as you build the database you can have automated sequences going out to people in your database based on what they do do they click the email do they reply did they not acknowledge it whatever it'll kind of move them through a process to the next step we have a sales pipeline so if you're looking to track people or attract organizations through a sales pipeline to close that deal and get that relationship to get jobs to fill we have that and then we also have a candidate pipeline as well for tracking candidates being interviewed for a job. So are we inputting all of the people or do you guys have a database like LOXO? We don't have a database. So we are just an empty database. You would need to provide the data from wherever you got it from. If you happen to have a spreadsheet of data, that can be imported in. We can pull it. You can pull people in from LinkedIn, Dice, Indeed, kind of one-off to pull them in. You can parse resumes. You can mass parse resumes. If you happen to have a large folder of resumes you can mass parse those all in too and you can even hook this to your website so that you could have a place where candidates can apply to jobs or even just submit their information in general to your to your database right from there I see okay okay and then we also interface with like zoom info so if you wanted if you had zoom info account you could search and mass upload people from zoom info as well so a few different ways you could do that yeah okay let me show you around a little bit I'm gonna hop into our latest version of PC Recruiter here. Let me share my screen. Jump in if you have questions too and I think when we spoke the other day you were you have a half hour slot today so I'm going to try and keep it to a half hour. Get as much as we can in that half hour. Okay do you see my screen all right? Yep. Perfect perfect. So I'm going to go ahead and get myself signed in. So this is kind of our landing page. This is all cloud-based. It's going to be something you can run on a PC or a Mac. Everything's in the cloud. We have a mobile app so a lot of different ways that you can access the system here you're basically going to work within this dashboard you can set this dashboard off this is going to kind of be basically what's going on you have the ability to configure this and put some different stats in there so you can kind of look at various candidates working with recently modified records you can look at new pending or open jobs you can look at new names entered so this will give you some kind of very light information about what's going on in your database in addition this full analytics reporting to this is just your landing page when you log in down the left hand side of the screen you're going to notice a menu and this is going to get get you to the different various portions of the database so of course we're going to have three primary record types and those are going to be names companies positions so those are going to be the three records that we work with so names are going to be your candidates your contacts any person who has a record in the system companies are going to be the client companies you're working with or you in companies your marketing toward and then positions the jobs you're looking to fill so those are going to be our three primary record types within PC recruiter they're all interrelated and cross-reference so a person if you know what company they work with they can be connected to that company obviously the positions connect with the company that's with and then the names or candidates could be connected to the position through a pipeline so you can track what stage they are in their interview process there you're also going to have roll-ups that's a list essentially roll-ups are lists within PC recruiters you're going to have the ability to build lists in the system you can mass email those you can set up email sequences drip campaigns you can apply all of those to a roll-up list take a look at them and then daily schedule merely a calendar that you can work through. You can schedule meetings, phone calls, follow-ups. It'll sync with an Outlook calendar too. And then we have our deals workflow. That's going to be more your sales pipeline. If you're looking to attract people, there's a custom sales pipeline there. And then all of your... What does that mean? Oh, let me take a look. What does sales pipeline mean? So sales pipeline, what you can do is if I go to my deals workflow, I'm going to be able to put little cards in here of any company that I'm working with, whether they're qualified, have I contacted them do they need assessment did I send a contract did they sign the contract did I win or lose the deal so I'm going to be able to track these are maybe the companies that I'm trying to earn their business so I'm able to kind of add these deals in here so I can kind of move them through so maybe contracts that maybe Vandele signed I can drag them over there so I can kind of move them through you can also forecast through this you can put kind of like see some of them have a are they warm are they cold you can put a ratio like how strong you think it is that they'll close or anything like that assign values to the deal as well so gives you a little forecasting there so this is going to be one side of that tracking piece so you're going to be able to see everybody you're working with all the deals you're working with but you're also going to have positions in the system so I'm going to be able to have here's a list of the last number of positions I looked at so I could see this radio radiological control tech with the Iowa National Laboratory if I go into that position record it's going to slide right in I can set up a custom screen here that I have the ability to put whatever fields I want maybe I have my description basic fields there but I'm also going to have a pipeline of people so this pipeline of people is going to be everyone who I'm considering for this job and you have the ability to rename these steps and stages call them whatever you'd like so you can kind of take and move them through this process very easily so maybe if if maybe I contacted Marc Merrill I can drag and drop him right to contacted and maybe Hassan Sophie I sent a hiring manager for review, I can drag and drop him right over there. I could even actually select his name, and I could even send a presentation right from here. So I can actually create a custom presentation containing his resume, maybe his LinkedIn summary, any other attachments I might have on him. I can email that right out of the system to my client, let them review it, and then they can provide me feedback. So a lot of things I can do to kind of track my process here, kind of who is where in the process, all the way up to whether they're hired. We can handle permanent and temporary placements in the system. So we can handle all those. And another nice thing about this pipeline, every time you drag and drop someone from one stage to the next, there's going to be an activity made that is reportable. So I'm able to go into my analytics dashboard here, and I can build my own custom analytics. So maybe I want to look at pipeline activity. And in this report, I've only chose to put in first interviews, second interviews, and phone screens. But you could put in every interview step you have, and you're going to be able to look at different time periods. So I could look at this quarter, last month, this week. I like to do a bigger one for the demo here, last year, because it shows a little bit more data. And then I can go down and see exactly who the four second interviews were that I had in January of last year. I could see who they were, what job. I can jump into their records if I needed to. or I can up here split this up by what job I was working or what client or even what employee so I can kind of divvy it up by recruiter to see who's doing what within my specific time frame okay so full reporting you can even do stuff like like business development you can decide whatever activities constitute business development and that might be cold calls reference calls names companies and positions added if you happen to use ring central we integrate so you can click the dial and click the text out of PC recruiter using ring central you can also get the activities in there as well for incoming and outgoing so you can kind of build your own activities and your own reports in here to very easily see what's going on or if you go over into the name side of things you can pull up any candidate by name like if Terry Stidham calls I can look up part of his first name part of his last name you see that's these little green chips down there and if I go ahead and search it's going to pull him right up not from here I can edit in line if I needed to update his information if I needed to I could also go and I could maybe contact I could send him an email right from here I could give him a call with RingCentral or I could add an activity to schedule a follow-up maybe even add a searchable note to his record so I'm going to be able to add a lot of data right from here but I'm also going to have a full record for each one of my candidates that's going to slide in from the left the right and that is going to be something where you can put a custom work workspace here so you can put in only the fields you want to see maybe you show the resume in a smaller little window there so you show kind of basic information your most recent activities schedule a follow-up call on Thursday I can see any interview or email I've exchanged with him too that's all collected in the activities here and is Is it really important to have a VO, a VOIP system if you're going to have an ETS? Is that paramount? I mean, we've just been using cell phones. Not required. A lot of people do, but not everybody. If you're not doing a whole lot of high volume, which I think you said you weren't super high volume, a little more specialized. We're exactly in recruitment. Like, we'll make two, three, four places a month kind of thing, you know? Yeah. In that case, you don't need that voice because you're going to have the phone number. You've got it there. Dial it. You don't need to click it now. You can dial it just as easily, and then you can just go in and quickly add an activity. So I can just put in here, called today, spoke with us and such, follow up next week, something like that. I think there's even a way that you can hook your cell phone into PC Recruiter. So when you click that phone, it will dial to your phone. I think that's a little option they have as well. So not imperative, especially if you're not. That's an option. That's cool. I like that. Is that for a for-sure option? I believe it is. I confirm, but I believe it is. Okay. Yeah, because that's a nice feature to do that, because a lot of people do just work on their cell phone. So you're going to be able to do that. We like to text, too. We find that texting works very well in our industry. With that, you would need to ring central to text out of PC Recruiter, We don't have our own texting platform. We run through RingCentral. But I think that if you're in the mobile app, you can text through your phone using the mobile app of PC Recruiter. I believe you can send a text through there without RingCentral because it's going to go from your phone. So mobile app texting would work. And then you're going to be able to kind of – your landing page is your workspace. If you go to details, that's going to show every single field you have. What's cool there, if I want to get to my phone number fields, I just type in phone. It filters them down. Now I'm looking at only phone number fields. So I can very easily kind of filter through all of my fields there. I can store multiple resumes connected if I wish. These resumes are all keyword searchable, so I have the ability to keyword search for every word that I'm looking for in the resume. It's even going to show a highlight showing where each word appears, how many times, all of that. I can look at any other attachments. Those are all searchable too. I could even keyword tag if I needed to do that. So I can actually create different groups of keywords, and I can actually add them out of, let's say, my user-defined codes. I want to click on a few. I can tag them in there as well. So candidate record is very, very configurable. You can put in your own custom fields. So depending on what type of information you want to track in a field, you can put in any field you wish. How difficult is it? So we have Excel spreadsheets with approximately, call it 10,000 candidates. I think that's about right. How hard is that upload? The spreadsheet upload is an included feature, and it's kind of a little mapping utility. So you just go through, you have a roll-up that's created, and then you go through and pull open the Excel spreadsheet, the CSV. And you simply click next to the field in PC Recruiter where you want the specific column in the Excel sheet to go. So first name goes in the first name field and so on. There's up to 20 custom fields. So if you have a field in your CSV that is not in PC Recruiter, you can actually have it created and that whole column of data added to that custom field that's created in the system. So we have to do it. You guys don't do that. Yes, you do it, but with the guidance of the trainer on the first training. So we include the training. So the training is included up front with PC Recruiter. you get 10 hours training the trainer would guide you through it so they don't actually do it but they guide you through it walk you through it share the screen kind of click you through it so you know how to do it again if you need to yeah so that's going to be an easy way to go about that and then you're going to also work within your roll-up lists so the roll-up lists are lists create our lists that you can create so I could go ahead and create lists I can save groups or when I import a spreadsheet it's going to be all on that list so here I have an account manager candidates list right there I can see there's 220 44 people on there so I can go into that list of people open the list I can go through and if I wanted I can kind of toggle through I go to the first candidate or the first person on the list maybe I give them a call then I can just scroll right through to the next person look at his activities give them a call I think even if I go to activities when I go to the next person I'll jump right to their activities so it's going to stick with whatever last navigation you had. So you're able to kind of page through these records, look at the individuals, give them a call, schedule follow-ups, anything like that. And then the roll-ups are also going to give you the capacity to mass email or put them into a sequence so that maybe everyone on this specific roll-up list, as soon as they're added to the list, gets an initial email. And then if they open it, they get a certain email responded back. If they don't acknowledge it in two or four days they might get a different email get the ring central that can even include texts as part of that that drip campaign too so that gives you another include what Oh tax measures yeah you can do text with the ring central piece so the role of lists are pretty flexible and it gives you the ability to group candidates a lot of people use that as a pre pipeline as they're going through of course you're gonna have a calendar that calendar is going to give you ability to schedule calls meetings follow-ups anything like that so I can see the call that's related to a deal so I can jump right into the deal there or if it happens to be related to a name record like there Terry's did and it says what I need to call I can jump right to the name record right from that it's going to pop it up in a new window and then I have my information right from there I can kind of full screen that right there so everything is included in here everything is part of the system it's all cloud-based you're going to have like I said easy searching easy grouping easy sorting reporting and tracking all those analytics if you send the call to a PC recruiter per month it is 115 per user per month that's what one year commitment a two year is 105 or a month to month is 125 and then why 750 to set it up 750 is the one time no matter how many users you are, that's a one-time setup. That includes the setup of your database. That includes 10 hours training with one trainer. Also, an initial qualification call where they kind of go through, help you figure out what you need, what features, what integrations you might want to set up and turn on. What does that mean, setting up your database? Because you guys don't actually put any of the candidates in there. No, we don't populate the data, but we create the database we help you install the capture tool if you wanted to utilize our capture that'll allow you to import from all these different sites here so installation of that hooking it into your website if you want to do that syncing up with your email and your outlook to be able to track emails in PC recruiter if you use ring central we sync it up with that so pretty much all the setup creation of your link and then we help you to populate data if you have spreadsheet or anything like that okay okay so let's write that down 750 please would you say it was if you get like a one-year contract is one hundred five or 115 a one year is 115 per user per month Okay. Okay. Yeah, I mean, if I'm being honest with you, I'm not seeing anything that's terribly exciting. Like what – let me think here. What can PC Recruiter provide us that Excel spreadsheets can't? Biggest thing is probably going to be the mass emailing capability, the searching capability. So if I wanted to go ahead and search through, I wanted to find someone with a certain skill or qualification, I could go through here and I could do an all content search. So searching all content is going to give me Boolean search capabilities. So if I went sales and marketing and I add that, what I'm going to be able to do, I'm going to be able to search my whole database instantly. So all resumes, attachments, notes, whole bunch of different areas here and it's going to give me query matches. I can look at his resume and I can see every word is highlighted or I could look at his notes and I could see the notes I put in there. It found it in his notes several times or I can see kind of where the words are. So it helps you better search than an Excel spreadsheet but it is going to still the basic of creating a group, tracking fields, that is kind of the basic there. All the reporting options are something different over and above that. I mean, reporting helps a little bit, but we use LEMList for our email marketing. It's great and expensive. It's like $75 a month. Basically, you get to email unlimited amounts people. Yeah, I don't know. I'm not seeing like anything super. I don't know. Okay. Okay. All right. Okay, Jim, if you can just send me your like your brochure with the different costs, it will be okay. Okay. I'll pop that over to you. Okay. I'll pop that over to share with you. And then if you have any questions, any further questions, further interest or anything, let me know. And maybe I'll circle back in about a week or so if I have anything just to make sure, follow up. We do appreciate your time, sir. Thank you very much. Certainly. Thank you, Jim. All right. All right. Take care. Thank you both. All right. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1575.134319,
    "salad_processing_time": 182.2407341003418,
    "overall_processing_time": 1575.134319,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hi.  Hi, Mariana.  It's Jim with PC Recruiter.",
    "job_id": "810bf157-efcf-4161-acc6-95eb4ad95cb4",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hi.  Hi, Mariana.  It's Jim with PC Recruiter.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": false,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3052418174036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}