{
  "recording_id": "3053932846036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:04:13.484513Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:04:13",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hey, did you call my cell? I did. Oh, okay, because I hear it downstairs ringing. Oh, that was me. It was charging. I'm going to the feast today, and I'm like, I'm going to charge my phone now. It's like dying. At least it's a nice place. It's not too crazy hot. Yeah. Hold on. What? I don't know. I have to, like, see if Dee replies. Because I know we're going to go tomorrow, and we're talking about going tonight, too. but I don't know. I'll have to see what she says. Quick question for you. This email that you created, this ticket for index, it's got a tygis.com email domain. Is that still correct? Yes, his email won't change until I think September 1st or something like that. Okay. So this is like Tygis branched off and took half of their users, made them into this brand new company that Matt Dion is the head of, but they're the same building, the same people, just splitting billing and splitting it into a whole new ASP. So the next step is to make a copy of Tygis' entire database, copy it over to Index. But we need to get the link created first, but we need to have billing adjusted, like set up with him first. Okay, so I'm doing it now. I just was wondering, I'm like, oh, because we don't go to him. You know what I mean? Yeah, he's with Tygis. It's just the same company. It's just splitting another version. All right. So, famous billing address. Okay, so their number is going to be 8950. 8950? That's their QuickBooks ID. Oh, I thought, because their monthly is 5450. so I was okay so there's that part okay so now I'm gonna do where's the invoice now that's the Linda Bailey wow I'm like reading this thing I'm like what that like did she not do a demo like we did a whole demo for like an hour and a half on the phone because that was the call that was my first day back from vacation and Patsy was she's like what the heck was that because it took almost two hours and we were talking we demoed everything and then she's asking the same question she just asked I said what she doesn't know what she demoed she's like what am I gonna see this but she got hit on the head and she's a little bit wonky but like what's her I feel like spending a contract it's always something with her she's always always like oh I had this accident or this happened or it's always something with her. Well, I almost feel bad getting into a contract with her because she's clearly not right in the head. Did you see her email, like all the attachments that when she emails? Go into ticket 102-315. I was in it and I saw. Look at like her reply back. It's got 1, 2, 3, 4, 5, 10, 14, 15, 16, 17, 18, 19 image attachments. What are they? I don't know. One is a picture of her head. Oh, one is a picture of earrings? Like zooming. Like what the fuck is this? Oh yeah, earrings. She's strange. But she's asking about all this stuff that has nothing to do with her. upgrade. One is a picture of her office with the ceiling on the floor. Ring Central, Canley, Perplexity, or ChatGPT. Lucia. I didn't see Lucia. She needs to explain more to her, I think. We're going to have to have a whole other call. I don't know why she's mentioning all these other things. Those things, you've got to sign up and pay them. ChatGPT doesn't have anything to do with us. Neither does Lucia, she's a little wonky there. Oh, and so now that you have this deal, you could put it on our fancy spreadsheet. I can. Oh, I didn't even put it on there yet. I didn't even put it on. Did I? No, I didn't. Maybe you're waiting until it gets paid. I think I was. I always wait until it gets paid to throw it on. Which makes sense. What even is her company? Medical Recruiters. Yeah. I've got to talk to her, and we've got to have a whole other call, and she's confused. This is an enterprise ASP installation. What's the setup fee? No setup fee because they get no training. Because there's no training, there's no anything. There's no setup. it's just they'll have to start paying their 14 users at $54.50 which is $7.63 a month so they'll have to start paying that now the first month okay so should I just do a recurring to start on the 15th of each month that's reasonable yeah okay so I'm going to do new okay so yeah I'm looking at him like I don't see but he didn't really open the agreement yeah okay so should I say started on the 15th or should I started on the first realistically what do you think let's start it on the how about 20th can we do that is that a thing yeah and it won't have your price warning us enterprise package 14 users $54.50 per month, $7.63. He's in Williamsburg, Virginia, so it's out-of-state taxes. Okay, and then we will start at $8.20. The next one, say, is that Wednesday? Whatever that is. that's the day I will be out and then you have to send that to him so he can set himself up a card to get it on right okay so then once that happens should I do should I do one invoice for now and have this one start August 20th yeah because then we can at least have him pay that invoice with the card he wants to get on file and then we can go from there. And then just push the next one out a little bit. Yeah. All right. Let me do this. I'm going to create the template. And then I'm going to use the template with today's date and do upon receipt. 14 users, 5450, 763 total. Okay. save and close and then there's one invoice now dated today and then their next one we will do starting in September on the 20th that sounds better that does and then how can I know when that's in so I can get the install take it in well I'll still be running the mornings it's just Wednesday I'm gonna come okay I'll still add a task cool and it should be at some point Monday Tuesday I would have been to pay yeah ticket 102 okay check of A15 employees paid okay I don't know how Patsy ever did it without this little reminder thing okay 102-350 that's the ticket number okay 89-50 right let me put that over there Okay. Alrighty. It should be sent. Let's see if he's viewed it even. Never know. Some people are really quick on the view there. Now, does anything change with this tigis? Yes. I have to talk to Tygis because Tygis is going to be reduced by 14 users. But I don't know exactly what, because what Tygis is wonky, they pay a lower fee per user, but a portal fee for only some of their users. So what I did was I made, since I wrote this new contract for Enterprise, which includes portal, I did their fee plus the portal fee. That's what comprises the 50 for 50. so I just feel like an intersect well can you just keep it simple and just call it enterprise and they can do portal or PCR mail because PCR mail really should be charged more than the other almost because then you're storing all this yeah well well the tightest is under a weird old agreement and they only have 11 portals so I have to see how many of their users that are left are using portal index doesn't matter because they all have it it's part of their enterprise but I have to talk to tightest to see how many portals they need to be and they're going to be 27 minus 14 users, so I'll talk to them and put a ticket to get that change made too. Can you just say, we just do Premium Pro or Enterprise, whatever they're called, and just say this is what we can do? Well, they're not signing the agreement. They're on their old agreement. Gotcha. Yeah, they're on an old, like, antiquated, weird agreement that charges everything a la cart so as a result I don't want to harass them to sign into agreement so we're just gonna I have to talk to them a few so that's going to adjust at some point but I'll put a ticket I want to talk with them but along those lines I have yet another question I have that you sent it to me let me see who it is it's the heiress partners Carlisle Colin they have that weird wonky a la carte nonsense of an invoice they were paying like 4950 user and separate for portal and separate for dashboard and separate for extensions oh yeah it was that the one they want to know what things were for yeah so I had a call the other day explained what everything was and demoed all the premium features because they actually could have increased their price by a nickel per user per month and gone full premium but instead they reverse course and said oh no no no we don't want any of that we don't use that we don't bulk email we don't sequence for small batch we actually want to drop the web extensions and the dashboard so they want to go to just two users at 4950 plus 2495 per user per month would you would it be most appropriate to put in a ticket just to drop those features and then drop them from the billing or should we set up set a brand new agreement for them but it's kind of wonky a la carte anyway I thought well how much is enterprise anyway 95 is it no let me look at them so they they don't actually only want the portal just so they didn't want oh no they did want to keep the portal so they want to have PC recruiter and the portal but not dashboard and not web extensions what do they call that one you guys calling that one the basics not a no this pro doesn't have portal so that would be enterprise but it wouldn't be I don't think pros a good name for that that's like don't be sick not probably bare bones so I don't I don't I don't know if we need a new agreement because it's not going to be an easy agreement because they're not going with a package I think maybe I just put in a ticket to accounting to drop like a meant addendums or whatever no I don't do it I don't we don't do those anymore we'd have to do an a la carte agreement so it would be essentially pro plus portal okay but I think they'd rather not sign a new agreement just because they're plugging along they're not going anywhere they're happy yeah I don't know what's their invoice look like now let me see and they're on an old tiered pricing which they wouldn't get because that's I don't even honestly I don't even know how to make a new agreement with tiered pricing Yeah, right now, what does their invoice look like? It's a whole mess of confusing line items. ASP, software portal. It's really just taking two lines off, and then plus adjusted PPI. it's really just taking two not two off yep yeah just taking those two lines off do you want me to just do that now their next invoice is i just don't know like just adjust my sql i guess uh the next invoice is september 2nd yeah if you could drop those lines off then i'll just put in a ticket that says they drop these features to have mac take them off but they're not even using them so they're not going to work software dashboard that's analytics somehow they had analytics called the dashboard at 50 a month. That's not even listed on their client contract type. And I don't know if we could really take off job board. Yeah, I guess. Well, we don't have to charge for it because they're not using it. I don't think we can turn it off. They don't have one set up, so they're not using it. Okay. So here's what you want me to do. Delete dashboard. Delete web extension. Just software portal two and two, right? Yeah, the software and the portal, 2 and 2, and that's what we'll make it be. And it's $24.95 a person for portal? Yep. This was old MRI pricing from 2011. and so they're 4950 per user and 2495 for portal okay so 4950 right two for 4952 for 2495 that's it And I don't think, we can't turn off the web extensions in their system, can we? It's just a setting, like use it yes or no, but it's nothing that they can't find and do it themselves anyway. So it's kind of like, what's the point? Well, I'm just going to, they're not using it. I'm just going to let it be just to not confuse Mackenzie. So I'm just going to throw in kind of a ticket to get the analytics out of there. Okay. So that's all adjusted. Their next one will be good, and they're all happy. So they're thrilled with PC Recruiter. They love it. They just don't want all that stuff. I'm like, all right. Okay. So their total is $148.90. Sound right? Yeah. And then the PPI increase? Would be less. It's $148.90. An extra $6. They're out of state. Okay. suggested thank you Robert that was a mess okay and then this was said 24.95 it's portal right yeah 2495 yep and that bill just went up I know never mind I must fix that already so there total with the PPI is one I guess we should do it without that one 4890 Okay. All right. That is done. Awesome. I think that's all I have. Yeah, that's all I had. That was Robin related. All right. Well, I will remember you're in and out next week. We have first day of school next Monday. And we have one middle school and one elementary school now. I can't believe he's going to be middle school already. That is insane. Yeah. Sixth grade. I remember when he was a baby. How do you go in bulk action? Send a reminder. not no oh where do I always find this I'm always like where is this I want to manage no send a reminder send a reminder here it is okay I don't recall seeing that that's a Converse resources.com, right? Yeah. That's what we got. Just so that they are still thinking through what they want to do here. Who? Whoever. Oh, Kathleen at Midland. Well, let them decide what they're thinking, what they want to do. There's nothing to do until they decide. Right now they have a contract. I don't know. Brian came to Midland. They're always goofy over there. Brian came. Was that Midland or Marvel Consultants? Oh, Marvel, yeah. Yeah, they're like, why this person signed it? This kind of question is on your own side. We don't know. Yeah, they contacted me and started telling me a little. They're like, wait, wait, wait. We're working with Brian Kane. We don't need to get you involved in this. I said, you sure don't. He looks so thin. Yeah, he does. I like saw him at Jared's funeral and I'm like oh my god you're so tiny he was just 15 pounds ago apparently he was even thinner wow he put 15 back on at least my daughter is kind of named after his wife Isn't that funny? Kind of. I knew of her when I was younger. And I said to her one time, I said, you know, if I ever married Daniel, I think if I had a daughter, I'd name her Marisa. Doesn't that sound pretty? Marisa Montoni. She looks like she does sound pretty good. Let's see. I'll talk to Linda Bailey. And then what is, do you know what's going on with CJ Owens? Oh, I can't keep my head straight. Let me see. C.J. Owens. Why send me an email asking me to contact C.J. Owens and confirm that the software trainings are the LMS, not live training? He requested Robin enter a new user ticket due to the screwy way we're billing them. Like, I don't know what that means. First of all, it's Jim Wise. Like, why is he still doing work for no money? I don't get it. He volunteers. But he emails me and I think I made a ticket and I signed it to Davisha and I said you need to just make a ticket because I'm not really supposed to be touching those anymore. They were taken away. They're boring anyway. They don't want me wasting time on that. You know more things than Davisha knows. So I get that. This is an old training ticket. What am I even in? Oh, Jason's doing something about talk to see. Oh, they had an hour of training left. And they added additional users. They were adjusted to five users on 8-13. Oh, this must be the one that Nick got pissed about. That's to be pissed about adjusting users. She notified me and said, do you want to finish this one? It looks like you guys have it handled. I don't want to confuse them with people sending them multiple emails. Jim Wise, can you make sure it's billed for this person under Senate employment? They'll make six people billed to CJ, the other three are billed to. They have to count there as six and three. but then he gave me a wrong number than what it really is. And I guess I'm going to guess this is the one that she was already having her response composed. I don't know when you're working. I still want to leave it lingering, you know. It's handled. I think we just adjusted the billing. I think that one was weird. He asked for six, but it already said five. There's six and three is what it is, I believe. Let me make sure on that. So is there really any reason I would ever need to talk to him at all? With who? C.J. Owens. oh yeah I see he talked to Tyler about training yeah I don't need to talk to him about he's already working with them and talking to Tyler and you oh no you were a while ago I was pretty talk to Tyler today yeah and sending it to Jason because there was like an hour ticket that they had left okay so he's all good I'll just squeak that right out of my queue uh-uh no please put those in the other room no she's hauling all the couch pillows into the dining room next to me and building a bunker in the corner and she's already got four over here and she brought four more i'm And what is Cain even sending me? Just a heads up, they are still thinking through what they want to do here. Here's the updated information. Do they need a contract? They're still thinking about it. They're not getting anything until they make a decision, right? Yeah, I guess. I don't even remember what it was. I just remember it hurt my head even thinking about it. And I was like, ugh. Oh, there was one more thing that I had for you. Hmm. There was a – who was I talking to? I was talking to a customer and they had some old, oh, it was Josh, Josh Hirequest. What's his name? Basically, this guy, he's got a PCRM trial going, Josh May of HireStrong. HireStrong is an SRA office. he is going to do the PCRM upgrade, but he doesn't want to pay the setup because he thinks he has training left. And it looks like he did because two years ago when he bought, he never got a hold of us to do consultancy or have the training. So he wasn't using, but he talked with us and us, you and me, and there was James, there was Lam, there was Mazzoni. We were all talking, but we decided we were going to hold it for him and honor it for whenever he decided to start using again, which is now. And even recently, it was six or eight months ago, James was like, yeah, we'll still hold it and make it available for him because he never used it. But he told us ahead of time his team didn't like nine. They were waiting on ten. And it took us an eternity to actually release it. So how much would we still honor him? What do you say? Did you see the ticket? it's not really up to me. It's all Nick's position, I would assume. Okay, Nick has nothing to do with this. It looks like you would be doing the training. It's assigned to you. If it's nine, I don't even know if I'm the best person to do it, to be honest. Oh, you mean PCRM? Yeah, I don't know if I'm the best person to do them. I have not been in there enough to... I know Jason's been training it a lot. You know what I mean? Jason and Garrett are probably better at training time. maybe I'll say see what Nick like would give him just say hey give him something what do you think and let him figure it out I just didn't know if you remembered or knew anything I kind of remember oh like you kind of we were chasing him down and like yeah he was like waiting for time and just kind of forget about it tickets probably let me find it I'll talk to Nick about it see what he thinks we should do I don't have any say so I mean I don't care if he gets his training I just I just want to see what we feel. I don't really care one way or the other. Especially the SRA office, too. That's another thing. Set up a free trial of 30. Wait, what? Free trial of PCRM. Why are they getting a free trial, though? No, he was trialing PCRM for a while. He's going to buy it, though, now. He was trying to do a beta trial of 10, and it carried over until M was released. And then he finally was doing that too. I see. Ticket is 731-64. That's Josh May? Yeah. Great. Okay. Well, that's all the things I have, Robin. I'm all good for now. Do you have anything else for me? I think that's it. I wonder if this was supposed to be the Chris Land and then after he left, maybe he got reassigned to me? I think it did, because it was originally Mazzoni. So it's from the gamut. Then he really waited a long time. Oh, yeah. It's been two years, maybe more. Has he been paying? Yeah, paid all along. Wow. Did he even use the other database at all? no he was paying and not using for a good long time oh but definitely give it to him i would say yeah i'll tell nick we're giving him some what do you think because we should give him some and he's sra and he's thinking about having a user and yeah i would just turn it by next because because all righty he just might give it to um garrett or jason though because they've been spending a lot more time and yeah they've been doing more trainings and stuff and um and i just really haven't been in there that much yeah i get it i told bill this morning i mean he's like you know i gotta get the sales up or when i go you gotta we gotta sell more you know some about M came up I'll be honest I'm not a huge fan of the design it's hard on my old eyes it needs more contrast the font needs to be a little bit bigger less space around it I kind of thought so too there's one little spot where you can click on to get to a record You know, for the people that are saying it's very, you know, too many clicks, I feel like it's even more clicks to do stuff. So, I don't know. I mean, not far off. I just think it's little tweaks. You know what I mean? Yeah. It could use a little work, a little nuance. Like, I'm just so used to, like, click on the name, pops up the name. Click on the company, pops up the company. And you can't do that. you have click that little circle unless I'm missing something but I also just have like you know very old habits that are I don't even think how I do it I just do it so sometimes the worst people to train are the ones that know a lot you know I've just like click click click here and having to be too deliberate like okay where am i clicking oh why am i clicking there all right so to confirm they will not need anything sent okay so we don't really know so we don't really care yet on that one I did reply I said I've created your first invoice dated 8-15-25-5 comes from billing at mainsequence.net. I've scheduled your recurring to process on the 20th of each month starting 9-20-25. Yay! And let me see. Do they pay? I don't know. That's just for me. I'm going to get out of there. Index. Okay. Okay. All right. Let me go. I've got to call one more person. Okay, Robin. I'm all done. Thank you. All right. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1617.577185,
    "salad_processing_time": 163.16517543792725,
    "overall_processing_time": 1617.577185,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hey, did you call my cell? I did.  Oh, okay, because I hear it downstairs ringing.  Oh, that was me.",
    "job_id": "325457eb-c514-43cf-a495-c02d45472367",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hey, did you call my cell? I did.  Oh, okay, because I hear it downstairs ringing.  Oh, that was me.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "billing",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": false,
      "solution_offered": false,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3053932846036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}