{
  "recording_id": "3058906050037",
  "version": "2.0",
  "timestamp": "2025-09-21T23:07:34.636222Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:07:34",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " welcome to zoom enter your meeting enter your participant IDs you are in the meeting now there is one other participant in the meeting Hello, Drew. Hello, Jim. It's just you and me, none of them yet. None of them yet. But we were, you and I were both a minute or so early, so. Yeah. Yeah, yeah, yeah. Just working on PCR-emifying the website content, trying to, like, replace screenshots and things like that. it looked pretty much so when I looked at it last week. Yeah, it's getting there. Now I'm kind of like the homepage got done, but now I'm into the sub pages, things about features, stuff like that. There's just a lot of old, old, incomplete, outdated, old screenshots. So it needs to be done. Get the courier off of that. Get the courier off of that. God, thank God that's not up there anymore. But there definitely are things up there that don't need to be there anymore. I mean, mostly it's just a matter of all the old PCR screenshots that are not necessary or things that we didn't have a screenshot of before that we had a thing there, but there was no picture because it wasn't attractive. of um so i mean there's a lot of videos of pcr9 up there still but that's okay as long as there's something so i'm just trying to get it ready i mean the deals and all that stuff isn't in there yet so that'll have to find a spot as well you know just sort of but i'm kind of there's somebody hello hello hi how are you all right how are you well thank you good we're just waiting on everybody I'm sorry you're the only one so far from your end joining we're just waiting on everybody else I don't know who else I see that I guess we're still waiting on Heidi and Karen okay no worries Thank you. Hey, guys, sorry, I was just cutting off another meeting. I'm here. Sorry. I'm here. Excellent. Hello, everyone. Excellent. Hello, everyone. I guess we're doing cameras off. Cameras on? I don't know. No, I don't have my camera on. I always have mine off by default because I'm usually taking notes or sharing screens. And I don't think I have a working one at this desk. So we'll just have to look at you guys and be awkward. We can keep ours off if you want. That's fine. It's fine if you don't mind. I don't mind. I need to have mine on, otherwise I'll get distracted and multitask. Maybe I can get mine up and running here. I use my, my, I'm on a desktop, so, and it doesn't have a built-in camera. So I use my, I have an app that lets me use my iPhone as a webcam. Sometimes it works and sometimes it doesn't. So let me see. if it functions or not. It's okay, Drew. Hey, there it is. Yeah, hold on. Now I just need to find a place to set the phone where it won't fall over. I'll get there. But yeah, don't hold up on my behalf. Yeah, so yeah, want to show your own PCRM a little bit. And I don't know, have any of you seen PCRM? Have you looked at it? at all or is this the first time? I have. I have. Drew showed me around a little bit. Okay. We're going to kind of go through here and show you around a little bit. I'll get us started. Drew might have a different viewpoint of it or maybe he shows different things or stresses different things, so I'll kind of include him as well as we look at this. And, Drew, if you want to jump in or want to stress something or think of a better way or anything at all, just let me know. Sure. No problem. I don't know about anybody else, but I just froze. Did anyone else freeze? No. No? Nope. We can still see you. Did your screen freeze up? Yeah, everything froze, and I can't even find my mouse. So I don't know if you guys – I turned on the camera. I broke everything. Oh, you are frozen, Tara. Yeah. Are you sharing anything? Because I can't see anything, and I can't find my mouse. I just shared my – Can you kick me out? Can someone kick me out so I can maybe come back in? Sure. Yeah. Can I put you in the waiting room? Because I can't even use my mouse. What's that? I'm going to kick out. I've never kicked out. I don't know. I think if you go to the participants list, there's probably an option there. Yeah, because I can't even move my mouse. It's just completely the whole computer just went. Okay. I sent her to the waiting room. So that kicked her out of the waiting room. She's gone. So she is gone. So we'll see if that worked. I've never had to kick anyone out before. That's a good thing. There's always a first time for everything, I guess. We'll give her a second to kind of get logged in again, see if we can get her in. It's always something. Well, since Karen, just to, you know, not hold up the demo, if you don't already take a look around on PCR10, you can show Heidi and myself. Perfect. Yeah, I can get started. She can join in when she gets in. Excellent, excellent. So, yeah, so PC Recruiter. So PC Recruiter 10 is PCRM. So it has become kind of, it is one in the same. And originally it was conceived as it was going to be a full-on replacement of PC Recruiter. So the PCR9, which is the PC Recruiter that you know and love, that was going to be replaced with PCR10, but what happened is this development dragged on and they added new features and new functions. Early this year, it was decided that they were going to launch it as kind of a separate product called PCRM. So like CRM, like Contact Relationship Management, but PCRM because it's PC Recruiter. So PCRM is how we arrived at that name. And it is a different interface, but it shares the same database. So what's nice is you can turn it on and use it, set it up. You could have half of your users using PCRecruiter9 and half using PCRM. Since it shares the same database, all the integrations work, same username, same password, real-time data updates, so it allows you to have two different ways of accessing the system, but you're sharing one database and data is updated real-time. It's also going to include just about everything that the PC Recruiter 9 has, only a new interface, a little bit easier to use, a little bit more modern. So I'm going to log in and kind of take a look around here, and if you have any questions as we go, let me know. Just kind of jump right in. Jim, is it possible that you can turn up your mic volume a little bit? I'm having a little bit of difficulty hearing you. I don't know. Let me. I'll turn it up as high as it goes. I don't know how my mic actually even is volume. Like, I don't know how to do it, actually. I never do. But my speaker's set up as high as it goes. I moved it up closer to my mouth, if that helps a little at all. It's a little better, yes. Okay. Okay, yeah. So the PCRM. So the PCRM product, what we've done, it's a new design, and rather than a top and bottom layout, we've kind of made it go left to right. So we moved the menu bar down to the left-hand side of the screen, and that is a lot of terminology that you're quite familiar with, some that you won't be, but essentially this is going to be the main navigation of PCRM. of the PCR app. The dashboard, this is kind of like your MyPCR. This is still going to be configurable. It gives you some different widgets up at the top. You can put in like a video screen or if you want to put in all names on position by latest activity or a whole bunch of different things you see you have up here. You can kind of go through and just drag and drop them right on through. I can put my schedule there if I want. So you have the ability to just drag things, move them wherever you wish and kind of design it on your own. A lot of the system is drag-and-drop and kind of picking widgets from various different places. So once you're in here, the menu bar down the left is still going to be the names, the companies, the positions, that's going to be just the same. And you also notice things like roll-ups, schedule, sequencing, activities. So a lot of the same functionality, but what we've done is we've redesigned how it works. So if you go into names for example that's going to give you our new names screen and that's going to show your most recently viewed records right here. We've added a couple of new things right to this front screen as it is so if you're looking at your list of most recently viewed names you can edit in line now so that's going to kind of be cool you can pick and choose what fields are shown here as well you can sort by and lock certain fields as you scroll sideways you can have certain fields locked or pinned if you want as well which is kind of nice and convenient. You're also going to have some actions which are going to be able to be done right from here. So I can actually contact a person. I can send them an email or call or text through RingCentral right from the screen here. Or I can add an activity or a note or put them on a roll-up list right from the front screen here. So your actions kind of add some new things to be able to do right from there. And then if I click into a specific record, like I click into Terry's record, you click the small photo, the name icon there, that's going to open up the The record is going to slide in from the right-hand side of the screen. And I'm just going to maximize this here. So this is going to give me my record in PC Recruiter, my name records, and incidentally, name records, company records, position records, they all look and work the same. So if you know how to configure one, you know how to configure them all. We've kind of tried to keep the similarity throughout the database there. And essentially, a lot of these elements here, like your attachments, your keywords, your notes, notes they're all going to be the same things that you're used to in pc recruiter but we have added a workspace and the workspace is going to be a configurable workspace you kind of start blank and add whatever you want on here so you can design your workspace to show the main fields that you're concerned with maybe you show a resume maybe you put activities really only what you want to see straight out of the gate each time then your details tab is going to be every field you have on the person so this is every single other field maybe that you don't show on the front screen something i like about this maybe i want to get into phone fields i just type in phone right there and it's going to show me here's only the phone fields i'm looking at or if i look at email i can type an email now it's going to isolate it down to all the email fields so it's going to give me can i ask you a quick question yeah the workspace one on the workspace uh the first one Can we set that so it's the same for everybody? Because, Liz, we could put the requirements that we want filled out on that first workspace page so that they can't change it. We want these particular fields filled out in this view. To my knowledge, you can. I believe you can. Drew, do you know any reason you wouldn't be able to? I think you just copy the screen format. I just don't want anyone else to be able to change it. Yeah, I'm not 100% certain how that works in PCRM either, Jim. I'd have to ask whether there's a preference that disables the – because I know you should be able to duplicate the layout to everybody. It's a question of whether there's an option to disable their ability to edit their own. It may run off the same preference that it does in PCR9. I'm not 100% sure. I think so. That was my hypothesis, too. It would stand to reason that it would run off that same, but we'll have to make sure. see if you can lock it and make it the same copy but yeah yes you can kind of cut that up and I would imagine if you lock it it would just disable the little edit pencil which is where you kind of pick what you want so I would imagine you can't we'll confirm I'll note that we want to check on that yeah and then your other options here a cool thing you can do is maybe I want resume to be right next to details I can go over here in the drop-down and I could just drag it right up there it'll snap over real time so it's a little bit easier to configure this system show things wherever you want to show them and some cool things in the resume you can have as many tabs as you wish you can just add another one name is specifically formatted resume and they'll just line up along the top there your activities have easier sorting and searching so I can sort by username right there I can start by date entered I can look at only last seven days so I can kind of toggle through and sort through my activities a little bit easier as well and one other cool thing on keywords you can actually still apply your keywords from the various different groups these skills specialty equipment education user-defined those are very much the same but what you now can do is you can right-click and you can actually tag right up in the main menu bar so I can go up here like I have principal systems engineer you can put up to three tags right up in that main menu bar the kind to stress what sort of experience that that candidate has right there okay so like I said a lot of it same terminology just looks a little different question what question Jim can you show us the blinded resume how that works you're the boy you have to create it the system doesn't do it you have you have created it yeah you'd have to create it okay yeah I think by default you're always going to have resume and blinded when you click blinded if you don't have one you have to take out the contact information however much you wish then save it then once you have a binded it's always going to show up there as the second okay except the tab over there you can add additional tabs if you want yeah so it doesn't automatically do that because it doesn't automatically know how much you want to blind in there exactly got it so yeah so the name records there they're going to be kind of a lot of similar terminology just a little bit different functionality. The searching is also done through the name, company, and position screens, very similar to how it used to be. And it's cool because as you go through here, maybe I want to type in Jim Lombardo. As I go through, maybe I know he's in Cleveland. It'll just add these little green chips right down here. So you can kind of move them. Can you still add, like, if someone was a hiring authority, is that still an ability to... and have that as like a column next to a name? Oh yeah, the status? Yeah, you could put that in there. So you could actually configure your search screen right there. I can go through and I can go down here and I can pick. Oh, edit, maybe I wanna take a look. You can do it from the add column drop down at the top there, Jim. Yeah. Oh, there we go, there we go. And then status. You can probably type in status. Yeah, you've got it right there. Then I can add it, and then I can move it around where I want it. I don't do much of this type of stuff, so I can figure it out, but I'm not real good at it. But, yeah, so you can move it there. Yeah, yeah, gotcha. So, yeah, you could add anything you want in there, the status, and I don't put it in there. And then you could pin it as well if you want the status to always be there, like the name column is. Okay. There's an option to freeze any columns so that some of them slide and others don't. Yeah, so if I go this way, you froze the status over there to the far left. Interesting. Go back and forth. You can sort by – Can we – I'm sorry. I'm asking too many questions probably. Can we flag if a candidate works for a client in here? well that's usually giving them a status of hiring authority like like ben brown i think what i think what she's talking about is if you've got a candidate who's who works for somebody who's a client but they're not the hiring authority i would imagine like the company is a client the company is a client so is there a way for all people associated with the company name to be flagged as a client you probably have them as employee i would imagine in their status I usually give them points. All right. But I don't think it gives them a little icon or anything here. It just kind of shows them. Yeah. It doesn't flash. I know you guys have done a good job of customizing for us. So just like when we place someone and it has a little place marker, would there be a way for us to create something, a field and a little symbol that says this is a client? I don't know that that does anything like that in PCRM. In 9, I'm trying to remember now. Was it you, Karen, that I did this? It was me. I've been asking this, yeah. I've been asking. It's me. I was like, this rings a bell. Yeah, it probably was us. Yeah. It definitely was me. And I have talked to, I've asked you before if there was a way to do it because we have a real problem with like, um, we can't solicit from any of our clients. We can't solicit any candidates from our clients. Um, we have like, uh, usually up to a year that we can't touch that anyone from that client. And it's really hard not to be able to, you don't want to have to go and look through each person. Do you know what I mean? And if it was in PCR and it was flagged, I'm sorry. Go ahead, Heidi. I was going to say, and to be more specific, I mean, we're associated with CBiz. We implemented CC Recruiter in 2006 the first time. We were Skoda Minati. Main Sequence is a client of ours. And so we've been asking for this and trying to solve this riddle since 2006 because we're associated with the accounting firm. So every candidate that we go and look at, we have to look at cross-reference in a system in CBiz and say, do we do audit or tax work? So I just want to make sure you understand, like, not only do we not recruit out of our search clients, but we also don't recruit out of CBiz clients. Yeah. I don't think they've always been built. No. Yeah. The nine version puts these little employee ID or a little lunch pail if they're placed. So that's kind of giving you that visual indication in the nine version. Did that work for you, or were you looking for something more or different? What is that stop icon indicating above that? That is somebody marked not available. Just like hands off, you don't want to work with them. You put them not available. that gives them a little, like they're not there anymore or something like that. Otherwise, again, yeah, there's icons for placed employee, not available, and I think on contract, yeah, on assignment has the little clocks. The problem with changing it to employee is putting the onus on the recruiters to actually, or whoever, to go in under that company and mark everybody employee, whereas if there was some sort of automation within, And if we say the company like CMEX is a client, anyone who shows up under CMEX as a client, under that name, under that client, would be marked right away, that's a client. You cannot touch them, right? Interesting. I'll make a note of that. I don't know whether there's a way to automate that, but it's… I'm just saying this from the perspective of like the recruiters and maybe the AEs will and will not do or forget to do, right? Because the other thing you can do would be – If it's somehow automated, it would be better. The other thing you can do would be to set employee as the default status when you're putting somebody in so that you would have to manually make them a candidate if you're not typically entering candidates. Yeah, I don't know if that would – I don't think that would work to be honest. I don't know about Heidi and Liz what you think, but – So effectively, though, what we're talking about is if you set the company to client, then anybody who is currently a candidate, because I would imagine anything else under there would stay the same, but if it's candidate, to change it. Yes, to automatically change it to whatever it may be, like whether it says client or it identifies them somehow immediately. You know what I mean? Yeah, just change them to employee if they're… Yeah. I mean, can I set that automation? I don't know if that automation exists. That's why I'm making a note. Because I don't think we have any automations that change the status. Not that I've heard of, ever. Yeah, but it's an interesting question. I'm not sure. Okay. Well, at least put it out there, right? Yeah, for sure. All right. Sorry, I took us off track. I apologize. No, don't worry. Please. Yeah, so you're going to be able to kind of go through and kind of resort what fields are going to show you can sort by field, you even still do now and you didn't at first but you now have the ability to search, like all your fields all content is going to be your Boolean search so if you ever needed to do like a sales and marketing. marketing I can go through here and I can add this query and what that's going to do is when I search it it is going to give me the best match up top like PC recruiter always has it's going to show you in the query matches that it was found in their resume it was found in their notes and was found in their attachments wherever you can even click into that it's going to open it up and highlight the words that found which is a feature that people have really really come to like and expect out of PC recruiter so we did add that in there so you're going to be able to kind of go through and see exactly how they use those words and it's going to rank them kind of the most matches in the most places up top and then clicking into any record very easy you can also page through them just by going right above there's that little circle with their initials or their photo if you happen to happen from LinkedIn you can kind of scroll through tab through each one so you're going to go through the records in that capacity there okay and then nice thing companies in the position they're all going to work the same. So companies you'll notice it looks just the same. So have your actions, your edit, all your searches, all of that. Positions also going to work the same. You're still also going to have your pipeline. Pipeline's still going to look and work just the same within PCRM as it does in PCRecruiter 9. So if you go into a pipeline here, I'm going to be able to open up that pipeline. I can work entirely just as it looks, same exact way. Okay so some things like the pipeline are going to look identical. Also the analytics and the sequencing if you ever use that that too looks totally identical so you're going to be able to see just exactly what you're used to because when this stuff was built the analytics the sequences PCRM was already in development so they kind of built it to match PCRM so that it may have looked a little out of place in PCR 9 but PCRM it's going to be the exact same screens right there. Now, something new we've added. Go ahead. Go ahead. Go ahead. I'm sorry. Oh, I was going to say something new we've added, something totally unique to PCRM is going to be a deals workflow, like a sales pipeline we have added in here. This deals workflow is going to give you the ability to essentially run a position pipeline, but with companies that you might be talking to, marketing toward, whatnot. You're going to have your different statuses. Are they qualified, are they contacted, need assessment, contract sent, contract signed. You will be soon if you can't already customize and change those. You're going to be able to put each card in as a specific deal. So that's one company record and you're also going to have the ability to put in various different activities you might want to do. You can check them off on the checklist. It'll show you how far you are. You can also go through here and mark them cold, hot, warm. You can put a confidence level, potential value, projected close date, some different things within there. So you're gonna be able to track every possible potential deal you're working. You can drag them from one step to the next as you kind of work through. And very soon there's some analytics reporting coming so you can do sales forecasting based off of the information and data and activities found in the sales pipeline. So this was a big new piece that we added, holding module, basically allowing you a company pipeline within PC Recruiter. That is looking very similar to the dashboard that we have for opportunities in Salesforce right now, Heidi. Yeah, this one. Yeah, they put it in a little while ago. So yeah, it's a nice piece. And I think eventually they might send the pipeline a little more looking like this, but this was put in there. So this was a big new piece. We also simplified the sequences too. So if you ever have built sequences in PC Recruiter, you'll find out they work great, they're super flexible, but they sometimes are a little cumbersome to set up. So what we've done is added a simple sequencing part in a roll-up list. So if you go here into a roll-up list, you're going to be able to see all your roll-up lists there, you're going to be able to click in any one of them, and you can actually build a sequence using these little icons right on the fly. So I can actually go ahead and build a sequence in under a minute. I can say I want to make it an automatic email, it's going to go to their primary address, it's going to be this form letter, and I go down here, I'm going to add, maybe next step is going to be a call, manual, and I just hit save all, I can go ahead and activate the sequence right as I create it. So it makes it a little bit easier to build a sequence, i.e. you can do it on the fly, you don't have to go on the back of the system, create it, test it, make sure it works, you just create everything all at once on the fly, launch it right from there, you can even have a column on your roll-up list showing what status they're at, so like a roll-up list stage is kind of replaced by the status. Yeah, the stage. Yes, the stages aren't there, but you can use the roll-up list with the simple sequence. So I have one running there. So instead of stages, you would just have what step they are in the simple sequence. So, but you no longer have the stages where you can set them up like within here and then also like write the activity depending on the stage? Yeah, the roll-up page will remove. So they're not in here. Yeah. The simple sequencing basically replaces all of the functionality of the stages with some additional capabilities. The big difference being that stages were, what's the word I'm looking for? Stages didn't describe any sort of process. I'm sorry. Yeah. Roll-up stages in PCR9 were just sort of this arbitrary, here's a list of icons. Well, you could set it yourself. Right. And in sequences, you can define a flow. So people are moving from this stage to this stage to this stage. And I know when that next step is supposed to happen or what's happened prior. So it's more of a flow management thing versus just I've tagged this person on this list as being at this stage and who knows when that happened or why. So there's more capability to it, but it serves all the same broader functions of stages. It just does it differently. And does it write that activity for you if it's automatic? Yeah, there's still activities. Yeah, each time a move stage happens or stage task gets completed, it writes an activity. And you can also actually set it to write an additional custom activity as well if you need something beyond just sort of the stock one. Okay. Yes, that kind of gives some difference. So, can we see if the job, the position, what the position tab looks like? It is much like the name record. You have a custom workspace and then all of your other details, pipeline, presentations, feedback, all that other stuff. So it can be configured to your loan. Can you present right from here? I think you could, yeah, if you see presentations. Can you add one right from here? Is that what you're referring to, Heidi, the candidate presentation tool? Yeah, I want to see what it looks like. If I was to say, okay, I'm going to send that candidate or any candidate to a client, walk me through that, please. You go to the pipeline, and you would put them in. Let's say I'm going to take Christy and Gary. I go actions, create presentation. And I don't know, it might even be the same looking screen as it is in PCR 9. So that screen. I was going to say, I think currently that's the same as it was in 9. I haven't done this in a while. So we're just getting with our integration with CBiz, kind of getting back into the weeds. I used to be a power user, but now I'm not good at all. Yeah. So you can go through here and create a different template, maybe put a logo at the top like I have. You can pick and choose what fields you want to show, just basic fields for the person. You can go through and show or hide their name and then resume and then additional attachments. So you can check off other attachments you want to show up there and maybe with the LinkedIn profile up top. Then I can go to the next candidate, make sure their current resume is there, checkbox if you have a blinded that'll show. And then I could also pick their other information that I want to show right there. Do you have the AI in here for the summary, if you wanted a summary written for you? We do. It's in here. Can you record the summary? Yeah, I was trying to remember. They just changed that, and I haven't actually seen it yet. I know that the AI – yeah, it's a relatively new thing. The AI summaries can be generated on the fly. I think it happens when you're sending the presentation. You can generate a summary. I forget. Yeah. If you go into the send, does the summary button show up in there? No, I don't. I don't remember where it is. I know that it's been done, but maybe it's not downtown yet because that's a new, this is different than what I'm expecting. It was in the in the candidate record. No, well, because there is one in the candidate record as in here as well. But when you're sending the presentation, there is now, as of very recently, like within the last two weeks, the ability to generate a summary on the fly while doing a presentation versus pulling it from the candidate record. Because you may want to write one that is specific to that role. And I don't know where you trigger it from, but I know that it's there. I would guess if I had to say, it's probably going to show up in the send screen. and it's just not in there. I'm not sure because it would be... per person, not in the email though. Oh, that's right. Yeah. I'd have to look into that one. I know that they added that, but I haven't seen it yet. So maybe it's just not in the, when you do the, when you're doing resume and additional attachments, where do you normally add the little write-up Jim in here? I know that there's a thing where you can do a little write-up in the, in the presentation. I normally would have had it already as an attachment. We'll just check it off of the list here or when I continue this kind of thing in here, that's the only places I've known to write it. Got it. You go ahead doing your thing while you're showing them around. I'm going to see if I can remember where this new feature is because that might be useful to know anyway. It would be because I didn't even know that we were doing that. Yeah. Well, that's why I'm wondering maybe it's been mentioned but isn't off of trunk yet. So I'm looking to see if it's on the development server only. Awesome. That might be the case. So you can also say that Maybe you don't want to allow a PDF download, so that's going to allow you to share but not give, so you're able to share it. They can look at it, but they cannot keep it. You can set the link to expire, kind of allow a star ranking in their feedback form so they can give it one to five stars. You can turn that on or off. And then down here, you can set it up to notify you a couple days before it's going to expire. You can pick who's going to get the email. Is it the position username? Is it anybody else random? You can notify when it's viewed. even change a position or change a step in the pipeline when it's viewed. So maybe you move them from presented to viewed by hiring manager. You could do something like that. And then down here you can get notifications when the feedback is submitted to or move them from a different step. So there's some different things you can do as far as building the Canada presentation. I found it. And then you can go through. You found it. I would love to see what that looks like on this end. And then also I would like to receive a presentation, and maybe, Karen, that's something you can help someone do for me, but I would like to walk that through the whole life cycle because one of two, actually three of the other groups we have, so everyone except Legacy Markham, could potentially be using this depending on how well it presents. Okay. So I would like to do, and Karen, I'm happy for you to do it, but like a mock-up with like the AI write-up, the whole thing, I'd like to receive a presentation. Hey, Jim, I found what I was looking for. If you're editing your presentation template, I think maybe the templates that you're using. Yeah, so you'd have to go under system and edit the template. Okay. You have the ability to do, there's a, so you see how you've got in there sections for resume and additional attachments in the middle there. There's another one you can include there called candidate write-up. And so that will give you the ability to generate an on-the-fly write-up for the candidate when you're sending the presentation. So if you go under presentations, templates, there you go. and then edit whichever one you wanted to use. I don't know which of the ones you were demoing. There's probably that last one. That one, yep. And then add section. Oh, okay. And then click on that and then set it to candidate write-up on the right-hand side there and maybe call it section name summary or something like that. Oh, that's got to be here. Candidate summary. Yeah, just save it. I think this is what they were referring to. Now, if you go back to generating one, you should have the option there. You may be able to just reload the screen. Nope. Didn't like that. Well, you're looking at the blinded presentation with salary template. Grab the, on the left, grab the one that you changed. There you go. So now when you're clicking that, now you can do insert a candidate summary and you can hit that. It will generate something on the fly based on the person's resume. et cetera. Obviously, in this case, Jim doesn't have a resume for this person, so it didn't have much to go on. But it will GPT its way through their resume and try and come up with something to say about them as a starting point. And then you can edit it further. Okay. Yeah. Okay. And there's a little icon. Yeah. There's the icon. And there it is right there. Yeah. So you can either grab the one that's in their name or you can throw one in on the fly. And I think you can You can keep clicking that icon and it will keep coming up with new. Yeah. If you don't like what it did, if you don't like what you see, run it again. Yeah. Yep. So can you guys do a mock up for me so that we can like look at it or. Yeah, I don't see why not. Like you mean like do kind of a basic set up of presentations in the database so you can kind of walk through what it would be like. Heidi, is that what you're looking for? And then see how it actually works? I'm actually just looking for, I guess, yeah, I want to see it. I want to see, I'm more curious to see what it looks like to receive it as a client. Right, I know exactly that's where you're going. Yep. Yeah, I want to see what it looks like on the client side. So, Karen, however you get there, if we have the capability to do this now, I'm okay with you working with Michelle Buchanan or someone to present a candidate to me. That's all I'm looking for. Can I get a trial, you guys, to just try doing that? Or what could I do? Well, I mean, presentations is available in your database already. It's just a matter of setting it up. Right. Because we have it now. It's just not a feature that we have historically used. But how much different is this presentation on PCRM from the presentation that is identical to what we currently have today? Yeah, PCRM, there's no, the presentation tool in PCRM is the same one that there is in PCR9. Okay. It looks or works the same, yeah. All right. All right, well, then that I can work on, Heidi. Okay, that'd be great. And I know you're leaving. I mean, it's not urgent, but it will be incredibly impactful to our longer term goal. Yeah, no, I'll do that as soon as I get back for sure. Okay, awesome. Thanks. For sure. So you can do that. Yeah. Because yeah, we haven't really used that. That's something we haven't taken advantage of. It's a nice piece. It's cool in there. But yeah, that can, so it'll look and work the same, be it no matter which version you're in there. Yeah. Okay, excellent. Thank you. And I also wanted to talk a little bit about the edition, like the record edition within PCRM. That too has been changed quite a bit. Where we used to have the quick add, that little lightning bolt, we now have the add records option. And this is going to give you options to drag files, upload files. Maybe you want to go to add a name. And I like to go to add a name because if I go through and I start putting in records, and I put Drew in there, and then I say, oh, I want to get a company in. I can actually add another company on the fly. I can say ABC company, and then I can actually toggle right back over to Drew, link him to my draft record. So I can essentially create a company and a name record all at once. Maybe I also want to upload another attachment, and then link that to the record that I'm about to create. So I could pull something right in there, upload that file, attach it to someone else. so I can actually add multiple records at once, multiple types of records at once, link them together as I'm adding. I can even check for duplicates on the fly, and I can see if I have any duplicates or not. So that's been improved a little bit there. And there is also, I don't think it's probably not in yours at the moment, but this is what I was telling Karen about as well, there is a big improvement coming to the mass import as well. So this is like I'm adding records on the fly. But the CSV sheet importer is also getting a big update. I haven't seen it yet, but I know that that's the next big thing. I've heard about it. Yeah. So, yeah. And that'll be in here as well. Yeah. So different ways, a little bit easier to import data. And Heidi, did you raise your hand? Did you have a question? No, no. I have a million questions, but I'm good for now. This is bringing me, it's taking me in the way back to seeing you. But yeah, so any questions just in general? That is kind of usually what I show in a general demo of PCRM. Drew, was there anything that I didn't cover that you normally would show? Or did I do a good job? Oh, thank you. Yeah, the only other things I can think of that would be worth noting, the pinning feature is new in here. We've always had in the pipeline where you can pin people in the pipeline and kind of flag records that you're managing. but there's also in PCRM the option to pin a record in, yeah, like that. And you'll see there's a little box in the upper right corner. So names, companies, jobs, any records you need to get to at all times. So if you've got a few people that you're dealing with or a couple of jobs you're currently working and you always want to be able to get back to them in a hurry, you can pin them and they stick in that little box in the upper right corner. Trying to think what else is a big plus. I mean, like Jim said, the big differences in PCRM, aside from the obvious ones you get from looking at it, is consistency. Buttons and things are labeled and look the same throughout the system. It's just a lot easier to pick up. It's more intuitive. And the ability to edit on the fly in the search result list is kind of my favorite feature. To be able to not have to click on the record and then go find the field and open it. I can just hit edit and change stuff while I'm looking at the list of results is really nice. That saves a lot of time. I do have two questions. What's the difference in price from 9 to M? And then also, so as far as like the CRM part of it is different is where you can track the sales stuff. Those are your two biggest. Because I know, Heidi, you were interested in that for any of the AE producers. So the biggest piece of that is where you are tracking the sales and where you can drag and put them into different categories as they're going along, correct? Yeah. Yeah. There's nothing else within like that kind of client tracking that would be a bonus. Yeah, the whole deals pipeline, all of this kind of deals pipeline in here, that's something totally new and the reporting on it that's coming out. Those are probably the biggest pieces that involve that. And then the simple sequencing is something that's only available in PCRM. The PCRM, it is only $10 more per user per month to add, and that would add for everyone. And then you would simply get – what's cool is you get a different link to access the same database. So everyone can have the option to use M or 9 or both, or some sometimes, some the other, or maybe you start using M and eventually you only use M, whatever you want to do. So $10 more per user per month. How do you switch back and forth? Yeah. You can do that. How do you switch back and forth? Like if you wanted to go from 9 to M, back and forth? Just go to your other login link. Yeah. It's a different URL. If I click separate bookmarks. A different person to look at. And then I just go back in. It's going to be the same most recently viewed person. Because if I go to names, it's sharing the name. So it's going to be that Nathan was the most recent I viewed. Yeah. And then it's $3.50 to set it up. That includes four hours training. So 350 one time with four hours training. Of course, if you wanted more training, we could build a little more training into that. The 350 is for like the one, two, five, ten user offices. So if you wanted, we could build a little more. But standard, 350 set up, four hours training, additional 10 bucks per user per month. And we just send a new agreement, which adds the PCRM to you, and it includes the AI suite as well. Okay. All right. I have no more questions. Does anyone else? On PCRM, what does the contractor, like their timesheets and their reporting, what does that look like? I think that's still nine only, if I'm not mistaken. I don't think they've moved anything related to contractors into PCRM just because it's not a widely used feature and they're kind of focusing on the biggest functions first. Oh, so that would be one of the reasons why you would have to flip back and forth. Yeah, there are a handful of things that probably will just remain PCR9 features just because they're built out in there and there's not enough people using them yet that it warranted throwing them in here. Part of the directive in developing PCRM is simplicity. So the less they can complicate it starting off. And contractor modules are probably some of the most complicated things there are in PCR. There's just a lot of moving parts. So that may come eventually. But at the moment, that's one of those things that you would just stay in nine for. Got it. And that's a benefit, too, that you don't upgrade or transition. You simply just gain another option, another logon. Yeah. Yeah. And I've seen a lot of people do it where they've got like, you know, we have a handful of people who are new users or they're just, you know, they're just doing the day-to-day operations and they're using PCRM and then there's one or two kind of admin type folks using the full package that they're used to. So you can kind of put it up however you want. That would be my question. Why would you use, why would you have both? I'm just trying to process that. As a user, or are you asking from our perspective? No, from our perspective. So we have people that touch the client and the candidate. And so what would be the benefit then? And maybe that's what I need to see, like the analytics, like side by side. What does PCR 10 have that PCR 9 doesn't have, and then vice versa, just so we could compare? I think the short answer on that is the main reason is just the UI. PCRM is easier, simpler to navigate around in. It's cleaner. It's easier to add records. There's just improvements to the workflow. Function-wise, the only things I think that it doesn't have that 9 does, and Jim might be able to correct me if I'm wrong, PCRM has the deals, which 9 doesn't have. PCRM is going to have the new importer. I don't know if that's going to make it into 9. PCRM has simple sequencing versus just the full-on sequencing. PCRM is liable to get more new stuff than 9 does just because it's kind of the direction we're heading. 9, the main reason for having both is that there will be some things. First of all, there will be people who are used to using 9 and don't want to start using something different. I mean, people are just kind of familiar with what they're familiar with. We're finding that PCRM is easier for brand new folks to get their heads around compared to 9, just because the UI makes more sense off the top of coming in cold. I think aesthetically it's better. Yeah. Yeah, aesthetically it's better. Workflow-wise, it's not using the frames anymore, where you've got three different parts of the screen all loading independently, the menu at the top, search in the middle, and the thing at the bottom. That also means that if you've got a bigger screen, it makes better use of your screen space, stuff like that. So I think just overall, it's cleaner and nicer, which is why people hopefully will want to use it more. Function-wise, like I said, there's things like the contractor module that probably aren't going to be in here for those who need it, and then they would still need the other version. But I think eventually most things that you could do in PCR9 with a handful of exceptions are already or will be in PCRM. And then it's just primarily a preference of interface. I think that sales piece would be helpful, Heidi, for some of the AEs and producers. The deals workflow? Yeah. Yeah, I think that's also one of the other things that isn't in there yet, but is in the works is the ability to send a DocuSign from there to Liz. I know. Oh, my God. Because there's pipes up right there. We're working on that. DocuSign has been incredibly slow to respond. But we have, I know that the deals piece as it is right now and what Jim's showing is kind of the first iteration. But the things that are coming to it, like Jim said, are the analytics, configuration, and then the ability for it to flag deals as cold or hot, that kind of thing automatically based on the amount of activity that's happening with them. But one of the other big things they're waiting on is this DocuSign integration. I'm not at all sure when that's going to happen, but the ability to take all the details from the deal and convert it into a signable document will be very cool. I think people will like that a lot. Definitely. Yeah. And if we have – this might be a dumb question, but I never take anything for granted. If we have PCR – if we have 9 and 10, they talk to each other, right? Real time. Yeah. Same database. So real time. They're both two websites hitting the same data under the hood, so it's instantaneous. I don't know. I think I still need to understand. I don't know that I'm as excited about it. I mean, just to be candid, I don't know that I'm as excited about it as I was before we got on, like the business case for us having both. because most people that we, this is how we are today. It doesn't mean it'll be like this going forward, but most people that we have on our team today touch the client and the candidate. And for that reason, I think PCR 9 makes the most sense. There are maybe things in PCR 9 that we could be doing that leveraging that we're not leveraging today. We have expanded our team, but I just, I don't know. I would need to see some sort of a comparison to see why I would do it. I think what would help also is for those that are in business development, how does PCR – what are the features that are enhanced for business development? And then we have our recruiters. What are the enhanced features for the recruiters that we currently don't have today? So for those that are doing, as Heidi said, dual roles, their overall benefit versus what we have today, that would definitely. I mean, we see this here, but I didn't even know we had the presentation feature in our existing PCR. And I'm here clicking around. I'm like, how do I get it to look like that? Yeah. I'm really curious about that. So if you could show us what those features are, those enhanced features that would help us, you know, sell this PCRM to our users, that will be beneficial. Or maybe it's just a case that we... I'm sorry. Because I like the layout. It definitely looks a lot cleaner than what we currently have. But apart from that, I do see some user-friendly features. But for business development, because it was mentioned, Heidi, it was mentioned that PCR is more, it's not like, I was checking my notes to find I think Palema said it it's PCR is not for business development as much as it is for candidates it's not a project management software we're not seeing it in 10 either there you go so are there features in here where you can manage a project or a position? I don't know, Drew. Do we really have any project management? Not really. Well, when they say project, it would be the position. So like to manage the position, the entire process of the position. I'm confused. Heidi and Liz, what is it that Palema is looking for as far as like a project management tool is concerned. They, like the way that they, no, no, no. So we have this retained, we have a retained practice. And the way that we present candidates is really unique because a lot of it is higher education, not-for-profit, where you're presenting to multiple people. And it's very, I mean, these are $100,000, $150,000 fees. It's very professional. and they use actual portals and links to present their candidates. It's not a quick email summary like what we're used to seeing here. And then the other piece of it is, if you think about it like this, in that business, so in our traditional whoever you want us to be, Skoda, Manati, Markham, our search business, we were always marketing Markham. Now, probably two-thirds of our business is marketing CBiz until they win the work, and then they're marketing the client. So they use the client's branding when they present candidates. They use the client's benefit information, marketing collateral. So the moment that engagement letter is signed, we're representing the client. our branding isn't on anything. And so they are much more project management focused than traditional search focused. So maybe the question, one of the questions, Drew and Jim, would be what other, you know, bigger retained search firm clients do you have? And how do they use PC Recruiter if they use it. Because what we're hearing from our new team members is that PCR is not project management focused and it's not geared towards the retained search business. And so I think the only way for us to really be able to articulate it or understand it completely is to understand what other true retained search firms, you know, do you work with, if any. and if so maybe we talk to them because there's something we don't know probably know that better than i would jim as to who's who's doing what with it yeah like do you do anything with like ratliff and taylor on search in cleveland i mean any of the bigger retained search firms not to my knowledge but the training team would probably know most about that because they work with everyone uh if we have any big retained search or what they do may be some best practices. That might be a good place for us to start. That's where we're headed. So if we think with the end in mind, we are looking to make this a tool, if possible, that can go across our talent solutions team, which now is, today is temporary staffing. We're on the fence about that. But it's temporary staffing. It's permanent, retained, and contingent. And then ideally there would even be, you know, we do some HR consulting. So there are other, and we want to get into the recruitment process outsourcing space. So we want to be, and we're going to be in a short period of time, a full-blown talent solutions firm. So search and consulting. Cool. Yeah, I think the best I could do is talk with the support team to see if there is any of them that they know of, anybody that does retained, or that maybe they know some best practices for what our retained clients are doing or anything like that. Yeah, I think that'd be helpful. We could probably cut out a lot of the middle questions if we knew the answer to that. Okay. Okay. I'll ask around and see what I can find out. Okay. Awesome. Appreciate it. For sure. Let me check on that and kind of let you know on that. And then if you change your mind or decide you want to add the PCR, let me know. We can go down that road when it's time. And we'll figure out stuff about presentations. And I'll look into what options there might be about setting candidates to employee status if you change the status of the company. I'm not 100% sure, but there may be ways to improve on that. So I'll work with Karen on it. Drew, if Karen still wants to test out a 10 license, I mean, she knows our business needs, so it wouldn't hurt. But I'm just, I'm like a more like let's talk about the end so we can, you know, cut out the middle thing. And so that is worth getting a lot of feedback and pushback on. And there may not be a tool that does everything we need to do, and that would be okay if we got to that answer, but we need to get to that answer in an informed way. Yep. Gotcha. Okay. Yeah. All right. Awesome. Thank you. Thanks, guys. Take care. All right. Thanks, guys. Bye-bye. Thanks, everyone. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1715.541313,
    "salad_processing_time": 228.76527285575867,
    "overall_processing_time": 1715.541313,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " welcome to zoom enter your meeting enter your participant IDs you are in the meeting now there is one other participant in the meeting Hello, Drew.  Hello, Jim.  It's just you and me, none of them yet.",
    "job_id": "50c5f3bb-0849-45a6-a9f4-e760543435ef",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " welcome to zoom enter your meeting enter your participant IDs you are in the meeting now there is one other participant in the meeting Hello, Drew.  Hello, Jim.  It's just you and me, none of them yet.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 2
      }
    ],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "urgent"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "high_priority"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3058906050037.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}