{
  "recording_id": "3059931781036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:08:20.509622Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:08:20",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID. Enter your participant ID followed by pound. Otherwise, just press pound. You are in the meeting now. You are the first participant. Please stand by. you you you you you Good morning. Good morning. Shereen, how are you? I'm good. How are you? I am well. I see Kirk just joined as well. Yep. Okay. Okay. Hello Kirk, how are you? Mm-hmm. How are you? Pretty well. Pretty well. Okay, so we have both of you online here. Wanted to kind of open up a dialogue here and start off with what you're looking for, what you're using now, and kind of what problems you're looking to solve, perhaps with PC Recruiter. um well we're looking at a lot of different stuff right now we've used them we actually have our own proprietary system that we're using with the company i'm with uh but i'm looking at going uh on my own and with me and shireen are starting our own business so you know we need a couple of different things i don't know i'm interested in learning about you know i know PC Recruiter has been around a while. I don't know what you integrate with. I don't know if you integrate with LinkedIn, if you integrate with any other kind of systems. Jim, would you call PC Recruiter a CRM or an ATS? Both, certainly both. PC Recruiter has always been both, and we actually now have a new CRM product that comes with PC Recruiter. So you're going to have a whole sales pipeline and everything there. Okay. What kind of integrations do you do? Do you integrate with anything like Apollo, Lusha, LinkedIn, any of those type of companies? Well, we integrate with LinkedIn. We actually have a capture app, which is going to allow you to pull people and records in from LinkedIn, Dice, Indeed, Resume Library, Career Builder, Zoom Info, a few others. So that is going to give you the ability to pull people into the system, populate your database. We don't have any direct integration with Lusha or any of those others. but with our open API that might be something you could write or we integrate with Zapier so you might be able to integrate PC Recruiter and anything through Zapier so that's another option there we also can allow if you wanted to post jobs to indeed, Zip Recruiter we post jobs to feed them to LinkedIn as well you could even post jobs to your own website and have candidates applying online or merely submitting their information to be considered so they don't even need to be applying to a proper job they can just submit their information in general. Okay. So let's say that someone sends in a resume to me. Does the system automatically upload and populate that, or is it something I need to do manually? Well, it's almost kind of in between. So if somebody emails a resume to you, it comes in, let's say, to your Outlook. You can right-click on that attachment and say, parse it right into PC Recruiter. Or we have a Resume Inhaler, which is a bulk parsing tool, which you can have that you, at the end of each day, just point it to your inbox and say, inhale every one of those resumes. It'll bring each one in, create a record for each one, index each resume for searching as well. And then also, you could have people uploading their resume through your website, put themselves directly into the database. So the only piece we don't do is we don't have an email address that you can just email it and it just turns up in your database. So we don't have that, but candidates can put it in online, or you can right-click or parse it into the system. You can even drag and drop it into our parsing utility. So a few different ways you can parse records in. Okay. Why don't you kind of show us some stuff here, kind of give us a walkthrough on how things work and what we can do. For sure. Have you seen PC Recruiter? Have you used it in the past at all? I've seen it a few times, but I don't know a whole lot about it. Okay, perfect, perfect. So I'll show you a couple of different options here. Like I said, the PC Recruiter, I'm going to start with the classic PC Recruiter. It's been around for 10 plus years. That is tried and true. Let me share my screen here. I'm going to go ahead and log in and kind of give you a general, just kind of few highlights of this version here. So, looking at this system, all cloud-based, it's going to be something you can connect to on a PC or a Mac. There's a mobile app. Username and password gets you in. And this is going to give you this interface. You're going to have the main menu bar at the top. That's going to be kind of some of the main access to the main elements of the system. So you're going to be able to track names, companies, positions. Those are our three main record types within the system. Names are going to be your contacts at your client companies as well as your candidates. So we're going to allow you to track both contacts, candidates. Pretty much anyone you need to track is going to be placed in a PC Recruiter under that name type. Companies are going to be companies you're marketing toward or your client companies, and then positions, the jobs you're looking to fill. So those are kind of our three primary record types there. And as you click through here, the middle area is for searching, search results and lists, and the bottom is going to be for the actual records themselves. So if I wanted to go into my system and do a quick search, I can go in here and I can look for maybe I need people that have sales and marketing. So I can do Boolean searches here, and I can search every resume in my system. Also, I can search attachments, profiles, including maybe a LinkedIn profile, notes. So I'm going to be able to kind of see how the individual used the word in their resume. It's going to highlight every instance of every word. Hey, Jim, can I do this? Would you mind if I interrupt you as we go and just ask you questions? Yeah, absolutely. The first question I'm wondering is, does it work better with Outlook or Gmail or Google? Which one would it work better with, or do you think it works equally with both? Both, because we have overlays for both those. And the Outlook and the Gmail, if you get an attachment, you can right-click on that attachment, and Outlook or Gmail parses it right in. So that's going to be certainly no problem there. And so how would you do a company search? Company search, you merely go to company, and you could say maybe I, Vandelay Industries was one that I could type in part of a company name. I could go to that record as maybe they called in, or I could search by anything, even if I had banking companies. I can throw in a banking and kind of search through the notes of the companies. So you'll see maybe I put in some notes, just what industry they're in or a little blurb from their website when I brought them in or anything like that. So company records, you're going to be able to pull them up by anyone. and I could look at all of them in Boston. So I can search on any field that I need to in my database there. Okay. I have a question. Sure. How do I put information in that I already have? Like if I already have my data, like if I already have everything in a Google Sheet, how do I add that information into PCR? Excellent question. So PCRecruiter actually includes, in addition to our parsing utilities, there is a spreadsheet import. so you can go up here and I can say I can pull in company data or name data or even jobs if I had them and I would be able to import a list so you'd merely need to get that Google sheet into a CSV which I'm sure I'm told you can do I've never personally done it but I think you can so you'd be able to import a list and the first thing you do put it on to some roll-up list in PCRecruiter okay I could even add a new one call it data import August 21st whatever it might be but if I go to that list I simply go to this generic file mapper and then I can upload my spreadsheet and what's nice about that I have one in here I think I have a sample test see there's a data so I can go ahead and I can pull my data into PC recruiter then when I go to the next it's going to give me a little mapping utility here so here are some destination fields some common fields in PC recruiter in addition you get up to 20 custom fields so if you have fields in your spreadsheet that aren't in your PC recruiter database you can map them into custom field one and it would create that field and then plug the data into that field and down at the bottom here there's the data that I brought in you'll see I have headers in my first row so that's kind of showing and then it's really simple I just go up here and I say I want the candidate last name field and the last name first name first name so I just map everything just so then once I have everything mapped I'm just doing two but you'd map the whole thing you can even save it as a template if I go next it's going to give me the option to check for duplicates. Your initial import, you're likely not going to have any, so you could just do no duplicate checking. But you could say, I want to update if a duplicate's found. And by duplicate, I mean last name and email address. So I could do that. Or I could even have a specific ID number or LinkedIn address or something like that, that I make that my LinkedIn or my duplicate identifier. And then I just hit import. I've imported a whole spreadsheet just like that, and it's pulled directly into the database. Okay. So once it's into the database, how do I make it a roll-up? it's already a roll-up so when you brought it in on that list it's already on that list so you would have a list there and you could go right to that list let's say I have 46 people it's on that roll-up list or if I wanted to build a new roll-up list maybe I did a search for every record entered today and I wanted to put it on a slightly different roll-up list or I could do maybe I'll just put in New York oops so I can kind of throw in any search I might wish and if I get a list right there I can simply select all results one of my options of my mental up to roll up yep I go to roll up put them on whatever one I want or create a new and then I've kind of isolated that group of people on that roll-up list and I can use that as a pre pipeline I can use it to send out mass email campaigns or I could even launch a sequence which might send out an initial email and then if they open it they get another one if they don't touch it in three days they get yet another one so you can kind of do sequencing email campaigns and the like in here as well okay so can you just show me again where you went to upload this data where did you click to upload the spreadsheet the quick add the little lightning bolt button in the upper right hand corner and then I'm able to say do I and do I want to add a name a company or position And then when I select, let's say, name, I get a couple options. I could manually enter a name record or I could parse. That opens my parsing utility so I can import a resume or import list is how I import my spreadsheet. And then that opens that little widget that we walked through. Okay, perfect. For sure. Yeah, so that's going to work. And then, of course, Capture is going to be our app that will allow you to import from various versions of LinkedIn, Indeed, CareerBuilder, Facebook, versions of ZoomInfo, a few others as well. so that's going to be like if I go to LinkedIn anyone I want to import a little click to add would pop up on their LinkedIn page and as I click that that's going to pull the record in create a record index their their LinkedIn profile so that it'll create a record and you can see like Christy Marvel is someone that I brought in from LinkedIn in the past I have her photo I have one-click access to her LinkedIn page it tagged the time the date the username even put the sources LinkedIn and then under it under attachments I LinkedIn profile so that's where you're pulling most of your people is in LinkedIn probably yeah LinkedIn because that's an easy way to do it or any of those other services we work with but if you've got a resume you could parse it in just like this and you could open up the parsing utility or you can right click on the attachment that'll open this parsing screen right from Outlook and it'll parse the resume in and if I hit open I can just pick a random resume and that'll parse all the pertinent information to build the record and then it'll attach the record or attach the resume to the record in a searchable format. Hey Jim, let me ask you this. So when you import something from LinkedIn, you're not getting any contact information. You're not getting an email. You're not getting a phone number. So what's the value of bringing it in from LinkedIn? Well, sometimes you do. So when you import from LinkedIn, if you're a first degree connection and they make their email and phone number public that will import so that is sometimes going to happen but often not if you're second or beyond it might not or if they don't make a public but that at least will get you their basic information their LinkedIn summary and another couple of things you can do when you have someone like maybe I have Christy in here from the system I could do a few things over on her social network bar where her photo is you see I can click LinkedIn screen so I know I can go to her LinkedIn but if I hit these three little dots that's going to let me look her up on zing facebook google yahoo i could even do a google search with city excuse me and state and i could search her to find a little more info or a little bit deeper if i'm looking at her record in pc recruiter if you work with zoom info or hire ez you can go through here and you can hit update via hire ez or update via zoom info and it'll launch your your higher easy or zoom info and it'll help you to go through and find more information on her that way so there are some tools you can use to find a little more info if you have that like the higher easy it'll launch right in a higher easy kind of find some more info enrich her data a little bit there so a few different ways you can do it you can always if you emailed her maybe you can always send add a new phone number or something like that So that's going to give you some options around that. Okay, so per email and phone numbers in that Zoom info, it will automatically go in there once you click on the Zoom info? Yep, it'll enrich it, and then it'll pop it right in here. Like I think, let's see, I don't have one, but if I go in, I think what the HireEasy does, and Zoom info works similar. If you go into that, you would go through authenticate. That's where you put your API key, your credentials to get in HireEasy. you can select the company. I think that's your company. And then you review the data you found. And I think there's a little click right there and it'll update it in the system. I might even have a video on that that I might be able to send over to you. Thank you. And how that'll work. Yeah, those are kind of nice tools there. And then you're going to have the ability, like I said, tracking your company records. I can go to a company from that company record. You can configure what the screen looks like. I have a set of all the positions that I'm looking to fill for them. I might even also have a set of all my contacts that I know over there. And then each position is, of course, going to have its own pipeline. So if I look at my radiological control tech here. The weather is 72 degrees Fahrenheit. Sorry, guys. Oh, no problem. Today's heat has had lots of clouds. There's a light going off. It's 180 degrees and a little 67 degrees. So I can look at my pipeline here and I can see everyone who I'm considering for this specific job. and you have a custom pipeline process you can build into PC Recruiter. You can have more than one if you wish. And then you're able to drag and drop these individuals from one step to the next through your process, creating a searchable, trackable, reportable event as you go. So that's going to give you a full pipelining for each and every one of your jobs. Now, another option, kind of the CRM side of things, we also have PCRM which is a different interface to the same database so what I mean is if I go in here and I can look at name and I can see the Christy Marvel was the last person I looked at if I log into my PCRM this is a whole different interface has a lot of the same functions but more but if I go to name my most recent viewed is going to be Christy Marvel right there right up top so I can go through here I could access her in the PCRM piece sharing the database so it's real time but what's nice about this PCRM in addition to some people like this screen format better you're going to have a deals pipeline here so if you wanted like a sales funnel here you can actually track various companies you're marketing toward and what you're doing to market toward them so I can say abacus is qualified and I have them in here as a line item in my deals pipeline I can look here and I see that I have set I had a call then I had a call to follow up then an email to follow up I could kind of make a list of activities I want to do for this specific deal I can edit this to give it a different temperature it's hot, it's warm, it's cool, it's cold. I can give it a confidence level. I can give it a potential value or projected close dates. So it essentially gives you some sales forecasting tools in PEC Recruiter as you're able to kind of move through and drag and drop these individual deals from one to the next. Very similar to an interview pipeline, but it's a pipeline for companies you're working with toward developing a relationship and getting the deal with them signing them on as a client. Like I said a lot of people like this specific interface better because if I go to names it gives you a little bit you can edit in line if you wish keeps moving there you know you can edit in line or I have some actions I could contact them I could email them right from the front screen if I had Ring Central I could even click to call or click to text right from PCRecruiter we interface with RingCentral for click-to-dial. I could link them into a pipeline, delete the record, pin it up to my, I could just pin it up to my area at the top here, so I can pin a few records if I needed to. Nice search too, if I'm looking. Yeah. Is this an add-on product, or is it included with PC Recruiter? It's included. It's included. It's a separate product we spun off early this year, so we give you both PC Recruiter 9 and PCRM and you can pick which one you want to use or maybe you have one person that does marketing use PCRM and the other person uses PCR 9 you can switch fluidly because it all shares the same database so it kind of is an added bonus that we've added and menu on the left is all your names companies positions roll-up lists daily schedule that'll sync with Outlook to and then all of your analytics reporting this looks the same in both versions but if you look at an analytics report you're going to be able to build your own custom metrics within the system so I can look at like my pipeline activity and I built this one just to show first second and phone screen but you're going to have the ability to put in different date ranges oops different date ranges so you can say I want to look at this quarter this week last year this month I could split it up by various jobs they might have touched, various clients I worked with. I could even split it up by employee if I had more than one. So I'm going to be able to kind of split my data any which way and build custom reports in here. You're also going to be able to look at the results of your email campaigns. If you send the mass email out, you're going to be able to look at your opens, your clicks, your unsubscribes. Oh that's cool. So you can see all of that open rate, click rate. I can even see who clicked what. He clicked one time. He clicked on my website on May 14th. So I can kind of see everything that's going on here. And then this lends itself to our sequencing tool that you can set it up so that maybe you have a proper drip campaign. So it sends one email, waits three days, sends another. If they open it, they get a third. If they don't, they get a fourth. So you kind of set some different automations in there as well. So where do you set, all right, let's say we're doing a mass email campaign. We're going to create a roll-up and we're going to email out to that roll-up. Where do you put up the follow-up emails? Where do you set that up? That's in the sequencing area. You can go into sequences. That's going to open up the sequencing screen and you can build a template. Hold on a minute. This is not in PCR. It's in both. Which one is it? It actually looks identical, sequencing. So even if I went into it here, you'll see it opens the same exact screen. So it looks the same in both. But I can go into my templates. These two come with the system. And then I can go ahead, get that alarm out of there. And then I can go through and I can edit my branches, and I can set up first step is going to be an email. And then I can say that if they reply to it, they're done. If no interaction occurs in three days, continue to the next step, which has added some to my call list. Then I can kind of pick. We can put all of our follow up emails. So we can do all of our follow up emails, like three. We can set up three in a row to the people that have opened the email. Okay. So where did you get that? Where was the sequencing button again? I didn't see that. It's sequencing in the main menu bar right up at the top. You'll see it's sequencing right up there. And then that pops it up into a new window here, but you have the exact same window in the PCRM. It's the sequence button over on the left, exact same screen. So it's going to look the same. So once you set this up with the follow-up emails, it'll automatically send them out. Like if we send out the mass email on one day, if we set up the sequences, in three days it'll do a follow-up. In another three days it'll do a follow-up. Yeah, when you set that up, yes, when you set up that sequence, that template, it'll do that. So it'll say, send an email, wait three days, send another, wait two days, send another. So you can say, or you could do if no interaction occurs within one day or three days or four days, send another email or anything like that. And it could certainly be only emails, or it could also include, if you had RingCentral, you could include a text, or you can add a to-do list to contact them on LinkedIn, or you could insert them into a pipeline, or do a number of different things. But you could certainly have it email, pause, three days, email, pause, two days, email. And it'll run on a roll-up list. So as soon as you activate it on that roll-up list, everybody starts. But if you add someone to the roll-up list later, they are going to start at the beginning of that sequence as you add them. so that's gonna have that's good yeah so the sequences are nice okay any other questions on anything I have as I squeeze you in this one I have another call in about six minutes but I wanted to kind of see if there was any other questions anything else I could show you or we can reconvene later today or tomorrow if that works as well. It looks like it's not going to be that big a deal to import a CSV, right? No, it's easy. And they're actually putting a different, I'm told, kind of a little more feature-rich version in the PCRM for a CSV import in the coming weeks. So they're adding that to the PCRM piece, but it's already there in the PCR9 and very easy to do. And the training comes with the purchase and the trainer would be able to assist you on the first training. Kind of point you in the right direction, walk you through it, do a screen share, click you through it as you're doing your import there. So there's some assistance there. Can you show... Okay. How much training comes with that? How many hours? You get 10 hours training. So the pricing of PC Recruiter, it's a one-time setup of $7.50, no matter how many users. That's only one time. That includes setup and creation of the database, help hooking it into your website, installing capture, hooking it into your Outlook, your Gmail, any and everything there. And 10 hours training with one dedicated trainer. So you'd have 10 hours training. They usually do it in the first 30, 60 days, but it lasts six months. So if you want to hold off a couple hours just in case you need something in four or five months, you can do that too. So you get 10 hours training with that. And then your users are 115 per user per month. That's with a one-year commitment. And you can add or drop users at will. So anytime you need to add or drop, you can grow, you can shrink. We're very flexible on that as well. Okay. Then last question, since you got to go. When we have IT problems and when something comes up, is there a call-in number or am I going to have to spend all day going back and forth on email? There's a call-in number. There's an online chat, which a lot of people use, or you can email. You can submit a ticket. There's online help as well. But yes, we do have a call number. We do have a staff who answers that. And anyone and who answers can help, you'd also have the contact info for your dedicated trainer as well. Okay. All right. Me and her will talk about it, and then we'll get back to you. Fantastic. And also go back maybe tomorrow, if I haven't heard, just to see if there's any other questions or anything like that. Yeah. Very well. You can give me a call. It's fine. Awesome. Will do. All righty. Well, thanks for the time today. Thanks for fitting me in, and we'll talk to you soon. Thanks, Jim. Appreciate it. My pleasure. Have a great day. Bye-bye. Thank you.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1738.435006,
    "salad_processing_time": 220.0646572113037,
    "overall_processing_time": 1738.435006,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID.  Enter your participant ID followed by pound.",
    "job_id": "1603bf03-4f86-4ae8-ac3b-7f52189866a3",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 3
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "general",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3059931781036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}