{
  "recording_id": "3059990328036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:08:26.501532Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:08:26",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your participant ID followed by pound. You are in the meeting now. There is one other participant in the meeting. Good morning. This is Jim. Good morning, this is Alan. Good morning, Alan. How are you? Good, how are you? I don't know, not too bad. And is Sydney joining us today? There should be a couple other people joining. Okay. That was my next question. Is anybody else joining around as well? So we'll give everyone a minute to get locked in. Hello? Hello. Good morning. Hi, how are you? Very well. Is this Sydney? Yes, this is Sydney. And we have two others joining us too, but they should be here in just a minute. Okay, not a problem, not a problem. And are they dialing in or joining you? They'll be joining me. Okay, very well, very well. So give them a couple minutes to get here. Now, have you seen PC Recruiter before at all? No, just from researching online. Okay. I don't know about Alan, if you've had any experience with... So I just looked at the length and some of the product demos you have on the website is what I looked at. Okay. And as I recall from our conversation, you're looking for something premise-based, kind of self-hosted? Yes. Okay, and I don't know that anybody really has, we do have a version that does that. I don't know if anybody else really does much anymore because for a long time we were about the only one that still did that. Yeah, it's definitely hard to come by. Yeah, but a lot of times if you've got the server and you've got the team to do it, it's fine. You'd need to do updates, backups, and everything like that on your own, but it is available. Ours, most of the functionality is going to be available in the self-hosted version. So I'll kind of show you around that. And as everybody's joined, I just kind of wanted to open up the floor and kind of see what are the main things you're looking for in a software, be it ours or anyone's. What are your main requirements, features, functions that you need it to do, that you need to have, and what are you using now? So currently we use FileMaker, and what we're looking for is just basically – and Alan and Dana, please feel free to interrupt, but we're looking for basically like a resume system, resume database. And we also want to be able to... I don't know what the right term is. We want to be able... Or we're looking for products that will be able to kind of inject all of the resumes and job descriptions that we have and and see who matches with the job descriptions that we have. And the other part of it is the reporting capability and tracking candidates and kind of where they are in the process, kind of keeping in contact with them, just typical applicant tracking system type activities. Right now what we have, because I complain about it the most, So I'll give some of my gripes about it is that what we have is an action. So we have to, so if we write an email, we do it outside of the database, and then we go in and have to go into the database and say we sent an email. And then when they get an email back, if we ever wanted to have the history, and obviously, you know, for posterity, if anybody ever wanted to go back and look and see, we're going between multiple different, whether it's email and then the database. any sort of listings or postings or kind of what's going on, comments and thoughts like that. It's just it's doing the same thing in different areas. We do a lot of tracking via Excel because it's easier to see our current candidates that are in play because it's hard to go in and just grasp that and see where everything stands. Excellent, excellent. That gives me a good idea. So yeah, so with PC Recruiter, we are going to give you the ability to kind of have everything in one area. Within the system, you're going to be able to track your candidates, contacts, jobs, positions, interviews, pipelines, all of that is going to be in one database. You're also going to be able to track emails whenever you send an email. It's automatically recorded in the record of the person to whom you sent it or received it. So you can integrate your email into PC Recruiter as well. So essentially you're going to have a journal with each candidate showing everything that's going on with them. Interviews, emails, follow-up activities, anything like that. So that's going to be very very useful to you there. And if you don't mind I'm going to share my screen and kind of start to show you around. Jump in if you have questions, if that's alright. And this is the on-prem version, right? Yes. Do we want to know about both? Maybe, like we're thinking on-prem, but if you could just highlight where there might be additional if we go with the cloud version, is that what you would say? Sure, sure, sure. And I'm wondering, why are you looking to go on-prem? Why is that of great importance to you? It's sort of what we've done, and most of what we do is sort of internal. Yeah, it's just where we've been at this point. Okay, okay. Yeah, so a little bit about PC Recruiters. So we are available in either cloud-based or on-premise. So we have both setups. The nice piece is that they look just the same, exactly the same other than one's hosted with you, one's hosted with us, and we do the updates on the cloud-based, the on-prem you need to do those and everything of that nature. There are a couple little things that don't work in the on-prem version. I think one of them is our AI suite. So we do have an AI suite within our cloud-based version that's going to give you some auto-matching. Well, that's coming out in the next week or so. But it's going to give you like auto-matching. You can click a button on a position. It'll pull the best 15 candidates from your database that match that position automatically using AI. Some content generators and stuff like that. So that's not available in the on-prem version because it runs off of our OpenAPI license on our cloud. so that's that's why they can't be. I think a lot of these features are available but also some of the interfaces with like ZoomInfo or some of those HireEasy, some of those don't run on self-hosted either. I have I think a document that has a more exhaustive list of everything that isn't available on the self-hosted but the bulk the base package is available on self-hosted. The email campaigns, email integrations, the sequencing, all of that that is available on both but they're going to look the same so so the main difference is just going to be pricing and where it's stored there so let me kind of show you around through here so I'm going to open up my system I'm in the cloud-based version but I use the right yeah I think we're using the self-hosted I use it internally to track my CRM so I actually use PC recruiter day to pay but I'm going to log in here and get us into the system kind of show you around so all cloud-based here or self-hosted if you're self-hosted the premise space you would just go to us you would create a link that takes you back points to your server rather than our cloud-based so it's going to look the same other than that so I'm going to go ahead and get myself logged in here and once I am logged in this is kind of how it's going to look you're going to have a menu bar at the top of the screen and that's going to be your main navigation that's going to get you to the primary elements of PC recruiter main records names companies positions so those are kind of three primary record types the names are going to be your contacts and or your candidates so pretty much any person that you need to track in the system you're going to be able to track them right from there the names are going to be in the system and we'll delve into those a little bit as well companies are going to be your client companies or your potential client companies so you're going to have the capacity to put company records in here you can connect names to them if you have a contact you're working with you can also connect positions to them once you're filling in a specific position. So positions are going to be in the system as well. And each position can have its own custom pipeline. So you're going to be able to have a pipeline, a subset of candidates who are interviewed or who you are considering and moving through your own custom interview process for that job. So we'll take a look at that as well. But getting to those names, those companies, those positions, all in the main menu bar right up top, this is also going to be where you have some things like your daily schedule, and I'll just kind of click through as I talk, your daily schedule it's a calendar it'll allow you to schedule meetings phone calls follow-ups it'll sync with an Outlook calendar as well so if you have something on your Outlook calendar that'll show up in PCRecruiter and vice-versa you can go through you can drag and drop the items to move them from different times you can also go to name that'll jump you right to that person's record if you wanted to give them a call so you can jump right into their name record and if you had RingCentral I think we also work with Google Voice you can click the little phone icon and dial them directly out of of the system. What's nice about that is it creates an activity, outgoing call made, time, date, username, or incoming or missed calls are also recorded as well. So that RingCentral piece is going to offer those activities, which is a nice option within the system there. So full daily calendar, you can schedule items. If you schedule it through PC Recruiter, it'll go in your PC Recruiter calendar that can sync off to your Outlook calendar automatically. You're also going to have roll-ups up at the top here. Roll-ups is our list tool. So a roll-up list is merely a list of people or a list of companies or a list of positions that have something in common. So I can see I have 365 messaging architects. I have a tech and sales list I created on November 20th. I have people within 40 miles of Boston that are marketing people. So I can kind of create as many lists as I want, call them whatever I want, add and take away to them freely. I could even add to them in bulk. If I did a search and wanted to save that search, I could do that right from there. I can click into this list of people, these 91 individuals. As I click to open that list, that's going to show up in the top frame there. And then that's going to show me, I can look at each person. And as I look at each person, their record will show up below, customize how I want it to look. That could be user specific too. And then I could go to the next person, take a look at them. What's cool about each person, if I go right down to their activities, I like to show up below the fields. This is going to show somebody changed their status on a roll-up list. Somebody updated their information. This person had a phone interview for a job at Vandelay Industries. Or I could see any email that I've exchanged with them as well. That's going to be recorded right here in these little boxes too. So essentially, it's going to give you, and I'll show you a real-world example. Sydney, I have you in my database. I have you on my calendar today in yellow with an alarm because that's a time-sensitive call. If I go into my record, I'm not recruiting. I'm simply tracking people. So I only need name, phone number, email address but I can look down here and I can see I noted that we made a call what we talked about I also can see there's an email I received when you accepted my meeting here's the email I sent with the meeting so I've got everything here automatically recorded chronologically by username showing it whether it was an email received an email sent whether it was a phone call made as I go back through here I can see I even have a pipeline that I moved you to my demo scheduled status there I could see there's an outbound call using my ring central so I can see everything that's gone on there so if I go to activities I can say oh has anyone else any other usernames no only me so I could filter by username or activity type or anything like that so that's going to let me very easily with one touch go to Bob Smith and I could either if I have my activities right below his fields I could just scroll down or I can click to activities right here in his main menu. That's going to show me a snapshot of everything I've done with him. Every interview, every email, every follow-up, anything like that. So nice. I'm sorry, just to be clear. So if Alan and I are both talking to a candidate, if we're looking at the candidate's activities, it's going to capture, I like to be able to see what Alan had done all in that candidate's journal for lack of a better term. Okay. Absolutely. Yeah, you could see everything, other users, any activities, even if they just move them from one step to the next in a pipeline, that's going to automatically create an activity. Or if they received an email from that person randomly, that's going to create an activity. So everything is shared in the activities. So that's going to be a nice, simple way of seeing what's going on. And if I go over to my names here, it's going to hold on to the last 50 records I viewed. So I'm going to be able to easily click into maybe I was looking at Terry earlier today. And I'm going to be able to just go right to his activities and I can see everything that's gone on here. I scheduled a follow up call for Thursday so I can see some different activities, some things I typed in there, what we spoke about, when the follow up was. Or I moved him to a different stage on a list or I updated some information or I exchanged an email. All that's going to be there. Also, I can look at his pipeline and I can see everywhere he's ever interviewed, every position to which he has ever been linked. So if I go to pipeline, that's going to give me a list of all these different positions. And I can see how far he got. He got to a second in-person interview, but it was back in 2023 he fell off. or I can see offer pending. I can kind of see here he was just linked to that job and never got any further. So I'm going to be able to kind of see everything I've ever done with this person. I have an area where I can look at any attachments, maybe older resumes, assessment sheets that he might have filled out, anything like that. I can even look at every email I've ever exchanged and see that right there in my emails area. So I have a question. How do you, Sorry, I have a couple questions. So like your activities, is that a set drop-down list of activities? Or if we needed to add something specific that we were looking for for activities, how would we modify that? It's a modifiable custom drop-down. So when I go to Christie, I would want to create a new activity. So I can go up here and I can pin. You'll see I have some items pinned. So I can just go right to the icon that is create activity. So I'm going to go right there, add an activity, and I can say called and left voicemail, try tomorrow, and then I have a custom list of activity types. These are all created by you. So these are whatever you want them to be. there that are like add name or email received those come with the system they're system-wide but you can add in maybe this could be cold call no contact made and I wanted to make it that specific activity type then I could also schedule a follow-up for tomorrow at 11 a.m. I could even color code it maybe it was a follow-up on an interview we had so I can make it blue so yes that activity type is entirely configured by you you build it out with whatever you wish the trainer would help you to do that trainings included with a purchase by the way so I'd be able to save that that way if you have to be looking at the activities you can see this was no contact made cold call or I could see pipeline activity an interview or maybe I even just go through and add a new activity and I simply put I got drug screen results I can just put that save so I don't even need to write anything but now that puts in there DS anyone else looking here knows I got the drug screen results back from Christy right there so you can use your activity types alone or in conjunction with some more detail about what you spoke of good thanks for sure for sure so that's going to be a nice way of kind of tracking everything that's gone on when you want to email someone you can go through and as you find their email you can go and click the little envelope that will let you compose an email which is going to be recorded in their record you know you can preload your signature you can do all the meeting requests, attachments, even link files from within PC Recruiter. So you can send that email directly from PC Recruiter. It's also going to come right from you. So you'll see mine comes from my Gmail address. So you can have it come from whatever email address you want, wherever. So that just doesn't change your email at all. Or you can pick a form letter. So if I go right here, I can select from a library of form letters. I can just go email. It's going to populate the Dear Hi So-and-So. It's going to populate my signature, anything else I want to. So I can select from form letter templates in here as well. So I'm going to be able to work with that. Those also are automatically recorded in the activities there. And then you're also going to have your resumes in here. So there's a parsing utility. Of course, you can parse a resume in. If you happen to be using Outlook or Gmail, you can right click on an attachment and you can say parse it right into PcRecruiter. So as you're pulling resumes in, and each person is going to have a resume linked to their record, kind of one primary. You can store a blinded copy if you want to store a second copy without their contact info. Attachments lets you store as many other copies as you want, but you're going to have the capacity to keyword search. So if I wanted to go through here and look at sales and marketing, I can kind of keyword search my entire database just this easily. So if I go up here, run my search, I've searched my entire database for the words sales and marketing, and I searched all areas you might limit this to only search resumes certainly you could do that or I can go through here and I can see that it was found in Terry's resume I can look at the resume it's going to highlight every instance of the words that I looked for or I could look at the end I can see it was not in his notes somebody put some skills kind of a skills list or a summary in his notes notes is a searchable area in each record as his keyword tags so if you wanted a keyword tag him you could have tagged him out of predefined lists of tags you put you can search out of that list as well or summary summary is another area where you can paste in a summary even if you drew something up or he sent something that's another searchable area of the system and then you're even going to be able to look at profiles profiles are like questionnaires within PC recruiter so you could build a little questionnaire like this that you could open it up and fill it out as you phone screen him as soon as you hit save every answer you put in there is now searchable data connected to him or you could send him an email with a link to this exact questionnaire he could fill it out online soon as he hits save it's stored as a searchable attachment so your profiles are going to be interactive web forms that you can utilize but also here his LinkedIn profile is part of this I can actually import from LinkedIn or dice or indeed or zoom info or career builder or a few others so I'm going to be able to look at there's this LinkedIn summary that is searchable data as well our capture add-on will let you import using that. And then all attachments, maybe older resumes, secondary resumes, formatted resumes, anything like that, those are all going to be searchable too. So very easy to keep in search. A couple of questions. First, going back on the parsing in. So I'm assuming Word would be no issue in Adobe PDF files, no issue with parsing in. How about scanned resumes? Scan resumes as long as you run an OCR. So as long as it's not an image. So we can't, nobody can import an image. So if you scan that as long as it's a PDF, as long as it's text-based, you can open it just like I want to go right from there. This will work with Word, RTF, TXT, PDFs, as long as it's not an image. So optical characters, OCR it, and then you can parse it in. It'll pull out the contact fields, contact information, email address, phone numbers, and then if I hit save it's going to create that record using this information to build the initial fields it's going to attach the resume as a searchable attachment but it's also going to do a dupe check so if I hit save here this resumes already in my database so it tells me this exact resume already exists so there's not even anything to update but I can click to view the name it's linked to so I can say they sent their exact same resume again however if it was a different resume but the same email and last name it'll pop up a similar little window that'll say there's a new resume would you like to update the resume and archive the existing resume so you could do that too so you could update the resume and just um if it's the same person but a different resume to update off of there too so it's going to be pretty good at duplicate detection so you're not getting duplicates within the system so yeah that's great um that's what I assume would be the issue for the the methodology. Going back to the LinkedIn. So I've had recent discussions with LinkedIn, and they're moving to block people from scraping in their data. Have you had that issue? We have not. They've hated it since it's been a thing, and they've tried to stop, and it's not illegal. So there's really nothing stopping everyone from doing it. I have heard no problems with people. Every once in a blue moon, one person might say, oh, they blocked me because I had a scraper. It happens with anyone using any scraper any time. But I have not noticed it having any impact on our users. And many people use it. So it's just this capture. I think what's happening with them, it's running into their revenue models because basically they're doing the data, and then other entities are using their data to generate revenue on their own systems. Anyway, I'm just curious if you've had to experience that yet. I haven't had any problems. The one thing, every once in a while, also, they'll try and slightly change the formatting to screw up all of these scrapers, but then we fix it within a day or so, and it's fine to go. So they don't like it, but they can't really stop it, and I've had no complaints that it's having any impact on our capture use. But yeah, it's a nice little, just adds a little button that you click to import them or update them within PC Recruiter, and you pop them right into the system. So yeah, so that's going to be a little bit about the name side of things, how you'd import them, how you'd search them, how you can work with them. You're also going to have, obviously, your positions. So we looked at positions a little bit. I can go into my position screen. Each position would have its own record in PC Recruiter. Again, it's configurable. This could interface to your website. So if you wanted, you could have the job posted on your website for candidates to apply online, feed themselves directly into the database. So that's one thing that many people use. But the pipeline is going to be everybody who's being considered for this job. And the pipeline is a configurable screen. So you can set up your own process up to 18 steps, and you're going to be able to connect people through the inbox over here. These are people that either applied online or maybe I did a keyword search and I just checked off three or four top candidates and linked them to the position. So I can do that right from here, and I'm going to be able to see I have these people, and maybe I contacted Brad, so I drag him over to contact it. And maybe I had a quick phone screen with Mark, so I can drag him all the way over to phone screen, and I can move him over there. So I'm going to be able to drag and drop people through my process here, my custom process, drag them anywhere I'd like. you name the process you pick what order it's in you pick the colors and then as I do if I happen to go to Mark's record I can jump to it right from here an activity was automatically recorded phone interview right there today's time and date my username it's showing what company what job that it was a phone interview all that detail is recorded there automatically likewise let his pipeline he's going to show that he is linked to that job it added one more option there's the pipe the phone interview them for today that I scheduled so I'm able to drag these people through this process all the way up to if they get an offer letter if you have a placement you can do permanent contract or both so either that doesn't matter you're going to be able to track that that placements area and then there's a few different ways you can report on your your activities so if I wanted to look at my analytics dashboard here I'm going to be able to look at maybe a custom metric support of pipeline activity and I built a report showing first interviews second interviews and phone screens but yours could have every one of your steps if you want I just kept it simple for the demo here and I'm going to be able to see I can look at it for different time periods last quarter this week anything I want I'm going to be able to see all the raw data below so I had six first interviews in March I can see who they were or I could also go up here and toggle it spread it out by job to see what jobs I worked with or what clients worked within that time or even by employees so if I only have one in this database but if I had more than one user in the database I'd be able to see kind of what everybody was doing so I'm able to kind of toggle through a bunch of different views of my of my activities here and then this is also where you're able to look at your question on that so if I have I'm working with other who I have subcontractors are also provided. Can I, how would I track like their activities in, in support of our recruitment activities? So, you know, we have a job posting, one of our, one of our subcontractors may have candidates. Is there a way to like separate, how would I track that in the process where they provided three candidates or is that all get pulled into the. Well, you could actually tag candidates with ownership or a source field so you can kind of filter that or you can look at any of these reports that you have in the system and you could even filter it by only one specific user so if you have one user you were looking to do I could pull up one user that I could kind of filter down I don't know any of the users I have in here but you could kind of filter it down for for one user as needed if you need it so I could look at be Russell. I could look at a report only for what that user's been doing. And anything they do in the system is tagged back to their username. So everything's going to kind of be tagged to a person. If they're not a user, can we create like another field to attach the candidate to whoever referred them or gave us their information, but they're not a user. Okay. You create a referred by field and you could have that free form entry or drop down that you could add. And those people don't need to be users. And you could include that field in one of your reports if you wanted. The referred by field and what activity has happened, including that field. So the nice part about PC Recruiter, you can create a field for anything you want, put it anywhere you want, and you're going to be able to track that very easily. I don't know if I have one in here, but you could create it. Oh, there I do. Referred by. So I could put in anywhere and I could put in Jay Lombardo or whatever. I could pull from a dropdown too. So I can make that field show up on my search result or in a report or anything like that. So back to the real back or taxable questions. So all of this contact information, there's no way to pull that in from the resume. That's basically manual entry to get like you have Mark Rednick, your initial contact information. You're building that out manually. If you have the resume, you can parse the initial contact info. So the parser is going to pull off of the resume. Basically, I'm going to show you what's on this screen. So the contact info that a person might have, the first name, last name, address, city, state, zip, country, email address, various phone numbers, and title. That data is pulled off of the resume. And when it creates the record, that's automatically plugged in for you. So it's going to pull in the basic info off of the resume, basic contact info. So there's an algorithm or something that runs in the background that looks for those data points? Mm-hmm. Yep, it's going to look for in the formatting, and it knows a couple million common last names, common first names, stuff like that, the formatting of at something.com. So it's going to kind of look for the formatting, tries to find out which one's a cell phone, which one's a home phone, which one's a work phone, whatever. So yes, it's going to do pretty good at parsing that out. Then things like if you had foreign language they spoke that's not parsed But you can add it as you would speak with the person current salary specialty areas different things you can put in certifications They might have you can add that as you go, but the basic contact info and name and Emails that's parsed out from a resume or when you bring them in from LinkedIn or anything using our capture tool It's going to parse out as much as it can find a bed info So like I said, you're going to have your names, your companies, your positions. I can go into company, I can look at a specific company record, and I can see connected to that company, there's all the job openings I have for that specific client. I might also even have a set of all my contacts over there. Maybe people I've placed there, maybe people that are just managers, maybe even been my hiring authority. I can connect specific records to a client company. He's a hiring authority, but I'm still going to have a record for him showing all my activities, follow-up on the interview, any emails we've exchanged. All of that's going to be included in here. Each record is also going to have an attachments area. So if you wanted to upload sign agreements or anything to the client records, the attachments area is going to let you do that as well. Let's see. I have a question kind of going off topic of what we're currently on, but when it comes to reports, all the reports that you can do through PCR when on cloud versus on prem, is that the same? Yes, the reports are all the same. Pretty much everything I've shown you today is available and the same in both versions. There's a whole reporting section here. So I could pull up a bunch of different reports and these are nice because if I go in, the applicant tracking report is a very popular one. If I go in and pull that report, I can say that I want to do it for a certain date range. so I could do it for the last year or I could filter it by a specific user or a specific company or a specific position or anything like that but when I pull my report I'm gonna have the capacity to export that report to Excel, Office, CSV, PDF or Google Sheets so I have a bunch of different ways I can push the data out I like to go 365 because it makes a nice format but I'm going to be able to look at my report here I'm looking at all interview activity I did in the last year and it's going to pull up a nice report showing each job so I'm going to be a rust about coffee grinders admin assistant vandal a industry advanced manufacturing engineer and I can see each line item it's an interview so it's going to kind of put everything right up there and then you can also look at some different stats so you can look at how many different positions how many different candidates how many actual interviews I like to do it over to interview status so there's your custom statuses you can see how many reviewed how many phones first second third not qualified so you can even track people who are out of process and why they are so you can generate this right out of the system. And like I said, that is the same. Pretty much everything I've shown you is going to be the same, be it self-hosted or cloud-based. And Jim, you said you have a document that lays out any differences between the on-prem and you could send to us later, maybe, after we're done. Yeah, I'll send it after this. What it does, it outlines kind of the main things that aren't available on self-hosted on-prem, and it also goes over the basic server specs and network requirements and everything like that kind of the basic requirements to install it okay thanks okay yeah and then pricing on-prem I how many about how many people would you have using how many seats would you have using the system we'll say five yeah okay so five users I'll look at my list you see if I can yeah let's see so if you're looking at five user I think the base on-prem is one-time $19,500 for five to ten seats on that. That is a one-time $19,500 and then this additional $6,000 to add the premium features which is the sequencing, the analytics, the email campaigns, all of that. That's a one-time cost that includes 10 hours training, all the installation and setup as well, and then there's just an annual update fee of 15% of that original purchase price. It's optional if you want to get system updates. Benefit to cloud-based all updates are included they're released and pushed you get them automatically self-hosted the updates come a little slower because we can't test them as quickly because it's not our our network but they come a little slower and they're available to you if you want them you don't need to get them though and it's 15% annually to get updates for that year I have some people that that pay that every year and get the updates I have some people that haven't paid it in four or five years and that's fine too if it's working fine for them everything they don't need to update so that's optional there it's a kind of counterpoint if you were looking at the cloud-based you'd be looking at an install of 995 one time that includes your 10 hours training and setup and then 115 per user per month so if you're looking at 115 per user per month times five users that's 575 a month or 6,900 a year so it's a several year payout if if you wanted to go that route there. But I'll send over the document that kind of shows you what's not available on self-hosted and the tech specs to make sure. You'll need a dedicated server, Microsoft SQL running on that, needs certain connectivity, and you'll need to have someone that can make sure your system's always backed up and secure and everything like that. And the integration from FileMaker, that's probably something you guys are familiar with. Mm-hmm. Yeah, FileMaker, we do data conversion services in-house. That one, I think the data conversion will be about $1,500, and that would take 90 days, maybe 90 to 120 days to get done. So how we do that is if you decide you're ready to go, we sign you up, sign a contract, you pay your initial investment, and you pay half of that data conversion fee. And then my team starts with the conversion. I think with FileMaker, I know they've done it before. They probably have kind of a standard map, but likely that might change a little, or yours might be a little bit different. So they'll work with you closely to kind of get the map just as you want it to be. They'll run a conversion, show it to you in PC Recruiter, make sure everything is where you need it to be. So they'll kind of go through there, and they'll kind of bounce back and forth with you. Do you need any changes? This is how it wants to be. Then they'll get a final backup. You'll kind of agree on a date, get a final backup of a file maker. You'll have trained a little on PC Recruiter ahead of time so you're familiar with it, And you'll be in PC Recruiter as the data conversion process gets underway. So that will kind of be something that you'll kind of be used to. And then they'll do a final pass over that weekend. So on Monday morning, you'll be up running with the converted data now in PC Recruiter. So, Jim, you said you do that in-house. When you say in-house, is that at your location or our location? Our location. We have servers here at a team who gets your data back up, gets it here onto our servers. they process everything here they kind of dial you in with a screen share similar to what i'm doing to let you click through and they'll click through with you to review the data make sure it's where it needs to be make any changes change the map whatever so you would have one person would work with you through that process and then they would hand you off to a trainer who would be your person that would work with you for your 10 hours of training to get you up and running on the system Okay. The 10 hours of training, does that only apply to the amount of users we have, or how does that work? It is 10 hours for everyone, so you can have everyone on every call. Sometimes you'll only have an admin user on the first call, and then others join the later calls, but it's really kind of geared toward your preference. So they'll cover whatever you want to cover in whatever order. They can stress certain areas. They can help you with, if you had a data import or anything like that, they can kind of help you wherever you need help and according to your schedule. So they're really flexible and they kind of tailor it to your needs and preferences. Is there also a way when you send the document of cell post, bid versus cloud, if you could also send the pricing again as well? Yeah. Oh, yeah. I can include a price quote just for either. So you look at both. I can do that. Sure. And to include the data conversion. Oh, yeah. Yeah. The file maker. For sure. For sure. I'll send that all over kind of together. So the details on the differences, what's included, what's not, all the pricing, both versions, data conversion, everything. I'll get it all over there. Perfect. Thank you. Do you have a time frame that you're looking to decide on something or make a move or anything? Yesterday. No, we're going to be making that decision very soon. Okay. We have to move forward. Probably with them in next week, yeah. Okay. Do you have the data in FileFinder? Are there resumes stored in there? Do you know? There are. Okay. because I ask because sometimes if you can get the data out of your file finder let's say in a CSV we have an import tool that's included in PC recruiter so the trainer can help you map your data in for free on the first training call but it doesn't get resumes but at least gets the field data and some people like that because then they don't have to wait for 90 to 120 days they don't have to pay the 1500 bucks you're just able to import the data with the guidance of the trainer actually with the resumes you could even use our resume inhaler if If you could get those resumes into a Word folder, you could use the inhaler and bulk parse them, even match them up. So that's another option, too. If you wanted to get a little quicker and a little cheaper, you could do that, too. But, yeah, so let me send over this info. And I have another couple of calls stacked this morning, so I'll likely do it this afternoon. And then when should I circle back? Maybe mid-next week? Is that too soon? I think that would be great. I have one other company to look at, and we're hopefully meeting with them on Monday. I haven't heard back. So, yeah, by Wednesday, we should have an update. Perfect, yeah, if there's any further questions or next steps or if it needs to be a sooner time frame or a longer time frame, anything like that. But, yeah, and if you come up across any other questions between now and then, let me know. By all means, Risha, just let me know. Jim, on the using the CSV file, do you have any documentation of how that works or what we need to do for that? I think I do have some documentation or maybe a video even I can share as well. Okay. Yeah, I'd like to take a look at that if possible. Yeah, and that's something that's nice because it's an included feature in the system forever. So if you ever come across a CSV of data, you get data from a source or an update or anything like that, you can import that in. There's even some cool update features so you can update existing records based off of updated data found on that spreadsheet. So I'll share that as well. Okay. Thank you. Thank you so much for your time. I'm sorry. And you'll probably have this in the sheets, but I was thinking about this earlier. So obviously we do a lot of this from the phone. Are we going to be able to use this? I guess I have to think about what I'm trying to get at. I do a lot of phone calls while I'm driving, obviously, on my commute and things like that. And so being able to capture that, if you're not in the database and using the Google, we'd have to use the Google phone, right? Well, we have a mobile app. Yeah, we do. We have a mobile app. So you can actually click into that app, click to dial out of the app, click to text out of the app. so so that gives you access remotely oh perfect yeah so a lot a lot of flexibility around that thank you Kevin I like we use ring central that's the the system with which we integrate and they have an app too so that's what I use so my ring central is on my phone it's on my laptop it's wherever I am and it's lets me take calls, it records the calls were taken, sent, made, received, missed, whatever. So that's kind of a nice integration that a lot of people like because it allows you to click the dial, click the text, write out a PC recruiter. So you have to use RingCentral in order to, within PC recruiter, in order to capture the phone call? Yes. If you want activities automatically created that the phone call was made or missed or received, RingCentral is the only system with which we integrate to do that we have a Google voice integration but it doesn't record activities and we have a zoom phone integration but it doesn't record activities and on the phone call phone connectivity is that actually providing a transcript of the conversation or just the fact that the call is made ah that we don't do that I think ring central does it but we don't yet port it into PC recruiter we've partnered with a company called quill that actually does that they take the notes will feed it in the PC recruiter right into the activities the transcript everything like that and quill I don't know if they work with the on-premise version that might be one of the integrations that doesn't but I'll check but yeah quill is how we do that we interface with them okay that's only ring central text messaging is only ring central but if you do it'll record the texts that it was sent and the actual text in the activities of the person's record. So it's a nice interface there. Anything else? No, I think that's it. Very well. Excellent. Well, thank you all for the time today. Thank you, Jim. Thank you. We appreciate it. For sure. And I will get that info out and then we'll talk next week, if not sooner. Sounds great. Thank you. Have a good one. You too. Thank you all. Bye-bye. Alan, can you stay on? I don't think so. Oh, it's his thing. Oh, yeah. We all go away. I'm sorry. You started it. Don't do it there for me. Yeah, come set it up. Okay. Bye. Okay. Goodbye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1741.906381,
    "salad_processing_time": 180.57727932929993,
    "overall_processing_time": 1741.906381,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your participant ID followed by pound.  You are in the meeting now.",
    "job_id": "90ca5416-4fa5-4fb3-a121-29b62b65d9db",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your participant ID followed by pound.  You are in the meeting now.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 1
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "general",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3059990328036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}