{
  "recording_id": "3060434299036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:09:21.563303Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:09:21",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. You are in the meeting now. You are the first participant. Please stand by. Thank you. Thank you. Thank you. I'm going to go ahead and start the recording. I'm going to start the recording. I'm going to start the recording. I'm going to start the recording. I'm going to start the recording. I'm going to start the recording. I'm going to start the recording. I'm going to start the recording. I'm going to start the recording. I'm going to start the recording. I'm going to start the recording. I'm going to start the recording. Thank you. Thank you. Thank you. Thank you. I'm going to ask you to stand up and say a few words. I'm going to ask you to stand up and say a few words. I'm going to ask you to stand up and say a few words. I'm going to ask you to stand up and say a few words. I'm going to ask you to stand up and say a few words. I'm going to ask you to stand up and say a few words. I'm going to ask you to stand up and say a few words. I'm going to ask you to stand up and say a few words. I'm going to ask you to stand up and say a few words. I'm going to ask you to stand up and say a few words. I'm going to ask you to stand up and say a few words. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. I'm going to open your ears. Thank you. Thank you. Thank you. . . . Thank you. Thank you. okay Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Hmm. Thank you. Thank you. you Hi, Laura. Hi, Jim. How are you? Sorry. No problem. I was just in the meeting waiting for you. I just got your email and just sent you over a quick email. I was in the Zoom meeting, so no problem at all. Okay. Here we are. How are you today? I'm well. I'm well. So I understand you wanted to look at the PCRM package, product, piece. Well, here's the thing. So we have a team that obviously works with PCR. and I guess we're kind of on this, we're trying to see what else PCR, if they have add-ons, what that would look like and see if there is an opportunity to potentially stay with PCR or if we're going to have to switch just due to it not being, have the capabilities of what we're looking for to add to an ATS system. Okay. Absolutely. Absolutely. What is, what is it not doing or what are you looking for that I can kind of address? See if it's something that we do. Well, yeah, I'm just so, you know, one thing we're looking for is, you know, a powerful sourcing AI system. I think that another one is, let's see here. I'm just comparing like, what do we have now? So right now it looks like PCR. I'm just going to compare to LOXO as an example, basic auto matching parsons. So like LOXO has a powerful sourcing AI automatic pipelines. Moderate Excel based experts where LOXO has built in analytics sourcing metrics. Let's see here. Outdated UI flexibility, but chunky, very easy to use in modern UI for LOXO. LOXO. I'm just, like I said, I'm comparing. It looks like you guys have a built-in basic CRM features where LOXO compared has one of the best recruiter CRMs. And this is just some research that we've done. So like LOXO in their package would be, it's a flat rate or per seat pricing, and then includes ATS CRM plus working tools, great fit for agencies. Now it does have some downfall as well. But, you know, I think the other thing is, you know, I think I really like the mobile app, you know, on PCR is a little hard to use versus some of the others. So I guess I'm just asking, like, you know, what, what, do you have add-ons that could make PCR more user-friendly to us, is there a way to make PCR maybe more streamlined instead of like when we're trying to do like roll-ups and things like that, where you got to always go in there and change, you know, all these things and it can be more streamlined or I guess, what are your thoughts? I didn't set up PCR, so I'm kind of new to like this whole kind of project moving forward. Sure, sure. Well, yeah. So with PC Recruiter, you actually right now have our recruiting piece, like our ATS, the premium package of it, actually with the AI. So you have the AI functionality that we have. You don't have our CRM piece. So that is kind of a whole different interface. It adds a sales funnel. It also supports the AI. And then we also have coming out an auto match AI piece, which will put a little button next to like any job you have in the system. You can click that button. It'll pull you the best 15 to 20 matches for that position in your database. Now, that being said, we don't look outside of the database. So PC Recruiter does not have any functionality to go outside of the PC Recruiter database. We don't like bring outside candidates in like I don't know if some of the others do. That's one thing we don't do. but yeah we do have kind of a different interface that I could kind of show you how it looks it essentially does everything your current interface does but looks different and add some some CRM functionality okay yeah that'd be great okay let me share my screen let me show you around a couple things here okay so I'm going to share my screen let's see where it is right here okay Okay, so the PCRM product is kind of our latest and greatest. So it is going to be something that would run off of the same database you're running now, but it's a whole new interface for PC Recruiter and it's going to add a couple of things. Okay, so when you add the PCRM, it's going to look like this and everything is kind of goes on the left hand side of the screen, as opposed to the top. It makes better use of the real estate on the screen. I can go into names, I can look at my candidate records, I could click into one of my candidate records, it's going to slide that in from the right-hand side. More configurable, easier to use. So you're able to put in kind of what you most want to see right into this area here. So the workspace is going to be a customizable piece. You can put in whatever fields, areas, elements in the system you want to see. Details is then going to be all of your fields. It makes it easier, like if I want to get to phone fields, I just type phone, it's going to isolate just those phone fields there. This is going to have, I don't know if you're using the AI piece, but we do have the AI is going to be in here for candidate summary generation. It's going to be in here for job description generation. So we do have that functionality there. And like I said, the auto match is coming. I think next week it's going to be released. So it's not currently part of the package, but it is going to be released very soon. So that is on the way. This This is also going to give you some CRM functionality in the form of a deals workflow. So you're going to have this deals pipeline. So if you wanted to put potential clients, different companies entered into the system, you can actually put them in this process. It's almost like a workflow but for sales. And you can go through and mark in different things you want to do. If you want to call, email, email to follow up, it'll kind of keep a checklist and when that's scheduled to want to happen. That'll go on your calendar too, by the way. And then you can also go in here and mark them. hot, warm, cool. You can give it a confidence level, projected value, projected close date. So you can put some of the information in here about what you're doing, and that's going to allow for some sales forecasting in the system as well in this interface. So the PCRM does add the sales forecasting sales funnel piece, and then it's also going to, it's redesigned the roll-up list a little bit too. So if you wanted to get into a roll-up list, I can go into roll-ups. I'm going to see all of the lists I have or I could search them by name I can go into any one of these lists right here I can kind of scroll through the list or we've actually added the ability to build a simple sequence right from the list so you can actually build just on the fly in under a minute a sequence of a few steps maybe an email follow call anything like that so the sequencing is going to be a little bit easier to use in here as well okay so that's kind of the bulk of what the new interface does that and it redesigns most of the screens so it's a little bit easier to use a little bit like you can edit things in line you have the option to add a new name a new position a note an activity right from the main screen there so it kind of helps it to work a little bit differently the like I said the AI suite the auto match is coming don't do anything outside of the system the rest of our AI suite is content generation there's an email generator then you're also going to have a job description generator and also a candidate summary generator that you can track through there as well and then you're also going to match these that's coming yeah the auto match is coming all the other is there and looks like you already have it in your database there and then your analytics yeah you have you okay in the analytics you can build your own custom metrics you can put in your own interview stages, your own activity types, and kind of build your own custom metrics in the system there. And you can look at it for different, like this quarter, last week, anything like that. You can split it up by job, by employee, so you can kind of look at the data in a different way there. Okay. Yep. We do use that. Awesome. Awesome. Now, does that kind of give you an idea? Did you have any questions or any other things you were looking for it to do or anything like that? So can you go over our costs now and what, you know, if we were to add these newer pieces and things like that, what the difference is? Yeah, well, right now. What the add-ons are. Perfect. You are paying $115 per user per month. That is our Premium Plus package. So you have everything. That's one package price includes everything. If you wanted to add the PCRM, it bumps it up by $10. So it goes to $125 per user per month. And that's a flat rate for everything with the PCRM, all the AI, everything like that. So if you wanted to add the PCRM, it's $3.50 set up. That includes four hours training and then an additional $10 per user per month. And then that is, yeah, there's no add-ons, no additional charges, nothing else. You're on the package that has everything. Okay. So, yeah, it's going to be a totally different look than what we have now. Yeah, a lot of people like it because it does everything that the PCR 9 does, but the PCRM kind of rebrands. It makes it easier to use, better format, and it adds CRM functionality, too. It's going to have all the same AI, all the same everything, but it kind of gives everything a new format, a new look and feel. Yeah, and we can still do it per, like, you know, like not all of our practices have their own names. They're not under all one name. So that's not going to change. We still can do that. Is there a way? So we have so doctors recruiters. I'll tell you who use it. So we have a gal that does all our employees in terms of like assistants, office managers, things like that for an office dental assistant. Then we have our hygiene recruiters, you know, and they just hire hygienists. hygienist. So different, different functionalities than what Loida, her name is, would do for strict employees. And then for doctor recruiting, which is me, you know, we do things a little bit different. I don't know how we do it. I think each of us have a little bit different things that we're looking for. So like, for instance, Loida, let's say she has 20 candidates. Is there a way to build a list with those 20 candidates and send that list to, like, let's say the office manager at the office for them to review instead of her having to do it individually? Does that make sense? Yeah, well, if the office manager has a log on, they could, she could build a roll-up list and then just send a quick notification to that person within PC Recruiter that just says, hey, take a look at roll-up list XYZ or whatever. So that roll-up list is going to be visible to anyone in the database. So you can kind of take a look at them right from there. So that would allow, that would probably be the easiest way. Build the roll-up list. So if you do a search and let's say that I am looking for people just in Cleveland. I'm just going to get a group of names here. So what I can do is I can take maybe these first 10, whatever, 12 people, and I can just check their check boxes off. And as I go through, I would just add them to a roll-up. I can go in here, and I can say 21. Okay, now I'm going to create a new one right there, confirm, they're added to it. So now, I've created and added those people to a roll-up list and then let's say that I wanted to go over and I was working with Maybe Jim so I can go here And I can pull this out of here search that I can go to so you'd simply put them in as a user in the database And you could go through actually I think you can even do it right from here. I think you could say contact PCR notification and you could say I'm going to go admin I'm going to say check out August 21 roll-up list. So I could go ahead and confirm. So they'd have to have a seat then as well, right? Well, whoever creates the roll-up list would need to have a seat. This person would just need to have a record because they could, well, no, they wouldn't need to have a seat to do, or even to see the roll-up list, they're going to have to have a seat if they need to see the roll-up list. Yeah, that won't work because we have 100 plus offices. So we'd have to have each seat for each OM. Yeah. Okay. Well, the second easiest way to do that, I think it limits it to 10%. If you have a roll-up list, you can go into that roll-up list and you can select, I think, up to 10 at a time, and you can do a candidate presentation. So I could take maybe five and I could go through candidate presentation. presentation. What that's going to do is that's going to send over to anyone, even if they're not a user in PC Recruiter, each of these individuals, so John, Andrew, John, Janet, and I can go through, and maybe I want to include some attachments or their resumes. I could do that too. Then what's going to happen, that just goes out as an email, and it would look something like this when they get it back. They would see candidate one, candidate two, candidate three, candidate four. So you can do 10 at a time in that candidate presentation. That's going to be a good way of doing it, And I don't have it very configured, but you can put the person's first name, last name, all their information in there. Actually, I'll show it to you from just how it could look in my PCR 9 version. And actually, this will show you how you could even do it today. So if I went in here and I'm just going to do a quick search. So let's say I had five people in a roll-up list or five people on a search. anywhere you might be you would just create that presentation so we could go create presentation and then you're going to be able to just go through and like I said up to 10 per presentation and then it might look something like this so it's going to be able to show their name what their fields their resume any other attachments so I can kind of go through and just look at each one. Okay. And you could even kind of pick and choose what fields are going to show in there. And the person receiving this does not need to be a user of PC Recruiter. They can just open this up, look at each person, give feedback. That's all they can do. And the sender can even choose to make it like expire in a few days. They could be notified every time that someone views it or anytime feedback is sent. So you can kind of do some different things within that. So the presentations are going to be a good way to do that. Sorry. That's cool because I think that that, I think that's what she is talking about. I think what we would do, Jim, is I think we would, would I, so there's a, there's a group, there's three of us on this little, if you want to call it a committee and we are trying to figure out you know we have one that just does not like pcr she thinks it's outdated she thinks there's always something better she wants to have it like glamorous looking which i don't care how it looks if functionality and it works good then so be it you know what i mean we want something that functionality works for you know three different areas in a little different capacity that makes sense and we can you know as we grow we can we can you know, use it instead of, you know, having to every three years change systems. I mean, I've been with signature partners for three years, and this is our third system we've been on. And we've probably been on this one the longest. I like PCR. I don't use it to capability, just because I'm more of a visual learner than like, if you show me, then I'll remember doing it. and so that's where we're at. So I think what I'd like to do is, I mean, so is there any updates on the mobile app? I don't even have the mobile app, to be honest, but I know the one says it's not user-friendly at all. Have you found that to be a problem? I don't use the mobile app much, but it's very simple. To my knowledge, it hasn't been updated. if it I would say make sure you're on the latest version when you go into the App Store but I don't believe it's been updated recently it's very very simple it doesn't do a whole lot because you just real-time access to your data it doesn't give you every field or anything like that so it's pretty basic but I would say make make sure you're in the latest version there would be my only recommendation just make sure in the latest version but there's nothing that's been updated on it recently I was just going to click download it and just see. Well, what I'd like to do is, can we set up a time to do a little demo of kind of the latest and the greatest and what is coming, just so we can show, I can show the other two gals, so they can get a visual as well. And show us like, you know, this is a great, this is great. I know one complaint is, which this isn't a complaint for any of the rest of us, is isn't there a way that we can have, you know, our candidates send out through PCR, like to have signatures and then send back or come through PCR? Because right now we use DocuSign, which is not a big deal. It takes two seconds to use DocuSign. you know, everybody uses DocuSign in our company. So I think that's why it just keeps it easier because not everybody uses PCR. It's just a recruiting function. Is there anything like that, that PCR does? We are working on that. That is in being worked on. So they are working on a DocuSign integration. So I don't know what's going to be out, but it is in the works. Right. okay because then you we can just get a like a little a little idea of each person's like what they're looking for and see really at the end of the day i don't think any system is going to give us what we want 100 i don't think it's unless if you're paying like isims of thousands and thousands of dollars. So I think we bring the other two in and just go like over a demo like this and kind of like from where we are, what the new PCRM feature looks like and what its capabilities is and go from there. Does that sound like something we could do? Yeah, yeah, we could do that and kind of show you around some things. Do you recommend anything? Do you recommend something different? Well, it might be good for me to get maybe one of the trainers on as well, because they might be. Oh, yeah. They're in the trenches working with someone every day, helping people know best practices. So that might be good, too. So let me see who I can get on as well. Yeah, let me talk and see who the best person on my end, one of my support people might be, too. So, okay. And then we'll kind of maybe open up an email dialogue to get something on the schedule in the coming week or so, week or two. Well, I can tell you that typically we have a meeting on Wednesday, 11 a.m. Central Time. So I don't know if that would be something that could work next week. you know if we get if we can find a trainer and and we can be flexible a little flexible too but i just know that we have that already in our schedule each week to do so if we maybe could try to maybe coordinate with that that might be really good okay i am i already have an appointment at 11 central next wednesday but any other wednesday would be fine uh would be fine or if I can get the trainer on maybe. I don't know. What about Tuesday at 11? Tuesday at 11 I should be good. Let me see if I can get someone on. It's Tuesday at 11 central. Let me just see who I might get on and we'll see what we can do. Let's see if I can get Haley. She's a hygienist. She seems to be the... Haley, is the one that's definitely on the outs of PCR. And I am open-minded. At first, I was like, nope, it's easy. You know, it works. I'm not saying, I do believe change is good, but if there's change within the system that is positive and it gives us, you know, more access to what we're looking for, then great. I mean, I'm not one just to jump on the the newest and the greatest train either because it just, that's not, I don't, that's just not how I work. So let me just see if Haley and I just sent out an invite. So if you, if you have a trainer, that'd be great. And we'll see if we can make that work. Yeah, let me confirm on that. And then we'll look at Tuesday the 26th at noon, Eastern 11 Central. See if we can fit that time in. Okay, and then I'll just email you if that'll work then. Perfect. Sounds good. and then what I can um what I can maybe do too is maybe I can just get a list of a list of things that we really just want to see like like a list of questions like what we're looking for what we don't like and then you know maybe send ahead so then the trainer and you have a heads up what that looks like that would be perfect that would be good and that'll give us better use of time and we can kind of get some things set up and take a look at it ahead of time I think that's great yep okay perfect all right thanks Jim I appreciate it thank you We'll talk to you soon. All right. Thanks. Bye-bye. Take care. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1774.605469,
    "salad_processing_time": 115.0844452381134,
    "overall_processing_time": 1774.605469,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  You are in the meeting now.",
    "job_id": "86a82539-261d-493d-a902-8e9a52f14479",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  You are in the meeting now.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "general",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3060434299036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}