{
  "recording_id": "3060128823036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:08:58.467538Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:08:58",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID. Enter your participant ID followed by pound. You are in the meeting now. There are two participants in the meeting. Good morning, Mrs. Jim. Hey, Jim. Hello. How are you? I'm well. How are you doing? Not bad. Not bad. And I think, is it you and Matt and Brad joining or anybody else? Yeah, Brad should be on in a second. Okay. Fantastic. Give him a minute to join here. Hey, how's it going? Not bad. Not bad. What's going on, Jim? All right. How are you? Doing great. Doing great. So I don't know. I think I may have left a message or kind of shared with you that I had used, we'd used this platform for, I think, maybe about 10 years previously. I don't know. You could probably look up and see what we had with you before. But we left because we had some frustration points on some of the things, and we started looking at other places, and I think may have gotten a little bit oversold on what the capabilities were. And, you know, but we've now kind of opened the Pandora's box of exploring some other things again. And, you know, there's some other products out there. And, you know, I'm super wary of being oversold on they can do everything. So I wanted to see what you guys have, what's changed, what's updated on your old Zen and just kind of get refreshed on the platform. Certainly, certainly. And what do you use right now? We use Top Echelon. Okay. Big Miller. Yeah. I think they have a newer product now or a new version. Yeah, they have a new, it's kind of an updated refresh on whatever. I mean, that was, you know, that's what they were using or that's, I don't know what it was like before, but it's a It's a little bit updated. We're also looking at Luxo. We've already rolled out a couple others, but obviously, you know, PCR now has some AI features. And, you know, I think we use some other outsourcing databases, you know, that we can obviously plug in through extensions. You know, we've got LinkedIn. We were having issues with the LinkedIn extension with you guys before, just putting it into the system. It just seemed like that wasn't being addressed. I don't know. But I don't know. You tell me, Jim. What's changed in the last two years with PCR? Well, let me show you around. Let me show you around a little bit. Yeah, so we actually have come out with a whole new product slash interface. We've added an AI suite. We've added the sequencing. So we have a few things that we've added and changed within PC Recruiter. Let me share my screen and kind of show you around what we've got here. Okay. Okay, so I should be looking at my sign-in screen for PC Recruiter right now. So I'll start kind of going through some of this, the newer pieces with the AI and kind of some of the things we've done. Some of this might look a little the same, some a little bit different. So as I go through, I'm going to go ahead and get myself logged in. Okay, so this is PCR 9. So this is the PC Recruiter that you use, PCR 9. This has been around for about 10 years, maybe a little more. and it has been kind of kind of rounded up a little bit they've cleaned it up some so still going to be menu bar at the top still going to be middle area searching search results bottom areas for the records themselves so one of the new things we added had you seen the sequencing at all did you use that i think you guys just added that before um but i guess give us a quick run down on that sure sure so what the sequencing does we've added that piece into PC recruiters like a drip campaigns and it's a new option up here it kind of opens it launches a new window here this is going to give you an area where you can build templates so you can build a template of your sequence whatever it's going to be and it could be email only so it could be sent one email pause five days send a second pause three days send a third so you could do something like that or it could be something like this one that sends an email maybe the next that's a call it adds it to a call list for you and then maybe the next step after that might be an email could also include prompts to schedule a follow-up or do a LinkedIn related item or send a text through ring central or anything like that so you can build different templates in here and they could be a number of different automations so you can kind of pick how you want it to be runs off of a roll-up list and let's say that I had one that I started I did because I have my task list here maybe the first step was an email was sent and then anyone that opens that email gets added to my call list. So it's going to run a call list in here for you that you can click into each person. It's going to open up kind of a snippet of their information, their activities. You can click to dial with RingCentral. You can read a script. You can kind of pre-populate a script in that sequence. And then when I'm done, I can mark them whatever happened. That'll move them on to the next step and kind of kick off whatever the next automation is. And then it's just going to kind of scroll through right to the next person. So sequencing has kind of been pretty popular lately. A lot of people like that. Drip campaigns are very hands-off or could be more interactive like I have maybe something I have to do in LinkedIn. I can click right there. I can click right to his LinkedIn page, send the request, and then come back and mark done or remove whatever I want to do. Okay, so drip campaign sequencing is nice. The email campaigns too is nice because that's been updated a little bit. We've added the ability to send out like a set of limits. You can only send, maybe you send a campaign to 3,000 people, but you do 100 a day. I like to do it that way because it keeps it small, more manageable, also keeps you under the radar for the bulk email police. But you're going to be able to look at the analytics. That's going to let you look at a report showing your email campaign results. So you're able to kind of take a look at your click rates, your open rates. I can see who clicked what, how many times, when they did. So I'm going to be able to kind of see all that data right there. Very easy to see. So it gives you a little bit more feedback on what you're doing. One of the things I'm curious on is, like, I know I see Zoom info there on the main page that you use. Obviously, you have some other metrics that can be pulled in or, you know, running ads and things like that. So tell me a little about that. And, like, you know, so once you put somebody's info in there, does your database keep that info live? Like if Terry Sidham, the senior managing director, gets promoted to a, you know, president role, will that update that? or do I have to manually go to Terry's page and see that he got promoted? Well, we don't auto-update anything because we have always been in our 27 years in business. We try not to overwrite anything automatically because what if you didn't want it updated or what if it overwrote the wrong thing or what if he made a mistake on his LinkedIn and you lost data? So we try not to overwrite anything, thus we don't auto-update anything. But that being said, if I go to Terry's record, I could always jump right to his LinkedIn, see what's going on and when I'm looking at the LinkedIn page, he's got a new photo, he's got some new stuff. So what I can do, I can go ahead and click the PC Recruiter Capture app. So the Capture app is going to let you import from all these different services, all these different tools. Okay, so you'll see what it added, a click to update over here to the far right. So what I can do is if I click that update, that's going to pull his information in. It's going to let me update my existing record, but I get to pick and choose what I'm going to update. So I'm going to say yes, direct match that's the guy let's review so I can go through here and I can kind of pick do I want the photo I have or his new do I want the title I have or his new it's the same but I can kind of toggle through here and see what I have in LinkedIn and what I have there so I can kind of see if I want to pick new old whatever so I'm able to kind of pick and choose anything I want to update or leave alone and then I could maybe throw on a searchable note put them on a roll up list link him right into a position if I want or I could just hit submit and update the information that I found so in this case I only updated the photo kind of freshen that up a little bit so I do have a way of doing that but it doesn't happen automatically but we try not to auto overwrite anything there we also interface with zoom info and hire easy so the zoom info you might have noticed up here that's going to allow you to if I click that zoom info it's going to open up zoom info let me log in and do a search for data within zoom info and then when I get my results I can mass import them into pc recruiter because we use that quite a bit so tell me how that works you guys well I don't have a zoom info account but as I clicked it it goes right to my login and then it's going to allow me to kind of take my results and pull them right in I may have a video I'll see if I have a video I can share that shows it in action because sometimes the partner company will do a video to show it in action there. But as I understand it, it lets you search ZoomInfo and then pull the data in mass, same as it used to, one still does if you were using Monster Career Builder, same exact thing. If I click on like five boxes of people that I can grab all that data all at one time rather than doing it individually? I believe so. I've never seen it, but I believe so. I believe that's how that is set up to work. So you can pull in 5, 10, 15 records all at once. We also have a ZoomInfo button down in the individual records. So if you want to go update via ZoomInfo, you could click right there. That's going to launch ZoomInfo. It's going to authenticate and then you can kind of pick what person. You can review the data. So if I'm looking for more info on Terry, I can update this specific record using ZoomInfo or HireEasy. So we have a partnership with HireEasy, used to be HireTool. So HireEasy and ZoomInfo have an individual click to update data enrichment integration right from the actual Canada record within the system. So that's going to let you use those two services to work with that as well. Okay. As you may or may not know, we work with RingCentral for click-to-dial, click-to-text. That'll record activities for incoming, outgoing missed calls. So that's going to be a nice piece there. Their mobile app nicely complements PC Recruiter as well because you can get calls anywhere you wish. And it's going to note activities. We also now have integrations with Google Voice and Zoom Phone. So you can click-to-dial using those. They don't, however, record activities. So those integrations, their APIs didn't allow for it, so we don't record activities for them. the best phone and only text integration. So that's going to be a nice complement to PC Recruiter there. And then we recently wrote an integration with Quill. So Quill actually does the meeting notes. It'll transcribe those notes from a call and attach them into an activity or note in the record in PC Recruiter. So if you had a Quill account, that's one we integrate with as well. And then we also added our AI suite a little while ago. And the AI suite is kind of comprised of four areas. Three of them are going to be content generators. One is going to be a search and soon to be an auto match, which I'll tell you about. But some of the automation, so if I looked at, let's see if I can have somebody who has a resume. So I just want to find somebody who has a resume so I can get that there. So let's go to Aaron Edwards. So I'm going to go to his record. So if I wanted, I could generate a candidate summary. So you always had a candidate summary field within PC Recruiter. It was previously used just to paste in empty or just to paste in maybe a LinkedIn summary before we had capture. Some people would kind of draw something up and put it in there. But what we've done now, we've added an AI generator button to that summary. So if I click that AI generator, the AI suite is going to take any resume it sees and any field data, and it's going to generate a custom summary for this person. So it's going to kind of give you just a basic AI-generated summary of the individual. You can click it again to regenerate. Sometimes it'll put bullet points or slightly do it a little bit different. So you can regenerate a candidate summary there. Save that. That's going to be something you could use as part of a candidate presentation, and it's all searchable data. So just a simple summary. Grab that. Are you able to add a company logo to that or like that? Or I guess I can just copy that and drop it on our own company logo. Yeah, copy that. You might be able to pop a logo in the top just at the top of it. I know you can add a logo header to every resume. Somewhere you'd have to put it in there manually, but yeah, you can insert an image right there. So you could do something like that. So I could save that and that's going to generate kind of a candidate summary. So that one people really like because it's just a quick little hit. hit the AI it's going to throw in a nice summary so people like to include that in their their profiles there okay so it's kind of bullet points of info net there we've also added that same piece to the position screen so there is now a job description generator so if you had a job within the system and I wanted to look at this job opening maybe I don't have this I can go ahead and click the job description generator. I can click OK. That's going to kind of take the information it finds on the job in the field and in the company, and it's going to kind of throw together a little basic AI-written job description. So kind of helpful. Not as helpful, I've heard from people, as the candidate summary, they don't like it as well, but it kind of gives you a starting point for a nice job description if you don't already have one. So that's going to give you something like that. So you mentioned something about matching. Let's say we have a job description. Are we able to use Is that the match candidates in our system that align with that? You are. That's going to be out next week. So it is just finishing up development, but they are going to somewhere. And if I had to guess, I'd imagine it's probably going to be an action. They're going to put in there an auto match. So you can click right in there, and it's going to bring back the closest 15 to 20 matches of people in your PC recruiter database to this specific company. I mean, to this specific job. So it's going to kind of give you the best match if they're in your pipeline or not. And it's going to give you the option to add them into the pipeline to start them through a process if you wish. So that, like I said, you know, that's our old pipeline. That, like I said, is coming out, I think, next week they're releasing it. But they're just doing the final stages of testing on that auto match. So that is something people have been asking for quite a bit, that auto match. So I was really excited to be releasing that. We also have an email generator. So if you go to anybody within the system and you go to your email screen, you're going to be able to click the same AI link. And that's going to pop up a little generator, kind of chat GPT-ish. I can say I want it to be casual. It's going to be follow up. It'll kind of generate a text. And then I can kind of respond to it several times. Mention the sales manager job. so I can throw something in there it'll kind of then add that into its text and it will then I can say propose a scheduled time next Tuesday at five or something like that and I can go back and forth I can then go use the text regenerate it a little bit differently if I click use the text it'll just insert that right into my email so it kind of helps generate emails they've recently also added this into where you create an email in a sequence or create a form letter they've added it into there as well. So that's another piece of the AI. And then the other part of the AI auto match is an AI search. I'm not partial to it because I've been doing this 26 years here with Main Sequence. I like Boolean. I like concrete. I don't like to do show me. I just don't like it. But you can go through here. You can do a little bit of an AI search. You can do like show me names in Cleveland or what interviews were there this month or what calls did I miss today? kind of some stuff like that so I can look at what jobs have no interviews so I can pop a quick question in there and it's going to pull out a list I kind of give you some some feedback back it's good for finding jobs with no interviews finding candidates I haven't talked to in over three months and stuff like that not good at finding things in resumes or boolean or like a searching experience or anything like that but it's a nice way to quickly pull up something you're looking for like jobs with no interviews so I found that right there so kind of a basic search they're building on it they're improving it and the more people use it the more it improves I just I'm always partial to a boolean search but this gives you another option search available there too so that is kind of the AI suite that is part of this PCR 9 package now I want to also show you what we've also come out with PCRM so PCRM was going to be a redesign a new interface for PCRecruiter 9 but what happened is since it was a development for quite a while they actually added in some some more CRM style features and actually spun it off as a separate product however what we're doing now is when we sell PCRecruiter to a new customer they get both one price you get both you get PCR 9 and PCRM since they share the same database I could use PCRM and you could use PCR 9 in the same database we're going to see each other's activity real time 100% of the time because they're sharing the same database so this is a new interface to PCRecruiter so I can log into the exact same database you'll see it's more of a left to right style as opposed to up to down if I go to names I'm going to see Terry Stidham was my last person I was looking at because that's what we were just working with there he is right up top I can edit in line if I wish I can also go right from here I can contact with an email, a call, a text right from my main screen. I can add an activity, a note, throw them on a roll-up list. If I click, of course, into his name record, it's gonna slide in from the right-hand side of the screen. So that's gonna be how I access my records here. I can full screen it. I also have the capabilities, since I go through here, to set up a custom workspace. That's gonna be kind of my main landing page. I have a custom workspace here, and that's gonna show me maybe his resume, a few important fields. Maybe I show his activities. And then I also have my details, which is every single field I have on this person. I like this because I can go up into the search and I can say, I want to see all my phone number fields. Type in phone, isolates only the phones. If I type in email, it's going to isolate only my email fields. Maybe I want my activities to show right next to details between resumes. I can go to my dropdown. I can drag and drop them right there. It's going to instantly real-time snap that up. I can even tag a few tags up in my main menu bar up at the top here. You'll see I have like a few tags I've selected out of my keyword tags. I can pop those up there. A lot of people also like the ability that you can pin. So if I wanted, I can pin him right up here in my main menu. I can go up and see all the pinned people I have up there. Maybe a job and a couple of people that I pinned right up into there. So I'm able to easily do that. Oh, I unpin them. I repin them. So you can kind of pin him up there. For quick reference, I can jump back into the radiological control tech, the position I pinned earlier. Now I'm looking at a position. Same pipeline, so it's going to have that new pipeline. I don't know. Is this the pipeline you used when you had PC Recruiter, this colorful, interactive one? No, we didn't really have that. Okay. But that's basically what we're looking at somebody else. You just kind of move people through the process. You drop them all like in your inbox, and then you kind of move them through the different stages. And you can go ahead and customize as many different pipelines as you wish. Each pipeline has up to 18 steps. You pick your colors, you pick your terminology, you pick what order they're in, drag and drop. You could even set up automations. So maybe when I drag them to phone screen, it'll pop them a quick email that says, hey, when are you available in the next three days? Let me know three times. So you could have automated emails sent out as you move someone there. And it's also then when you build that, pretty much anything you do in this pipeline is going to be then be part of your analytics reporting. So you're able to look at a report. What side of PCR is that considered as? this is PCRM. So it's a CRM product, PCRM. And it has pretty much everything PCR9 has, but adds a deals pipeline. So that's one of the big things we added to it. So there's now like a sales funnel. So you can put companies in here and you can go through and mark different specific activities you want to do. It'll keep a checklist as to where you are. You can go through here and You can do this for both marketing the candidate as well as working on a search. Oh, you could. I think marketing a candidate is, I guess you could do it this way. I've seen people use the deals for either a company, trying to market yourself, your services, or to a specific position. Maybe you know that Vandelay is hiring a new CEO. You might put the position in here to drag it through. but usually people would go in a pipeline a position pipeline but I bet you probably could put one here well let's see if I add one it goes to a company so you're gonna have to have a company so this is more company centric the pipeline there yeah but you're going to be able to do some reporting on that forecasting on that and so on and you see like the analytics they're gonna look the same in both versions but you're going to be able to build custom metrics so you're able to look at a report here I'm looking at first second third interview or first, second phone screens, but you could have every step of your interview process in there. You can look at different time periods from last year to this week. I could break it up by job, break it up by client, break it up by employee. So you have all these different custom metrics reports that you're able to interact with. And that's going to let you keep tabs on what's going on in the system there. And this specific version or this specific analytics looks the same in PCR 9 and PCR M because it was built when M was already in development. So it was built to look like both there so yeah so that's a little bit about what's new so some of these records like I said are going to look a little the same like the schedule looks very much the same but some things look different what we try to do in the PCRM was make it if you figure out how to use it if you figure out what happens in the action column what happens when you click Edit on one screen it looks and works the same in every screen so you have the same thing for companies the same thing if you look at a company record you're going to have the same workspace the same tabs the same icons the same ability to pin everything's the same no matter what you're looking at there so the nice part is you can use either and maybe you start off using only PCRM or maybe a lot of people that have used nine before they go to nine and kind of slowly creep over to PCRM maybe some people stay in nine always so you can do either or or EMI. Okay. And what's the, if you go to the main page on M, what's that look like when you just go to like the little, the little home screen? Yeah, this is my, like the dashboard, the MyPCR screen. And you have some different stats you can throw in here, recently viewed records, recently modified records. If you go up to the little pencil, you can pick and choose a number of different things. You can just drag like an info panel, whatever you want to throw down there. and you can kind of move things around and you can put something different in there if you want, or I could trash it, or I can drag these things around. So it's very configurable. The dashboard is going to be the first thing that comes up. The add screen is also kind of slick because what you can do is if you go to add, you can drag a whole mess of files in here, or maybe I want to go to add a name and I want to put Neil in here. And if I go in and I put Neil, I'm like, oh wait, I want to add a company. I don't have a company in the database. I can go right down here, at a new company at once, I can say it's going to be Best Buy. I want to then click over to Neil. I want to link him to my draft record, Best Buy, so I can actually do a little more heavy-duty edition of records. Yeah, start a whole new thing, yeah. Okay. I can even upload an attachment, add that in the mix, link it to the candidate's record, or parse it as a separate resume and add a different person all at once. How good is it about duplicates and stuff? Oh, pretty good. You can actually, there's a check duplicates button at any time. You can click even halfway through, and it says, Neil has no duplicates, but this does have a duplicate. If I click right there, I can see I already have it. And I can go through, pull the record and update it, and it's going to tell you what it'll do. Or you can discard the duplicate and just say, yeah, I want to add it again. So you can kind of look at it halfway through, or when you hit save, it'll look for duplicates as well. There's also a duplicate report. If I do that, like if I have like sometimes I may have like five best buys in the system. Am I able to combine those? Like I don't understand. Like the system we're using now will a lot of times create the same company over and over again. It drives us nuts. So how do I know that there'll be one there and you can just combine it right there? Yeah, I think what I can do, so I'm pulling the record information. So the information from the Best Buy record will be used to fill the empty fields, allowing me to, oh, okay, so if I hit okay, it has pulled in the information of that record. And I would bet you that if I hit submit, let's see what happens. I think I probably just updated that and I might have even added Neil. I've never actually tried it. I've shown it, but I've never tried it. So let's look at Best Buy search. Best Buy. I've only got one, so it did not pull in a dupe. it did take that and let's look at any names that are associated to see where are the names I've got to Neil yep it added the old blank last name so yes it found the dupe allowed me to kind of merge what I was trying to add into the existing record and now I had Neil added new to the existing record that I had for him so he's not right in there today so yeah we've tried to make that a vast improvement for duplicate handling duplicate merging duplicate identification everything like that okay would you be able to shoot me would you find that video on the same info stuff would you be able to shoot me an email with that video I will I will I think I had someone else today asked for it too so I'm going to look it up and kick that over to you let you take a look at how that works I'm almost positive I have one see I can put that over there pricing for PC recruiter 115 per user per month that is with a one-year commitment that is going to get you everything the PCR 9 the PCR M and everything we've looked at today that also there's a one-time setup of 750 that is for the whole office and that includes set up of the both links and the database assistance if you wanted to post jobs to your website install it to hooked without look and saw the capture piece to import from LinkedIn anything like that and then it also includes 10 hours training so you have 10 hours of training with one dedicated trainer on our team and then of course not to mention you have call-in support online support helped us support online chat on our website we have an LMS and our whole Learning Center so you have a lot of avenues available to get assistance on the system how about transfer number or metadata that we have right now and put it into there is that include that no that's a separate thing Top Echelon, that's about $1,000 to do. $1,000 takes about 90 days. So they would map that in. We've done Top Echelon quite a bit. So they have a standard map, but your data is likely a little bit unique. So they'll kind of work with you to custom map the data into the center. And you still use, like if we text in RingCentral, it still uploads all that information as we text and communicate or call someone, all that stuff? Yes. Mm-hmm. Yeah. Incoming, outgoing missed calls and texts. including the actual text of the text if you will. You also have another option if you wanted to let's say you were looking to get this going next week and you were ready to get set up you didn't want to wait 90 days to convert the top echelon data if you can get that in the CSV you can map a CSV of that data into PCRecruiter with the guidance of the trainer at no cost of the first training. So some people go that route even if you had resumes get those into a word folder we have a resume inhaler which will mass parse those match them up to the existing record in PCRecruiter that you brought in from the spreadsheet. So you you have some additional options if you didn't want to go the conversion route. If you went the conversion route, you'd kind of be getting trained on PC Recruiter while the conversion was going on. You would be working with the conversion coordinator so he would kind of work with you and show you your data, make changes, kind of walk through that process. And then you'd agree on a final go live date, usually like a Friday once the map is done, and then they would get one final backup from the top echelon and then run it over the weekend. You'd be up and running that morning, likely starting some training with your whole team shortly after. So you could do full conversion or you could do a CSV import in a resume in HEMA. Gotcha. Okay. Gotcha. Okay. I'm trying to think if there's any other questions. I mean, it's pretty straightforward from what I remember. I mean, it just got some updated things to it. Okay. Well, Jim, I appreciate you being able to carve out some time so quickly and you went through it, I mean, it seemed like an old glove. We were to put it back on, you know, with the M thing is a little bit new and different, but that stage process is kind of what I'm seeing. Now, will I, like going back to that stage process to see all your stages in the mix, you only looked at that like one time or you see that the positions are like... Each position has its own pipeline. So each position is going to have its own specific pipeline. And so you're able to see these are the people I'm considering for this specific job. But what's cool about it is if you go to a specific record, like if I go to Hassan right here, if I open up his name record, I'm going to have a pipeline on his name record, too, which is going to let me see any and every job he's ever been linked to and how far he got with each one. Here he was not qualified. He was inexperienced. But here he got sent to hiring manager just recently. So that's going to give me kind of a snapshot of the candidate and everywhere they've been. And then each position is going to, of course, have its own pipeline showing everybody that's in consideration or everybody that's on the process. You can see them too. Okay. Okay. Do you guys have any questions on your own? No. I agree, Brad. It's obviously a lot of, you know, brings back some memories. yeah hopefully hopefully we've addressed anything that was uh we've tried to kind of if we hear things from people like that kind of that we're being complained about we try to address them uh so hopefully anything you've had in the past has been addressed and improved upon with all the new integrations features and the new pcrm piece there um yeah when are you looking to decide on something any concrete time frame or when should i follow up what would be i mean we're here for for a reason. So, you know, I think we're just trying to get a collaborative thought process on which one is the best for us. You know, that's kind of it in a nutshell. You know, yeah, I'll be honest, that's what we're, we're pretty close, Jim. So, let us talk about this on our end. If you can shoot me over the Zoom info stuff, that'd be great. And I'll circle back with you. I'll probably get back to you next week, either way. Perfect. I'll put you down maybe a follow-up mid to late next week if I haven't heard anything, but reach out anytime. Any questions or anything you need, let me know. All right. Thank you so much, Jim. Really appreciate it. Thanks, Jim. My pleasure. Thank you all for the time today. We'll talk to you soon. All right. See you. Thanks, bud. All right. Bye-bye. Take care. Bye now.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1762.400115,
    "salad_processing_time": 130.4627866744995,
    "overall_processing_time": 1762.400115,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID.  Enter your participant ID followed by pound.",
    "job_id": "5548ee2e-85a6-43e9-8256-33e4ebc54a01",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 5
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3060128823036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}