{
  "recording_id": "3061374753036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:10:22.152176Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:10:22",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is Garrett. How may I help you? Hey, Garrett. How are you? Good. How are you? I'm good. My name is Ahmed Kurtam. I'm with DesignForce. I'm one of your customers. Okay. Got you here. Awesome. How can I help you today? My team is having a total meltdown on ways to be able to communicate with our clients. Okay. So I am less knowledgeable about this, but I have browsed all of your articles and gone through all of your additional training. And I don't seem to have a streamlined idea of what the best solution is for what we're trying to accomplish with in terms of client communication of our search process. Okay. So, what we have right now, we're an agency and we have a number of routine searches and we want to be able to have either real-time reporting with our clients or a weekly report giving dispelling our pipeline and our pipeline status. And what we love is the view within pipeline, within PCR9, where you can see it through staging and in summary of each candidate. We've never used client portal or presentation. It seems presentation is maxed out at 10 people. Right. For presentation, which doesn't work. We want to be able to reveal both our source or what you might call a roll-up as well as people that have entered into the pipeline or the candidate process. Mm-hmm. Okay. Help me through this. So the presentations, yeah, wouldn't be the answer. that's just going to show you certain fields per record and their attachments and resumes as a presentation of who the candidate is but there are let's see there are reports called applicant tracking reports as anybody mention it yeah I've seen those and let me just go to report I was just looking at pipeline reports applicant tracking report and and then I would export that into Excel right so you can adjust date range and then certain filters so filter by the position ID if you just want to show people in a certain position. You'd filter by company name. So any of the positions related to a certain company, you could filter even by certain steps. So just show everybody related to the offer pending step if you have one of those steps or something. And you could use those filters in combination. And then, yeah, you would export it to Excel, like you said, and it would show you date and time stamps of you know where people are in what steps um and did that yeah might be a good starting place for what you're looking for still not thrilled with that excel sheet it's a aesthetically displeasing and b um Can I add a notes section? Like, can I edit this report? The applicant tracking report has a few fields that I don't want, right? like username, position ID, date posted. I mean, they're all blank, so I don't want them on the report. And then gender, too, right? Like, that's not great. Right. Okay, yeah. You can build a custom applicant tracking report that has, you know, all those same filters when you go to run it. The problem is when I've come to try to build a custom one, I don't know what field is what because of an extraordinarily large list of fields that are populated from my company's database. database. Like it has like all of these weird titles and be like copy of copy, you know, company name. And it's just like getting into the type of report that I need is like, has been really laborious. Yeah. So it might be, let me see here. I'd like to share my screen with you and show you what I'm talking about. Yeah, that'll work. Yeah, if you just want to open a new tab in your browser and go to meetings.ringcentral.com. Okay. And once you're there, is it asking you for a meeting ID? Yes. Yep. Okay. That's 220-778-326. Because my team is, like, really unhappy with me using PCR, to be honest with you. And I'm trying to find a way to make this work, but I'm not sure it's going to, given what I'm seeing here. All right. Yeah, I see. All right. So you can just mute the audio at the bottom left so there's no echo. And then click the blue share button down at the bottom and select your entire screen up towards the top. Awesome. I can see that. So, I'd like to have my team be able to update a position. So, what I'm aiming for. Let's start with that. Okay. I love the way this looks, right? And I wish to be able to show that to my clients. If I could have a spreadsheet that could have something exactly like this, right, and, like, remove this column, what I would love is it to be gridded this way right and and then if it could have like the ability to be able to push like a note section here and have that be a report that would be all okay yeah so our pipeline doesn't really export and end up being like a visually similar thing. It is going to look like that applicant tracking report in Excel, but we can build the report to just show all the fields that you want. So name, status. Let's start with that because I can use an AI tool if the report's being generated, right, to be able to then make it aesthetically more pleasing. Oh, there you go. That's a great idea. So, yeah, so let's jump back to the main PCR screen, and I'll show you how to build a custom report, custom applicant tracking report. Okay, and then, oh, I think you went to PCR. There you go. So at the top right, there's a gear icon in the action menu. So far top right of the screen, click on that. And on the tabs across the top, we want to go Pipeline, and then go to Add at the bottom right. Yeah, that's where I would go. So in the center where it says Title, and it has a little code that says Report Title, I would adjust that first. Just give it a name. And it looks like you might already have that. Okay, yeah, there you go. All right, so then you can collapse where it says header rows. Those get automatically filled in after you put in your body rows. Click there, and then you could use that search bar at the top to try to find whatever fields you want. So what's maybe the first one? This is what I'm saying to you. I have no idea. you know like you see how many of these are showing up and i'm like yeah they're all i want exactly okay so you're gonna want let me just first name and last name right yes all right so they're listed right there but if you wanted to find them quickly you could use that search bar at the top and type in the word like first and it would narrow down and show you just the first name field. So just for practice, go ahead and just, yeah, try typing the word first up there. And it's just now showing you the first name field, and you can select it, and it gets plugged in there. That's probably the easiest way to use the tool, searching through the fields. So there's last name, excellent. So body rows, what does that mean? Those are going to be the columns in your spreadsheet. Okay. So, I want to do... If you click in there and just choose a different field, it'll replace it. Yeah. So then I want name, company name that they work for. Is this company name that they work for currently? Yep, exactly. Well, this one says current. That is a custom field that your organization has created. So we can go check on a name record in a new tab to see which field you do want to point to. So yeah, if you just go back here, is there a certain field on a name record that you're trying to reference? The one that I want is title. Okay. Right here. Excellent, so yeah, let's go back and we'll type in title in the search bar. Well, first I want company name. That didn't come up. Yeah, so it doesn't use spaces, So yeah, just start typing the first word rather than finishing it all. Okay. And then title. There you go. That one? No, that's name field. Yeah, it's the name records title field. So that's correct. Okay. Then I want credentials. So I want this guy. Okay. Then I want group by stages. So, of the fields that are here, can I have notes? Yeah, we could check to see if notes is available. Just, I guess, start typing notes see if it comes out position no no okay that's notes about the position try note without an s at the end no okay yeah so that isn't available in the custom report here but we could build you a custom sequel report there are people on the team who know SQL queries and know how to use SQL language so that might be... What field of nodes can I put in here? Is there anything in here that references an activity? So you can scroll up and search for activity. You're going to want to look for anything on a name record. It does not have the notes section of a name available here, but you could look for activity with the search bar. So it has last activity. Last activity maybe? So it usually shows up just as a date. So I'm I'm wondering details last activity, if that's different, the one that says details last activity. We could try that if you wanna enter details last activity. Okay, and then I want the pipeline stage. Okay, yeah, so that's gonna be when you run the report, you're gonna select what position you're referencing, and then it'll show you what stage they're in. So let's do the, yeah, search for, yeah, let's search for step maybe. Let's see if that, no, okay. Interview count fields, stage, roll up stage, stat stage. Okay, let's, don't use the search, just kind of clear that out, and then go down to the interview field. so we can see all of the available interview fields heading. So, yeah, just scroll down. We're looking for that interview heading. There we go. So it should be interview type. That will show you the step that they're on. Did you see interview type? Yeah, it's kind of towards the top. Yeah, there you go. And then there is a... You could... do a date along with that of when they went into that interview type? It was one of the first ones under interview as well, I think. Yeah, so interview appointment date versus interview arranged date. So the appointment date would be if you set a date for an interview where arranged date is the date that you place them into that pipeline step. Right. We have their current company. Yeah. Their title, current credentials, and the current interview. And then we have some... Yeah, that last activity is the only one. I don't know if it's going to show you what you're looking to see. And we can test that out. And if not, I think the next step would be to have us build a custom SQL report for you. So what else should I put here? What are these fields? So the field groups and the totals, those are ways of just calculating total number of unique names that are in this report. You would choose the first name field or last name field and it would show you the total number of unique last names and with the number next to it. Kind of like just a way to summarize the data or like current number, like the total number of people in a certain step. I definitely want the report statistic and the activity type distribution and the step distribution. That would be awesome. Okay, yeah. So that would be just choosing the field you want a total for. so you can maybe do the interview type to see, you know, the total number of people in each interview type. All right, so, yeah, just start typing the word interview type maybe. So we're going to get a much better report than that. And then these things here are going to be much cleaner if we have these statistics here. See what I'm saying? Yeah, so it would be total number of positions unique, total number of available positions unique, number of internal positions, interviews. So, yeah, I would definitely put an interview type as one. So, this is field groups? Yeah, so you're just choosing a field to have statistics and data about in those field groups. No, but I'm saying, Steve, there's an Excel sheet that's going to get automated out. And this is what I pulled from the new pipeline report that had multiple tabs and these graphs. Is that what you're doing right now when you're saying, let's get that set up? Yeah. Okay. Yeah. Okay. All right. Now, what do I search for here? Interview type. And it should be a little bit lower, interview.interviewtype under the interview fields heading. How am I supposed to know this? So ridiculous. So hard. All right. What else? Total number of unique candidates. Okay. So, that would just be how many names are represented on this. So you could just put in the last name. Let's see. Or let me see. What is the best one for that? We could actually. Did you say that the report you have pulled up on the right is a custom report that you ran in your database? No, this is your new pipeline report. Oh, okay. The one that's already pre-built in there. Okay, I see. Correct. Correct. New pipeline report. Okay, I was thinking we could cheat off of the setup if it was a custom one, but the new pipeline, I'm not able to see what fields equal those particular total number of unique candidates, those types of things. So I would do positions unique. So, yeah, you could do position job title, I think, or position, yeah, position ID or position job title. Let me think there. That one's probably good. And you could do, we're trying to get a count of how many unique last names or how many unique names there are. I'm thinking the last name might work, but it also might not because if there's two candidates with the same last name, it's not going to give a unique count. And decision . Here we go. What is all this? Are you seeing this? Interview custom design for us reviewed. Okay, so those are specific steps in your pipeline. Yep. That's what I want on all of these. Okay. So that would tell me how many are reviewed and how many are in outreach and how many are in candidate screen, et cetera? Yeah. Yeah, the problem is in this, you only have six fields to fill in with the field group. It looks like you do have more than six steps there. Well, some of them are copies. Oh, so when it says copy, that means that you have different pipeline templates in your database. And so it's just showing you the steps for each pipeline template. and one of your pipeline templates was named copy of pipeline or something that you guys built. So it would be what template and then what step inside that template. But yeah, I think you're going to run out of fields because you only have six there and it looks like you have a lot more steps. So I would definitely recommend having us build a custom SQL report where you basically just write out all the fields that you need, and we will build it with SQL rather than with this custom report builder. It doesn't look like there's enough spaces for what you want. Well, can we save this and see what this looks like? Yeah, absolutely. Go ahead and close this pop-up window. Click on Reports on the left again to kind of refresh the page. And then go to Pipeline Reports, and you should see it next to Custom. Yeah, there you go. Is that the one that we just did? I thought you put your company name in it. Let's see. Oh, yeah, DesignForce, yeah. Okay, and then you could choose a certain roll-up list of names if you want. So only those names. You could use any of those other filters below and also select a date range. And you have to do change that to name roll-up. I think you only have you have position roll-up selected But that was actually a name roll-up. So Yeah, and that drop down there go to names. Okay. Let's go ahead and run that see what it looks like Okay, so what was that last – that last activity one is blank, so that wasn't the right field. Interview type, arrange a – This is pretty close. This is pretty close. It's just that last – Can I sort by interview type? Yeah. Yeah, you can sort by anything once it's in Excel. I think at the top right is sort and filter. I'm not like the best with Excel, but there's like an AZ. Yeah, expand selection, good, hit sort. Let's see if it's able to do that. No. All the, what was it saying in that pop-up? It had to be the same size. Okay, yeah, because you do have that one at the top. That is a full, yeah. Can you have it sorted by that? Let's go back to our filters. Sort by job title. Switch that. See if you can sort it by a different one. Doesn't have the interview type. type. Maybe it didn't post it. No. I want it by interview type. Okay. Let's go back to Excel. And if you... All right. So highlight the word other underneath interview type downwards. So not including the words interview type. Okay. And then hold down shift and select the final right there. Yep. What does that say? To do this, all the merged cells need to be the same size. Okay, so which ones are merged? I'm guessing it's this one here and this one here. Anyway, we need to get rid of last activity in that report template. Okay. So we're going to go to reports menu. Reports. You just go to the gear icon at the top right of your action menu there and go to the placement, or no, pipeline reports and click on the one you want to edit. We'll go to the body rows heading and get rid of that fast activity. Do I just move these guys over here now? Yeah, that will work. Okay. Okay. And then what was it? Okay, yeah. We did a field distribution. Let's see what we have here. So interview type, that is not showing up with anything. But the other is showing there was 40 people in other. OK, three out of process. I'm not sure. 1, 2, 3, 0. So, sign force pipeline client interview. If these are the – okay. These are the ones that we're looking at. Yeah. Yeah. So it's show a zero and a one. Yep. That's position ID. Other. This is position title, I think. Okay. So interview type almost looks like a heading. and below that automatically we got things like other DF vetting process, and it's giving you a distribution of each person and what step they're in. So if you go back to that Excel file on the right, it says interview type kind of as a heading, and then we didn't put in other or DF vetting process or out of process. Those already came built in as soon as we put in interview type. So it looks like the people in that roll-up list, 40 are in other, 25 are in DF bedding process, and three are out of process. We saw all that data just by putting an interview type. Which one is interview type? It was the first one we had entered that we removed. Yeah. Hang on. I'm going to close. Close. This. Oops. Here I come. Menu. Here I come. Pipeline. This guy. Yeah, so that interview type, it automatically populated rows that said, like, 40 people are in the other. 25 are in the DF vetting process. Three are out of process. and then it shows our next one we entered called position job title. So it doesn't look that way. That one worked, yeah. Oh, actually, no, it's a heading again. Position job title did work. It says right below it, licensed surveyor 56 are in that position. Licensed land surveyor 12 are in that position. It's the custom ones that were bad. Yeah, those ones didn't really pan out. I'm not sure what they were even showing us. Those were strange. This guy. Okay, so just so that I'm clear, what I have to do is when I am in a position, say it's the licensed surveyor. and I'm in pipeline, and I want to represent this pipeline in that report, I have to take all of these people and add them to their own roll-up. Is that right? No, you could actually just filter by this position. So you could, in your filtering when you're about to run the report, say, show me all the people in position ID down below. How do I do that? Show me how to do that. Okay, yeah, clear off that. And then down below under filters, you have filter by job title. Click the little pop-out icon to the right of that, and you can search for a job title and select that position. And that will filter just by that one. then did that and this is what we're looking at this is our I think so. Why does it look different? Has the last activity... Go to the field distribution, see if it looks the same, the tab at the bottom. Yeah, okay, it did save our changes. Okay, so interview type, I see, okay. What do I need to fix? Hmm. So there's 74 in other 14 out of process, DFA process one, mission title, license surveyor. There's 89 people total in the license surveyor. Okay, yeah, that one. Okay, so it's not showing you each individual step with the total next to it. So I think that's what we're after in that field distributions thing where we're kind of falling short. So, yeah, it's like we got close, but I don't think we're able with the capabilities of this customized report screen to do it. Where making where our team making a custom sequel report will probably be able to show you exactly what you want to see For field distribution even for those fields on the first tab, okay Can we have it sort a specific way on on this so that it's by last activity Yeah, that can be part of your instructions for the custom sequel report what I'll do is I'll open up a ticket and Through email, you could just respond with what you want. Here's a couple things. I mean, for one, is there any way that you can service me enough today is my first question. Like, can you get me as close as possible today? Because this is something that is like a full-speed train running towards a number of our clients that are now wanting more real-time. Like, I used to be able to give a client a user ID and a password, and they can look at the pipeline through a portal. Is that no longer a thing? Oh, yeah, that is available, the employer login. Yeah, we do have somebody that still sets that up on our team. So we could go that direction instead of running the report. Can you show me what that looks like? I can't exactly do that right now. I'm jumping into a scheduled meeting in a few minutes, but I can get you in contact with somebody who sets those up and they could give you a full demo or show it even in your database, if that would help if you want to go that route, especially because the reports, you're saying like kind of real time is the goal. Reports are something that one of your users have to run the report and then email on a regular manual style basis. So it might be that this employer portal is more helpful for you than going the reports route. Okay. My question for you is, is there anything right now that are within this editing setting that I can have it sort by last activity? Not on that screen. I think the only option to sort of my last activity would be to figure out how to do it in Excel once you have it exported. Okay. The next question I have for you is can you tell me about where an employer login would be, like in my database? How would I give access to that? I'm not familiar with that. I would have to defer you to the person who sets those up in customers' databases, the employer portal. But here, let me pull up my test database on my screen. I'm just going to look around and see if it jumps out real quick here. It would be really appreciated. And then, because I know you have to run, and then if you can open that ticket so that I can give you revisions off of this report that we're really looking for. or if you could just take the notes of what you had from me so far and proceed that would be great um so yeah uh we could here let me see pcr website links to play down this um because i yeah i'm seeing in the links to be oh go ahead I was looking at like where in the name contact I know like where the like I was messing around with mine and I know here there's a system info right and there's the web extension and login and password what I don't know yeah that's for the contractors who are using our PCR mobile app to clock in and clock out to keep track of their timesheets that's there that's for that password and login yeah yeah the employer portally I really would have to just defer to you to the person who's familiar with those and what I would recommend is basically gathering the fields you want a report in case you want to go that way I do know the name of the report that you created today so I can take a look at those fields and include that in the ticket so as a starting place and then you can respond to that thing take off these ones add these ones something like that yep okay cool so yeah I will start that ticket and send you an email as soon as that's ready to move forward you can start that ticket and can you have somebody from your organization reach out to me about the client portal those are the two things that I'd like if you have absolutely all right anything else that you needed today? No, I will look for your email and correspondence, and I appreciate your help. Awesome. All right, we'll talk soon. Thanks so much.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1805.131211,
    "salad_processing_time": 271.375004529953,
    "overall_processing_time": 1805.131211,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence Technology.  This is Garrett.  How may I help you? Hey, Garrett.",
    "job_id": "079985ed-75c5-4c9a-acdd-b0d5bca31f1c",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence Technology.  This is Garrett.  How may I help you? Hey, Garrett.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": false,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3061374753036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}