{
  "recording_id": "3062113883036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:11:11.888306Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:11:11",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hey, Robin. It's Sean Reeves calling from Corrigo. How are you? Good. How have you been? Pretty good. I have a question. When I am exporting either a company record or a name record in either Excel or as a CSB, and it asks me if I want default fields and there's only one option. If I check it, it gives me default fields. If I don't check it, it just runs it. How do I control what fields I want to export? Because where do I go and adjust that? So when you don't check that default field, that's how it's labeled, that just gives you like all of the predefined fields. It doesn't give you like any custom things. I'm sorry, scratch what I just said. The opposite. When you just export and you don't check that box, it does what's in your layout. Okay, just layout. That's based on your layout of the roll-up. Now, if you check that box, it's just all of the predefined fields. So opposite of what I meant to say. Okay, so if you check it, it's just predefined. Right. So if you have, like, custom fields or things like that, like, if you check that box, It's kind of like a set list. Okay. So you have two options, really. You could either further customize your roll-up layout with what you do want, or you could – is it a list of names? Well, I'm working in companies right now. Just to bring you up to speed, I have taught myself to code in Python over the last two weeks, and I have been scraping database stuff, and I have been leveraging all of the AI tools. Like, I think I finally have a piece of cord with ChatGPT. Like, I know how it needs to. Chat sucks at going out and scraping. Basically, I think it's not allowed to, but I went and taught myself how to do Python, so I have scraped up all sorts of goodness. And what I'm doing is rather than going through a thousand of my companies in my database and adding addresses and adding this and adding that, I've scraped it off the websites and I'm just loading it into a CSV and re-uploading it. So I just want to make sure that I have all the right fields, like all of my custom fields and predefined fields so that it's ready to receive that information. So what you may want to do, if you don't want to change your roll-up layout, there is a like an option for names like a name report where you could specify the field that you need oh is that under report yeah but you'd want to first create the report like if you let me go around one of my databases hold on one second I'm in a customer database oops don't want to be there hold on one second no problem so if I want to do it in the in the actual export function if if I have done an advanced search and pulled up companies and I want to throw those on a roll-up and print that roll-up out or export that roll-up, I need to do it by adding to the layout and then not checking that box. Because if I check the box, it's just going to be the predefined fields. Correct. Okay. Now, you could do a name, I mean, a company report if it's based on companies, but I believe that one's more limiting. Let me just make sure. I think you can only get... So company reports, name reports. Okay, so there's just a summary report and a detail report. Yeah, that's not what you're going to want, though. Let me see something here real quick. Here, manage custom reports, company reports. And you get one, two, three times how many rows? One, two, three, four, five, six, seven. What is that? Eight. One, two, three, four, five, six, seven, eight. Would 24 fields be enough? Oh, God, yeah. Yeah, I'm sure it would be. Okay. So here's what you could do. And I'm going to send you to the Learning Center on this, too. Okay. Okay. analytics and reporting custom reports okay that way you have the instructions as well but i'll tell i'll tell you about i'll tell you about it too though yeah tell me about it address? My email address? I've got a new one. I actually had to restart, and I've got to talk to you at some point in time about switching over everything from being named Corrigo. Everything's fine. Zach and I are still friends. It's send it to Sean, S-E-A-N at Reeves, R-E-E-V-E-S and Victor, E-S, recruiting all one string of characters. Hold on one second. I lost my string again. I have way too many windows open right now. Nope, I do too. My God, it's like a hot mess. Sean, wait. ReevesRecruiting.com Okay. I'll send you this link. Okay. If you go to reports on the main toolbar. Yep. yep yep and then what you're going to do there's a gear icon at the top right which is where you go in to create a brand new report okay custom company reports and then yes you click on the custom company reports tab okay and then first thing that you're going to want to do hold on one second i'm so sorry about this it's all right not that one not that one not that one my gosh waiting for Robin waiting for Robin so it's reports gear icon alright so I'm just going to open up another window because I have no idea gear icon and then I do So the first thing is you're going to want to expand like that first heading if you don't have it expanded right now. Whoa, you mean hit add first, right? Oh, yes. Okay, so custom. The first thing, it's all these things that if I flip them downward, they'll show everything. Yeah, but you don't need body rows probably just yet. So let me get that report. so I just put my own report in there for myself whatever I want to call it what I want my header rows to be okay so where it says custom company report header when you expand that section you could keep what's at the left and at the very far right for date and username what you do need to do is where it says title in the middle clear up that field completely and name it whatever you want to name this report I'll just call it custom report for right now. Okay. And then you can keep header rows collapsed right now. What you want to do is go under body rows. Body rows. Okay. There are a bunch of empty openings right here. Yeah. And that's, I was counting before. I had it on one of my screens. I was counting them. So you have three. And the reason it's like three across is just like with a paper or whatever. You know, it's just. Okay. But if you get, like, what you would do is working left to right. You click in the first cell, and you're going to see company field. Pick a field, yep. And you'll just work left to right, and then go down to the next row, left to right, go down to the next row until you have all the fields that you want. Okay. As you pick a field, if you look under header rows, it'll put the field name as the column heading. Okay, I got it. So that's why you probably don't need to worry about header rows too much unless you go in. Because as you select when it replaces it, the only time you really need to go under header rows is if you decide to maybe pick a field at the end but then clear it out. You might get some extra header rows that are still populated. Or let's say in case you wanted it, instead of being company name, you wanted to say client. But that's just like the column heading as it exports. Okay. I see what's going on here. Okay. All right. So on header rows, I see that it's adding that stuff. As you select under body, it populates header. So I would probably just double check that at the end. Okay. And that wouldn't be as confusing to do it. And then field groups below that, that's not important? No. Field groups is like, let's say you had a field state. If you pick the field state, what it'll do is at the end, when you're printing this report, it'll give you a breakdown of all the companies in this export. So many had this state value. And then so many were in Ohio. So many were in Michigan, Pennsylvania, things like that. So I think for what you're doing, you probably don't need that in this case. Okay. Okay, and then anything for report footer, I assume that's just whatever I wanted to put in there if I wanted? Yeah, most people would just leave it blank. Okay, so this report... Really the title and the body rows that are needed. Can this report be exported as Excel or CSV? Both. Both, okay. So if I hit save on this, we'll just call it what it is. All right, custom report, and if I want to... So what you have to do is once you save or even go in and make a change in your saving, you always want to make sure you're clicking reports back on the main toolbar. Okay, so I can get out of this manage custom reports bit for right now? Yeah, once you've saved it. Okay, I think I did. You'll close out of there. Then you'll have to click reports on the main toolbar. I did. That's going to refresh the listing and any changes. Okay. So now if you go to company reports. There it is. option, you'll see it in there. And then you'll pick your roll-up list that you want to run it based on. Okay, let me just grab something and see what happens. Okay. And then at the top right, you're going to have your export options. They may not all be pinned, though, so you might need to go into that three-lined icon. Oh, I see. Export to Excel, export to PDF, export to Google Sheets, the hell with that. Export to Excel, CSV got it okay I usually probably want a CSV but that's like the most raw format where it doesn't it makes it so much easier where it doesn't have all the extra stuff that could make sorting or filtering more complicated yeah I'm going to get rid of get rid of Excel then just so I don't and I don't need it as a PDF I'm just going to put Excel there because that's CSV I'm sorry that's what I'm probably going to use Yeah, that's the more raw format that's easier to sort and filter. And if I don't put dates in, it'll just run it? Well, what you'll want to do is you have to select one of those options. So if you have them in a roll-up list, then pick the roll-up list. What's that? If you have them in a roll-up list, you can just pick the roll-up. So that way you can roll up to control which records, but then the report's controlling what you want to know about them. Okay, and if I just want to, how do I run this? Because there's no button to hit run like there is to search. The export to Excel. Oh, it is. That's okay. So PDF view. I'll just do PDF view mode. Okay, it did do it. So it did put those fields on there. So it looks like it worked correctly. So this is how, and the reason I want all of these fields is I've got Python set up to, if I, let's say I export, I've got a whole bunch of stuff. Like I'll have something from ZoomInfo, like a CSV from ZoomInfo, and I'll have something that I scraped from the website, and I'll have it saved as a CSV. And then I will have company names right out of PC Recruiter. So the first thing I do in Python is compare all of those three and do a lookup with some fuzzy, like I've got a fuzzy kind of program in there that will look at the company name, it'll make everything lowercase, it'll get rid of all of the spaces, like it'll get rid of extra things like LLC or LTD, and it'll say, oh yeah, Acme Corporation is Acme Co. because it'll look at the address and it'll look at the URL and it'll go, yep, that's right, that must be correct, and it'll slam all this stuff together and then I can put it back into the CRM. Because you know how if I, all that information, there could be 20 different ways that somebody writes the company name, and then if I try to upload it into PC Recruiter, I'm going to end up with four duplicates. So what this does is it looks at the column where it has, it'll say CRM company name, and it'll have however it is in PC Recruiter, and then it compares it to all the other CSVs that I'm trying to slam together and compare it to. And it lines up all the companies and all of the attended data in the right columns. And so far it's worked pretty well. And then I can just pick and choose what data I want to put into PC Recruiter based on, like, my fields and naming convention. Does that make sense? I think so. I'm starting to be like a real data slut is what I'm doing. Yeah. you're you're slutting more than I am well the thing is I have clients that don't they say they don't need my help but they could really use help with their data and but I am getting clients where I've made placements now where they said oh no we've got great team I just need you to get some data for it because that's what I did for the last six months for the company that was they were going to hire me full-time they had me build a database for them and I learned how to do some of this stuff while trying to do that. And I'm just getting better at validating my data and trying to figure out how to avoid duplicates and what's valuable and what isn't type of thing. So it does help my own recruiting though, especially in a field like construction where people, one company will describe how they do stuff one way and use different words and they'll call it one thing and another company will call it something else. So I've just basically built some tools in Python to kind of compare similar stuff and use Boolean expressions to sort through some of the stuff that companies say and put them into the correct buckets so I can find them again. One thing is when I want to re-upload this stuff into PCR, what I really need to key on, you know how you're doing a manual mapping when you put this back in as a file? Yeah. Is the important thing that my CSV to be uploaded, my target upload CSV, the columns in that CSV need to match exactly what the predefined field naming convention is and the custom field naming convention as I've defined it in PC Recruiter, correct? Well, when you go to do a CSV import using a generic file mapper, you could take any column name and map it to a predefined field because you have the selection. It's custom fields where the column has a match. And there's only like a dozen of them down at the bottom. Yeah, those have to be an exact match, including capitalization. And if you have an underscore or not, that's what's important. That's what I thought. Now, what's going to be tricky, though, is if you're going in and you're changing the company names in PCR, like different what's in your file, you need to have something to match the data up. Otherwise, you're going to get duplicates. as you were saying before? The only thing, see, what I've done is I've exported the company names out of PCR as a CSV. And then what I'm doing is if I'm getting data from other sources as CSVs, I'm benchmarking on what it's called in PC Recruiter. That's my benchmark or that's my kind of gold standard for. Or, in fact, I've got it where Python will spit out a – it'll give me two sets of output. It'll give me a 100% matched and then a problem children. The problem children are typically where there was something on my other data set that didn't match a company as it was pulled out of PC Recruiter. and that's fine with me because if it's not on the, if it's not in the PC Recruiter printout, I don't have that company in my database so I'm not worried about the problem children or the errant ones. I don't, but yeah, that's what I'm benchmarking on is and I, when I go to upload it, I'll go update, I'll make the selection of when I'm about ready to upload it and I get that pop-up that says for duplicate checking, I will go only replace information that's there or add new information if there's no information there. And I just key on company name, that last choice in the radio box, because I know that the company name is matched up correctly. So does that all sound right? I believe so, yes. Yeah, I know it's hard for me to describe this stuff because there's so many moving parts to it. but I don't know. Where do you guys, I mean, are you deep in the weeds like the queen of technical, or are there other folks there that are really good at like SQL and Python and all that kind of stuff? Who's like the mastermind at your team? We don't really get involved in that kind of stuff too much. Sean's good, isn't he? Sean's no longer with us. What? Yeah. Did he retire? No, he took another job at another company. Oh, really? He's been with you guys forever? Yeah. Oh, that sucks. Huh. Well, who all is still there that's kind of like, who would you go to? It's not part of their job description, but they're like, yeah, I know how to do this or that or the other thing. Probably somebody from our development or QA team. Oh, do they even? Yeah, they don't really. They don't even reside in Cleveland, do they? They're not part of that group? No, they're here, but, yeah, we typically have them working on projects. They don't really interface with customers. Yeah, I didn't think so. When I say I've tried to teach, I mean, for the last two weeks, I have been teaching myself Python, and I've learned enough to be able to read what's going on and beg, borrow, and steal other people's code to get it to do what I want it to do. but I'll be damned if I cannot find anybody, and I've called technical colleges, I've called universities, like I'm trying to find somebody to teach me actually how to do this where I could start at the top and just start typing in code like you would write COBOL or C++ or something like that, and I can't find anybody. Even my old employer at Roche Diagnostics, I'm like, I know they've got a business decision analytics team there. Maybe somebody will help me. But is there – I mean, where would you recommend I go to get better at this? I mean, I guess enroll in school. Well, yeah, I've looked. It's like, yeah, I don't even know what to call this. It's like people have told me Python is like a really old language, but it's doing everything I want it to do. But at any rate, sorry, I thought I would ask you while I had you on the phone. and I thought somebody around there would be doing some data scraping just to be able to do stuff for your larger clients and things like that. Yeah, I mean, that was really a developer skill. Okay. So it's not like something we do. I got you. Well, I thought I'd ask as long as we were at it. One other thing I thought about, A lot of my data sets have the state spelled out. Is there any way when I just – can I set some sort of button or toggle something to be on in PC Recruiter that when I import something as the full state spelling, that it will default to the two-character state abbreviation? Does it know how to do that? No. When you do a CSV import, it just takes the data exactly as it is. Okay. What I recommend people do is, because it's easier to do it in Excel before you bring it in, is to do like a find and replace. Oh, just do find and replace? Yeah. Okay. Shoot, even something like that, you might even be able to run through ChatGPT anymore. Yeah, I could. You could dial and change the state to a two-letter abbreviation. Great point. Yeah. Yeah, pretty soon I hope we're both getting close to retirement age because I think chat GBT is going to kill us all. Yeah. Yeah, I don't know what you guys think about it, but it does help you with stuff. You know, things that I would have been stuck on, you know, a couple of years ago, like every once in a while I'm doing like a custom report for something. They're like, oh, I wanted to do that. I'm like, I don't know how to do that. but sometimes it helps me to do it faster or fix a problem before I get stuck. Yeah, it's amazing what you can ask it. Like I'll take sections of this Python code and go, here's the error exception I'm getting, or here's what it's saying, what am I doing wrong, or how do I fix this section of code, and it'll spit it right back out at me. Oh, I see, you need to do this and this, or you need to tab over four spaces to match the element you're working in. I'm like, well, all right. And that fixes it. So, all right. Well, I'm going to be – while it's all fresh in my head here, I'm going to go forth and conquer and start merging stuff. But sorry to hear that Sean's gone. I don't – when somebody's there that long, I suppose you guys all get to be either good friends or dysfunctional work friends, but you're still friends. Both. Yeah. Oh, no, I... The above, yeah. Well, Shannon and I, like, Sean is here. I mean, I've been here 20 years, yeah. Right. Huh. Well, I hope he does well, and I'm glad you're still there. I don't know what I'd do if you left, so... All right. You have a wonderful week, and I appreciate your help, Robin. Alrighty. Thanks. Bye. Catch you later. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1830.278159,
    "salad_processing_time": 152.28844809532166,
    "overall_processing_time": 1830.278159,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hey, Robin.  It's Sean Reeves calling from Corrigo.  How are you? Good.",
    "job_id": "2329fd61-6133-4e36-a41b-699b3d54a994",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hey, Robin.  It's Sean Reeves calling from Corrigo.  How are you? Good.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": false
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3062113883036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}