{
  "recording_id": "3080327395036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:14:24.686263Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:14:24",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Oh, thank God. Hi. How are you? I actually have... I don't want to cry. Can't be crying. Well, here's the deal. I'm a technical idiot, and they always give me these step-by-step things. This time, all I needed to do was, when I'm setting up follow-up in PC Recruiter, it wasn't going to my calendar. So I tried to do it. I actually have Outlook open now, but my Outlook doesn't work anymore. It only works PC Recruiter. It has a PC Recruiter portal. And for me to send an email, I can't send an email unless I use PC Recruiter. I don't know what's going on. I need it removed. I don't know either. I'm never going to do it again. I'm never doing it again. Now, it might be just updated or something. It might be something so simple. Let's just figure it out. Okay. Okay. can you get an email or no not at all um you can try it i don't know i finally got it open and it keeps saying that the license they gave me was expired oh let me pull up my computer but then when you open up outlook it has file pc recruiter home but it doesn't operate as my outlook anymore hold on one second let me get my other if i go to home okay there i go to home and it did it okay i just need to play with it more. I still want you to look at it, and if you would finish setting that for me. Hold on one second. Let me, because if it's expired, it might just be like you had a... I even said to Garrett, I said, will you please just do it for me? It never goes well. Here's the step. Okay, let me see. Let me pull up my old computer, because I don't have the... The portal licensing is a little strange. Like, it tracks like a connection, and then if you do too many, then it says it's expired. So it's in this other app that I have to use. I don't even know how to use it with PC Recruit. All I needed was when I set up something to follow up, I just needed that to tag into my thing. I probably am not even going to use it now because it just scared me enough that I'm... It probably just needs to be cleared and possibly even updated, but we'll find out. Don't be scared. Probably a quick little fix. Let me just check the link. You know what? I'm an old, old lady, and I need an IT department just for me, and I don't know what I'm going to do. I need to be trained on this, and I haven't figured out the training because it's like I use it. I need to use PC Recruiter more, but I just keep going back to LinkedIn, and I'm thinking about just paying the $8,000 to do the Recruiter on it because I've used it for years. everything I need there and I can just calendar through Outlook. But I went back in PC Recruiter just trying to find where my follow-ups were and couldn't find them. So it's simple little things. Yeah, if it's not connecting, then that's why they wouldn't be showing up over there. So bear with me one second. I'm going to have to cloud that licensing. I'm glad I got you, by the way. You're always so kind. Ah, thank you. I love Garrett, too, but he doesn't understand who he's dealing with. And Jason doesn't even return my calls anymore. I'm like, okay, I need some more training. You know, I'll buy it. I'm fine. I'll buy it. Nope, no phone calls. Really? Oh, I'm a train wreck. I'm an absolute train wreck. I don't blame him. You know, we paid the $500, and, you know, we were doing all this training without a CRM. So then I was talking to the sales guy. I can't think of his name right now. You know, and I said, I need more training. you know well here's what we'll do for you we got more training and I still wasn't in the place you know to so I could work with it every day but but then you know just out of the blue I needed Jason for you know I was told you know do you have any fee agreements do what do you have in the letters and stuff oh I have things for you we can you know an application you can use let me get it ready for you and he did and he's just wonderful but I don't even know what are what you have at my fingertips to even know what I could use and what needs to be loaded into my profile. Yeah, I don't know if we really do too much with the agreements because everybody has a different situation. So usually those are kind of... Well, I don't even know what I have at my fingertips. You know, I don't know what's there. But I will tell you that the video that, you know, on how to set it up, you know, said put it in Internet Explorer. And I'm like, okay, well, is an Internet Explorer dead and gone? Yeah. Yeah. And the video I was sent to set this up last week had, you know, open your Internet Explorer toolbar. And I'm like, okay, well, let's just try it in Chrome. That worked. And then I put the license in and it said it's expired. Okay, let's see. And then it froze. It just locked my Outlook. So I did the, you know, that, okay, let's just shut it down and come back up. So that got me stopped from crying. Don't cry. You're not going to cry. We're just going to fix it. I'm just such an idiot, and I can't ever quit working, and I need to make money, and no one's going to hire me in my old age that would pay my bills. And I don't know what to do because I'm just a technical fucking idiot. And I need to be learning AI and all this stuff, and I get stumbled on such simple things. Okay. So last connection was September 4th. The date is good. All right. That's another thing that I have going. Since I have you and I know how good you are, I go into my connections on LinkedIn, and all weekend long I try to work, and Friday nights are my night to send connections on LinkedIn and to add things, and I try to do it Saturday night. I get one or two added and I clear the cache, I clear the cookies, and I have to sign back into LinkedIn and the add, the parse button or whatever you call it, the inhaler, whatever it is, it's not opening up all the time. It's very rarely opening up. Let's put it that way. And I'm like, how many times a day do I have to clear my cache? Shouldn't have to. Because that really isn't related to cache. Well, I know there's probably god-awful ugly notes. Don't help this lady. She's awful. And that's probably why no one helps me. And it's sky high, right? Yeah, sky high recruiting. Okay. I don't have it. And it said, you know, enter your, to go in and do a trouble ticket, you know, put this in your address bar. And then it said, enter my password. And I'm like, I don't know what the password is. to change the password. I needed Outlook, but I was locked out of Outlook. Yeah, if you just go to our help desk, our help desk has nothing to do with your PCR login information. So you would just use like forgot password on the help site and then that can help you generate one. Well, that was the problem. I couldn't get into the help site. If you ever, yeah. Also, the other thing you could always just do is just email support at main sequence. Couldn't. I was locked out of Outlook. Yeah. All right. So I just sent you an email. Let me know if you got it. Okay. That's why I was crying. I was like, I'm locked out of everything. Where's my send receive button? It's moved. This is why I don't ever add anything new because now I don't know where my send receive is. Oh, there. It's written out, Kim. Big letters. There we go. Love you to pieces. Robin, I hope you own the company. Okay, what do I need to do? Okay, so in that, just click the link or whatever it is. Join call. Join meeting. I forgot how it's worded. I feel like it should say join meeting, but it says join call. I don't know why I'm using a camera. Yeah, turn on that and microphone. Yeah, you don't need a microphone either since you're already on the phone. Okay. Maybe share your screen instead. Continue with our effort. Because if you're on the phone and you join the computer audio, a lot of times it makes a lot of... Yeah. I was going to hang up the phone. Okay, what is that? Do you want people to see and hear? I said no. They're all gone. What's your name? That's what I need to do. I'm going to let you in. Okay, so what I'm going to have you do at the bottom of that meeting screen, there's an icon with a rectangle with an arrow. Click that, and then it's going to pop up a window. Once you see that window, go over to the right where it says entire screen, and then select which screen to share with me. Just make sure you click entire screen first. What screen do you even need? I have entire screen. Entire screen. Yeah, it depends how many monitors you have. Okay. I just have one right now. Are you kidding? I don't even know how to put two monitors together and I need to. Okay, let's minimize Chrome. Don't delete this meeting tab, but just minimize it. Okay. So let's have you do this. Go up to where it says PC Recruiter over at the top left. And go about almost a little bit more between about a third of the way over. There's a green wrench that says options. Oh, you can't control my screen? It would be so much easier if you could control my screen. Okay. So I have fixed that. No, if you have RingCentral, let's see, but this does not let me control screens. Okay, so one thing it doesn't have, it doesn't have a connection to your database, but then that says expire. I never got to do anything. It just kept saying my license was expired, and then it went to this screen. And if I hit save and close or try to do anything, it freezes Outlook, and I have to set the computer down. So let me make sure they're right for them. So how do I get back to it? Hold on one second. Okay. That's the number that I was using, right? Okay, here's what I'm going to have you do. I'm putting a number into the chat area of the meeting, which I believe is going to be down at the bottom right for you. Chat area of the meeting. I have meet Google call. I'm assuring your screen. Oh, you might have to go back over to your Chrome window then. Okay. And then do you see like a little icon down at the very bottom for chatting? Is that the two people thing? I think it's one over. Got it. I should close some of these. Okay copy that number. That's the number I have. Let's just copy it but make sure you don't grab a space at the end just in case that could be. Okay right click copy. Okay. OK, let's go back over to Outlook. But close one of those windows. I only want one of them open. So when you hover, try to close one of them. OK, let's go into that now, that second window that's been there. OK. OK, click on what's right behind it. OK, see the number at the very, very bottom? Yes. I forgot if it's a single click or a double click. I think it's a double click. Click on that. Hit yes. Okay, paste the new number in. Hit okay. Why is it saying license expired? Because this is the number that I have for you. Let me just double check. Has something happened? I didn't check my billing to see if it was debited this month. It doesn't have anything to do with billing. This is all. Okay. basically separate for this part. Three was just in here. Oh, come on Robin. It's so weird when you go from one laptop to another one that's got a much smaller keyboard. It's much harder. You need to charge me outside a PC recruiter and teach me how to set up two laptops and how to use them. It's really you just get like a HDMI cord with like a bigger monitor and you plug it in the back and you go in your display and it's actually, even I figured it out. Well, you know, my thing, I have two laptops. I actually have three laptops sitting here on my desk. And I just need to network them so I can see one. And what I've been doing is just using two laptops all day long. And I would love to be able to learn how to do two screens at once and go from one screen to the next. I was having trouble when I did have it networked for a while. I would lose one screen constantly and couldn't get to the other one. I just need all the dummy books that are made for anything that I might use. And I definitely need a dummy book for PC Recruiter. I probably Google 50. I do love AI, that new AI window. I wasn't pulling up the right thing before. Hold on one second. Maybe it wasn't written in the right number. I have no idea what I was doing. Okay. Let me just check something real quick. What's an infinity mirror, by the way? Oh, that's just like, it keeps reproducing. Don't worry about that. Okay. Okay, so we are going to do... Okay. Hit okay. Okay. Let's go back over to your PCR database. database. If you want to do like a new tab, like how you would normally log into PCR. PCR database. Yeah, do you do like a new tab? Do you have it bookmarked? Okay. I have them down at the bottom. Okay, click on that. That one? Yeah, copy that URL that you see at the very top. Okay. and then hover there go to let's go back to there that second window click add connection add connection paste that in or actually replace about blank I take that about blank portion off go yeah Okay, put in your PCR username and password. This one I know, but it didn't work when I was trying to do it with the K Geiger at Sky High recruit. I have jokes that I need to write in. Okay, so this is going to ask you about syncing your calendar. Okay. Now, do you only want it going from PCR to Outlook? Yes. Okay, so for now hit no. why would you do it the other way um some people want it where it goes back and forth but some people just like it just to go to yeah i just want it so it pops up you know with 15 minute notice i have something okay then hit yes here okay okay and then when taylor i need to talk to you before you leave but i'm busy on a remote right now so where it says remember my password hit that checkbox. Remember my password. About halfway down. I just guessed it. I got it. And then go down a little bit more and type in your password. And then once you're done with that, go to calendar sync, which is a tab in the middle. and instead of no synchronization, change that from PCR to Outlook. Is this a smart way to do this or will I be changing it down the road? No, as long as you just want to go to your, like, whatever you do in PCR just goes to your Outlook calendar, it's fine. And then go back to credentials real quick. What does this disable synchronizing calendar categories colors? What does that mean? That's just if you had, like, colored tasks or whatever and you wanted to keep it with Outlook. and then let's go back to the credentials tab. The connections? No, the credentials tab. You're in calendar sync right now in the middle. Credentials. So make sure that's saved. Okay, hit save and close. Okay, let's now go over to your Outlook where it says always allow check that box and then select open and this one for a rounded look you can say don't show me in the future and then skip oh Oh, I didn't hit that button. Okay, so I have a question. See, I may be, when I read my emails, will I have that pane? Okay, just like that. Yep. Awesome. I go back and forth between. So you should be good now. Okay. Let's hope. Why don't you do file, exit, just to make sure. Okay, now let's go back to your Outlook. Why is it asking for that number again when I gave it to you? Okay. I think we have it saved, don't we? I thought we did. Nope. But I have it. We'll have to do that every time? No, you shouldn't have to. And I thought we had it in there. Okay. Do that and then skip. Okay, let's do one more time. Go back to Outlook. Okay, now we've got it saved in there, right? The other thing I just want to double check, let's go to File up at the top left. And go down to Options. And see where it says Optimize for Compatibility? we want that selected instead of optimized for best appearance. That could definitely be causing some issues right there as well. And then over at the side in the sidebar at the left go to add-ins. So second option from the bottom. And then see where it says manage com add-ins click go. Come on manage. Manage com add-ins at at the very bottom of the screen there's a go button okay go yeah click go so one thing that happens is like some add-ins really kind of start making things like a lot slower especially with ours one for sure I have not even figured out what this is I don't think you will miss it the Outlook social connector if you do not use that turn that one off what is it I don't even I know. I have not figured it out. Okay. So where is it at? It's right above where it says PCR Outlook. It's called Outlook Social Connector 2016. Okay. Nobody has ever missed it. We can't even figure out what it is. And that should just like help you. And then, okay. And then, okay. So you should be good now. Okay. Since I have you, let's see if we can get this to duplicate come on you might have to go like send receive like in your outlook go back over to all the time or just no I think just initially let's see what's going on there let's go to your outlook okay and um hit send receive let's see if that kind of starts syncing it up Like what day do you know you have an item on your PCR schedule that would be on your Outlook calendar? Oh, I have no idea. I couldn't find it again. I tried it once a couple of weeks ago, and then I went in trying to find who it was I was supposed to do follow-up with and couldn't find it. Let's go over to your Outlook calendar. you like all my things god I don't know who this was I don't even know how to get rid of that okay let's go back over go over to your mail icon because you've got to be in mail to interact with PCR hang on since I have you on the phone for staffing I don't know who all these things are how do you get rid of them somebody keeps sending me these meetings and like that one that i just was on i guess you just right click and delete it okay so i'm trying to find how far back okay we did that one i think I don't know what that is. That may have been one of them. That sucks because I don't know who Brittany is. So if you go to PC Recruiter and pretend like you're going to – I don't know if you have a name or a test name or whatever that you want to – I do wish we didn't have to sign in so often. That's up to your browser. It's up to your browser to remember login information. You can have your browser prompt you. Oh, I just told it. Okay, name. I'm going to see if there was Brittany. Well, why don't we test, like, do you have me in there? Or, like, test, I just want to see if it will start syncing over your calendar. name Robin yeah and then last name Montoni what was it Montoni yeah I'm not seeing you that way way mo in t-o-n-i mo n to ni to have it right mo n to ni yeah no match okay so you don't have me give any just kind of like test play record and your dad no No, I wouldn't know how to do it. Just open up any name record, I guess. Can we use me? Does that work? Yeah. Yeah, just any name record. Look how many there are. Oh, look. I work at all these law firms. Wish I didn't have that. Yeah, I just want to see if you write in activity as a follow-up if it goes to your schedule. So go ahead and open up one of them. And go to add activity. Where is that? That's where I don't use this enough. Well, you don't have it pinned, so you'd have to go to activities and then hit add from the record. and then the plus sign is over at the far right of that bottom half there no above above that add yeah see I need practice doing this but I basically just keep adding things where it says schedule follow up down at the bottom put in a date and time like put today's or do that okay and hit save Okay, go back over to Outlook. And you'll probably have to wait a few minutes, but it should eventually sync over here. Like if you do your send receive over the top, that's usually when it kind of checks from what I've noticed. Other calendars, shared calendars. I wonder if you need those selected. Can you check those two boxes where it says other calendars, shared calendars? I'm sorry, we're about... Down at the bottom left. Okay. Both of those? Yeah, try both of those. Okay. I guess not. Okay. Go up to PC Recruiter and go to options. options in PC Recruiter options, options, options okay, go to where it says tech tech test tech okay okay, gosh I wish my eyes were better than they are you want to read them? cash exchange SMTP address re-enable Winmail? Click the first option where it says, view background processes. It's like a bar at the top. 98457. Might be processing kind of still. let's like maybe wait and see if we see him like a little bit later but this should get it to start going now do you want to see see if we can get this problem to duplicate uh cancel i don't want Yes, I do. Okay. So when I'm in my network, I have new people. And my ad doesn't come up. I have to go up in here and delete browsing data, do all of that. Almost every single time I try to add someone. Heck, yes. Cancel. I'm sorry, back to the one? Cancel. Cancel. Cancel. Can you click on the Manage Extensions icon at the very top right? Is that one? Yeah. Click where it says, actually click directly on the extension at the top right. Let's see what that does. That one? No, right next to that one. Off, off, capture default company. Okay, Sky High Recruiting. Let's hit log out. I'm going to try this. Let's take a look. Where it says Sky High Recruit. Is that even right? Let's see. What am I doing? where it says Sky High Recruit. Let's just take off the Anne's Dialsheet portion. I don't think it really matters, but let's just take it off. Okay, hit Login. Put in your username, password, and select your database. Oh, do I know this one? That's your PCR password. Is this what I was using all along? Mm-hmm. That's when it just gets you to your database. If anything is connecting you to your database, it would be your regular PCR password. And then make sure you pick the right database. Okay, hit Login. Basic mode, company mode. Okay, and let's scroll up. Make sure all those are on for LinkedIn. Logout? No, just scroll up in that window. Oh, okay. I'm sorry. Make sure they're all on for LinkedIn. Okay, let's go over to somebody's page again. I think I can you do this since last week at Friday nights when I really started noticing it and then it was like every one to two times I would have to clear can you get the reload option at the very top left like very top left yeah just before their linkedin url so it's that like kind of recycling circle looking right above there that yeah try that reload okay there it is let's do it let's close some of these other tabs like you got two Laurie Smith's open like make it so you only have one Laurie like yeah make sure you only like let's just try no keep that open you just left the meeting but try doing it with only one oh gosh I'm sorry dang it okay George Sanchez yep i need to go back into that meeting because it didn't work so i would i mean i have to get going though i had a okay um chapter six so so i have to hit that circle and it comes up i would say the workaround for now and then i can give you a call tomorrow. Okay. I am at a doctor's. I have a MRI in the morning and I won't be home until about 1030. And then I get really busy in the afternoon and I'm central time. So what time does work for you tomorrow? I would say 1045 till one. and that's your time 10 45 yes it'll be like 11 45 my time i'm eastern and it would be really smart if you sent me a calendar invite okay i'm just gonna i'm going to be a little bit drugged in the morning tomorrow morning i have to be in an mri tube for an hour and a half. I'm going to sit you for noon Eastern. That'd be 11 your time. Awesome. Okay. Hey, Robin, thank you for not making me cry tonight. Don't cry. It's just software. I tell people, it's just software. I'm such an idiot. I need to sit and just work and work and work and work with this. But I either do one thing or the other thing or I'm interviewing and I'm just not using PC Recruiter like I should. and now I'm trying to overlap a bunch of AI into it and it's like, okay, you don't even know one without doing the other. So, okay, hopefully we can get this resolved. Sometimes you have things like, you know, is your Chrome up to date or, you know, things like that. Yeah, we did all of that last week. I did it a couple of times last week. Okay. All right, let's see if I can figure it out. I don't know. I know one person had a problem and I have never figured it out. And then it like kind of, I think it started working. I don't know exactly what it is because we did so many things. But like using just, if it doesn't load, just hit that reload page instead of clearing cache. Okay. That at least keeps me from having to log back into LinkedIn every single time. Right. Yeah. If you just reload the page, basically what the capture is going to do is say, oh, hey, this page is loading. because sometimes what we found, at least for some people, and then they'll say, no, I didn't. But then when I'm on a screen share with them, I'm like, but you have like multiple people open up at once. Who knows, is it that? Yeah, they've told me to shut those out too, but right now I have one guy and that's the only tab open. Yeah. So as a workaround for now, if you just hit that reload page, that little circle at the top left. And my calendar invite came in for 6 that we set up the test. It was supposed to be for 5 minutes, and it came in for 6 p.m. So is it set on Eastern time? That would be based on your username and your computer. I wonder why it didn't when we did that test. That would be something else we can address in the morning. Remember we did it for in five minutes and instead it set it up for 6 p.m. Your user preference, yeah, you're separate you through the time are you supposed to be central? Yeah Your username is off Okay, why is are you the only telling Hang on. Now it's not letting me log in to PC Recruiter. And it won't let me delete anything. Close out. Go back. It's just you, right? Because your whole database is set for Eastern, I think. Time off. Okay. How do we change that? Is that something you have to do? I'm changing it for you now. You could have done it, but I'm doing it now. Okay. Central time, U.S. and Canada. So going forward, it'll fix that. What do I need to do? It's just going forward. Oh, okay. It thought you were Eastern time because you never had it set for your time zone. Robin, I will talk to you at noon my time. Is that what you said? 11 my time, noon your time? Yes. Awesome. Thank you so very, very much. No problem. Have a good night. Have a great day. All right, bye-bye. Thanks, bye. All right, I'm off the phone. What a fucking nightmare.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1924.771301,
    "salad_processing_time": 100.83849048614502,
    "overall_processing_time": 1924.771301,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Oh, thank God.  Hi.  How are you? I actually have.",
    "job_id": "db56c90e-081e-4539-816e-deb73d70a828",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Oh, thank God.  Hi.  How are you? I actually have.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical",
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3080327395036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}