{
  "recording_id": "3081766516036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:15:00.096925Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:15:00",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hi, this is Stephanie. Hi, Stephanie. This is Robin Mantoni with Main Sequence. Hi. How are you? So I understand you're having, inhaling resumes. Are you trying to just do an individual, like right-clicking in your portal or? No. Is Garrett available? I've been working with him, so he's kind of up to speed. up to speed, but if not, I can run through kind of everything that I've tried, and I can explain everything to you. Yeah, I can, yeah, let's do a screen share. Would that be okay? Because then I could see it, and we'll get you fixed up there. All right, bear with me one second. Let me get your email address here. Okay, I'm going to send you, do you happen to have RingCentral? do I have ring central no okay then I'll just do a google meet okay start an instant meeting okay you should get an email from me in just a moment okay and that came from um here it is got it Thank you. Now when you click on that join call to get into the meeting, it's going to ask you about camera and joining with computer audio. You don't need either one of those because we're going to share a screen and you're already on the phone. Okay. Is it sharing with you yet? I was just asking you to get it now. Okay. All right. So now that you're in the meeting, what I'm going to have you do is at the bottom of the meeting screen, there's a share screen icon. It's a rectangle with an arrow. Click on that, and that's going to pop up a window. Go over at the right where it says entire screen, and then pick which screen to show. Perfect. Okay. Let me. So when I go to do the inhale, it puts that they're bad. Let me see if it'll work this time around. Because Garrett told me a bunch of stuff to download. And so I just finished downloading everything. Please put these under duplicate, which is not bad. that's something different. Can we open one up? Like where are you getting these from? Let me see. Oh hold on it's opening the resume. So it's letting me open the resume the fact that it imported them just now which is good we also got two folders hold on let me let me try to do this from scratch so if i hit a monster get some new resumes because yesterday it was putting them all into bad oh okay that's And it was the error was that it could not read. Could not read them. This will do a new search string. Okay, so we'll just try to do like 20 resumes. Yeah, that one says confidential. Some of those say confidential. So I don't know what we'll be able to do with those because. Now, I also see you have two folders called resumes to inhale. Yeah. Actually, in a third one, too. So let's first, because you got that one, it was bad duplicate. You should have a bad duplicate imported. So the end point I can just move up? No, no, because that no, actually let's do it this way. Let's make a new folder and let's just call it resumes for PCR. Because right now for some reason you've got like three things called resumes to inhale and you can't just like move those around. Okay, so let's go new folder. Yeah, resumes for PCR. Yeah. And then I'll take all my Salesforce ones that I just got. And then we're going to have to change that inhaler to look at this folder. I just want to kind of see it without. Yeah, we'll read it. Okay. Then let's open up your inhaler. There you go. And then we're, okay, Outlook. Yeah, you're going to go look for your resumes for PCR folder. And that's saying could not open file. Okay. It's probably taking a moment trying to get the folder names. And you'll probably have to expand that inbox. It's probably going to be under that. It's a bummer it's not right at the top like how it shows in here. So resumes to PCR. Oh, there it is. Okay. Click okay. And then before we do an import, so go ahead and check that or hit okay there. Okay. Let's go up at the top left. Now let's go up to actions. let's go to connection settings. I just want to see double check here just to make sure. Okay and hit test. Perfect hit okay. Exit this screen and then go to actions and this time up at the top left and this time select preferences. Let's lower that first resume size to 50 and then any chance did you already add a zero to the maximum I always just kind of do both yeah I did okay perfect all right let's see and move to Duke folder okay everything else looks fine okay let's hit okay and then let's try import from email now Okay. Okay. So I guess we'll just take a look. Yeah, I'm a little concerned. I'm a little concerned. So let's go back to the inhaler because I'm not seeing anything showing a preview. Oh, it says could not open file. And that is this time zone for you? 237. Okay. I'm two hours later, so I just wanted to make sure. Okay. Can you do me a favor? Can you open those files? Can you go to, like, one of the e-mails? So where did it go? Look on your resume for PCR folder. Hold on just a moment. Okay, what did you say? Go to that resume for PCR folder and then expand it. Okay, go into BAD. into bad. The PDF, okay, open. Save time with document summary, view summary. Okay, this one. Can you right click on this for me? Like kind of drag and then right click. like this no like try dragging first yeah okay can you save this file to your desktop for a moment Okay. Let's try. Okay. Let's go over to Peace Recruiter. I just want to see if we get any kind of the handler it basically does is it tries to automatically parse and then just grab the next one I want to see it I believe it's similar language to what our add resume screen does I want to see if the add resume screen gives any more details of maybe what's wrong with a file see at the very top right as a piece recruiter it's got that quick add it's a lightning bolt select that choose name go to parse from resume and then hit start Now, did that pop up a window? Like maybe even on your other, like do you have more than one screen? No, just one monitor. Oh, that didn't pop up anything for you? No, maybe my permission is blocking pop-ups from PCR. Or maybe it's behind everything. That could also be an option. Sometimes I've seen like where people, where it's popping up on their other screen and not the one I'm actually watching. It doesn't look like it though. Everything. These are all the things that they asked me to update. Hi. Garrett was saying try this and that. Try disabling add-ons. What's this? Oh, finish. Is there a way to do, like, PC recruiter in the Outlook? because he was showing me that there is PC Recruiter that could be right here. Yeah. Yeah, let's do this. We could do that as long as it's a one-at-a-time thing. So we could try that. It was basically going to be the same thing I was going to kind of show you, but it would just be another way to do it. So let's close this stuff. And in your main PCR, I'm sorry, your main Outlook screen, let's go to File. and go to options down at the bottom left. There's a setting I have to adjust here and then we'll install it for you. Okay, see where it says optimize for best appearance over at the right there. Switch that to optimize for compatibility. Optimize for best appearance. Optimize for compatibility. Okay. And then down at the bottom left where it says Add-ins, click on that. I'm sorry, what did you say? Click Add-ins. Okay. At the very bottom where it says Manage Calm Add-ins, click Go. What I want to do is try to minimize the add-ins that your Outlook has so it doesn't kind of shut things off for you see the one that says outlook social connector let's go ahead and turn that one off i'll be if nobody ever uses it we can't figure out what it is and then scroll down a little bit more do you see something for skype maybe okay that's already selected okay do you use the one note add-in within your outlook i don't even know what that is okay then turn it off uncheck that one so uncheck one notes and then we can leave everything else selected and then hit OK and the one other thing I'm going to need to have you do is go to view up at the very top and if you go where it says reading pain which is going to be about two-thirds of the way over at the right. Okay and then set that to right. Okay now I'm going to have you go up to the top of Outlook and go to file and choose exit and then I'll walk you through the steps of downloading the update and then setting it up so it's connected to your database. Go to exit. Okay. So what I'm going to have you do is go to a browser tab. Actually, this one says Launcher. Hit Finish. Okay. We might need to double-check that one for you, too. Okay. Let's go over to a browser tab, and I'm going to have you do a search for PC Recruiter Downloads. Okay. click on that first link that says downloads scroll down and it will be at the far left you'll see peace recruiter from Microsoft Outlook click on that green link there you go perfect There's my page on my side. Okay, once it's done downloading, I'm going to have you open and run that file. Because one thing it could be is just something about the format that Monster provides that in. We'll have to see, but this will be a good way to check. We'll check one at a time and see if there's any additional message on it. Thank you. Okay. Let's open, click on that file. And when you do that, you're going to get a prompt that's going to ask you if you want this app to make changes to your device, you'll select yes. And then hit next. I accept the terms and then next, next again, and then install. And this screen, it might take a little moment and then I'll kind of catch up and run a little faster. Okay, I finished and one thing I want to check on because I saw where it said that the it ended prematurely or something like that. Can you type the word app down at the very bottom left of your computer where it says type here to search. Okay go to apps and features. Okay so this should list all the programs that are installed on your computer. Can you go down to the J's where you would have J's. Do we have Java listed. Okay that one I saw. Okay perfect. Go down to the P's and let's look for a PISA recruiter launcher. Okay so that one did not run. Okay I wonder if that was related then. Okay let's exit here and I think I saw it in your downloads. Can you go to your downloads icon at the top right. Where is it? You know let's just do a fresh one. Can you go to your PCR login page but don't actually log in? Perfect. Okay at the bottom left see what says launcher install. There's a link for Windows as well as Mac. Click on the one for Windows and then when that's done running we're going to run that file. Okay, here you're going to hit next. I accept the terms and then next, typical and then install. then finish. Okay what I'm going to have you do this first time that you log in go ahead and log in and we might get a couple prompts here see where it says always allow check that box no no hit the always allow check box first then say open control loader click allow here okay say you can see how you have that gold number one at the very top right a Peace Recruiter. Let's go ahead and have you click on that for a moment and then click the activate PCR browser notifications option there and then click the word here and then click allow. Okay before we get into setting actually no we're going to do the portal set up too and then we'll we'll come back we'll try I wonder if that was part of the other issue it may not be though okay so what I'm going to have you do see the URL at the very very top with your login URL yeah go ahead and copy that now because we're going to need that in here in a moment okay perfect okay let's go ahead and open up Outlook and it's going to ask you for a serial number, which is a pretty long number. I'm going to have to read that off to you. So bear with me as we do that. Okay. All right. Let me put it in a note pad so I can break it up cleanly. It's easier when I read it off to. Okay. 1099, 40, 55, 223, 4372. And then click okay. All right. So this Peace Recruiter ribbon at the top, what it's going to ask you to do next is connect to your database. Like, how does it, you know, know to get your database? So see where it says add connection? Yeah. Click on that. And then where it says about blank, clear that out completely, but then paste what you copied that URL into that field. Perfect. Hit go. Okay, select your database name. I think mine's just default. Yeah, that's, most people don't use one called test. So, okay, then you're going to put in your PCR username and then your PCR password. If you hover on your outlook icon down at the very bottom, just hover on it, you should see that second, actually the third window. Go ahead and then click on that. Perfect. Okay. So put in your PCR username. It's going to be that second one. That looked like it was a different username. Okay. Oh, you're connecting. Okay. Okay, so that's going to ask about syncing your calendar. And then this would be writing your emails. And then here you'd be putting in your password. here hit no can you go back to that configuration screen can you have is it still open I think we kind of lost it okay do you really want it hooked up to your email because every email you send is going to look like he sent it as far activities are using somebody else's login be EJ he that one's the right one okay but you probably would not want your calendar or your emails writing as him you're basically using somebody else's login so everything that you do is going to read an activity in PCR as if he did it he doesn't you he doesn't use this so he he doesn't use this this one is not okay but i'm just saying that any email that you send because you set it to sync your calendar or write activities i'm going to write an activity as his username even though it's your you doing it so you really should be your own username or maybe turn it off okay um so let's just hover for now on that setup screen. And where was it? It looks like the second window. Okay. See where it says remember my password? Hit that checkbox. It's about halfway down there. Okay. And hit test connection, which is kind of near the top there. Perfect. Okay, hit okay. And then for calendar sync and auto activities, I would turn this off since you're connecting. These are your emails, but you don't probably want them writing as him. So I would say no, no. Uncheck that box. Go into that dropdown and say no synchronization. And then where it says auto activities, change it from your email address to none. And then hit save and close. Okay, let's go into, oh, in here where it says always allow, this is basically an Edge web viewer, kind of asking the same kind of question we already saw in Chrome. So we just say open there. And then don't show me this guide and hit skip. Okay. Let's go to one of these files that were emailed to you. Like in the bad section? Yeah. Let's go in there. Let's right click on one. Let's see if doing it one at a time gives us a little bit more detail of what it's not able to read. So see, now go ahead and click on the actual file on the attachment and select parse resume. Well, this is a bad one to test because this one's confidential, so it doesn't have. Okay, let's just scroll down and see. Okay. Okay. This is also confidential. This is normal. So Torrance, California. That looks a little bit better, right? Uh-huh. Okay. Let's hit save. Save. And then what I'm going to have you do is see where it says click to view name record. let's go click on resume from this name record that I created one thing I don't like is that it recognized some spaces for the email address which is kind of odd. Okay, so this is a pretty formatted one. Okay, see where it says PDF view at the top? Switch that to text view for a moment. And it's at the very top left. Okay. All right, let's go back to where it says PDF view, because obviously it looks way better being a nephew. Okay. The one thing I don't like with how they format their resume, there's a whole bunch of text that it recognized before. that email address. Okay, let's do this. Let's go back to your Outlook. Let's take a couple of these that are in BAD and move them back to resumes for PCR, but just not the ones that are confidential. And that's the one that we just did. Okay, that should be enough. I just want to see if it works. Okay, let's go over to your inhaler. And what is your exact time right now? 3.02, okay. Yeah, I can't open file. What is it about these files does it not like? All right, let's try something else here. Let's exit this. Oh, hold on one second. Open up your inhaler again for a moment. See where it says include subfolders? Let's uncheck that. And uncheck the other one too. Let's drag that email back to the resumes for PCR. Let's drag some of those back over. Okay, and it is now 3-0-4. Okay. Okay, go back to inhaler. 87 kilobytes. That is not much at all. Going back to bad. Can you go to actions again for me? Could not open file. Go to preferences. let's change that down to five let's just take that zero out do not set a receiver it's so weird because i've i was able to inhale last week um and i didn't mess with any of this stuff. I have no idea why. I don't touch this stuff, you know. I just do my import from email now. So that's weird. Do you have any other resumes that did not come from Monster? No, I only download from Monster. I only use Monster. I'm going to send you one. I just want to see what happens. Okay. I'm going to send you one more thing. Oops, what am I looking for here? Let's see. On your screen, go back to connection settings again. Is that with the inhaler? Yeah. I think you had some things in there selected that I don't. Okay, so that's fine. Exit that. Go to preferences this time. Uncheck those top two options that you see. And application. Yeah, that part's normal. Okay. Uncheck those. Link position none. Any other settings that are different? Okay. Let's hit okay here. If you hover on one of those last messages, subprocess after. What does that say? Okay. Could not open file. Okay, let's exit here. okay uh go ahead and uh minimize this for now let's move a just a couple back over you have to do all of them for now I just want to see if anything's working now that we changed some of those some of those settings just like grab like three or four I do not like these. Why? Okay. Let me, I'm so sorry, I'm trying to think here. What else could this be? Okay, do me a favor. Open up PCR. So kind of do it like where your outlook's like half a screen. And then you're, so like kind of do it like, We're not full screen. Okay. Go over to PC Recruiter. Okay, click on that lightning bolt icon again. Lightning bolt. I go to name. Select parse from resume. Hit start. So now that we have the launcher, it should pop up the screen I was looking for before. Did it pop up anything? There we go. Can you slide this over to the right a little bit so it's more at the right? This is the same screen we saw when we were just, like, doing the right click on the file. See how in your email you have the file? Can you drag that file to the bottom? I want to see if it's able to recognize anything that way. So the file that's attached in your email, like drag that. Yep. Kind of just click and drag and drop it right there. Okay. Okay, so the inhaler does not like these monster resumes for some reason. Okay, here's what I'm going to do. I'm going to send you a resume and we're going to see what happens with it. Okay. Thank you. Okay. So it's just going to be a Word file. And then when you get that email from me, let's have you move that to the resumes for PCR folder. Because it could be something that Monster changed their format or that it doesn't like something about it and I'm just not sure what. Okay, so move that email to that folder that we have being monitored. Okay, now let's try the inhaler again. Is it under there? Is it under resumes for PCR? I don't see. I don't know where it went. OK. Yes, it is here. OK. Kind of where they didn't give you a count. OK. Yeah, I thought that was where they didn't have. I was looking for the number. But it shows my screen number. So . It just moved it because now it's gone. Okay. Let's close your Outlook for a moment. But I never saw a preview. That's like really strange. You just see a preview and then a confirmation, like one resume imported. Come on. Oh, God. Sure, save. And this screen we can close for now. Same with the other one. Same with this one we can close? Yeah. You said? Yeah. So there is apparently recognizable text. It's just why isn't it? OK. Let's close this candidate wizard here. We don't need that for now. OK. Let's open up your outlook again. Okay, let's go to resumes for PCR. Okay. Maybe we should have that. um we should have that awesome maybe that's open hold on one second what i'm gonna do let's try this Ask them if they also had a problem with their monster. In the meantime, let's go over to your PCR database. PCR database. Okay. See where it says new names. Okay. Am I in here? Should be last name on Tony. last time someone uploaded was at 5 which is 3 p.m. Hi. And I also might have been in there too. I'm in a lot of databases. Can you do a search for the first name Robin and then the last name just put M-O-N-T? R-O-B-I-N. Last name M-O-N-T. Okay, it did not create anything. Nope. And what is your username? EJG. EJG, okay. E-J-G. E-J-G. Okay. It can't be anything about securities. That is a full administrator. He's a full administrator, so I'm actually not giving him access to anything that he doesn't already have. I'm just going to go ahead and send some securities anyway, just in case. Okay. Like him being an administrator overrides so much of it anyway, but I just want to see if it does do anything. Okay. I don't really think there's nothing really in here. He has to use some card app, right? All right, here's what I'd like to do. I want to uninstall Inhaler and reinstall it. Okay, do I go to, like, the apps? Yeah, let's see. So let's go to, yeah, apps and features. or actually see what says add or remove programs go to that one add and remove there you go right there that top one right there now it was at the top that was a search we actually want the actual setting So type add ADD and then see where it says best match under system settings. That's the actual setting. There you go. Click that. Now just click where it says add or remove programs okay I think you went to you went to the other one again or actually that gear icon over at the right is that it maybe it's on a different window or something it's at the very bottom right on your taskbar Okay, this is where we need to be. Let's find PC Recruiter resume inhaler. Let's see. That's new. I'm not. Yeah, we're going to uninstall and reinstall it. Oh, okay. Automatically close application and then hit okay. You said automatically close? Yeah. Okay, so that's gone. All right, let's go back over to a browser tab and you might still have that downloads page open still. That's the page that we're going to want to go back to. This one? No, this one closed. We can just open up another page, I guess. Go to Peace Recruiter downloads. Do a search for it. This is that downloads page that we got the portal from. We're going to redo the inhaler and see if that has any, see if that does anything for us. Okay, so that first page that says downloads. That little Google Meet screen says to stop sharing and hide. hit hide it just hides the toolbar gets it out of your way for you okay so we are going to scroll down on this page And in that second column, see what says resume inhaler? There you go. Okay, go ahead and open it up. Why doesn't it have an inhaler code for you? Huh, I wonder if that was our issue. That would have been, maybe it was never registered. Did you remember registering it? Like you put in a code for it? Do you remember doing that before? No, my company provisions all this stuff for me, so I never, I don't think I had to. Okay. I wonder if that's what it is. Maybe you never registered. Okay. Bear with me one second. Because either that or we just don't have it stored here. Okay. Okay. One hit text. I had you know what I had you look at all the other stuff I didn't even think about that are you new to using this no I've been using PCR for over three years now okay but this newer inhaler and things like that when you maybe upgrade or whatever? You didn't, like, redo it recently, right, without registering it? I did update. I did have to update the PC. I had to update this. Okay, because if you had it for a really long time. Gotcha. Okay. All right. Because it was putting all my emails into BAD, and then the guy said we need to update the most recent version, so I got the most recent version of this. Okay. All right. Yeah, because if you had, like, an older version, things got moved around and stuff. Okay, so let's hit typical here. We're just going to try this. Hit install. Hit finish. Okay. Now because it's not actually up yet, you're going to have to do a window search at the bottom left and just type the word inhaler. Okay, resume inhaler. Go ahead and open that out. Okay, so the first thing I'm going to do is go to about click registration okay where it says company name type in Tom centric consulting and while I'm here I'm going to store what this number is supposed to be. This should have went forward for you. Okay, bear with me one second. I'm going to generate this number. And what did I do? There it is. And it's COM, I'm going to spell it like exact COM, CEN, TRIC, consulting. Okay. One, four, nine, five, six, seven, zero, zero. Okay. So the number you're going to put in, is one, one, four, hold on one second, let me get this out of the way. Okay, so starting over, the number that you're going to put in for the serial number is going to be 149-561-00. Okay, let's go up to actions. Go to connection settings. I don't like that it has all this in here. Click here to connect to database. I'm just going to try all of this again. OK. Put all that in. OK. Click test. Test. Okay. Hit okay. And then hit okay. Where did that go? Okay. Go up to actions. Preferences. See, why did it, like, keep all these settings when it uninstalled and reinstalled? Okay, let's put 20 as the number. Do not send or receive. Hold on one second. My eyes are bad. Sometimes it's a little print on a, trying to read somebody else's screen. Not always the surface, right? Yeah. Okay. let me see that my screen or your screen where'd it go Okay, allow messages, do not, what does that say? There it is. Send receive, no, I don't really need that. Okay. Question for you. And I'm really sorry, but I've got to keep these screens up, and it's going to be covering your screen. Underneath where it says allow messages to be moved from inbox to subfolder, Outlook only, it's going to say, like, see users, your name, app data, local. That seems like it would all be the same. I think we saw that before that it was. And we want move to duplicate folder. Okay. Let's go over to filters. Anything there? Nope. Good. Okay, let's go back to options. And really nothing there. Okay. And really nothing there. Okay. That looks exactly like mine did. Okay, go ahead and hit okay. And let's reselect that email type folder. Actually, you know what? Let's switch it away from Outlook and switch it back. I'm just really stumped on this. I don't know. why this is doing this. Yeah, go over where it says Outlook, where it says email folder type. I'm just going to have you repick it. Okay. Okay. Yep. And then go over at the right and repick your resumes for PCR folder. I think you had to expand it once it started loading, right? I think we found it all the way down at the bottom. A little bit different than your actual order. The rest makes you inhale. That was really weird how there was like three of those. Unless that was just changes over time. Changes over time. OK. All right. Hit OK. Is it selected though? Just yet. Right there, right there. OK. And then let's exit this screen. Let's make sure it's selected. Did you click and highlight it? I think you did, right? Yeah. I did a bunch. It's like, I don't know if it's good or not. Maybe because we're not really changing anything. Maybe because we're not really changing anything, maybe it's getting a little confused. Okay, let's exit out of that then. Is it letting you exit? There it goes. Yeah, it says, I'm so stumped. Okay, so let's go back over to Outlook. I mean, we've got a workaround doing on 1 out of 10, but obviously we don't want to be dealing with workarounds. We want it to actually work. Yeah, I can't do that because most times I'm inhaling 500 plus resumes. Okay, yeah, you don't want to be doing that then. Okay, let's move that email that I sent you. Let's move that one back first. Okay, so go to resumes for PCR. My email should be in there, right? Okay. yes no right click you want to know another way you could do this if you don't know about it um if you don't have this window open like go ahead and close it for a moment close this window okay at the very bottom right so it's got the up arrow with all your like hidden icons at the very bottom right almost by the date and time okay right click on the inhaler icon it's that gray right now it's because it's not monitoring okay if you right click on it you could just say import from folder now or import from email now oh if I right click this yeah so if you were like not even wanting to open it really okay We got that one. It did. We got that one this time. It did something. Okay. Yeah. All right. Let's move maybe like two or three over and do it this way. Sometimes it's a process of elimination. Okay. All right. Right click. I'm towards the email now. I think it's working. Okay. Now let's do it how you were doing it. And that will just tell us the uninstall and reinstall fix it, or whatever we just kind of redid for you. Let's just kind of see. Move a couple more over to resume for PPR. Yay. It's importing. Now what if we do it with, as you were before, not doing that little right click, not doing that little right click but truly going up to actions import from and then I'm going to show one more thing don't pick them all I'm gonna have you do one more thing I'll pick a few move a couple over okay now actually do the right click show application this is kind of the way you were doing it go to to about I'm sorry not about actions you know what you're doing more than I am actions import okay that seems to be working too now the other thing if you want that just hey if I move something over to that folder you would just need to make sure that you have the inhaler icon up so that's like down in the task bar so meaning like in the morning I'll get from their desktop see how there's a monitor email option at the bottom right turn that on yep and then monitoring on so really all you would have to do is throughout the day put emails into resumes for PCR as long as they have a resume attached and then I believe it's set for like every 15 minutes as long as this is running down by the date and time so meaning like when you start up your computer in the morning you'll just open up the desktop icon so that it's down at the bottom right and then every 15 minutes it'll check for new emails so if you may need what are still left back over to resumes for PCR the next time it connects, which could be probably about 15 minutes, it'll just do it for you. So that way you don't have to, like if you're doing 500 a day, you could do like a few, you know, make them go to that folder. And then that way you don't have to go into the app and do it too. And I'm really sorry. I don't know why it wasn't working before because you had the right version, it seemed. But it seemed uninstalling and reinstalling. I think the uninstall and reinstall. Okay. Because we kind of did like a whole remove of it and then re-added it, reconnected it. So I'm not 100% sure, but it was definitely one of those. Yeah. Yeah. I think that that's what did the trick. So I can delete all the other PCR folders just so I don't get PQs. Well, the one thing I would be concerned about is if you had things under imported, whatever, do you have them saved somewhere else if you ever needed the actual email? Because if you get rid of the folder, it's going to get rid of the emails underneath it, too. No. No, I always clear them. Okay, as long as it's something you don't care, then you're good. Yeah, I always clear them because I don't want to delete. I just need to delete the whole folder. Delete folder. Yeah. Okay, and then that will be streamlined. I kind of thought at first maybe it was having the folders with the same name but then we still ran into it with that folder so I'm not really sure I'm so sorry it took so long to figure out what the cause might have been but at least we have it working for you. Apologize for that That's okay. I'm excited because I got two interview requests that came through while you were on the phone All right. We'll go take care of those interviews and have a good evening. Thank you so much for all your help. You are welcome. Bye. Thank you. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1938.939677,
    "salad_processing_time": 346.87356901168823,
    "overall_processing_time": 1938.939677,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hi, this is Stephanie.  Hi, Stephanie.  This is Robin Mantoni with Main Sequence.",
    "job_id": "367888d4-c925-4056-8e83-3bb46245e107",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hi, this is Stephanie.  Hi, Stephanie.  This is Robin Mantoni with Main Sequence.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3081766516036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}