{
  "recording_id": "3081754413036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:14:57.298098Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:14:57",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " This call is being recorded. Hello? Hi, this is Garrett with Main Sequence Technology. I received a voicemail you're having trouble with PCR. You know what? I don't know. Like, when I go on, I have no idea what's new. I can't even tell what is new. Oh, okay. So when you log into your database, you mean? so like I look you know I'm in PC Recruiter I don't know I mean is mine active I'm paying for it can you are you able to tell the new yeah I can look that up um oh PCRM you mean the the instead of PCR9 you have PCRM added to your account uh let me see and make sure it's like $85 now or whatever. Let's see here. I just can't see what's different. So you might, you would have to have a different link to get to your PCRM account. PCR9 is still going to be available. You can log in on the old link that you've always been using, but you would use a separate link to get to the PCRM version of the software. So if it looks the same, you might be using the old link. Let me send that to you right now. I could just probably have your email address. And how would I get it so it opens there? And then when my email, like I have it so it's PC Recruiter. And then if I want to inhale some, like I guess a person's resume or their data or whatever. How do I know it's going into the right? so basically it's your same database whatever you add into it will be going into that database pcrm is just a different um like a different face for it like a different uh what's the word it's the the same database it just looks different a different interactive experience on the screen. It doesn't do anything more like with AI or something? There are AI features in it. It just is a different, more user-friendly, intuitive way of navigating through your database. Okay. So let me email you that link right now. Is linda at medicalrecruiters.com or linda at Bailey's Search Associates better? Linda at medicalrecruiters.com. Okay, perfect. Yeah, Let me email you that link here. PCRM login link. Okay, I just sent that over. And I would bookmark that one if you wanna utilize the PCRM interface versus the older interface. Folder, would I make it a different one? How do I, it says favorite added PCR. Would I, what would I use as a just to distinguish between the two? M? This, yeah, PCRM is this product's name. The last one is called PCR9. it's switched over to M. Okay. Okay, and it's asking me for, oh my god, it's asking me for my password in my, okay, it's letting me enable notifications, browser notifications. okay now i'm wondering because it asked me when i signed up for this like did i want to did i use any of these other tools and they were i don't know if it was um github or who do you guys work with like other extensions like i have lucia um okay we do have um an integration partner list on our website that you could look through where a lot of those companies have built an integration that works with PCR if you have like an account with them. I could send you that as well. That would be great. I mean, what do you, is there somebody there that once I get this and I like look over it, if I don't use it, are you able to tell me what the, you know, the value is? Oh, a PCRM? Yeah, we can have our... Not the PCRM, but like the integrations. Like, I don't know what GitHub does. I don't know what, I don't use it. Oh, I see. What is it, HubSpot or some of the others? I see what you mean. Use Box or Hires. But you guys had a bunch listed, and I don't know what the value of using them are. and which I'm investing in some technology that works, like LinkedIn recruiting, the recruiter or whatever. How it does, do you guys have some kind of interaction between the two? Yeah, so for LinkedIn, we have our PCR capture tool where you're able to pull up a profile on LinkedIn or LinkedIn recruiter and hit click to add. There'll be like a button that appears on your browser. I already have that. Okay, yeah. So that's our integration we've built with LinkedIn. Besides that, let's see, nothing that I know of with LinkedIn because they require manual, with their terms and policies, you need to be manually adding persons one by one rather than bulk bringing people over. So our capture tools are best integration with LinkedIn currently. and I'm looking in our learning center there actually might be a video we did a while back with some of our about some of our integrations and partners that might be helpful in addition to the list I'm sending you but the list I'm sending you actually there's a button that says learn more under each partner and it can give you a rundown of what they do and links to their site Okay. Do you guys, have you ever spoken to Lucia or Lucia? I don't think we have an integration with them. That doesn't look like it's on this list here. Let's double check. Yeah, nothing with Lucia. I know a lot of customers do use Lucia, though, where they would grab information from Lucia and then maybe just export it as a CSV file that you can then import into PCR. I don't even do that. So that would be great if I could do it. Right. Is there a... Let's see. I can send you instructions for importing, like, an Excel file of information that you've gathered from outside sources. Like, it would basically, yeah, just be an Excel file with a list of names and all the different fields of information. And I took and added, like, would it be a CSV that you would, you know, then, and then how that would work, you know, inputting it. Okay, yeah. Yeah, they might. I'm not so familiar with Lucia, but they might have an export button or an export tool to in bulk export a big list of names. And then, yeah, I'll give you the instructions for importing that CSV file list of names into our database or our software. Oh, good. Yeah. And I did find that video. PC Recruiter Partners might be useful. Awesome. And then importing. Okay. All right, I will send that over now. Oh, wait, actually there's an importing video too. Let me include that. video. Okay. Cool. Yeah, just let us know if any questions come up about either of those things, importing or that partners list. But yeah, each person or each partner on that list should have an explanation or links to their site to see what they do. And if I'm on my regular PC recruiter, hold on let me see if I can pull that up. Okay, medical recruiters. There is a list under, oh god, what is it called? I go, would it have to go to system, right? Yeah. and I was on it, and I don't know where it went. Let me see if I already have it. Oh, it's the SIC codes. There are so many codes on here, and I don't work with any of these people. I don't know how they got populated. They've been populated since it got automatically, you know, updated one time. I don't know how to get – I mean, I have to go through them one by one to get rid of them. Yeah, I see you have like 20 pages of these. Okay. I didn't add them. I am not sure. Yeah, we don't really have SIC codes to add. Was there anybody on your like team at one point that were updating things? It showed up like when I guess they, I don't know if you can look on my particular database, but I didn't put it, nobody put them in. Okay. Yeah, I can ask the team if we could maybe like do a bulk clearing of those SIC codes. It says you have 972 in the, wait, am I in the right database? I'm in the one called Medical Recruiters Restore. Is that the right one? Or are you signing to the one just called Medical Recruiters? No, it's just the regular Medical Recruiters. Okay. Sorry about that. I mean, I would just need a couple codes, but I guess can I go on here and it just gives them to you? It can add them, but they're 960. It would take me days to get rid of them, go through all of them. Right. Yeah, let me see if we can just get those cleared out for you in bulk. Do you want all 960 removed? Yeah, I guess unless there's some that pertain to medical or wealth management. But, yeah. And then I guess I could add them back. I mean, that's what – can you add them on? Can you add them in? Yeah, you can add an SIC code. If you notice – so it's listing your SIC codes in the bottom frame there. If you click at the, there's three horizontal lines at the top of that. You can add. Or import. Yeah. Okay. I haven't used it because I can never find what I need and it's just populated to the end. Gotcha. Okay, yeah. Maybe we can get this cleared out for you in bulk. And then, yeah, you would just probably want to go in and add the handful that are most relevant to you afterwards. It's just, you know, crazy. I have everything from meatpacking, creamery butter. And I'm just like, ah, that's a function I can't even use. Gotcha. Cool. Yeah, I'll create a ticket for that and get back to you soon. Anything else you've been having trouble with in PCR? You know what? I always have problems with letters because I don't know if the letter is supposed to. And I guess it's something whenever we go over, but presentations and then form letters or like there's a name letter. I don't get the difference between interview letters, job, you know, information. company? So yeah, your form letters are, they're categorized because you're able to use a certain category of letter with different parts of PCR. So for example, there's one called like pipeline emails. Those form letters are only allowed to be plugged in to a pipeline step, your position pipeline. So they each have their own specific piece or slice of PCR that they work with. It mostly comes down to the insert fields. If you're familiar, when you're building your form letter, you can put in something called an insert field. That's like that little code for like a first name or a code for your email signature. That's form letters? Yeah, inside a form letter, exactly. Where's form letter, position letters, pipeline routing, presentation, feedback, placement, pipeline, company? So yeah, those are all categories inside of form. Those are all types of form letters. So form letters are the larger category. Each one of these is a type of form letter. So yeah, those categories have those insert fields and name letters, for example, you can only use insert fields related to a name record for the company that they work at. where position letters, you can only reference positions with this insert field, like a job title. So is there an explanation for these? Because I'm going to say I made a pipeline. You know, that's what I generally do. I make a pipeline and then I narrow it down to position. So when I have my final narrowed down position people, and then I want to send them to the hiring manager, who would I put that under? Okay, yes. So that is, I think you mentioned it, the presentation feature. You want to send a presentation over to the hiring authority. and the way that form letters maybe interact with that feature is that you can have a pre-made email template ready to go. That category is called presentation slash feedback letters, so that you basically have the email written out that says, you know, click here to view the presentation is really the most important part of that email. Presentations, and it says name letters underneath it, position letters, feedback letters, under presentation feedback letters. But I don't have, I have no matches found. It says there are two select. That's just me. Like it's me, the global admin person. So who do I make the, is this where I send, is that the email name or the search? It's a search. What am I searching? Oh, so yeah, if you're under system, form letters, presentation slash feedback letters, this is where you can create a form letter, like an email template. store it here for use later on. And it looks like your database, you don't have any. So it's presentation, then, I mean, which one do I want to use if I'm doing a presentation that says search? I don't have any. So how do I, no match found, how do we even create one? Oh, just click the three horizontal lines at the top right and go to add letter. Yeah, you could build one there. Nothing there? Sorry, say that again. There's one for default. Is that a? Oh, that's a different setting. That would be who is receiving your feedback letters by default, who's receiving your candidate presentation notifications by default. But I wouldn't worry about that because you can adjust all those things in the moment. So if I'm sending this ad letter presentation, it says HTML letter, word letter. Right. And then it says name. Is that who I'm sending it to? No. So this screen you're on, you're basically just building an email template so that you can use it whenever you are sending a presentation. So you're not in the presentation feature at all here. You're just in the place in PCR where you make email templates. We call them form letters. Do you have some that are already kind of pre-done or no? I have the same. You would have to create it. Let me check. Most databases do have at least one presentation letter already preloaded in there. So I noticed you don't have one. So let me see if I could grab one from my database. So I just wanted to be able to see how it would be set up if you had examples to put in there. Okay, cool. Yeah, let me add one right now for the candidate presentation. Okay, and then we add... So there's two that we preload people's databases with. I'm not sure why yours is missing that I will put them both in there. One's called just the candidate presentation and one is the multiple candidate presentation when you're sending more than one person over to a hiring authority at once. Let's see. Okay, so if you in the top frame click on presentation feedback letters again it should refresh the bottom frame and you should see the two form letters that I just add it to your database. Okay, so go to candidate presentation and multiple candidate presentations. Yeah, each of those are the ones that come pre-loaded with our customer's databases for you to use or edit or do whatever you want with. You know what I also have a problem with? When I'm trying to copy and paste and put it, like to say, a job description in, it won't let me it says something about I get it like an error thing oh okay is that so what screen are you on when you're trying to copy and paste inside of PCR so what part of PCR are you in where you're trying to copy and paste well say I'm trying to like send maybe this is this has multiple candidate presentation. Is this where you add a bunch of candidates to this? No. Or this is where you want to send a job or job description. Oh, so this yeah, this is just your email template for when you want to send a presentation of multiple candidates to a hiring authority. that feature, the presentation feature, is somewhere else in PCR. This is just where do you make the email template. That's what you have on your screen right now. For a job description, you would go to an action... I wanted to send a job description or position letter. I don't know if that's what that is, but that I could send it to people that I put in a position, say, or in a roll-up list is usually what I use. I'm sorry. So if I get a roll up and then I wanted to find out, take that all those people and add them and then put them, you know, to, you know, send a letter to see if, you know, and attach a job description. As like those people you're sending it to, to see if they're interested in that position. Like say I have a roll up and I just opened it. I don't know if you're able to open up. I have to clean a bunch of these out. I never know how to get rid of them. Oh, if you want to delete a roll-up, if you're on the roll-ups list, if you go to roll-ups in the main menu, you can check the box to the left of any roll-up listed there and then click delete in the action menu. It's a little trash can in red at the top right. I have edit. I'm sorry, not that action drop-down. It's the handful of icons at the top right of the screen. One's a red trash can. That's your action menu. Yeah, just check the box and then hit the trash can to delete. Got it. Okay. Wow. That makes a lot. Okay. Okay. Got it. But yeah, it's totally possible to do what you're saying where you have a list of names and then you send them a form letter that gives information about a certain position. That would require you to first create the form letter and the form letter category would be position letter. And once you build that form letter, you can reference any position you have and send that in bold. So I have to go to the presentation section and click on position letters? Not the presentation. Presentations are solely for presenting candidates to an hiring authority. You would want to go to system in the main menu, form letters on the left, and then position letters on the right. Hold on a second. System form letters. And then what was the other one? Position letters on the right. Under form letters? Yeah. Well, what is a company letter? Those ones aren't almost ever used. it's basically you can build an email template that references certain fields on your company letter. I mean, on your company position or company record, sorry. So you can use an insert field that has a company's name, their state, their city, things like that. And those aren't really used ever because you're normally sending emails to people rather than just companies in general. The name letters always are more popular than those. But the position letter for your specific situation would be somewhere, an email template that would allow you to reference position fields. So things like the position's job title, the position's job description. So you could build a template out that references those things, and then you can send that position letter in bulk to a roll-up list of names. Okay and then if they're here and I want to get rid of them I just click on the action and that is where it has its delete? Yes. Okay so this is where I'd create it and then exactly where do what do I do with that? Once you have a form letter created you would go to your roll-up and just open the roll-up up and once you're in the roll-up you can go to the select all which is right above all the check boxes there's a select drop-down to select all the people on that roll-up list roll-up or it says clear search delete help or is it that is Is it the plus thing? No, that's his new roll-up. Oh, no. So you want to actually open the roll-up itself. So if you have a roll-up right now, let me go to you. So you have Gormie, SGA, Taylor, 725. You have to click on the names in the roll-up. So you go to the roll-up name, but next to it, you have to click on the 146. Say this one has 146 people. Yeah, exactly. That opens up the actual roll-up list. And then you would click on select at the top left of that and go to all results so that they're all checked. And then in your action menu at the top right is a letter icon to send a bulk email. You mean the thing that looks like a envelope? Yeah, it's like a. Yeah, it would be like a little envelope icon at the top right. This will open up the screen. Yeah, this is where you can create a campaign and send an email to people in bulk. Got it. And I can actually give you a couple links as well in an email that helps with explaining what each form letter category is used for. Thank you. As well as, oh, sure. Yeah, they do get confusing a little bit. There's a ton there. But yeah, it'll help with the form letters. And then I'll give you another article in our learning center that shows how to send a bulk email. That might be helpful. Wonderful. I'm sure I've done it before, but it's been a long time. Okay, yeah. This will definitely be helpful with an article, and I'd definitely like to look up videos from our Learning Center, too, if we have them. Let me see. Okay, yeah, email campaigns. Good. I'll send you that as well, so it'll be a video and an article. We've got reading formulas. There we go. And email campaign. All right, so I sent that as well. Anything else you had questions about in PCR? I'm just going to see if I can find maybe a document or some info that I could cut and paste. Just see if it'll allow me to. Let's say someone emailed me a job description and I just wanted to, you know, copy and paste the information. Right, okay. Copy, and I'd go to that. Oops, where is it now? So, yeah, you'd want to pull up the position record. Can I go to paste? Well, let me paste. It says back, forward, reload. Let me see one more time. Okay, here's the cut. Is it paste? That says copy. So if I've got right clicked on that stuff that I wanted to put in the body from, say, an email from the hiring manager. Your browser doesn't support direct access to the clipboard. Please use the control X, C, V keyboard shortcuts instead. Okay, yeah, so go ahead and highlight the text. I'm not sure. What browser are you using? Chrome. Hmm. Okay. Yeah, that usually is just standard turned on in any browser. I haven't seen that one before. But if it is telling you to use the keyboard shortcuts, you can do highlight the text that's in the email and on your keyboard hit control C at the same time to copy. But it says control X, C and Z. Yeah. So those all each have their own function. Control C is to copy. Oh, control C. Okay. Yeah. That'll copy the text. That's fine. It's now copied your clipboard. And now if you go back to PCR and open up a position record, go to the job description box, and then you can paste it. Oh, my God. I'll never remember all this. I'm in pass, letter, position. This is what I'd want to send a bunch of candidates, right? Oh, no. Okay. So the form letters are just templates. They don't have any details in them. They actually use something called insert fields to reference records. So, for example, your template would just say, here is information about, quote, unquote, job title. It's just like a job title, a generic little code called an insert field. Then you create the position in your database. So if it's like a position for a cashier, you make a position record and then you can say, I want to send that form letter. And any time I had just a generic code in my email template for this form letter I'm sending out, reference that cashier position letter. So it would be the cashier's job title would be included as it sends out. Its job description would be included as it sends out. But then you can recycle and reuse that same form letter for any position. So you could send a bulk email with the exact same email template about a completely different position the next day. And then I'd have to erase the whole content of what's on there. Right. Actually, you wouldn't because you are just using generic terms in the template. You're just putting the words like job description. Oh, I really don't get this. Is there something that – is there like a link you can send me for that? Yeah, I just emailed you a video. Like I want to take that roll-up list, and I want to send everybody there, you know, information about a job. So you said I have to do add letter for the physician. and then click whatever names I want to send it to. But I can't put that on. It won't let me just copy and paste it. I mean, something's wrong. Can someone look into that and see what's going on with that? No, it's working. So... So do you have a position record created in your database for what you copied and pasted? A position? Yeah, like open position. Yeah, there's several. OK. And so that information that you're copying, that job description you're copying from your email, you would want to paste that into a position record so that you can reference that or talk about that position record to people through an email. Okay, so maybe I need somebody to go over it with like we can share screens and I'll do that tomorrow. Can we set something up? Yeah, you can purchase training sessions with us. And they, yeah, we can train you on how to use form letters and how to create positions, anything in PCR and walk you through it. But the links I did send you today are from the Learning Center, which also included a video, which might be helpful. It's basically a prerecorded training in itself, which is, you know, the free option. So you don't have to pay for training. So I would maybe watch those form letter and email campaign videos first to save yourself having to pay for training. But if you do have questions, we're definitely happy to train you. Just reach out to our support line and we'll set something up. for training. All right. Thank you so much. I'm sorry to take up all your time. Oh, no. Happy to help. Yeah. Just let us know if more questions come up after watching the video. I just don't mean to sound like such an idiot, but I had cancer, so I've been out for a while. I'm just going to find out Wednesday if it's back, but it's a hyaluronidase spinal. It's a lymph node, So I had lymphoma. So I, you know what, I was just got really, really sick and I had a bunch of surgeries and chemo and radiation. And I think I'm fine now, but I couldn't work because I couldn't even talk. Like I couldn't even speak. So not using stuff and not being like, you know, I haven't had, I haven't placed anybody in five years and I've been working, like just trying to work with some of my network. but I'm just not having great results because I'm not using my database to its, you know, to the capacity. Yeah. And it is, it is complex, the database. There's a lot of features, a lot of things to remember. So yeah, maybe that the learning center links will help kind of jog your memory on a few things, but yeah. Training might be a good idea too. If you want it to just hour of training left. So yeah. Let me take a look at your account. You might, let's see. We have additional training ticket here. Let me take a look. This is eight. Okay. Okay, and that had two. Aha, okay. So it looks like there were two training hours purchased on this ticket, and one hour and 30 minutes were used. So you do still have 30 minutes left on a training. Robin is the training agent here on this one. Okay. So, yeah, if you were interested, you still have a half hour available. And is what is right? Does she have an extension or email? Yeah. Let me. Sorry. No, actually, I could do this. It'll be great. I will reopen that ticket, that training ticket and let her know that you are interested in using that last half hour. and I will also CC you on that so you get her contact that way too. That would be wonderful. Thank you. Yeah, no problem. Great. So yeah, I will get that connected up, but yeah, feel free to take a look over some of the Learning Center resources I sent your way in the meantime. But yeah, definitely use up that last half hour. That'd be great. okay thanks so much I really do appreciate it no problem have a great rest of your day you too bye-bye",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1937.398032,
    "salad_processing_time": 116.71923184394836,
    "overall_processing_time": 1937.398032,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " This call is being recorded.  Hello? Hi, this is Garrett with Main Sequence Technology.  I received a voicemail you're having trouble with PCR.",
    "job_id": "f1824f0e-c291-4c83-9fe3-ddf240fc892a",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " This call is being recorded.  Hello? Hi, this is Garrett with Main Sequence Technology.  I received a voicemail you're having trouble with PCR.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3081754413036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}