{
  "recording_id": "3082868289036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:15:47.298648Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:15:47",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thanks for calling Main Sequence. This is Robin. Hey Robin, Alyssa at HCP. How are you doing? Oh, pretty good. How are you doing? I'm all right. It's been a minute. Certainly interesting times out there in the world of recruiting. I wanted to just have you talk me through it so I don't mess it up, but we're changing the email alias on the admin login, and I just wanted to make sure, like, it was done correctly. Okay, let's take a look here. Yeah. Because right now it says Steve Holmes' email, and I need it to say somebody else's. Okay, so it's the admin username, right? Yes, ma'am. okay so it's not for like automated out by the databases when that person's actually logged in okay correct okay let me see what they have set up to that because if they're set up for incoming that might need a change too okay What is the name of the trash folder that you use? Is it because there's deleted messages and then there's trash? I'm going to go to Maureen's desk and just we'll do it from where it's logged in. Maureen, can I borrow your computer? Yeah. It would actually be like on that email account. You have a sent folder to find, but you don't have a trash folder. So if you were to ever delete an email out of PCR mail, then you know which one it goes into. Yeah, yeah. I just want to fix your email. All right. So let me go to email. I don't even see this working right. What the heck is going on? Yeah, well, to be perfectly frank, nobody, you know, admin has ever really used the PCML. So I need to set my admin assistant to use it. Yeah, it's not even downloading. It's not even connecting to a server. Yeah, it doesn't. I wonder if the server is not even good. Which one do you use? use recruiter yes I use recruiter let me just see what yours is just to make sure I'm giving you yeah because I'm in her I'm on you know Maureen's desk so I'm logged into her PCR mail I'm looking at her uh system login um hold on you gotta be hold on once yeah she's logged in as admin Okay. What is the, why is this not? Because what I'm looking at right now, it says Steve Mills, Steve Holmes. Yeah, that's not even, there's other things going on here too. Okay. Get it squared away. Okay, so the mail server, at least for incoming, is not even connected because it has a bad server name. Okay. Okay. So you are hosted by Office 365, it looks like, right? Correct. Yes. Okay. So here's what you're going to want to do. Do you want to do a screen share? Sure. Yeah, I'm on Maureen's computer, so do you want me to do it from her RingCentral? Oh, yeah, let's do RingCentral. Okay. Let me pop up RingCentral. Yeah, if you have RingCentral. Let me pop up her main RingCentral. We do. What the hell? Where's her? All right. Oh, here it is. Okay, so you want me to go to video. Yeah, and then click join. Join. Meeting ID, please. Meeting ID is 050. 394 810 oh well that's interesting hold on give it to me again her num lock key wasn't enabled 050 394 810 joining okay all right here's I'm going to have you do I'm going to continue without audio because we're on this call yes okay all right you want me to share screen yeah but make sure you go to entire screen I believe should be at the top uh-huh so entire screen but it's going to be entire screen screen to which is where the application is sitting okay I just pinched you have more than one monitor yeah where the multiple monitor crowd gotta be anymore insane I know when I'm traveling and I'm I've just got my laptop screen. I'm like, well, I can't function. Oh, I know. I go to like a medical appointment every eight weeks for like this IV, and I bring my computer, and it's like, oh, my gosh. Like I can't function like this. Okay. First world problem. So let's just exit out of here because I'm going to set it up where she gets not only sending but also incoming. Of course. Yes, please. Yeah. All right. So do you want me to just give you remote control, or what do you want? No, go ahead and log. go over to her main tab of Peace Recruiter. So you can exit this. It looks like you're free to exit. Yeah, I'm in email. I'm sorry. Go ahead and go down to those second and third tabs. You know me, I'm a multi-tab kind of girl. And I think what we want is that one. what the one oh you're just close okay so let's go it's a very top right a piece of recruiter where you would have the user image and the edge of that user image go to the gear go to email okay it's gonna take a moment to look so this other one called HC pursuit that's the one that's not even connecting is his incoming server and the outgoing server they're not even connecting so let's go to configure this is oh this is a bunch of old shit that i don't think we need to be perfectly honest i don't care if we delete the whole thing okay this is old stuff from if you look at the dates you know yeah because they haven't even been connecting okay so let's go to configure so mail servers is where we get that box with all the subfolders let's go to mail servers and for that one there just go action delete if you think you didn't need it don't need it okay and hopefully take a executive decision here yeah steve will come screaming at me what happened like nothing all right it's not connecting anyway because there could be a lot of stuff on there and it might take a while to delete okay okay so just okay so just leave it as it is go over from from mail servers all the way over to the right and click add It's going to be in the lower half. It's just not pinned. Okay. Let's give it a new description. So not HC Pursuit, but whatever it may be. More email. How about that? Okay. Where it says save sent email to sent items folder. Change that from yes to no. Okay. They do it automatically. and the rest of the details we're going to get by using sign in with Microsoft and you got to make sure that you're signing in with her email address now this might go a little bit is that your company that are worth their weight in gold that's Maureen for us she is amazing what a great person anyway all right I'm sorry That's going to have those, though. Okay, let's scroll down to the bottom. So we see where it says M. Corcoran at Hotmail. I don't want it to be logged into that. Okay, we're going to have to do this a different way. She might need to either sign out of the account, or we're going to have to go in under incognito mode, which basically won't recognize that that's what she signed in as. So we've got to get out of here. Okay, I'm going to exit out of this box? Yeah, just exit out of all of this. Okay. So what's going on is she's actually signed in on that other account right now. So let's just. Let me. So here. So if you do new incognito window. Let's see. Maureen signed in as a Gmail, not, you know. She's probably signed into her Outlook right now. So just go new incognito window. It's just like the third choice there. That won't. Oh, okay. Sign in. that way you'll be prompted for what account we're a new incognito window okay got it okay go over to our pcr shortcut which is the way at the left so actually for the screen behind just go ahead and close that this um yeah yeah close out close out of all that close pcr mail all pcr okay sorry Maureen we're going incognito because you're signed into um uh chrome and everything under not your hcp email yeah i think she's signed into her her office 365 she signed in that way that's what it's trying to write yeah your office 365 is not signed in with m cunningham at hcpursuit.com yeah it's kind of it's currently not okay let's go to pcr okay it's way over at the left got it weird so this should prompt like starting from scratch for signing into her email account so username would be admin login And then go back to email? Go back up there. When are we guys going to fix that? It's not broken. It shouldn't be. Why is it still showing up, Robin? It could be under incognito, or you could have it possibly where you're maybe clearing cache every time you close your browser. See where it says do not show this guide in the future, but it doesn't say, you know, to save that setting. It just says skip. Yeah, just hit, yeah, skip. So it doesn't let you not save it, show it in future. Anyway, all right, I digress. It could be a browser setting, plus we're also in incognito, which isn't going to recognize those things, some of those settings. Got it. Okay, all right, so we're going to go, let it load up the other one here. Okay, we're going to go to configure. HC pursuit is still showing for what it's worth yeah take a long time to delete out mail servers area okay go to the far right click Add okay give it a name or rain is a goddess army and then where it says save sent email to sent items folder switch to no and then sign in now this is where okay so see how now that one yeah so you got to put in her work email here now at hcpursuit.com. All right, next. Let's get on with it. There it is on the spreadsheet. Oh, cool, look at that. Bam. Yep, that looks right. So Sarah said keep me signed in on this device. That's why it's just got to go to the other one. That's too much good if he gets a recovery email. Continue. Stay signed in. Sorry, ever so pokey. Do I click on let's go or do I just X out? I don't even know if I, I guess X out of it. I don't know why. It's the, it's the co-pilot AI. We're giving you a sales pitch thing. B less, B more. What can I help you find? What the flippity flop is this? Shouldn't be doing that at all. Co-pilot. I'm going to maybe X out of this because just to search M365 co-pilot. All right. Let's try this one more time. I have no idea why that's popping up. So crazy. Ah, here we go. Now we're back. Hit accept. This is cool. Maybe. All right. Look at that. Hit test connection. Test connection? Yeah. And I'll just make sure it can connect to the server. Okay. Yay. Exit the test. And then very carefully, only hit save once. Do not double click it. Clicked and pulled my hand away. Sometimes it takes a moment, especially when people have a lot of folders and emails, and they double click it, and then it tries to set it up twice. And then close? Close. okay next thing we have to do is up at the top is go to email folders and we're going to have to be very careful with this because we have all those old ones but then we got the new setup too that uh three-lined icon because it's not pinned you're going to go into that three-lined icon and click on set sent folder and it's going to pop up another window we've got to be very careful in here because we've got to make sure that sent folder yep say that five times fast okay we don't want personal we don't want hd pursuit we got to scroll all the way down and find her emails okay and then we're going to go to sent items this should be right above this maureen's email yeah this should be way down there okay so it should be yeah if you went back down to the bottom because those are all her other folders too I'm pretty sure up morning email here we go okay so you got to go all the way down this is going to be one of the last things you're going to look for sent items got it action action mark ascent mark as sent items okay okay close this window just the X yeah cancel either one go back to this relined icon now we have to specify what is the name of her trash folder. Okay and then this time we want to again make sure under the Maureen email section. Uh-huh. And this time you're gonna look for deleted items so you actually just went past it. Yep I see it. Mark as trash folder. Yep. Now it won't it's gonna start to get the emails now that we marked the set in trash but that takes a while to do the initial sync they'll eventually be there so let's exit out of here go to preferences this might already be set but we'll have to double check it go to activities down on the sidebar at the bottom left and no that's not said where it says right incoming emails to the activities change that from none to from subject body Okay, perfect. Click save over at the top right. Okay, go to alias address list at the top, which is the mail server that was getting like the folders and all the emails in them. This is for sending. This is the same thing you see under system. We're going to click the edit option because we don't need Steve's information in there anymore. That is true. So we change it to Maureen email? Yes. and then alias name is her full name or however she wants somebody to see her name oh rain the goddess okay from address and reply to address you have to match her account I'm already standing here going, I know why she called Robin. Yes. All right. Okay. IMAP server. Oh, that we've got to use this. I know. Don't bother changing it. You're going to waste your time doing it now. Okay. It says IMAP server. We don't want things this ascending as going in that other account. We want it to go to the one you just created. Go ahead and drop down more in email. Got it. It says delay between emails, super important with an Office 365 account. Put in the number 3000, which spaces them three seconds apart. Yep. Okay, thrust sign in with Microsoft, and that's going to update the server port, username, and secure password. Damn on it. All right. And test connection. We might get an error here, but it just means it's setting. Okay exit from test. Sometimes you get an error there if you don't have SMTP authentication enabled for the user's email account. And click save one time. Yeah so yeah now this one you can even double click it doesn't matter it's the other one. Okay so let's exit this PCR mail tab. And as far as station not stationary but um the you'd want she'd want to do her with her but that's just an email set up not okay yeah i forgot okay let's exit this tab bye-bye okay let's go back to pcr mail okay choose email okay where it says Maureen email go ahead and expand that and then hit save above so that way if she ever goes in here it's like a little floppy just a little floppy icon right above the nope right above the folder list oh sorry got it kind of like a gray blue heading okay and hit okay got it got it that way when she does come in here if she ever wants to go in here she doesn't have to expand her folders okay so sent so you see we've got the folders we've got which is the sent and deleted the email is going to take a while to download but she can at least go ahead and send now exactly so all i have to do is pop over here pop over to here and set up her email setup and email signature. All right, groovy. Fabulous. All right, and then this is going to talk to this, and this is going to do that. And she does have PC Recruiter on her... Save that, I'll play with it in a minute, but close this. No. Just looking at her PC Recruiter to make sure. activity queue and so forth. So it looks like everything is there as far as PC recruiter. So I can drag this over if you hear eyeballs. Oh, for her. Okay. Yeah. For her outlook. Yeah. Let's just go to options. Options, options. It's in the PCR ribbon about halfway over. Oh, sorry. options. Okay, go to calendar sync. Because that's up to you. No auto activities, go over there. Yeah, that we want, right? No, that you don't need because we turned it on in PCR mail. Okay. So she really can just use this just for like resume parsing, basically what's going on. Okay, perfect. Okay, that's important. Still resume parse. Yeah. All right, so we don't have to do anything. We're good here. You have Java and Launcher on that computer, I assume? I would assume. See, because it's still doing this thing. It does it for me, too. Well, that's when you're in Portal, too. But there's no way to get rid of it. You've got to hit the box, check the box, and then hit skip. And it could be that you're clearing cache when you exit your browser. No. All right, let me... Yeah, we were looking for Java. Go down to her apps down at the very... Let's go look at the full list of apps installed. Oh, okay. I was just looking for Java, but where do we... Do we see apps somewhere here? Go to the magnifying glass icon. Magnify, okay. The window search option. Okay, yep. Okay, and type in either ADD or type the word app. Depends what kind of version. Oh, there it is, apps and features, yeah. I swear to God, it was different versions of Windows. I never know which one to look for anymore. I feel you. All right, let me drag this window over. I can't drag this window over. All right, if I can. Okay, come on, come on, come on, you little bastard. Get over there. Okay, here we go. All righty. We are looking for Java. She's got Amazon Coreto. Okay. Right. Yeah. I was told to do Coreto a long time ago, but we're supposed to have Java too, right? No. One or the other. I usually do Java instead of Amazon Coreto as long as I'm in a Windows computer. You do need to use Amazon Coreto if you are on a Mac. Okay. Yep. So why don't we take that off? Let's just get rid of Amazon Coreto. Do uninstall. You're probably seeing something like, do you want this app to make changes to your device? And then you go to java.com. Hold on, let me go back to the Coreto thing. Uninstall, preparing to remove. Okay. Just preparing to remove, uninstall. The program's being installed. Okay. Good choice. Anything else that I have to remove on here? Let me see. And do we have launcher? Go down to the P's. PC Recruiter Launcher. Okay. 10-20-20-23. Okay. Let's exit this apps and features. So Amazon credit was off. Is it done uninstalling? It just had to close some widget to finish. Okay. Let's go back up. Let's make sure it's gone. Yeah, let's scroll back up. Let's see if it's gone now. It's still doing it. Please wait while Windows configures correct. It's still uninstalling. So once that's done, if you go to java.com at the very top in the other browser, go to java.com. This one? Yeah. Actually, no, you know what? No, go to java.com. I take out all the other stuff. Okay, hit enter. Go to download Java for desktops. You got something security flashing down there. What is that? The blue and yellow thing? maybe that's why things are taking so long yes I never enabled the allow Coreto thing sorry now it's done or finishing thank you let's wait until that's done my bad okay did it let you finish on its own it's almost done okay so here do you download Java for desktops okay Okay, that window disappeared. Download Java for desktop. Save. Yeah. I don't know if you want to go desktop or just put in downloads. It's going to be at the top right. Okay. And then, okay, open that up. You'll see like, do you want this app to make changes to your computer? Hit yes. As soon as that pops up, which it has not yet popped up, it's spinning around. This is an older laptop. All right, say yes. Say yes. java installation okay all right install that double looks like it's dangerous huh yeah it sure is all right i just added that other i'm not seeing it might be on your other screen yep it is Waiting. Sometimes the data kind of runs slow, but then it runs quick. got a pending restart too on this laptop. So we'll probably do that when we're done doing everything here. Get it all nice and spiffy. So first installing Java. Drag it over so you can follow along with the crowd. Okay. It should be done any moment. You've successfully installed Java. Okay. I probably would go ahead and, like, close Outlook, close PC Recruiter, you know, and then go back in so that everything kind of starts up fresh. That's what I was thinking. So let me, yeah, I will reboot the whole banana, and I'll have her send me an email from within PC Recruiter, and we will go from there. All righty. Well, have a great day. You're always wonderful. Thank you, Robin. You are welcome. Thanks. Bye. See you. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1962.434426,
    "salad_processing_time": 147.08887243270874,
    "overall_processing_time": 1962.434426,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thanks for calling Main Sequence.  This is Robin.  Hey Robin, Alyssa at HCP.",
    "job_id": "8445352e-a3f9-499e-825b-b7a64dfd14eb",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thanks for calling Main Sequence.  This is Robin.  Hey Robin, Alyssa at HCP.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3082868289036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}