{
  "recording_id": "3082245114036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:15:05.902314Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:15:05",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling in today. This is Garrett. How may I help you? Hi, Garrett. Can you hear me? Yeah. So, Garrett, I just have a question here. I just want to understand more about duplicate email addresses. Because I just sent out our newsletter in PTR, and then after I sent it, there's like a prompt that I have 33 were duplicate email addresses, 32 have opted out. Now when I click that 33 duplicate email, I don't see any duplicate emails here. So how does it work, that duplicate email addresses? Oh, it might be that you have resend checking turned on when you're sending out your bulk email and what that'll do is check to see if that email address has received the form letter that you're sending in the past. And if it has, it'll say this is a duplicate email address. There's a feature called resend checking that you might have turned on or it might be on by default for your username. But basically it checks to see if any of those email addresses have received that form letter before. And if it has, it won't send it again. It'll call it a duplicate email address. So even if this is a different form letter, they will not... If it's a different form letter, then you can send it with resend checking. But if resend checking is turned on, it won't send the same form letter to the same person twice. Where can I see that? Sorry, what's the term? Resend checking? Yeah, let me take a look. I'll pull up your database. What's your name and what company are you with? My name is Karen and I'm with Targeted Recruiting Group. Okay, Targeted Recruiting Group. My user is Kate Cowan. Okay. Let me just, under your username. Can you still hear me? I think something cut out on my audio. Oh, good. Okay, sorry. All right, so I just logged in. I'm going to check. So if I go to like a roll-up and go to send a bulk email, I'll check to see what the default is for resend checking. One second here. Select some names. Where's the mail icon? And then optional. Does that apply to all bulk email that I'm sending? Or just for a specific campaign? Yeah. So it depends on if you turn that setting on or off for each email campaign you send. So, for example, if you go to send a new email campaign, like maybe just open up a roll-up list and select a few names and then hit the letter icon to start sending an email campaign. And I'll show you where the option is for resend checking. Let me know when you're there. Yeah, I'm here now. Okay. On the left. On the left. Oh, sure. So are you seeing where it says create new campaign or use existing campaign? Yes. Uh-huh. So I did. Okay. Then on. Here is create new campaign. Good. Okay. And then on the left, if you go to options, which is a gear icon, you'll see the option for resend checking. And you have it by default set to be turned on where the selected form letter only, if it was sent to somebody in the last 60 days, it will not send again. So that might be why you had those duplicates listed. Did not resend letter only. So if it's the same form letter, I understand it correctly. it will not be sent to the same recipient, right? Right, right. But you can turn that off if you want them to receive it more than once. But this is a different form letter. I created like a new form letter for this, and then it's also a new campaign. Oh, okay. So your recommendation for this one, Garrett, whether this should be turned on or should be turned off. I would turn it off if you plan to send the same form letter to the same people. But if it was a different form letter that you have never sent before, I'll check the list of people that you sent. Maybe there would be something to do with duplicates there. I'm not sure. Was it a roll-up that you sent? The email too? That's monthly newsletter. I see 1861 okay. So I have the list here now. Okay so if I turn this off now I can resend the newsletter to this 33 just to get email address right? It should be able to. Let me double check here your background tasks. I want to make sure that it went out. One second. Okay so So it says that it is currently running. Yeah, 49%. OK. And let me see where it says not sent next to any name here. OK, I found one not sent. In PDR. Is there a delimiter? I mean, in the limiter, right? Yeah, just in sequencing. But not in any other. Okay. No, it's only in sequencing. Here, let me find. There's a person listed here on page. Oh, I just lost it. Which page was that on? Somebody had not sent next to their name. Let me try to find that again, sorry. Sure. Pick it up, William. Okay, there we go. Morgan C. Okay. Okay, so we have Logan C. I'm looking at newsletter. Oh, I see. Okay, so one of the examples, I think I know what's going on. One of the examples was the email address, Crandall OJ. so C-R-A-N-D-A-L-O-J at gmail.com that is listed on two records in your database there's two Logans that share that email address both of those Logans are on your monthly newsletter roll up so it wouldn't be able to send to both those people because they share one email address so that's where it was a duplicate and I imagine that probably is what's going on with some of these other ones that were not sent, you have two of the same email addresses for multiple records. If you look in your database, one is listed as Logan Crandall, L-O-G-A-N C-R-A-N-D-A-L-L, but you also have a record called Logan C and that has the same email address and they're both on the monthly newsletter roll-up. So that's probably what the duplicates are. I'll see if I could find another example of not sent in the background tasks here. I'm just scrolling through. So you mean if it's not sent, if it's not sent just for the other one, but on the other one it's sent and that causes duplicate email address? Is that right? Yeah, it was able to send out to one of those name records, but it can't send it the second time because it has the exact same email address. Got it. Let's see, so we have a Todd Garrison. This might be another example. Let's see. So Garrison is on the roll up called monthly newsletter. Okay. okay yeah uh same thing here so um the email address t garrison at targeted dash recruiter is on two of your name records, and they're both in monthly newsletters. So I think that's what's happening across the board, where if the email address is shared between two name records, it'll only send to one of them. And that's why you have that list of duplicate 30%. Is there a way for us to filter those in the database for us to double check, which has name records with duplicate email addresses. Is there a way for us to do that? Yeah, let me check to see if there's a report for that so you can clean those up. What would be for us to do the merging of 50 days? That's one of our projects for the cleanup of our PCR. All right, so I looked in the reports. There's an auditing report that checks on if somebody has the same email address in the email address field. But it seems like you were pointing this campaign to go to the email work field, not just the regular old email address field. So I don't think it would, this auditing report would find people who have the same email work field. Let me see. I could double check. No, yeah. It's only looking at the email address field. Yeah. Gotcha. Yeah. There is a way to do it with a, oh, sorry. Go ahead. We have a lot of email options in PCR. We have the email address, which is the primary. We also have the work email. Then we also have secondary. Or how about... Yeah, you have email home, email two, email home three. I've seen those definitely. But yeah, in PCR, the only way to see if there is duplicate emails to merge those records is with the primary email address field. There isn't a report that runs on other email address fields, unfortunately. How about for a name? Can you do an alternative? Yeah, you could do a report that shows people with the same first name and last name, or last name and email address, things like that. So to run that type of report, you would go to Reports in the main menu at the top. You must select first the form letter. Okay, I'll get back to this later on. So I have to go under reports. Right, and then auditing reports on the left. Okay. And then on the right, go to duplicate names report. Oh, okay. And here's where you can select the criteria that it's seeing, you know, this is a duplicate. One of those options is first name, last name. You could do that if you wanted. You don't have to select a roll-up list. you can leave that blank. And then to actually view the report, you go to the three horizontal lines at the top right and click search. Okay, let's see how about... What did they feel here? Um, maybe email address. And then where should I go search? There's the three horizontal lines at the top right and then hit search. It might not be pinned yet, the search button. Okay. There we go. Let's try. Oh, okay. And so this will give you a list of everybody that shares the same, you know, if you selected email address, same email address field. And if you click on merge next to it, you would get a pop-up where you can choose. Oh, sure. Problem that I would just be, well, my question here with merge is that it's not showing information because there are some, hold on. So if I merge this, like this one, I have cp cell p87 AOL. This has three counts of name records in the system. So if I have three, will it show me either one of those has an attachment? That's actually my problem because it will not merge all the attachments, right? It will merge all the attachments into one. But you can, so when you click on the merge button to the left, it will have a pop-up window. and you'll be able to look over information about each one of these three records. You can even click on the name in the name field, in the name column, to jump to the record. So you can gather even more information about which record you want to make your master record. Yeah, there's like an option for me to check. Like for this one, there's three. I have to choose which one will be the main record, right? and one has... Right, you just check the... Okay. Yeah, you just check the box under the master column to make... and then hit merge. So this is just for attachments. How about, let's say, the others have notes on it or activities on it. will it also merge with the master information or with the master name record? Yeah, it'll merge notes and activities. Let me pull up the Learning Center article about merging so I can see all the pieces that get merged. Better help you out there. Gotcha. Okay, let's see. Okay, so yeah, it says merging, you will select the master record and one or more records will be merged into the master record. Activity logs, attachments, and other items will be combined into the single record. So yeah, I imagine that you have like a... That will be deleted, that's for sure. Right. It will overwrite field level data if, let's say, the first record has the city of Philadelphia, the second record has the city of Newark. The master record you select will end up being the city. The other city listed will be lost, if that makes sense. Yeah, but for the... On the field level... Yeah, but everything else it seems like attachments and activities, they'll all merge into that one. I see. But for the field level, whatever is in the master record that I choose will be the one that will be left. Exactly. Okay, got it. That is a really big help. Okay. now let's just go back with this one because I'm trying to do that earlier where is that hold on um oh shoot I think I just lost the okay so let's say this one onto the name record I mean to the resend checking let's say this one if I do both email I have to go to options right options on the left so if I have this turned off this will be just turned off for that specific form letter so I have to do this every time I'm going to send a form letter yeah if you want to send it to the same people again but you can't adjust your default setting there so that it's always turned off if there's probably a gear icon at the bottom left of that pop-up window where hopefully you can set your default for recent checking okay all right and that this already applies to all of the formatters or campaigns that I'll be sending yeah okay then I just have to because earlier I'm trying it out and gives me a pop-up that I have to select a form letter first. Okay, so I think I just have to resend all of this duplicate. I think it doesn't matter if it's sent twice, if it's just a newsletter. Okay. Okay, yeah, and if you click on on use existing campaign that also protects you from sending it twice to the same people so if you go to use existing campaign and you go to send it it'll not send to people you've sent before if that helps at all well the thing is this is newsletter we're sending it like once a month so we're okay same recipient and every time I believe I have to create new campaign Because if I'm going to use the same campaign, I cannot change the formatter, right? Exactly. Exactly. Yep. So, yep. Well, I just have one question left here, Garrett. This is actually a problem that I'm encountering most of the time. I've already raised it before to Robin. but there's no such like resolution that we came off there are times that the roll-off is actually shared to me however like let's say right now I can access it but after a few days I cannot access it and it's not letting me access through categories. Let's say the monthly newsletter or the newsletter distribution. If I will search it through roll-up name, it will not pop up. It's not letting me search, but it's shared to me. All right, let me check on that. Let me go back to roll-ups, and you said you're using that little search bar at the top left and which one are you searching for? So the most of the roll-up that it's not showing me is the CN Alert 5.2225. Right now I can search it but I'm not sure in the next days. So the resolution and it's kind of weird because if I log in through my laptop, what I have to do is I have to open it there and then I can I'm not sure if it's gonna be my PC or because when I log into my laptop I can search it there and then when I open it so that it will be at the recent show or show recent that's the time I can access it like my main PC to search roll-off it won't allow me to search it's like no result even though it was shared to me before so what we did back then with Robin is I have for the username I have to uncheck everything like reset like uncheck all then select a category a different category and go back to the different category to the same category and check all the username again and And as for Robin, it seems that there is a glitch in the system we're in. My account won't read Todd's roll-up, something like that. Oh, okay. Todd's roll-up specifically. Okay. Interesting. Cool. Yeah, let me pull up. Let's see. Todd's. Roll-ups here. Uncheck. Oh, let's look at Todd's for a second. Okay. And you said, what was the name of the one that you're having trouble with again? Like yesterday, Todd created a new roll-up, which is Add to Newsletter. That's under Admin, Newsletter. And it's not showing up on my end. But when I opened that in my laptop, I was able to see it. Oh, okay, add to newsletter. I'm going to the recent now. I have to add to the different computer so it will show up in the recent. That's mostly the workaround that I'm doing. Okay, and you said it was called add to newsletter? You kind of cut out as you were saying the name of it. Yes, add to newsletter. Okay, let me check here. So I'm going to go to show all instead of show recent. I'll just add to newsletter. Check all here. Yeah, it's coming up for me. Uncheck all. It won't come up with uncheck all, will it? Okay. Yeah, I'm not sure. It does seem computer specific for some reason because I can't recreate it and you said you know you can't recreate it on your laptop so i am not sure specifically what's going on with the computer um is there like a favoritism for citroen yeah i am not you know i could check to see if robin opened a ticket or something about that do you know did it sound like she was going to open a ticket or um I'm not sure. I think Robin did not open a ticket for that because we are able to create the work around we're in. Robin just has to uncheck it for the username because for some reason my account is not reading Todd's roll up. So I just have to uncheck it. But that work around won't work most of the time. So I really have to look for a different computer for me to access it. Got it. Are you on your computer now that's having the issue? Yeah. We could maybe go on a screen share and I can see if I can find any other workarounds for you, if that would help? Yeah, sure. How can I do that? Okay. Just go to a new tab in your browser and then go to meetings.ringcentral.com. Okay. Give me one second. Ring Central Meetings? Zoya didn't know anywhere. .ringcentral.com, right? Right, meetings.ringcentral.com, and meetings is plural with an S. And once you're there, it should ask you for a meeting ID, and I can give that to you whenever you're ready. Okay. Okay, yeah, I'll meet you at IDC. Alright, that is 494-645-780. 780. Okay, and then if it asks about joining with audio, you can say no to that since we're already on the phone. Yeah, perfect. And then click on the blue share button at the bottom. Select your entire screen up at the top. Okay, can you see my screen now? It is loading. Cool. Yeah, I can see that. All right, let's go back to PCR. I cannot give like a specific um cannot give a specific roll up right now but mostly what I do is I have to search here it's like the roll up let's see if this would uh hold on give me one second I can try to search okay let's try this one quality bow let's see okay it's showing up How about this? Oh, there. Okay. Marketing and chasing. This is a category. Oh, okay. This is what normally happens. I'm not sure if this is a website so I don't think I have something that needs to be updated. Yeah, so this normally happens. So if I search roll up name here, nothing will show up. So what Robin asked me to do is to uncheck all here. And then I have to check outside and then select a different category. And then try to check all again and then search back. Like so. Select all. Oh, okay. That would show up. But sometimes that workaround won't work. Okay, that's strange. Yeah, as long as it has either the right category selected or no category selected like it does now where it says select a category and you have the right username selected in that filter under usernames, it should show whatever you're searching. especially if you have show all toggled on on the right those are all dialed in it should show you everything without having to do that workaround let's see it any other do you have any other examples of maybe one that's not working on your PC I can't think of any Let's see, roll up, roll up, one sec, let me try to find a roll up here. Roll up. I actually can't think of anything. I'm just going to try to get it to work. I actually can think of a roll up. Hold on. Okay. No problem. Roll up me. How about this? But this is the one I created, so this should show up. I'm the creator of this. Okay. So mostly the role of that is created by Todd. Even though it's shared to me, I cannot see it. Yeah, I think it's hard for us. to identify right now. It's not. That's okay. I mean, if it does, it seems like it's working currently for some reason, but if it does pop up again where you're trying to get to a specific roll-up and it's not showing up on that computer, just give us a call or you can email support at mainsequence.net and we'll investigate. At least, you know, we know your username. We could sign in as your username and see if we can recreate the issue. But yeah, at least it's working now, which is good. But yeah, if it does stop working for you, just let us know. Okay, so you can short-throw motion real time. Yeah. Okay, I think that's it for me, Garrett. Thank you so much. That helps a lot for the merging and then the duplicate email that I just want to really... Yeah, happy to help. I could send you a Learning Center article. I'll just send you in an email about merging just so you have that handy and maybe I could find one on resend checking too. And, you know, just use that as a reference if you have any more questions about it. Yep, that would be really helpful, Garrett. I just noticed you no longer have the chat feature. right yeah support chat we we closed down um but we are yeah we're still doing phone calls and you can always email support at main sequence dot net yeah because i hate to create in-ticket tips that's too slow for me oh yeah i really need oh gotcha all right yeah then just give us a call yep yeah no problem have a great rest of your day you too bye",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1941.559288,
    "salad_processing_time": 92.72355318069458,
    "overall_processing_time": 1941.559288,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling in today.  This is Garrett.  How may I help you? Hi, Garrett.",
    "job_id": "83233a3e-6ad4-47eb-86b5-ba8691371c2f",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling in today.  This is Garrett.  How may I help you? Hi, Garrett.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3082245114036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}