{
  "recording_id": "3083107355036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:16:05.003039Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:16:05",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " This is Tyler. I hate when people lie to me. Or not helpful. He probably thought it was a different person because one was Richard, one was Rick. Well, I mean, I started it off. I go, okay, how I usually do this is it goes probably in their attachments or in their resume, which on keyword version, too, it doesn't help much because you can't search attachments. It goes probably on another record. I said, what's unique about the person, such as their address, that I could keyword search and see if it's on another record? I always do the last name. I thought I might have done that. It's Kurt Rudolph, so I don't know if you ever talked to him, or it's like, you know, very long, passive-aggressive. And I'm like, yeah, yeah, yeah, I see that. Like, let's move on. So, yeah. I'm like, wait a minute, how did I miss that? I don't know how I missed that. I'm like flabbergasted at myself. Because I'm like, it's probably on another record. If we change the name of it, maybe add some extra spacing in there, that should change the back-end CRC number so it's not recognized as the same file. Somehow it still was, which was kind of surprising. well because but if it's like the exact same like text yeah but i thought way back when like if you go in and you modify some things or like change the name of the file then maybe i didn't edit enough i'm just like irritated that i didn't catch that because that's like what i should have found in step one I don't know why I didn't miss how I messed up but anyway thank you thank you thank you I just feel like an idiot it's a long day it's a long life so congratulations on your house when do you get to move in so we're kind of doing it there's a few things that we're doing before we move in. Like we have someone coming out tomorrow. I have to run on my lunch break. Luckily the new house is right around the corner, literally like 10 minutes away from where I live now. For painters to come do a quote. For painting the downstairs. They said they should like after the quote, they said they should be able to get in next week. and my buddy does carpet. He came and measured yesterday so we're going this weekend to pick out what carpet we want. And then we're getting a fence put in for the dog so they're coming to do a quote on that on tomorrow night to see when they can hopefully come put that in. But once the painting and carpet is done, we're hoping to be fully moved in by either like the 27th or the 4th oh that's nice nice oh i wish i was moving i need a bigger house for now when my kids are home i need a bigger house we have a lot of land i have none that's nice because i live in mayfield and it's like i'm at the last house on MI Street. So then the corner, you know. So I have like all these yards that overlook mine. And it's so annoying. So enjoy that. Because that's like, that and no bathroom space. I hope you have two baths. Yep, we do. I have one and a half. Horrible. Let me find. Here, I'll send you the Zillow link. made me happy. It finally listed as sold today. Oh, here's my scare. I'm supposed to go to the Buckeyes game Saturday, and our friend, he knows everybody down there, and he's always getting my husband tickets whenever he needs and whatever. I just read today, looking for three tickets. I'm like, wait a minute. Isn't this taken care of already? I'm going to the Penn State game. Ooh, good for you. That's awesome. My mom got a, there's six of us going. She got us some really fucking good seeds. Nice. We're in section 116A, or 16A rather. It's like the lower, it's like the lower bowl, like at like the 30 yard line. Oh, very nice. Well, my friend, my husband's friend, he would always get them like where they're on the field. and they've had some, not always on the field, but they've literally been down there doing like Carmen and with them and everything and into the tailgate things. But, I mean, he's just getting, what is he asking for? He's asking for tickets in what section? I don't even know. I'm looking for three ADEC tickets for OSU game Saturday. I don't know where ADEC is. That's like the level. oh well I would have hoped I already booked a hotel we have all these plans I don't know I think that's just how they work they do it last minute I wanted it not to be last minute it was supposed to be done like a while ago I thought oh wow you have a ton of land nice look how big the back end part too is well what's really cool like if you look at like that top view like you'll see like how it ends up like some trees back there yeah we found we didn't even notice this until after we bought it there's like a little like path like behind the the trees that goes to like a little like it's almost like a little meadow opening oh that's on our property very cool look at all those trees i don't have anything like that well it's nice so the guy to the right of us and behind us is all one family and they make maple syrup oh so all those trees are just don't park your car near them you don't want to get that sticky stuff on your car yep my husband yelled at me one time I was where was I I don't remember where I was I didn't even know what kind of tree it was it was just kind of like slightly hung over and it got like all that junk all over it's very hard to get off very nice aren't you so excited oh yeah then that outbuilding we're going to side it up and drywall the inside of it and insulate it it's going to be my man cave let's see he's repining back to me oh Kurt Rudolph yeah like oh I never would have guessed like I don't know why I just didn't do Scola. Maybe I did his name. I don't know. Let's see. Alright, so he's handled it at least. That's good. Alright, I guess I'm going to get back to work here. I'm starving actually. I'm really hungry. I think I'm going to order pizza for pickup. Just go grab it. I got Subway on my lunch. I don't know why I have a taste for Geraci's pizza right now. Geraci's doesn't have good pizza. Every once in a while I just get a little craving and they have one down kind of like around the corner. I'm in Mayfield. So it's just at Wilson Mills and Salmon. I'm right up on. Two slices and a Pepsi for like I don't know, six, eight bucks or something like that. My grandma lives on Chelmsford. Oh, wait, I know exactly where that is, but let me think where it is. Chelmsford is, I know the name. It's where City Hall is. Yes, yes, yes, okay, yes. Yeah, so when my parents got divorced, my dad lived there for a little bit, and so spent a lot of time in Mayfield. Now, they live there now at all? Yeah. They live there now? Yep. When they go to vote for mayor, got to vote for Diane Snyder. and then i'm trying to think where because we go to that uh there's that pure hockey where danny days used to be yeah we go there all the time for my son's hockey stuff or we go to play it again right up there gotcha then i i go i'm a big nerd and i go to mr cards and comics it's like right in front of the greens right by that walgreens at the corner gotcha I do miss my Skyline Chili though I never go there It closed Oh did it? Yeah You know Marisa when we went down to Ohio State For What were we down there? Maybe Oh probably moving her in Yeah moving her in There's this place What was it called? Dirty Dogs or Somewhere in Ohio State Where they do these hot dogs But like all these crazy toppings Oh that is Dirty Dogs Dirty Franks Dirty Franks Dirty Dogs Something like that. Yeah, there was like a loaded baked potato one. I'm like, I'm not doing all that. There's a place in Mentor that does it too. Oh, she's like, yeah, we got to go here. I was very surprised. It would be something my daughter would like, but she went and took my husband. And so, yeah, it was pretty good. I can't wait to go. I've been to one game in my life, I think. And I think it was when we were just dating before we were even married. so I'm very excited to go. Yeah, it's a good time. I'm excited to go back down this year. Yeah, I mean, so my friend, you know, he goes to OU, so we're like, oh, well, we have to go to that game. Yeah, perfect. Yeah, you know, I think both my kids would probably, would rather have been Penn State, but that's going to be a good game. Very important game. Yep. And they're saying it's supposed to be a night game. Ooh. They said it'd be the Texas one, a night game. Yeah. Well, they already, because they announced it's a blackout for Penn State. So, like, everybody wears black, kind of like the opposite of Penn State's whiteout. Yeah. So, I had to order my black Ohio State jersey. I went and got a new shirt because it's going to be, like, 86 this Saturday. So, I'm like, I want something, like, V-neck light. I obviously can't do a crop because I'm too chubby and old. so um i at least got something that was like thinner and v-neck you know keep cooler and then my husband said like oh we're supposed to wear gray and i'm like god darn it so i'm trying to find a lightweight gray shirt so i have my daughter on a mission i'm like you gotta run down to the bookstore i'm not gonna get anything and there's nothing like local that i'm finding i don't have time to order now if you go to rally house that's why i bought the red one they don't have much for women's in gray oh really that kind of spray yeah there was one and i think it was like red and gray because i actually almost got that one but it was like almost like uh not elbow length but like still was just longer it was thicker and heavier like that's not what i need something light as possible yeah you can always try to take sporting goods too i might have to but i so there's this college traditions it's over like lane and that's like right around the corner from marisa was dorming last year so i'm like jesus and then she has like classes sometimes up there because of engineering i'm like if you have classes but she lives literally down the street from the big bookstore so she's going to go look tonight at the big bookstore and then if she doesn't find it then she's going to look at the other one for me because i found two that i would wear that are gray and not like heavy and that's Give me 86. I'll be walking around all day. It'll be hot. Yeah, it's going to be toasty. Very toasty. All those people. I'm going to be sweating. Yep. Alrighty. I think I'm going to order a pizza. Take a little lunch here. Yeah, I'm waiting to hear back from Mac so I can learn how to do data returns. Well, hopefully we don't have too many. We've had way too many. Way too many. yeah there's just the one right now that's smaller but every time i go into the database creator it's giving me a weird error so i don't know if i'm doing something wrong or if coverstone needs to fix something but i figured i figured i'd go to mac first make sure i'm not doing something wrong before i bug coverstone i haven't seen that server level stuff like other than like an occasional screenshot so i have no idea we definitely need more cross training on lots of stuff i think Yeah, well, this is the first time I've seen it. So I've seen it. So it'll. Yeah. Well, situations like this, you know, losing Sean was. Was bad. Yeah. Especially Sean and Matt, like, you know, Matt and then Sean. That was. That was a rough one. Then we'll see how this meeting goes. I don't think it's anything to be concerned about just yet, at least. Well, it sounds like they're pretty close to selling. I was told 90-10%. But I don't know when. Oh, that they're... Oh, I asked Bill. I just asked Bill directly. I was like... I don't know. There's a little bit of a standoff with the Snyders. Bill wants to paste the stuff off, keep it going, and whatever. and there's a little bit of a standoff. Yeah. Well, I'm sure the court proceedings will figure that part out. Yeah, I think it's more a standoff between Bill and Snyder's. Like the Snyder's want to sell or don't want to sell? They're not wanting to pay the debt because they don't feel responsible for it because they didn't really know about it. And Bill's like, I could pay it and keep it going, and they don't think they should pay it. Something like that. I don't know. I don't know how you have four people being owners and not knowing more what's going on. Gotcha. So it's just a matter of them paying off the debt first and then selling. Which apparently you can do. And keep it going under your own names and stuff like that. And I guess the Snyders don't want to pay the debt. so then it comes to somebody else pay it and it just takes it over oh like takes over the company yeah which from what I understand is how it was kind of worded to me it's a little bit more of an issue with the Snyders no that's not surprising so I don't know I keep you told nothing to worry about so well yeah they've always they have said multiple times like if they do sell it's going to be like contingent on them keeping people around but yeah they could say that till they're blue in the face but ultimately it's a new company and they make the rules and they decide who stays and goes yeah so i honestly can't even think about it anymore because i was working so many hours and so stressed out that like you know me my colitis stuff I can't get stressed out like not like that like I was borderline like there was like one day I started crying to my husband and he's like what's wrong I'm like I just can't catch up like I was it was insane how busy it was because just pretty much within a week like half the people were gone and just trying to figure things out the whole billing situation people are calling constantly why am I getting an invoice it was insanity absolute insanity so that kind of stuff i was just like i can only deal with this the task i have to do like it was just um yeah i mean it seems fine now i mean if anything from what it sounds like we're actually doing way better than we were because we're not wasting so much money. Well, we're still stretched pretty thin. Yeah, but I mean, you know, they paid about 25 grand or 20 some thousand just for that office space a month. Yeah. That's a lot. That's a lot for people to not be there. So. Well, it's because Bill's apartment was there. I don't even know if that was... I don't even... I don't even know. But it was, yeah, 20-something grand. They had to keep those car payments and everything. Yeah, they were definitely not smart with the money. Yeah. So it's got to be smarter. So... Well, like I said, they're going to run at bare minimum as long as they can to get the books clean and then... I'm staying positive. I'm staying positive. Honestly, I don't think them selling would be a bad thing. As long as I sell the job. I got things to pay for. They're going to have to know people that know how to use it. Yep, exactly. And we still have a lot of customers. so yeah according to my sequel query my custom set we have 1454 active companies in the database yep I have the same thing on my PCR page then I have my active companies anybody that's a thousand plus that's either on hold or in collections yeah I have a company that is collections client cities client status on hold collections client status active yep customers that need ppis yeah companies on hold yep i do the same thing because i gotta especially the collections ones um it's just actually a lot lower right now but i saw people actually have to put in their card stuff instead of what's her name going in in the back end ethics still in collections Essex is actually sending a check they I emailed with them they were actually going to overnight it and wanted an address um because I turned them off I kept we kept emailing and calling and they don't nothing happens turned them off and that same day got a reaction like yeah we've been trying to reach you and you know pay your thing we've been trying to leave messages and um so then she sent me a thing like this is a check we're sending it what's your overnight thing um since we actually don't have a building i said just send it to the po box we'll give it you know several more days so yeah it's on its way though well that's good yeah it's like you can't like just ignore shit and then oh i have this one customer that they're pissing me off i'm like i'm like done going back and forth with them because they haven't paid in a year who is it mgmt something it's yvette and shane graham and bill gave me extension like all right you have 60 days to pay it nothing okay then they want to negotiate this you know and what and then the late fees i said i'll take the late fees off if you pay it didn't pay and then they're like oh we can if you can remove the late fees those total 390 we'll give you 200 no not accepting those terms i offer you to remove the late fees i'm not doing it again that was a courtesy before and you still didn't pay like until i see money come in i'm not touching anything with their billing i'm not doing anything and then they'll like well i try to call you we've had like three conversations and don't reference an email from april because that's long gone you know yeah that's what i want to say like the last one when i offer something i said if you could pay this today or when can you pay it and then you don't get back to me for two weeks that offers gone i can't believe i'm flabbergasted was the one word that you you would do this what What good does it do to turn off my database access? Well, let's see. You have 13 open invoices. Two of them are for 2003. This is not the first time you've been on hold. I put you on hold in April. Patsy did it in 2023. And you're flabbergasted. I don't know what company gives you services for a year without collecting money. My car would be repoed. My house would be in foreclosure. like it's not a charity and i'm done there's a few people like that i'm just like i'm not going back and forth i'm not negotiating either pay up or there's no reason to talk you're not a customer in my opinion i'm done yep bill's like well see if you got 300 well i can give you two that's not what i said i said i or no bill said take the three or the 250 i said no i said 250 per month plus your regular. Well, I could give you two and if you can remove those 390 late fees. So you want me to only go down to two and take off 390. You're still backwards and you'll never catch up that way. Like, just ridiculous. Yeah. And I'm sorry, if you don't have a few more hundred dollars and you know that, then you're not in business anyway. Yep. You haven't paid in a year. Like, enough. Oh, I just went on Facebook because my phone's out. Breaking shots fired at Utah Valley University Turning Point event. Oh. God, these fucking shootings. I hate it. Look at that. One guy that hit a shot down at High Street. Oh, my gosh. reports that Charlie Kirk has been shot. Who? Charlie Kirk. He's that guy that goes, I've seen him on different things. He's that guy. He's very conservative. And he goes to the college campuses and people are always debating with him. Oh, yeah. Apparently he's been shot, according to this thing. oh wow let's see oh gosh condition unknown he's in critical condition the video shows him being shot in a jugular he's probably not going to make it oh wow I don't want anybody going through that I don't care what your reviews are that's just wrong oh no someone's saying he'll be okay oh I don't know alright I'm going to go eat I'm starving alrighty talk to you later Thanks. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 1971.24187,
    "salad_processing_time": 149.75261449813843,
    "overall_processing_time": 1971.24187,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " This is Tyler.  I hate when people lie to me.  Or not helpful.",
    "job_id": "4dbf58c4-f54e-4287-9ff9-e328f161b0de",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " This is Tyler.  I hate when people lie to me.  Or not helpful.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3083107355036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}