{
  "recording_id": "3085905692036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:17:38.818853Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:17:38",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Enter your participant ID followed by pound. Otherwise, just... You are in the meeting now. There is one other participant in the meeting. Good afternoon. This is Jim. Bear with me here. Certainly. How you doing, sir? I am very well. How are you? I'm good. I'm pretty well for Friday. Thank you. Excellent. Excellent. Am I coming through okay for you? We just moved, Jim, and I'm still working on the technical pieces, so I'm not sure this is my first kind of Teams or Zoom call. You come through just fine, just fine. Okay, excellent. Awesome, awesome. Yeah, so I want to show you around PC Recruiter today. And before I share my screen and kind of show you around, just wondered what were kind of the main features you need or what are the main things you need the software to do, be it ours or anyone's? Jim, to give you some background in terms of, you know, with where, what I'm looking to do, and ultimately, you know, I have been in the corporate world for a while. And I've used from, I guess I would call it a larger scale or enterprise level usage and pretty familiar with a few different tools, applicant tracking tools to, you know, within that environment. And so I'm kind of in a bit of a transition period in my career right now where in the purpose for reaching out to you and initially through Jim is that I'm looking to kind of hang my own shingle and have been doing that, working in that direction and a crazy time to do it, but ultimately in terms of place individuals in different organizations, but also looking to do business development. And so in tracking all of that, Jim, so, you know, I've had some conversations and with a few folks, one of those being John Busey, who knows Jim Wise, I guess they know each other pretty well. I think you, I have mentioned that to you in the past, and they go back a number of years. And John had recommended, and I'm doing business with John and his partner at an organization, and growing that business with other organizations. But ultimately, what I believe is to help grow my business. I'm a solo person, plan to stay solo at least for the foreseeable future. But my two main avenues are to grow my network of individuals. Part of what I'm using primarily right now is LinkedIn Recruiter, LinkedIn Recruiter Lite, some clearance job efforts, but then also just the good old-fashioned other avenues and social networking, a little bit of that, but primarily networking as well. I would consider myself an old school recruiter. I've learned some of the newer things that are out there through maybe some AI enhancements or tools, chat GPT, that sort of thing. I wouldn't consider myself by any means an expert at those, but kind of learning as I'm going. But really trying to grow this, doing so, I expect to make a decision, Jim, on PC Recruiter or another platform within probably the next four to six weeks at the top end. And that may be a little bit slow, but just wanting to get things moving forward. Just at this time, kind of getting things adjusted, getting my ducks in a row, for lack of a better term, and getting things moving in terms of the business itself. Sure, sure. And hopefully that helps you, just to paint some broader strokes, I guess, just in terms of a little bit of history and trajectory-wise. And certainly happy to answer any questions you have to help you. Sure. And just kind of looking for basic tracking of candidates, positions, companies, interviews, emails, contact, everything like that? Yes. Okay. Very well. Very well. Yeah. So let me show you what I'm seeing right now, Jim. Now, that may grow. That's one of those that my vision on this is probably not where it will be, let's say, in six months, but that's what I'm seeing at this point. Okay, perfect. Perfect. Well, yeah, let me show you around some of the system here. I'll share my screen, kind of show you the basics, take questions as we go. It's the best way to take a look at a demo, I think, so that'll work well. So, let's see. That sounds great. Perfect. So, I'm going to share my screen here. You should momentarily be looking at a sign-in screen for PC Recruiter. Okay. You see that all right? It's coming up. You bet. Perfect. Perfect. So this is our sign-in. So I'm going to show you just kind of the basic system here. It's all cloud-based, so it's going to be something that will run on a PC or a Mac, pretty much any browser. So you have a lot of flexibility in how you access the system. There's a mobile app as well, so you can access it remotely too. So you're going to have a username and password. That will get you into the system. Once you are logged in, it's going to look more or less like this. And really, it's very configurable. So you have the ability to put your own fields in here, show or hide various different buttons or elements or actions on the screen. You're going to have the ability to kind of set up a lot of your own configuration options within the system there. So you have a lot of things you can kind of set how you feel they should look within the system here. which is nice. Okay. So essentially here, main menu bar at the top, that's going to be your primary navigation, and that's going to get you to the main elements of PC Recruiter, those being names, companies, positions. So kind of those three record types are kind of what we will basically handle. The names are going to be your candidates, your contacts, pretty much any person that you want to track in PC Recruiter. So that's going to be your names within the system. Companies are the companies you're working with, maybe even companies you're marketing toward. So you can put in various different companies in here and the positions the jobs are looking to fill and they're all going to be interrelated. So if I went for example into a company, it's going to hold on to the last 50 companies I was working with. I could of course look one up by name if I wish. But if I wanted to go into Vandal Lane Industries, I'm going to see I have a company record will show up down at the bottom of the screen entirely configurable. I keep mine in three columns but you can keep yours in more or less. You can put in your own fields, use our fields, that's all up to you. kind of with each company record you're going to have a subset of positions so these are all the job openings you might have at this specific company and then you might also have a subset of contacts down there at the company these could be your hiring manager these could be employees that you work with there these could be people that you have placed there even so these are going to be our contacts at that client company and if I go into like Ben Brown my hiring authority click his name that's going to open his name record up in a brand new camp and from there I'm going to be able to have a custom record for this hiring authority I'm going to be able to store his email phone numbers whatever fields I wish and then I have a nice activity history showing everything I've ever done with him follow up an interview actually not whatever that's good it can even track emails incoming and outgoing so it's going to go any conversations calls that sort of thing it looks like it tracks that whatever whatever the input and I of course would manually put that in some things are automatically One thing that is nice is we integrate with RingCentral. So if you wanted to click to dial and click to text out a PC recruiter, you'd be able to utilize RingCentral to do that. So that's a nice option there. You're also going to have capacity to add an activity. So if you wanted to add an activity here, you can put in different types of activity, whether it's a cold call, general screening, marketing call to client, whatever it might be. You can kind of typecast whatever this activity is going to be, jot down whatever it might be, and then even schedule a follow-up maybe and add it to your calendar that way. So very, very easy to do it like that. Okay. So that's going to let you kind of track what's going on, almost your journal showing everything you've done. Okay. So that's going to give you a lot of things you could do with them there. Okay. So looking at that, I'm also going to be able to go into my positions. So any of these positions, I can attach people to them as well. so I might also maybe I go to the position tile up top this is going to let me get right to a position I can type in a name or I could go to one of the last 50 that I worked with that's big what we do is we kind of keep everything you recently viewed right at hand if I go to name for example last 50 name records I was working with are going to be right here can click right into them okay so if I go into position that's going to show me all my job openings if I go into this radiological control tech that's going to open up my actual position screen another configurable screen so you're able to put in any fields in any order so you could do some different things with that all the fields are searchable so you can do some different things and what's nice about this is if you put a job in PCRecruiter you can actually interface this directly into your website so our job board integration would be able to be imported into your website it'll match your site no matter what it looks like what's nice is when a job is entered and it's available slash open and there's one opening or one opening or more it can be shown on web. So you can see it's showing online right there. So that is something nice because you can kind of drop one of these templates in so that if you wanted your jobs in a list format or maybe you wanted them in a little bit more condensed list or maybe you wanted them in a table. You have some different options that you can place in here and then when the candidates select one of the specific positions it's going to show that one didn't have a description but it's going to be able to show your description a few fields and then candidates can actually apply online. You can even let them log in using LinkedIn, Yahoo, Facebook, whatever. That'll help to prevent duplication. So it'll see if they log in with LinkedIn, it'll see that they've already applied there. Maybe they're already in your database and it will simply update the existing record there. It doesn't add a dupe. So that's going to be very helpful there. So I could also go in and then I'm able to put in any information that I wish right from there. And I can go ahead and they can fill in all the required fields enter themselves directly into your database. So this is going to be nice because you can collect online applicants very easily just using our job board integration. Okay, and then once people apply online, you're also going to have a pipeline right there. And that's going to show you everyone who's being considered for this job. The inbox over here to the far left would be everybody maybe who has applied online or if you had your internal database, you can also search your internal PC recruiter database. and link groups of candidates to this position and then you're able to move them through your own process whatever you want to be so you have the the ability to put in up to 18 steps call them whatever you'd like drag and drop people from one to the next you can right click and pull them out of process you can put in your custom reason codes as to why they're out of process or you could drag them all the way up until maybe they might get all the way up to an offer pending or placement. So you're able to put in your own process here with all of the steps that you need. Jim, is that customizable for each company? So let's say for this particular company, RCT, you go to another organization and maybe their hiring process is a little bit different. Can I adjust that based upon the organization? You can have as many pipelines as you wish. So you could build one for your company or if one maybe could work for three of your companies but another has a very unique process you can build as many different pipeline processes as you wish so okay a lot of flexibility there so yeah a lot of different things you can do in there and one candidate can be in as many pipelines as they need to be and one pipeline can have as many candidates as needed so a lot more flexibility there too okay so you're able to kind of do that and as you do drag and drop someone so let's say maybe we had a first interview with Mark I drag and drop from right there if I go into his record that is automatically going to create a searchable trackable reportable event in his activity showing right there first face-to-face pipeline activity my username name of the company the name of the candidate what type of interview was the name of the job is in there too so all those details automatically happens it's records act that activity just out just by dragging and dropping him through which is okay okay so full activity tracking there's reporting on all that too so what's nice is whenever I look at one of my candidates I'm gonna be able to look let's go to Terry maybe that's going to go into his record I can full screen it here I have the ability to put in custom fields like maybe I can check off custom fields certifications he has foreign language he speaks whatever it might be but they're all searchable and then I'm also going to have down here a complete history of everything we've ever done with this candidate emails calls if you're using ring central it'll even track incoming calls outgoing calls missed calls texts sent that's even recorded in the activities as well so a lot of things are going to be there and then you could choose to show their resume right there or maybe I could show searchable notes everywhere he's ever interviewed how far he got where he currently stands so all all of that information is going to be tracked right here very, very easily. Even attachments, you can upload as many attachments as you wish to each record. So a really nice way to work with that. You're going to be able to kind of build this to your liking, any fields you want. And what's also cool about the customization of the screen, you're going to be able to pull in all sorts of information. But even if you just keyword search, you're going to search a lot of different areas of your database. So if I go up in here to my name search and I go to the advanced search, I can go through here and I can look for sales and marketing. So if I look for sales and marketing, I'm going to be able to run that search. That is going to instantaneously search my entire database. I'm going to be able to get results back showing where the words were found. And I have a lot of different places so I can see Terry was my best match. And I can see that the words were found in his resume, his notes, keyword tags, summary screen, profiles, and attachments. So I have a lot of searchable data here. And I can go into any of those. So if I click on the R, that's going to show me. There's the resume. It's going to highlight every instance of what I searched for. Same with notes. So notes is going to help me to find what I'm looking for. I can tag him out of lists of keywords if I needed to. So I can do that. I can also go through a summary. There's even an AI summary generator. Click a little button, it'll generate a summary based off of the information in their fields and in their resume. Maybe you want to go to the profiles so you can look at maybe their LinkedIn web profile. We have a tool that can import people from LinkedIn, Dice, Indeed, all these different sites. So if you're looking at anyone on LinkedIn, there's a little quick to add button on every record you might look at on LinkedIn. It'll add them directly into the PC Recruiter database right from LinkedIn. So it's going to give you a lot of flexibility there. And then that LinkedIn web profile is searchable. So that's now going to be something I can keyword search on here, along with any of my other searchable areas. So I could go through, I could even build maybe a questionnaire that I filled out. Whatever their answers are, I'm going to be able to search on all those too. Excellent. And then all attachments are searchable there. And then from here, I can check my checkbox is over in the left and I could go through maybe I want to pull up a map and show a dot for everybody's location see who's where maybe I want to go and send a mass email out or I want to put it into a position pipeline I can mass link them into a pipeline or even put them on a roll-up list so I can do that too very, very easily. So a lot of... From emails and that connection, how does that work, Jim? Forgive me. As far as the... So if I were to send out a mass email or an email to a candidate, where does that email come from? Is that from my email account or is that through the system? How does that work? It's going to come from you because when you send an email, even if you send a mass email, it's going to come from... Here, it's coming from my Gmail address, but it would come from whatever your email address was. You can embed that into there. So either individual emails still going to come from you, mass emails. And the cool thing we have is with our email campaigns piece, you can build campaigns. So send mass emails out to people. That's going to let you see kind of. You can see who opened, who clicked, who unsubscribed. So all the stats of the email and the results are going to be tracked very easily. You're also going to be able to build a sequence if you want. So you could build something that says maybe, excuse me, I sent an email out and then I want it to pause a day, send a second email out. And then if they reply, they get a third email. But if they don't, they get a fourth email or something like that. So you can really build automated sequences in here. and then everything you do in these email sequences could be part of a report. If I look at analytics, I'm going to be able to look at not only, like let's say a metrics report of all my interview activity. I chose to show only first, second, third interview, or first, second, and phone screens. But I could look at it for last year, this week, last quarter, whatever. So I could see all that data there. So this is any of my interview activity, any of my activity data. I could even split it up and look at what jobs I worked with in that time period. or I could go down here and look at an email campaign. So I want to see the last time I emailed the campaign that says update your contact info with us. So if I look at that, it's going to show me my click rate. So it's going to show 93% of my people opened it. Who were they? I can see down here 93% of my people. There they all are. When they last opened it, how many times they opened it. I could even look at what links they might have clicked inside of that. So I can see all that information there too. So I have a lot of things I can work with in there. Full reporting, full tracking, these reports are all customizable. You can do KPIs and then various custom reports and things in here too. So you're going to have that piece there as well. Like I said, people really like the searching of PC Recruiter, the mass handling. You can build roll-up lists that you could then build a sequence off of. Or you could just go to a roll-up list. That's going to kind of group a list of people. Maybe I have some sales and marketing people, 20 of them on this list. I could just keep them right there, get right to that list of people anytime I want. And then from there, if I wish, I could give them a different stage or status or priority. I can customize my different stages on here so I have a lot of different things I can do with that. And then I could mass email from here. I could export these people. I could import a spreadsheet onto a list so your roll-up lists are real flexible. Gives you a lot of different things you can do with that as well. Okay, so a lot of flexibility within the roll-up list there. To talk a little bit about the capture piece, that's going to be, like I said, that means by which we can import from LinkedIn. So if you happen to have anyone on LinkedIn and you wanted to import them into PC Recruiter, I can go through here and I can look. I just want to get a list of people here. and if I go down through here let's just find somebody that I don't have in my system pop into here so anybody who I might go to their LinkedIn record I'm going to have a click to add will show up over here on the far right and that click to add is going to give me capacity to add them into my PC recruiter database I don't know why it's not but there are limits to numbers on that Jim just in terms of number of people you can transfer over nope you can have as many as you want no limits because it's a scraper so there's no limit how many times you can use it you can just hit click to add okay there's no limit of people in your database your database can keep growing and it will bring in his photo his name his title sometimes email or phone it'll always get it if your first degree or if they make it public like he made his email public that shows up and then it also shows his location you can add a searchable note you can add him to one of your roll-up lists or link him to one of your positions into a pipeline right from here just as you create that record so you could do that all at once and then I have a record for him in my database so if I go back in here look at the dashboard I'm going to be able to see new names today there's Brian Roland in my database and I have a full record here I can see his name his title his LinkedIn summary I can get one click access to that now I've got my username the time the date the sources LinkedIn because that's where I brought him from and then under attachments I have a fully searchable copy of his LinkedIn summary I can edit a view and take a look at it right from there so nice easy way to kind of pull people in of course there's a resume parser so you can parse resumes in we even have a means by which you can parse resumes directly in from Outlook or Gmail we have overlays for those two that's going give you capacity to just say, oh, I got this resume emailed to me. Right click, parse it in the PC Recruiter. It'll create a record for that, and it'll pull it right in. So a lot of people really like that feature as well. That's right. Yeah. Yeah. That makes sense to be able to do that. Very good. Okay. Kind of a separate question for you, Jim, as far as follow-up calendar reminders. So back on the business development side, in terms of marketing, if I just want to make a note to reach back out to somebody, you know, a month, six months, whatever the timeframe may be, is there something within the system that can help with that, just in terms of activities or tracking, that sort of thing? Yeah, you could put, let's say I wanted to put a follow-up to Brian here. I could go into his activities and just note a quick activity, and I could say follow-up in three months to check in. I could put it wherever I want to talk about. Maybe it could even be no contact made, or maybe it's going to be a general screening call, whatever it might be, marketing call to client maybe. and I can go ahead and throw this on my calendar for one two three months out we'll pop that in there hit next now we're going to be able to save that so I can save that change that has not only been added this call is scheduled for 1212 it happened on September 12th but I'm also going to have my schedule in PC recruiter on December 12th now I'm going to have that call right there and I can see that it was a follow-up three months to check in there's a marketing business development call I can even jump right to his record from there this will stick with an outlook calendar too by the way so you can kind of work with actually easily okay excellent so yeah that's going to give you the ability to schedule your follow-ups track what you're working with and track everything that you might need to track in there very good Let's see, any questions on anything? Anything that I hadn't shown you? Anything you wanted to go a little deeper in? As far as, you mentioned RingCentral. Not familiar with that. Is that part of this package and would love to learn a little bit more about it? Sure. Well, it's not actually part of our package. It's a partnership that we have. So RingCentral is its own company, and that is going to – it's just a phone dialer. So like you see, I've got it here. I can click to dial out of here. So I can click to dial – just click the little phone number next to anyone's record. So if I happen to go into a name record, every name record is going to have a little phone icon next to every phone number. Let's see. Just click that phone. That's going to launch – that will launch RingCentral. that'll also note an activity that an outgoing call was made or incoming or a missed call, anything like that. And then it's also going to allow you to text. By clicking the little text bubble, you can send a text to RingCenter right from here, and that will also record it in the activities. So it's nice because it tracks your calls, then calls are reportable data, so you'll be able to do that. And it's nice to be able to just click the dial on the system, use the mobile app too so your phone number follows you wherever it's going to work with pc recruiter excellent i like that that's a nice feature as well okay yeah so it's a separate product you need to buy ring central but once you do it just hook it into pc recruiter we don't charge anything for the integration there okay how much gene do you have a sense of how much that is if if i were to go forward with that or is that something i it's certainly good to do so but in in terms of follow-up. Do you have a sense of an estimated cost on that? I want to say 40 or 50 bucks per user per month, I think. Okay. Not crazy, not crazy. Okay. Okay, very good. And then the PC Recruiter, like I said, it is $115 per user per month, and that is for the premium package here. It has everything you've looked at here. Actually, premium plus would include the AI Suite 2. And then $750 to set it up, and the $750 is going to be a one-time and that is going to include creation of the database it's going to be able to will assist you hooking it into your website installing the outlook integration if you want help setting up ring central pretty much any function or piece of PC recruiter you want to get set up will help you set up and it also includes 10 hours of training so you'd have 10 hours of training with one trainer you'd work with that person start to finish and they would get jumping running on the system through personalized training sessions, 10 of them, so 10 hour long sessions. Excellent. So it's very flexible and it's very personalized. They really work with you to cover what you're most interested in. They go at your speed and they would be there. If you have questions, you can call them up direct and just ask them anything, anytime you need to. Very good. Very good. As far as storage capability, is this something that is stored within on the cloud? Or is it something I'm assuming that it is, but don't want to, I'm dating myself a little bit. The last time that I was personally involved in one of these, there was an option to do either or. I'd be more interested in a cloud-based server to keep this information. I'm sure this is certainly part of this package. Yep, all cloud-based. This is going to be cloud-based, so it's stored on our servers. You can access it from anywhere. there's nothing on your server at all but you own the data there's no limitation per se it is merely um you get kind of one gig per username so you'd have a gig of data storage included that's about 20,000 records if each one of the records had an average resume so if you have everyone has five resumes you might get a few less than that if everyone has no resume you might get a few more than that but a lot of different options there but if you did exceed that. It's just $2.50 per gig per month over that, but not many people really get that much. Understood. Understood. Good to know. Okay. So when you're having conversations with other individuals or smaller teams, what types of questions are you getting there just in terms of interest? Just curious to know what other folks are looking at, how they're using it, anything that we may have not covered here. Certainly appreciate knowing. Sure, Bob. Well, we've talked all about integrations. Also, some people will use something like ZoomInfo or HireEasy. Those are both data sources. We can enrich data from those. So if you click right in there, if you wanted to use HireEasy, you can update via HireEasy. And what that does is if you have a HireEasy account, the credentials plug into there, and that will go and find another cell phone number, another email. It'll try and find a little more information on that person using hire easy or zoom info and then of course if you happen to want to pull people in from in addition to LinkedIn indeed career builder Facebook zoom info seeing monster resume library or a few others you can pull records in using our capture tool so a lot of people like that we talked a lot about searching let's see we talked about position scheduling kind of covered most of everything sequencing that is a whole another area in there that you could kind of build automated sequences so you can kind of set it up so that send one email wait two days send another wait three days and a third or maybe you want to send an email that if they open it haven't added to a call list you could do that so I have an active call list of people that opened one of my emails so I can go right into Jim's record see a blurb of his record information a little history of his activities I could even dial his cell phone by clicking that number right there I could even put myself a script in there so I click the dial read the script mark him as left message rolls onto the next person do the same thing click to dial read my script marked left message rolls onto the last person so it gives me almost a pre-populated call list qualified off of people that have opened my email so that's going to have a cool cool function of our our sequencing piece Excellent. Yeah, and I see you've got reports there back on a previous screen. That looks good. We've got pricing down and all of that. This looks good, Jim. I appreciate your time. And just to jump in, better understand things, if I have any follow-up questions, anything in particular that comes up, okay, it's best just to connect with you by email and go from there. Yeah, yeah. Email me. Give me a call. I'm happy to help with any additional questions. And then when should I put you down for a follow-up just to kind of touch base check-in? Let's see. I would say first week in October. Jim, I'll be in a better place to see where things are sitting. I fully expect to be moving ahead with PC Recruiter or another platform. There's one other that I'd like to check out, but I think just from everything I've heard with PC Recruiter, I've heard from a couple of folks that I trust and value their opinion on things that I'll likely be coming back in your direction here. Also, just getting some personal things squared away. But I'd say within the next few weeks, that first week in October should be good. For sure. Perfect. I'll put you down for a follow-up that first week. and any questions you have, just let me know. And it's a pretty quick setup process. So if you did decide you're ready to go, I email you the paperwork that day. It's a DocuSign. So once it's signed, then we email over an invoice. You can click to pay with credit card. Once the setup in first month is paid, within a day or two, you'll have a link set up and be ready to go. So you'll be good to go. So pretty quick setup process too. Excellent. Excellent. Very good. Thank you, Jim. Much appreciated. I appreciate your time. My pleasure. I appreciate your time. and we'll talk to you early October, a few weeks, unless I hear from you sooner. In a few weeks. You got it. Have a great weekend. You too, sir. Thank you very much. Thank you. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2013.743015,
    "salad_processing_time": 107.24233746528625,
    "overall_processing_time": 2013.743015,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "job_id": "249d9191-cb11-4a21-8f64-a303d4b95460",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 1
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3085905692036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}