{
  "recording_id": "3085308789036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:17:21.137580Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:17:21",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is Garrett. How may I help you? Hey, Garrett. This is Jason Johnson over at Neely Pierce. We have a bit of a quandary. I've been a PCR user for 19 years, and Truett Neely has asked me to perform a task neither of us can figure out. So we're hoping you guys can help us out with this. All right. So we have recently done an import which put emails into a new email category. we're left with 20 something thousand names that have an email address in a custom category we call email personal and he wants that field eliminated so what i'd like to do is move anybody who has an email in email personal which is a custom field into the email you know the main email predefined field but i don't know how to move things from a custom field to a predefined field globally Oh, gotcha. Okay, so we have, yeah, we only have the copy custom to custom and copy predefined to custom. So in order to do that, you would have to do an export of the data and then re-import it, switching the information from one column to a different column name in your CSV file after export. That's what I figured. Yeah, that's the only real way to do a move from custom over to predefined is through the export and import process. Okay, I thought you might say that. So here's what, let me explain what he wants done and make sure that I understand from you the way it needs to be done. So he would like to say, I don't know if you can see our screens, we've got three fields, email work, which is a custom field, email main, which is the predefined field, and then email personal, which is a custom field. So he wants, if anybody has an email in email personal, he wants that moved to email main. And if there is already something in email main, he wants that record skipped. So what I was thinking was I do a query and I say email personal is not empty and email main is empty. So only pulling those records. So start off with only exporting those. Can you think of any better way to do it? No, yeah, that's a great starting place with that advanced search. One is empty, one is not empty. And then when you export, I would include in the export the identification field. Is that something you have experience with? I can give you a rundown. No, and in fact, when y'all said that to me once before and I went to do the export, the export looked different than I had seen previously. I haven't exported in so long until I did so like two weeks ago. So if I pull this search up, maybe you can walk me through that export because I think I'm missing a step somewhere. Okay, yeah, absolutely. All right, so real quick, let me pull this. I guess I need to roll it ready up. So I'm going to say predefined field email address is empty, and custom field email personal is not empty. So that gives me 21,000 names. I'm rolling them up now alright That's a big list. It's working. Nice. Thanks for helping us. Would a screen share be helpful? Do you want me to do that, or are we good? Yeah, we can. I mean, I think we're good so far, but yeah, if you prefer that, we could always jump over to one. I'm a quarter way through this roll-up here, so it's still going. Okay. The next step, once we get that, will be adjusting the columns displayed in your roll-up list. Okay. So that we can see... Oh, that's why we need an export. ...whichever column we want to... Okay. Right, yeah. Cool. Yeah, whatever columns you see is what you get in your export. So we'll definitely add a column called identification. And then we can use that as the duplicate checking criteria on the import. I could say if the identification field matches that, you know, it is a we don't need to create a duplicate type thing. And that'll make sure every record is getting updated based on a unique identification number. So we're not going to lose activities or anything like that either, right? Right. Yeah. Nothing will be lost. We'll just be updating records that already exist with basically two fields, email address, email personal. So when we have somebody that's imported, let's say, so I think a lot of these imports came from like 2010 or 12 or 14. And then now we're going to correct them. That person's activity is going to say import 2010 and import 2025, right? It's just going to show two imports. But the original, this person entered the database 15 years ago, that info is not going to be lost. Right. Exactly. Okay. Understood. Okay. It is rolled up. I'm going to refresh my screen just because I'm that kind of guy. And reopen. I got 21, 866. Okay. And I am back. Now we need to customize my screen. I have shown email address, email work, which are the two new ones, and email personal. So I need to add identifier to my screen, you're saying. Yeah, there'll be a field called identification. Okay, give me a second. I haven't done this in a minute here. Configure. What's it called? Configuration. Yeah, it would be in your action menu at the top right. Configure. It's a gear icon. Oh, yeah, yeah. No, I'm on configure. I'm in the screen. What's the field I'm adding? Predefined identification? Yeah, it's called predefined identification. Make sure it's just one of the fields there. It doesn't matter the order. Then hit save. And then refresh the screen. Perfect. Okay, she's there at the end. Excellent. And then go ahead and select all. The identification, they're not numbers. Some of them just, like, are the same. Oh, they're the same? Okay, let me take a look. I'm opening up a roll-up list right now. They should all be unique. I see what you're saying they should be, but some of them just say Texas PT unknown as in, yeah, some of them have like hospital names. Oh, okay. How can that be? I've never even seen this field before, so. I'm not sure here. I'll take a look at the change log on one of these records. Okay. Nothing there, no clues on that one. So yeah, the identification field can be changed or edited. So it looks like somebody might have changed these from the just regular unique value that is assigned each time a record's created. I notice all of them have in common they were imported at the same time. So my guess is back then... Whoever did that didn't know. They mapped something to that field, probably is what happened. They mapped it wrong and imported it. Right. Okay. Yep, that is correct. So that's not fixable. Right. We won't be able to use the identification field to update records. Okay. But we can just do – I was going to say, can we just duplicate check by that email name itself? Which field are you referring to? The email personal, because we have everything quarantined to one roll-up, right? So I can export this, then take everything from email personal, and just remap that to email main. And then that just duplicates everything, right? So I re-upload the field, duplicate check, you know, if found update. And so it'll take what's in their personal email and it'll map it to their predefined email. And then that email address will appear in both fields. Then I could global change just this rollup list and delete the personal field. Yeah, that's a good way to do it. So just during the duplicate checking screen during your import process, you're going to, yeah, make sure you choose update. And this is, you know, the duplicate checking screen on the import is where a lot of problems happen and people screw up their data. I just want to make sure we have it totally figured out. So you're saying we would probably want to do the email personal field as the duplicate checking field because we know for a fact that every one of these records have a email personal. Okay. Yep. And we know for a fact that none of them have an email main because that's the way we found it. So we'll just say if duplicate found, update, and then it'll update. With the criteria of email personal. Yep. With the criteria of email personal. And then it'll update that record and take that email personal, which we have already remapped to the email main. So then when it's done, this list will have the email in both boxes. From there, I can then global change and remove it from the personal side, which isn't necessary. That just looks clean. I mean, that's really not even totally necessary. That's just a little extra step, I guess, to make it look nice. Yeah, that sounds good. That's a great plan. With the next step here of exporting, you'll have to select all at the top left there, select all results. And that'll be getting every checkbox selected. And then you'll have the export action button in your action menu. You probably have to click the three horizontal lines to see it. I got it. The one option to pay attention to is there's a checkbox that says default fields. You want that unchecked so that it uses all the fields that are visible. So I didn't remember that box from before. What does that box mean? When would I want default fields? That would mean that you're only exporting a handful of fields that are like first name, last name, company name, email address, phone number. it doesn't correspond with your columns that you've set up in your view. Okay, got it. Okay. Okay, so go ahead and leave that unchecked, and then I want to export as a CSV, correct? Yeah. Okay. Are we backed up in case I mess this up? And can you undo what I do if we've messed this up? We're not going to mess this up. This is right. We're doing this right. yeah we're doing it right I mean there there is a backup service we can perform it you know there's a cost involved but we can set you back to you know yesterday or whatever you would need most likely okay I just have a new window has opened and it's thinking I'm guessing this is a big one so it's probably in this for a second probably oh and you know what I should mention that this big of an export We'll probably time out. I forgot about that. It probably won't. It probably won't work. We might have to break it down into smaller roll ups. I've never tried to export this big, so I don't know. So just let the thing think for a second and see if it times out. yeah most likely it will i think the max i've seen people do is like 9 000 records at a time so okay um so we're at 21 maybe split up three or four different lists yeah at least uh two or three uh maybe three would would cover it um all right let's copy the name uh maybe we'll get lucky can i just reset my timeout window no that's not on my end that's on your end. Yeah, it's just like connecting to our servers. There's like a timeout for an action, like an export. All right, well, let's see if we can set a new record since it's already started. Fingers crossed. How long is the timeout? 60 seconds? I actually don't know. It could be a little bit longer than that. Okay. maybe we'll get lucky here so yeah I think I had it figured out I just was nervous this is a big this is a big ass list dude yeah true it is very specific on what he likes he likes everything tidy yeah that makes sense that's good to have good data no yeah yeah we like a tidy tidy list but I think this all stem from the last import they did of 30 something thousand names that populated a new field so we just went with a new field in my opinion i would have just gone deleted that import and i would have re-imported it to the correct field i think would have been the shorter path to success here and then you could have just renamed the field but whatever that's true too yeah tell me this Why is it that he has renamed the field email main, but it's actually just the email predefined? So on the contact card, it says email main. But when you go to search, you still have to search by the predefined email field. Is it just because you have renamed? Yeah, the actual field is called email address in PCR, but you have the option on your layouts to give it a new title. But it only changes it on the contact card, though. It doesn't change it everywhere. It'll change it on the record, on the field. It's like a display change. Right, it's a display change. So the actual field's called email address. So people have to know. Okay. Yeah. So why not just leave an email address? Anyway, okay. Right. I think his idea is he wants everybody to know that's the primary. If you only have one email for a person, put it there. If you have two, then use the field separately. I think it would have been cleaner to call one email primary, email secondary. I think it would have maybe been better. Yeah, and that all can still be adjusted even on a user level. So when you adjust your record layouts, it only applies to your username. so you can have a different set of fields and look yeah yeah i mean maybe I just have less fields. Maybe we'll get lucky. So is that export screen showing anything at the moment, or is it still kind of just blank? It's blank. So it opened a second window, a second tab, and it's spinning, but it's still spinning. It's blank, but it's still spinning. Okay. That's all right. I'm hesitant to do anything else because I was going to go split up this list while I waited, but I feel like I shouldn't check with it. Okay. Yeah, maybe just leave it to sink. Yeah. Appreciate your help this morning. No problem. there's a lot of us here that are old school recruiters from k bassman and kbic was just super strict about fields and so there's so many of us that have 20 years of experience that come from that militant use of pcr i think that's why he wants everything he wants everything perfect which I'm a supporter of. I agree. Yeah, that makes sense. Man, I can't believe it's still going. I am at two gigs upload speed here. So, I mean, we got a hella fast internet, so maybe we'll... It's still bottlenecked by what you guys can export to me. Right, that's true. So it doesn't matter how fast my connection is. I heard you guys have been busy. Y'all have been harder to get a hold of in tech support, I'll say that. Oh, yeah. We just have a smaller tech support team now. So, you know, anytime calls come in, we usually find that, you know, the other people are already on call. So, yeah. But we do have a, you know, our voicemail, our new directive is if somebody leaves a voicemail, you know, it creates a ticket for us. So we know to call people back is the highest priority. Oh, that's cool. If there's a voicemail left. So we all get indications across the team for that. So, yeah, if you don't get anybody on the phone, then you can always just leave a voicemail and you should get a call back. And that puts you in the queue. Oh, that's cool. I mean, usually I'll just send an email, but this is one I was like, I'm not writing this all out via email. Yeah, that makes sense. I figured we end up having a bunch of back and forth. It's just one of those things that's easier to do by phone. lights this big right it's still spinning it says loading yeah I haven't I haven't seen it wait this long before so I'm not sure how it'll end up according to Jim and I Google's timeout is set at 14 days huh okay but administrators often change it to one hour or require the user to re-sign it again. Oh, is that like a, I see, like an inactivity? Yeah, an activity that'll crash. Yeah. And then the network timeout request. Most people code at 300 seconds, which is what, five minutes? Something like that. So basically it's saying idle state 60 seconds, network timeout about five minutes. So if it is not doing anything, if nothing's happening, it'll crash the window within 60 seconds. But it is doing something. We know it's working. So probably your developers have set it at 300 seconds. Okay, yeah, could be. If you try to send JavaScript for over 300 seconds, you'll get a timeout function, usually written within most codes of developers. That's what Jim and I say. In the meantime, I saw this morning they caught the Charlie Kirk assassin. Oh, yeah. I did. I saw something about that a few minutes ago. Yeah, I didn't read much about it. No, I hadn't watched it. It looked like the snippet I read made it sound like Trump was on TV live when he heard about it. Oh, okay. And reported it, like Trump himself reported it on live TV while doing an interview or something. So I didn't get a chance to dig deeper, but talk about breaking news. Yeah, that's immediate. And how about getting it from the president whilst you're interviewing him? That's a, I guess that's a, if you're a journalist, that's the scoop right there. You got the scoop. Right. That's the big moment. That's the, yeah, that's the pinnacle of your, of your career right there. Yeah. You have the president's attention when that comes through. Pretty crazy. Then again, he's, then again, he's such a showman, you know, that could have been a well choreographed moment too, you know. Oh, that's true. I didn't think about that. Always a possibility. Yeah. I was watching a thing on – what's this comedian's name? She's a little too brash for my taste. What's her name? Courtney something? No, Whitney. Whitney Cummings. anyway she's a little bit too crass of a comedian for my taste but anyway she was talking about she had done a roast of donald trump back in the day and mtv or comedy central whoever does the roast had said you know you ask the the guest of honor what topics are off limits and everyone is supposed to respect that no questions and he said the only thing that's off limits is my wife you say anything you want but you can't talk about melania and she was like no man i i don't have any other material that's the only material I have. Oh, no. So she said she looked at him and he looked back and winked at her and she did the Melania jokes and then he looked very irritated, like angry, like this isn't funny anymore. And she said when they walked off stage, he smiled and said, that was great television and then walked off. Oh, wow. And she was like, it was in that moment I realized like this man, he's a showman. He's a showman. He really, he's, everything is specific and calculated. Like he's not, this is not someone who's aloof. This is not, you know, because he almost paints himself as this loose cannon, right? Like, you know, America, fuck yeah. Right, right. He's like, no, it's all like, it's all methodical and thought through. And I thought, oh, that's interesting. Yeah, that does kind of open up a perspective there. Yeah. Now, granted, this is a long time ago, right? This probably was in the days of, you know, what was that show he did with You're Fired? Yeah. The Apprentice. Yeah. So this is a long time ago. But anytime I see a news story like that, I'm like, is it really breaking news? Or he's like, all right, I'm gonna give you guys the scoop. Here's how this is gonna work. We're gonna play it out like this. I'm gonna be on it. You're gonna be interviewing me. You know what I mean? Why? That's totally plausible, right? That's completely plausible. It is absolutely plausible. I would not even bat an eye if that was the truth. My conspiracy theory bone is on overdrive. I'm like, we never went to the moon. Tell me about it. The earth is flat. Lay it on me. I'm going to grab a drink and lay it on me. It's all open for discussion. Right. So funny. Yeah. Yeah. You know, yeah, it's easy to look at things like that. I've seen so many theories and things that I'm like, you know, that's some of the first time. I mean, the first thing my brain goes to now sometimes, you know, it's funny. Totally. Yeah. Because you're like, well, I remember when I fought this thing, which sounded ridiculous and like, Oh, well here we are. It wasn't ridiculous. Right. There's still plenty. I can't get behind. I can't get behind flat earth. I just, I can't. I've got a new, I got a new theory on that one though. I think it's all a joke. I think they're just messing with us. I don't, I think here's the conspiracy. The conspiracy is that flat earthers aren't even real, that they don't even truly believe the earth is flat. They just want to stir the pot. I think they're professional gaslighters. That's my new conspiracy. Yeah. That's, that makes more sense to me because, you know, it's, it's hard for me to believe, like, you know, I haven't listened to many of their, you know, reasonings and all that, but it's tough. Yeah, but I think that's more likely what you said. I'm like, but we've observed it. We've seen it. We've observed that. That's an observation that's been made. I don't know. That's fine. I'm like, that's just basic. Anyway, I'm like, you remember the sailboat before? Like, I've been on a sailboat, and I've seen boats come across the horizon. Like, that's – With the curvature, yeah. I've seen the curvature of the earth. Man, this thing's still working. Do you think it's doing anything? I don't know. Maybe we should just let it roll? Maybe, yeah. I mean, I haven't seen it go this long. I mean, it's kind of like it could go either way at this point. I feel like holding you up from whatever else is going on over there. No, it's all right. No worries. I have some research and stuff like that. Right. Oh, you know, I do have a quick call coming up. Oh, yeah, I have a quick call actually coming up at 1015. But so do you do you know the I guess the next steps? I think so. I think when this comes through, I'm going to get a CSV and it's going to show all the fields. And then I'm going to take everything from the column that's in the personal email field and I'm going to cut it. and I'm going to paste it into the main email field. No, I'm going to copy it. No, you need to copy it. Yep, you need it both places. I'm going to copy it and paste it to the main email field. Then I'm going to upload. And you don't have to map every single field during the import. You can just pick a select few. I can just map just the email, right? Yeah, email address and personal email. Just pick those two. and then when you go to duplicate check, you say update. Email like personal, duplicate check based on personal. That's the criteria. If duplicate found, update. Yeah. And then let it roll. That would cover it. Okay. And then next would be the global change and delete the personal field. Right. On that roll up. Okay. That's where I'm going to forget. The global change is where I'm going to forget. Do you want to just email me those instructions or do you just want to call me back later today and we'll fix that? Yeah, yeah, I can I can get you some instructions for that. Because that global change specifically, that's what I'm not going to remember how to do. I haven't done that in a while. Oh, gotcha. OK. Yeah, I can help you with that. And then if this does time out on you, the current screen, do you know how to copy portions to another roll up list? I figure I have to go through and select page by page and then actually you can do select all. And then when you click on copy to roll up that action button, you'll select your roll up. And then a screen will come up and saying, do you want to copy all records or a range? And then you could type in one through nine thousand. OK. Yeah. and then do that again, 9001 through 18000. Okay, no, I didn't know that. All right, well, I'll let this go until the screen times out, and then if that doesn't work, I will do that thing. I'll re-import it, and then you'll send me the global change instructions to delete everything in the personal field on just that roll-up. Perfect. Yep, that sounds great. Okay, thanks so much, man. I appreciate it. I'll sit here for a few more minutes and see what happens. Sounds good. All right. We'll talk soon. Thanks, brother. Have a good one. Yeah. See ya.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2005.150889,
    "salad_processing_time": 101.25126314163208,
    "overall_processing_time": 2005.150889,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence Technology.  This is Garrett.  How may I help you? Hey, Garrett.",
    "job_id": "82bbd7a6-53ea-4cc3-8799-bb6db6707d88",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence Technology.  This is Garrett.  How may I help you? Hey, Garrett.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "general",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3085308789036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}