{
  "recording_id": "3088401961036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:18:55.213699Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:18:55",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling MainSeries Technology. This is Garrett. How may I help you? Garrett, this is Ernie Bivona. How are you? Good. How are you? Fine, thank you. Is there a way of looking for companies in the database where there's been an activity within the last, let's say, 15 years, 20 years? In other words, my database goes back to the 1980s. So if there's been nothing going on since, you know, in 10 years or 15 years, there's no point in talking to them. They may have moved on, who knows, whatever. But in seeking live bodies, if you will, is there a way of identifying their activity in the lab? Because I looked. I don't see where I can see that, do that. So we can do like an advanced search that says the last activity is greater than this date or less than this date. You would probably want, let's see, like less than meaning in the past from a certain date. So if you're saying maybe 10 years back. I know, but where would I do that? It doesn't say under predefined fields, company, city, state, country, industry, specialty, email address, notes, keywords, summary, profile, attachments. I don't see activity. It would be called last – oh, you found it? No. I'm saying in candidates, yeah, but not in companies. not in company okay let me check on that are you in the consumer or industrial database industrial we do not use consumer haven't used it in 30 years got it all right we will log in on my end we should get rid of it we if you did want to do that we could put in a request with the tech team to remove a database if you want it, totally fine. I mean, it hasn't been touched in decades, so whatever information is there is going to be pretty much worthless. Gotcha, okay. And just logging in now, my internet connection must be slow today. It's taken a really long time, sorry. let's see company advanced search and look for okay it might be do this customer I see what's happening so with company searches you've customized your search to only show specific fields in that drop-down instead of all available fields so we can either switch that and add in last activity as an option or we can clear it so that you have any field imaginable as an option when using your search drop downs so to do that just go the top right are you on a search right now like an independent I'm on the top we're not there yet let me get let me I got that's going to be the purpose of it course let me let me get to the where I can do this and then we can and then we'll export where you create a role perfect whatever okay so if you're on go the company in the main menu at the top and then there'll be in your action menu top right a gear icon that says customize you'll have a new pop-up window that appears on the left it will say available field on the right it'll say selected fields so those selected fields are the only ones that are showing up in your search drop downs. So you can add last activity from available fields and move it over to selected fields or you can clear out all of the selected fields, leave that blank, so that every field is available to you when you perform company searches. Well, hold on. I went up to the top. I saw activities. Oh, no, you want to go to company in the main menu at the top of PCR. And then at the top right are a handful of icons. One of them is a gear icon in the action menu. It says customize. Hold on. Learning center, user preferences, background test start, change my password. Oh, it's a gear icon a little bit lower than that gear icon you clicked on. Database, data management, global change, web extensions, employer websites, database menu. Oh, yeah, that one's in the main menu. So you want to jump back over to company in the main menu. Go to company and click search. And then at the top right, there's an action menu. It has like a question mark, a gear icon, a magnifying glass. The one you want is the gear icon in that set of icons. Okay. So now we want to what? So, yeah, the selected fields on the right, if you clear those out, it'll make sure that every field is available to you when you perform a search. Right now you only have those ten fields available to you when you're performing a company search. So how do I clear them? Just hit the minus sign to the right of each one, and that'll remove it from selected fields. And once that's empty, just hit save at the bottom right. Then we'll be able to use last activity as part of our search. Then what's going to happen when I want to go back to do the last activity? So, yeah, while you're just still on this page where you have available fields and selected fields, just make sure selected fields is empty and then hit save and then you can close it. Oh, good. Okay, then we could go. You want to go to your company advanced search. I know. Now I close this and I go to Company, Advanced Search. Perfect. And then you want the predefined fields as your first dropdown. In the second drop down you can now choose last activity. Last modified? No, it should be last activity. Sometimes it's easier to start typing rather than hunting through that long list if you You want to just start typing in that field at the top of the dropdown. You're looking for last activity. Perfect. Select that. And then you go from when to when, greater than, less than. Yeah, let's do less than, meaning in the past, before a certain date on the calendar, less than. And then to the right, put in a date. So I think you might have said 10 years ago or something, anything before that. I think 2000. There you go. And then hit add. I did. And then hit the search. And it might need a full date, like January, like 01-01-2000, rather than just 2000. 01-01-2000. We'll see if that brings back anything. That's not right. Hold it. That's not right. Add. And then do search. 8,254. Okay. Yeah, and those are, you're looking specifically at company records with their activities. There may be names inside of those company records that have later activities. So these are just activities written on the company record. I don't know if that's exactly what you want or if that works for you. Well, I mean, like right now, there's this blank company. Why it's there, I have no idea. And there's a name attached to it. But it's a blank company. I don't know how that ever happened. And it was in 1998. And it was a person who was here for 40 years, and he never could figure out the computer. I'm serious. He was here for 40 years, never could figure out the computer. So at any rate, we would create a roll-up list, right? Yeah, you could do that. Select at the top left of those search results and go to select all results. And then we would roll-up list and we would add a roll-up list, right? Yeah, add roll-up at the bottom, at the pop-up. It should give you a place to name it. I have to do this all over again. I kind of understand what you're doing here. one less than and then doing search and I get the eighty two hundred and then I gotta select all I don't know how you got thirty thousand I want to export all of that and then Well, but if we put this into a roll-up list or export it, how do I export all of these things? Oh, so, yeah, the search results there, you can go to add to roll-up at the top right. It's like a little notebook icon in your action menu. and once it's in that roll-up you'll be able to export the companies open No, I got zero. So how come it didn't add? Oh, what's the name? Did you just create a new rollup? Yeah. Okay. Did you click on the zero under company to add it to the rollup you created? If not, I can... Here, let me do it again for you. Here I'm just going to run that same search. We'll do less than Wait, less activity Let's say less than 0101 2000 Add those in, search I'm going to select all Do the, let's see, okay, and you just named one company since 2000 so I'm going to click on on the zero to add those, and it'll slowly start adding them in. And I'll let you know when that completes. One second here. I got 2,687. How come that's? How come I got ? How many did you find? I got 2,687. Okay, so it just completed adding them all in. So if you want to go to roll-ups in the main menu up at the top, then you should see companies since 2000. It should have been 8,250. and we want to export it to a spreadsheet. Isn't there a CVV? CSV. CSV, can we do that? Yeah, CSV. So go ahead and open up that roll-up list if it's not already open and hit the select all results again at the top left of the list. and then there's a you'll probably have to click the three horizontal lines at the top right and you're looking for export in that list of actions export okay and then you can choose if you want it to be a CSV file the bottom I got 8000 something I didn't look at that, you did that I probably don't have the ability to do that. Why not? I have no idea. You can, but I'm just saying anything that hasn't been acted on in the last 25 years. I've got the AI go through it, moving the whole thing up. Well, it's still cycling. Yeah, it will take a while to export 8,000. if you try to export more records than that, it'll usually time out. So if you're trying to export something like 30,000 records or so, you would have to break it up into multiple roll-up lists and export like 9,000 at a time. More than 9,000, the system kind of times out and doesn't complete the export. Okay. All right. Well, let's see where this leads us. you know the idea is that chris wanted to do a an ai cleanup cleanup whatever i'm not sure how that works I know we have a little gerbil and it's in a wheel. There you go. Enough peanuts to feed it so it keeps the computer working. But in reality, it's still cycling. But I don't even know how that works. Now it stopped. You should have a new download. The downloads almost always show up at the top right. Okay. Okay. You want to look at it because I got a phone call coming in. I don't even know where that phone went. All right, so this should be – all right. Let's see what we got here. So we have username, last activity. Oh, we only have the last activity. And this is for 8,000, right? Let's see. If you do want to get certain fields in your export, you would have to adjust the columns that are listed on your rollups. So just kind of like customizing the view. I want to get every company that we've hired someone for. Oh, everyone you've hired someone for. I want to do a reach out to all of them and be like, and since we've hired for them before, you know, hey, and do a message to them. But I want to extract that data. Okay. So, yeah, so if you get a roll-up list together of whichever companies you want to interact with, it sounds like you want to export all of those companies and get them into maybe a different program like an AI. Yeah, I want to get the Retrace UBT to go through it, and then it'll give me all the contact information so I don't have to go one by one and go from there. Okay. Yeah, so the roll-up list that you're viewing, it has different columns that are listing different fields. That is what exports. So you want to adjust that list to include more columns. You can. Less columns. So you would do that first before you export so it has the right fields visible. So in order to – If I go to companies, I go to search. Now I'm going to go to customize, and I want to see what would be the – That's not how it's done. What? Never mind. Just try what you're doing. Yeah, so if I wanted to create a roll-up list of all companies we've placed names into or candidates into, how would I do that? Okay, let's see. That would be a couple extra steps. There isn't like a field that shows people have been placed in that. do a name search for anybody with a status of placed and build that as a rollup list. Then you could do a company search and say any, any let's do a company search for anybody on that name rollup list we just created. It's kind of like cross searching across between, you know, name rollup and the company search. So a couple extra steps on that, but I can walk you through that. Let's start by just doing a name search. So go to name up in the main menu. Okay. And then do in the – you could stay in basic search for this, but those drop-downs on the left, first name, last name, city, switch one of them to status. And then the search value to the right of status would be just the letter P for placed. And then you can hit search. I don't have status. Yeah, you do. Company name, where do I have status? Are we names or companies? We're in names now. Status drop down, okay. And then the next one would be what? Yeah, status drop down. If you selected that to the right, you can use placed as the criteria. So everybody in their status field who has placed. Then just hit search. And that should bring back, I'm doing it in your database, 280 results of people you've placed. And then go to. Is that from any date or from time immemorial? It should be for any date. Anybody who has the status of placed in your database, there's about 280 of those. We're over 1,000, so 288 is... Okay. So that must mean that... I'm just going through the invoice numbers. Gotcha. Yeah, it must mean that the placed, the status field on the records aren't accurate or up-to-date. Usually when you take somebody through your pipeline and drag and drop them to the placed area, PCR will automatically change their status to placed. So it might be that these names were placed at some point and then they were changed or updated back to candidate or something along those lines. So that's why they're not showing up in this search. Let me think of maybe an alternate way of finding people who have been placed. We have roll-ups, let's say that. Let's see the roll-ups you have. The company since 2000. This is 8,000. We have this right here. I just did. I don't have access to your roll-ups, by the way. I don't have access to any of these. No, you probably do. You just don't know how to get there. No, I'm in roll-ups. It doesn't say, yeah, but you can access those. You can access those. You're not limited to just me. So are these roll-ups all limited to just him, or is there ways for me to be able to see them as well? Or is the whole company able to see all roll-up lists? You should be able to see them. When you go to roll-ups in the main menu at the top of PCR, you'll see some filters across the top, like a search bar, category, and then username. You'll want to use the username dropdown to select the other usernames to view those. Okay. So now I'm able to see every roll-up list in the company on this earnings. Let's see. Now you're in my computer. I can't get to my computer. All right. Yeah, so basically I want to just... Go ahead. All right, so we can then... I was figuring out maybe an alternate way of finding people who have been placed. So you would want to do an activity search for anybody with a placement activity that was automatically recorded on their record when they were placed. See if we get different results with that. So in the main menu of PCR, go to activities. If it's not pinned as part of your main menu, click the three horizontal lines to see your unpinned main menu items. But you're looking for activities. I do have activities here. Okay. I'm on activities. Perfect. Then go to, at the top left, go to interview. Instead of, you know, it'll say company name, position, interview. Click on interview there. And then you can put in a date range that you're looking for this placement. So you could put it back to, like, the year 2000 or whatever you need as the start date. All right, we'll do 2000. And then end dates today, so that's good. Below that, you'll see filters. You might want to clear out the username filter that's automatically there so that it will apply to anybody who made a placement. So backspace anything in username. Below that, it says interview type slash status. Click on the pop up icon to the right of that filter and select from that list anything related to the placements. It's probably at the bottom there. And select that. And then at the top right, click the magnifying glass in the action menu that will perform the search. I'm wondering if I should also do accepted, like offer accepted meaning or interview or no? No. Just that? Okay. And then what did you say? After I click that, do what? Yeah, once you select those, the magnifying glass at the top right to perform the search. And that will show you every, okay, excellent. Yeah, that should show you everybody with an activity that was a placement. And then you can select all those results and put them on a rollup list by going to select at the top left of the results and then clicking all results. and then go to your three horizontal lines your action menu at the top right to find roll up all results check and then the three horizontal lines at the top right yes your action menu top right you'll see roll up as an option and under the three horizontal lines. Then go to Add Rollup at the bottom right of the pop-up to create a new rollup list. You can name it whatever you want. This will just be the people who have been placed. Okay, cool. And then save that, and then make sure if it lists that new roll-up list that you created, that it starts adding the names to it. Otherwise, you'll have to click the zero to say, that's the roll-up list I want to add the names to, and it'll start adding them. Wait, have we saved that last thing? No, it's already all placed, and it's already downloading. Oh, good. Okay, then you're in good shape. Once that finishes, you could go to Roll-Ups in the main menu. Go to all placements name. Just make sure it added 927. I just checked that. It's still adding. Added 2768. Well, what's weird is this is 5,438. Okay, and that's fine. So you did an activity search. So that would mean that some names have been placed at an activity of placement more than once. So it ends up being less number of names, but more activities. So that should be fine. Okay. So we've got a list of everybody who has that placement activity. Now we want to see all of the companies that are associated with those names. Is that correct? We want to, yeah, I want to get a CVV. I wanted to get a CBB of just this information. So quickly, how would I do that? Because Ernie has to get his computer back. Oh, no problem. Yeah, if you just want to select all at the top left again, select all results, and then at the top right, click the three horizontal lines again, and go to export in that action. In roll-ups? Once you have the roll-up open, I'm sorry, yeah, go ahead and open the new rollup you created. You'll do select all results. All right, so here's this. All right, and then this is all the rollups. This is 2007. Oh, no, 20,000. Interesting. Okay, so if I select all, all results. Select all, and then at the... Yep, three horizontal lines. Export will be listed in there where you can then choose CSV as your export type. Perfect. Okay, awesome. Okay. All right, I'm going to just see if I can do that from my side. Okay. You know, I mean, you're so fast to jump. All right. Let me try now. Let's see if I can roll it from my end. Okay. So, show all. Yeah, don't look at that. Okay. I got them. Nice. Okay. What's he saying? He can see them now? Yeah. Oh, good. Okay. All right. Thank you so much. Yeah, no problem. Let me know if you have any other questions or come across anything else you need help with. But yeah, just exporting is opening that roll up and using the select all and then export in the action menu. Yeah. All righty. Reach out if you need anything else. All right. Thank you so much. Thank you. Thanks.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2050.78784,
    "salad_processing_time": 105.30544066429138,
    "overall_processing_time": 2050.78784,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling MainSeries Technology.  This is Garrett.  How may I help you? Garrett, this is Ernie Bivona.",
    "job_id": "17f99d64-0c18-42ea-a66d-a4089d10952e",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling MainSeries Technology.  This is Garrett.  How may I help you? Garrett, this is Ernie Bivona.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "general",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3088401961036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}