{
  "recording_id": "3089541002036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:19:29.931656Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:19:29",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting. Enter your participant ID followed by pound. You are in the meeting now. There is one other participant in the meeting. Good afternoon. This is Jim. Hey, Jim. Good afternoon. How are you? I'm well, Brian. How are you? I'm good. I didn't mean to get all choked up. I apologize. No worries. No worries. Yeah, thanks for joining me today. I wanted to show you on PC Recruiter a little bit. Just kind of wanted to initially see kind of what you're using now. What are you really looking for in a software package, be it ours or anyone's, so I can know kind of what your main criteria and requirements are. Yeah, great question. So, Jim, I think the best way to get started is to say, hey, I'm a little bit of a blank slate. The last time I was in agency recruiting was about eight years ago. Or no, I'm sorry, rather nine years ago, nine years ago. And I've been a corporate recruiter. I exited the organization I was at and decided rather than get into the rat race of trying to find a new recruiting role, that I would make one for myself. And so I have been actively building, and I have about seven clients right now and 10 roles amongst them. I've got I'm using pin.com for my sourcing solution and sourcing engine in conjunction with LinkedIn LinkedIn premium not LinkedIn recruiter I want to draw that distinction and Google custom search engines that's my sourcing engine and then I'm using the G suite Google and Google sheets to keep track of candidates and that is my ATS and that's my story and I'm sticking to it all right all right so kind of looking for the basics tracking names companies interviews jobs kind of the full gamut you've got it okay excellent actually yes I want to show you on PC recruiter a little bit and and I'm going to show you I think you were referred to us from somebody as I recall yeah so uh Bryant who who's another recruiter in the Atlanta area and he focuses on on sales talent I focus on technical talent and yeah, I just thought that it made sense if something was working for somebody that I admire, you know, don't reinvent the wheel. Just do the thing that they're doing and try to keep up. Awesome. Awesome. That's good. Yeah. So yeah, he's been with us quite a while, quite a long time. So yeah. So let me share my screen and kind of show you around here. If you have any questions as we go through, just jump right in. And I'll warn you, I have another call at two. So I'm going to try and get this done in a half hour, which shouldn't be a problem, but if we need to reach out to another time follow-up we certainly can Jim no worries alrighty so so get logged in I'm going to share my screen you should be looking at my sign in screen for PC recruiter and once you see it let me know you see that screen okay yep we're good let's go awesome awesome so so this is all cloud-based it could be something that's going to run on a PC or a Mac there's a mobile app so you can really access it from from any type of machine anywhere you need to. I'm going to get logged in with my password here and get logged into the system. And once I am, this is going to be more or less how it's going to look. Now, it's very configurable. So you could actually, if you wanted to not use the sequencing piece, you could hide that in the main menu bar. You could rearrange the buttons and where they are. And then you have full control over if you were looking at, for example, a company record, what fields show down there. We have a standard company record that comes with the system, but you can add your own fields, move ours around, make a combination of the two. So a lot of flexibility in how that's going to look and what fields are going to be where. Same going to hold true with the name record, position record. So it's going to be very, very configurable. So you can really make it look how you think it should look and what's most interest, what's of most use to you. Basically three primary areas in the system. You're going to have a primary menu bar at the top. That's going to really be your main navigation. That's going to control this middle area, which for searching search results and lists and the bottom area for the records themselves so if I look at my main menu are this is where I get to my my primary record types like names companies positions so I'm going to have names are going to be the contacts my candidates pretty much any person that I need to track in the system so those are all my people or my names I'm going to have companies are going to be the companies that I'm working with client companies or potential client companies so this is also going to give you a some CRM functionality so you can track other companies you're talking to and your efforts to sign on more clients and then positions obviously the jobs you're looking to fill so those can be entered into here as well cool thing about a PC recruiter is when you enter a job into the system you can utilize our job board tool and that job board tool is going to give you the ability to post jobs directly your website let candidates apply online put themselves right into the database so that's fully part of our system so that's going to give you another another feature feature available so those three records names companies positions they're all interrelated and they're cross-referenced take a look at each of those but to talk of just through some of the other elements in that main menu bar you have a daily schedule you're gonna have a just a calendar meetings phone calls follow-ups what have you that'll sync with a Google Calendar if you wish or Outlook either way so you're gonna be able to schedule your your day in there you're also going to have roll-ups which is essentially lists so you can build different lists in the system you could maybe you do a search and you take that entire search result it saved them to a list you could do it that way you can add people one at a time you can send bulk emails so if you wanted to send a mass email to everyone on the list or you also have the capability if you needed to you could set up a sequence so maybe they get an email then they get a follow-up email if they open that email but if they don't touch it three days they get a different email so you could set up this full sequencing drip campaigns that's all included here that runs off of the roll-up list as well so you're going to be able to group and sort and organize your candidates. You could also use these as marketing lists or a pre-pipeline. So before you start moving people through an interview process you can create a pre-pipeline and use them this way. And then a bunch of different reporting options like the system analytics that's going to give you custom reports showing your metrics and KPIs and stuff like that. Also if you're sending out email campaigns you can look at opens, clicks, unsubscribes, replies, all that same stuff. So all that standard reporting in there as well. So So that primary menu bar again, it's going to be your main navigation. Everything kind of centers around companies, names, positions. I usually like to start with the company. It's going to hold on to the last 50 company records you were looking at or you can search in by name or city or state or whatever. If I go into a company record, that's going to show up in the bottom portion of the screen. I keep my record in three columns, but you might want it in five or one. Again, any fields you want, anywhere you want it to be. If I scroll down, underneath the basic company information, I have kind of two subsets of data under each company record. That's going to be all my positions. So all the jobs I'm looking to fill for this company. So I have a record for every job. If it has a chain link next to it, that means there's a pipeline for that specific job. And I can show you that as well. We're going to take a look at the pipeline a little bit further on in the demo. But then I also have a subset of names. These are all of my contacts or people that I've placed or employees that I know at this company. So you can connect all of the people you know at a company to that company. And that way you're going to be able to see maybe I know Ben Brown is my hiring authority I can go into his record I have a place now where I can put his direct email his direct extension I can have other fields here I'm also going to have a small activity history showing everything I've done emails I've sent to him follow-ups I scheduled with him everything like that so that's going to be very easy to work with in there okay so that's the kind of general look and feel of things any questions so far no I'm good. I'm following around with what you're putting down. I'm liking it. Fantastic, fantastic. So just like when I went to company and I'm looking at all of my companies, if I go to position likewise, last 50 positions I was working with are going to be right there. So that eliminates the need to really look them up, though you can. But I can go into this radio electrical control tech. That's one that I was recently working. Again, a configurable screen. Maybe you have some basic field data, a nice formatted job description. There's even an AI generator in there that will generate a job description for you. if you need it that's going to go into the system and this one incidentally is showing online so I'm going to be able to tell right there it says online in green so that's going to let me know that this position it's in my system it's available it has one opening or more so that means to me that it is posted on my website and then you can kind of take and pick kind of what I wanted to click you can kind of pick what format you want if you want your list your jobs listed in a list format or a table format or anything like that so you're going to be able to kind of work with it that way candidates then click your website they're going to be able to see your job fully formatted description any other fields you want to show and then they can go ahead and apply online that lets them put themselves directly into your database upload a resume and you're able to dictate what information they're required to provide so that's going to allow you to help me build the database very easily there okay as well we're going to have the ability to parse resumes so if you have a resume to parse there's a parser in here it'll create the record off of the contact info it indexes the resume so everything searchable we even have a tool to import records called PC recruiter capture and capture is going to work with all these different versions of LinkedIn also indeed CareerBuilder Facebook zoom info any of these that you can get to that you have a membership to or some of them are free any of these you go to you can like if I'm on LinkedIn I can click a little button and that's going to add that person into my database it's going to create a record it's going to import their photo, their contact info, if you're first degree. Sometimes if you get banned and they don't share it, it won't show that. But that's also going to pull in a searchable copy of their LinkedIn summary too. So that's going to give you a nice easy way of pulling people in. Record I created the other day off of that, if I'm looking at Brian Roland, I got a record created directly off of LinkedIn. I see his photos there. I've got direct access to his LinkedIn page. It got his email because he shared it there. It also got his location. It tagged my username, time, date, source, and under attachments, I'm going to be able to see there's this LinkedIn profile. That's something I can view and search on. So that's really going to- All right, so wait a minute. Let me ask you a question about Ryan, Jim, for a second. It's my understanding, I thought LinkedIn limited you to how many profiles you could download each day. Does this get around it? Does it get me in LinkedIn jail? What's going on? Well, I've never heard of any limit. I don't know. All you're doing is viewing, and then it's a browser extension. So when you go in and you're looking at LinkedIn or Facebook or any of those sites, any record you look at, you're going to be able to go through here and I can look at Albert here. So if I go through and I wanted to pull any of these people in, all I do is go to their record. So as long as you're able to view that person just like this, I don't even know that LinkedIn knows you're using a browser scraper, like an extension like we are, because what it's going to do, it's going to pop a little click to add over on the far right-hand side. So click to add. It's going to pull the information in. You'll see it pulls in his photo, his name, his title. Sometimes contact information shows up if you're a first degree or if they make it public. Sometimes they don't. Many people don't make it public, but you usually get location. Okay, I don't know what that's showing in there, but I can go through there, and I can see maybe I want to add a searchable note, put them on a roll-up list, or link them into a pipeline. I can do that if I want as I hit submit that pulls him in now I've never heard of any problems or limits But every once in a blue moon somebody will say LinkedIn told them that they were caught pulling data out or something like that Because Lincoln doesn't really like these scrapers even though everybody has one, but they're not illegal They're not doing anything wrong So every once in a great while like I've heard it from one person one time this year that somebody got linked in jail just for a day or two or whatever. So that doesn't happen all that often. So it's pretty much something that's gotten around. But it allows you to easily kind of pull records in. That's another way to get records into the system there. Okay. Keep going. Keep flying. Sure. So I'm also going to be able to look at my position. So I'm going to be able to look at all these different. I'm going to go back to my radiological control tech. And if I want to see everyone that I'm considering, I can go to my pipeline. And that pipeline is going to be my own custom interview process. you have up to 18 steps you can put in this pipeline put them in whatever order call them whatever you'd like put whatever colors you want and then it's merely a matter of maybe I had a phone interview with Pam just drag rubber to phone interview nearly a matter of dragging and dropping from one step to the next and that's going to create that searchable trackable reportable event in the database and it's going to move that person through to the next step in your pipeline so anytime you come into the pipeline you see instantly who you have where so maybe you're going to call the follow-up on first interviews today you've got them all right here. You can mass drag people from one step to the next. There's also a nice candidate presentation you can send out of here so that'll kind of create a nice email with a person's resume and maybe some additional attachments and then the recipient they can look at the email, they can give you feedback but they can't print or download any of the information you send so that's a nice way to do that. Could even send a bulk email right from here to everyone in a certain step or maybe everyone in this pipeline so a lot of mass handling and then maybe maybe you looked at Mario and he wasn't qualified for the job I can even move him out of process and I can put in up to ten different categories as to why he was out of process maybe it seems of an auto rejection letter as I move him and they're not qualified it's gonna pull him out of the main categories but it's gonna keep him in this out of process area so you'll be able to see if he happens to come up again you would see on his record he was marked out of process because he wasn't qualified for this specific job so maybe don't consider him for this job again But this is going to be a nice simple way of tracking interviewees. Who is being considered, who is where in the process, and as an added bonus, if I go to, let's say I go to Pam, get right to her name record, I can do so right out of the pipeline. I'm going to be able to see on her name record, I'm going to be able to see an activity. There's the interview or the phone interview I just did. Username, I've got the name of the company, the name of the job, the name of the candidate, what happened, all that detail is automatically recorded. And then a little bit further down here she's also going to have an individual history showing every job she's ever been linked to and how far she got so I'm going to be able to from her name record see everywhere I've ever interviewed her if I happen to have had her before or if she's part of my candidate pool that I work with I can see everywhere she's ever interviewed so nice easy way of tracking people through an interview process you can have more than one pipeline you can actually have as many of them as you wish and when you enter a position one of the questions it'll ask initially is which pipeline do you want to use you pick one then it's going to assign that pipeline to that. Okay. Quick question. How do I send a resume to, let's say that I want to send a resume and a write-up to Mr. Client. Do I copy paste? Do I drop it into Gmail? Like, what does that look like? Well, you could go right to a candidate's record and from the resume, I don't think she has one here, but if I had one, there's an option up here where I could just go email resume and I could send it right from, it's going to come from your Gmail as it comes from my Gmail here because you're emailing out a PC recruiter using your Gmail the resume can be attached it's already attached to the PCR file if you had one you could just send it right out but there's a cooler way of doing it if you wanted to let's say I wanted to go to Terry I want to email it out I could create a presentation that's gonna let me build a custom presentation this looks a little bit nicer because it's gonna let me set up maybe a template with my logo at the top I'm gonna be able to say what I don't want his desired salary I don't want when he's available but I want all the other information about him. Then I can say keep his resume and I also want to do maybe his LinkedIn profile and maybe I actually have a skills checklist that he filled out for me. pick additional attachments off of his record. Here I'm able to say do not allow my recipient to download or print or save what I'm sending him so it allows me to share but not give. I can set the link to expire in a few days. I can even be notified a couple of days before it does expire. I can get an email notification every time he views what I sent or every time he provides feedback. My recipient, my hiring manager. So it's going to look something like this when he clicks on it out of the email that he receives he can look at the resume and if you had any additional attachments those would show here too so he could look at this information he's got all the info then he can just hit feedback and give you feedback can't keep it can't print it can't save it or anything like that and then okay get a notification every time he looks at it or provides that feedback so the Kennedy presentation is designed to do just that it's designed to streamline being able to email out of the system being able to share a a resume with someone. All right. And then I also have keyword searching. Oh, go ahead. No, I was about to ask you about sourcing and sourcing integration, actually. So that was on the tip of my tongue. Thank you. Okay. Yeah. So I can search within my database. Okay. So of course, these are going to be people that I've parsed in, people that have applied online. Maybe I imported a spreadsheet of contacts I got somewhere or was pulling people in from LinkedIn. We also interface with ZoomInfo and HireEZ if you wanted something additional for sourcing. And pin.com, what do they do? Are they a sourcing tool as well? Yeah, they're a sourcing tool. Okay. And you say they integrate with us. I'm not familiar with that, but it happens all the time. Oh, dude, they are sick. Like HireEZ, I'm a big fan of what Stephen and that team have done. This is next level. I'm not familiar with how they integrate with us, but it happens all the time that various companies and products write integrations to us. So it's not uncommon, but I don't hear about it. So you can work with that. And then you're going to be able to keyword search all the data that you bring in. If I want to look for sales and marketing, I can do a search. I'm searching my entire database. Straight away it's going to show me best match up top. even going to show me where all the words were found. So in Terry, he's the best match, his words were found in the resume, the notes, keyword tags, candidate summary, profiles including maybe a LinkedIn profile, and one or more of his attachments. So six different areas of the record, every record are searchable. I could even click on that resume, it's going to show me the resume I have stored in here, it's going to highlight the target every word I searched on. Same with notes, notes is an area where you can type or hand paste or copy and paste searchable information and that's going to be something that will be highlighted as well. Keyword tags, you can tag the individuals out of specific lists that you can build in PCRecruiter. It'll search on those keyword tags. Also candidate summary, that's going to be another highlightable one. We have a candidate summary generator too that will use AI to take and generate a summary using the field information and the resume information for any candidate. You just click that little generator, it'll generate something like this that some searchable data and then profiles there's the LinkedIn profile it found it in there so that's going to access the LinkedIn profile it's an attachment so it doesn't highlight but it is going to show you the words you were looking for are in there or you might build like a custom PC recruiter profile maybe a questionnaire yes what is that it's a web form you can build in PC recruiter you pick the questions you pick the answer types short answer radio button checkbox whatever some people will open it up like this and as they phone screen someone they'll just type the answers check the boxes whatever hit save or you can email this out to the candidate whenever they fill it out as soon as they hit save either way as soon as save is hit it's a searchable attachment connected to that record so that's going to help you collect and store more searchable information on each candidate so those are all searchable and they might look more like a skills checklist they could look more like a phone interview questionnaire whatever so that's another searchable area and then anything you upload is an attachment I've got a bunch of old resumes here archived resumes when I updated his resume it's searching in on those as well so a lot of different searchable areas in addition you can search zip code radius you can search by every field of the system either predefined or custom because if I look at a name record I'm going to be able to put in any fields I wish you'll see I have a number of different fields in my setup here including like check boxes drop downs so I can search on any bit of information in the system I want so we make it very easy to search and kind of pull all the data that you're looking for. And then there's, of course, quick, if you wanted to enrich the data, you can enrich with HireEasy or ZoomInfo right from the name record. You can just hit that. It'll go enrich the information a little bit automatically. So some different things you can do as far as working with your data, keyword searching, and everything. Okay. All right. Got that. So you mentioned HireEasy for an integration. I want to go to a different integration. What do you guys do, like, with an integration with a call recording software and how that makes the records indexable, searchable? I'm thinking about, like, using a meta view. Do you have a relationship with those guys? Is that for BrightHire? Not to my knowledge. Not to my knowledge. The primary integration we have with phone is RingCentral. And that's really just going to be click to dial, click to text. It's going to give you the ability to track incoming calls, outgoing calls, missed calls that you can then build into the reporting in the database because it creates activities in PC Recruiter. So that's going to give you a little bit of integration. There's also one called CallLogic that is more of an automated call system that I believe works with us as well. Okay. All right. Do you have a marketplace that can show me the other partners that we can use for integration? Yeah, it's actually on our website. You can go into it, and I'll just pop into it right now. Okay. I didn't see that beforehand. I apologize. I didn't mean to be sloppy. No worries. You can go here, and you can look at, oh, where is it? Integrations and Partners, Hunter Discover Our Tech. that's going to give you kind of a list of all the different companies integrations we have so they're all going to be listed here of course the ones we know about sometimes there are ones that we don't know about our marketing guy hasn't gotten in yet but these are all the different ones that we'll work with okay why do people stay with pc recruiter because i i don't want to i don't want to choose i don't want to choose something in three months down the road say oh shit i should have gone with somebody else? Really, the biggest reason is because of its flexibility, the customization, the configuration. You can really set it up however you think it should look, and you have the keys to the kingdom to do it. You don't need our assistance to change things up. You're able to do that. Many integrations that we already have, plus you have an open API. You have access to an API, so if you wanted to write your own integration, or sometimes you can work with another product and say, here's the PC Recruiter API. Can you write an integration? It's very easy to do that and also some of the custom things like the the those web forms that we looked at those are pretty unique to PCRecruiter very customizable and flexible the ability to import data from a spreadsheet the interface with the website just the variety of different things that we include in PCRecruiter it's all inclusive so when you have PCRecruiter you get that like the premium plus package you've got it all we don't nickel and dime you anything like that we also oh okay got it got it we include the training as well so training is included up front so if you were looking to go with like the PC recruiter you'd be looking at like 115 per user per month and 750 set up the 750 setups at one time that includes 10 hours of training it also includes help hooking it into your Gmail your Google suite your website we can work with your web people to hook it in there and training on the system and that's good for six months. So if you do add somebody in the next six months, still have a little training left over, you can utilize it that way. And then we have phone support, online support, there's an LMS, there's a help desk, there's text chat support on our website. So we have a lot of different avenues that you can access support from within the system. Okay, got it, got it. One issue that I have is when I'm weighing decisions, I get a great demo, and then when I want to go in and start clicking around, either it's, no, you can't do this, or we don't do demo environments or test environment. Would you let me take this out for a spin for two weeks just to see how I feel if I feel that it works with my workflow. Yeah. I'll give you the link to this database if you'd like. Would that be okay? I demo in this database, so I'm in it. It's a demo database. That's much fun. That way I can practice uploading a resume and kind of seeing what that looks like. Yeah. I can email you the credentials to my demo database. It's fully functioned. It's got everything in it. Do whatever you want. Click through it. Just don't put anything private in there and click through it for a couple weeks. Take a look. If you have questions or you're running into anything, you can give me a call. Let me know and we can run through and look at anything maybe you stumble upon or if you have any difficulties or anything like that. I'm happy to just touch over my demo down the base link. Okay, awesome. I know you've got a hard stop. I don't want to keep you. It's 1.56. Why don't we do this? I've got a pretty weird week next week with Jewish High Holy Days on Monday and Tuesday. What if we came back and had a conversation? I don't want to push this out. I want to be able to make a decision and do the implementation and things of that nature if I decide to go with you or have additional questions. Can you send me a link to your calendar and see if it makes sense for us to talk on Friday the 29th? Wait, that's the 27th. Monday the 29th? Oh, Friday the 29th. Monday the 29th would be ideal. Monday the 29th would be ideal. That would be ideal. Perfect. Let's book it. Let's do Monday the 29th. How about I give you a call about the same time, 1.30 Eastern? Would that work? Great. I'll send an invite. Excellent. Perfect. I will email you then my link to my database. take a look at that and we'll speak the 29th at 1 30 i'll get an invite out for you later today we can reconnect then awesome let's talk fantastic well brian thanks for the time today thanks for the time and attention i'm glad we were able to get your fit in and i'll get that email out to you shortly jim have a great afternoon i appreciate you you as well sir you take care bye all right bye",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2067.950541,
    "salad_processing_time": 209.88700890541077,
    "overall_processing_time": 2067.950541,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting.  Enter your participant ID followed by pound.",
    "job_id": "1ee1efb4-569b-4c2a-8afd-ca1bd44fcc01",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 4
      }
    ],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3089541002036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}