{
  "recording_id": "3090127165036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:20:13.219982Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:20:13",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " How's it going? Hi. Hi. How are you? Ooh, another fun day. Aw. But this one, this one is really messed up. This grasslands thing. So I don't know why they set it up this way. I don't know what the deal was. But they're supposed to be paying $75 a month. for their users or whatever, which, fine, that's whatever. But I don't know why the invoice says $90-whatever Canadian dollars. I'm wondering when they charge their card, because I feel like we've asked Kathy about this. You don't do it for anybody else. And I could have sworn there was an email chain. I don't know if it was about them. I assume it's them. If your card charges you 90.85 or what the currency rate is, that's just the cost of doing business in another country. You're paying off 75. We're not giving money back to you to make the difference. I don't know why it's done like this. Here's the thing that doesn't make sense. We're charging them in US dollars, right? That makes sense. My guess is when they use their card, they get charged Canadian dollars. Yeah, for sure. Just like if I use my card in Canada, it's going to charge me whatever the current exchange rate is, blah, blah, blah, blah, blah. Apparently, they're wanting reimbursed for that. They didn't say anything about that, but what we are doing and what we did with the most recent invoice was we are charging them 90.85 as the rate and not $75. So they're paying like $15 more a user, unless somehow there's some magic that happens that I don't see. But I don't think that's true because this one has discount currency exchange. I think they were going in every year manually and discounting that off. I guess whatever, based on whatever the rate is. whatever the rate was at the time. But that doesn't make sense. You're already going to do that when you pay for it. I'm going to forward you. I'm trying to find some. I gave in cast uh Jim Labrado wrote no Jim Labrado wrote did anything ever happen this one I truly have no idea what a current current exchange discount is or what never heard of that The only thing I can confirm is that there are six users. There are only six logging in because we're trying to get them to pay. Like, everything about it is right. It's just that there's no reason for us to put – like, I think they used to do deals where you would pay in the currency of, like – like, you would pay in whatever currency for the other, like, place. Like, if you were in Canada, we would sell it to you, but we do it in Canadian dollars. My guess is they just complained about it. Because they were also just questioning, like, well, what is the recurrent rate? Like, I don't know. I've never even saw that. I think they got an invoice and they were wanting to know what the current rate was. And that's where it was like, I don't know. I've never even noticed that another invoice. But they, if they're at, so... so is it changed now wait let me see what's in there now because maybe it's been wrong the last two years because if it was actually at 75 dollars 75 times six is per what where were they uh this is the wrong invoice where's the right one Because there's a recurring in there too. Yeah. So it's just, I think it's, okay, so they have, let me do this. This is a little weird. There we go. Okay. So for six users, if it was $75 times six, that's $4.50 per month. but our rate is 545.10. Oh, did they actually put the discount? Oh, maybe this is the most recent one. Oh, okay. Currency exchange discount. Let me say something. Calculator. Okay, I'm in the recurring. The recurring is set up. Okay, so it's 545 per month. That is 545 divided by the six users. Okay. That's the 9085, the 545. So we're billing that at the Canadian rate. but then we must be discounting I guess we discounted what the currency exchange was. Yeah, so probably the difference of the 75 to the 90.85. Then they're not getting any annual discount, which makes no sense. Something is wrong with it. Yeah, I don't know. Maybe they just weren't offered an annual because they were already getting this currency thing. Maybe they were like trying to get both and they were probably like, screw that. But also, the currency thing doesn't make sense. because what is it? 90, 85. Yeah, so no, they're actually paying 66 a user because that's what 90, 85 would be. But I have no idea what they're they were doing. 75 times 6 is 450. times 12, that's 4,500, and that's over 5,400. I would think you'd want to do this completely different. Yeah, I don't understand why we're doing it like this. And also, that's wrong. 90, 85 is not, like... I don't know. Like, that number is never going to be right. Like, if our rate is $75, we should be putting that... Like in our terms. And then whenever they get paid, whatever they have to pay on their side, it is what it is. But that's the thing. It still is the same amount. They paid $5,400. And if you did 75 times 12, that is $5,400. You'd have to do, let's see, calculator. Okay, you would have to do 90, let's say the going rate is 90.85. Minus 75 is 15.85 per user difference. So times 6 users times 12 would be 11.41.20. What I think needs to happen is this discount, the currency exchange, that needs to be clear of what it is. So that way, whoever's looking at this invoice, we know we're billing them at 9085 Canadian, but we're taking off because of the difference. But 9085 Canadian is not 75 US dollars. It's like $66. dollars. So we're still building that. The rate is obviously wrong then. We're building them in US dollars. We're just manually doing this. We're manually inflating it to then discount it for a currency exchange that doesn't exist. That doesn't exist. We're not out any money, but this is stupid. Actually, we are out money then. Because if it's 90-85, is the equivalent of 75? No. If it's not, if it's equivalent to 67, then we are losing money, right? No, because if you do 75 times 6 times 12, 5,400 is the right amount. And that's how much they should be paying. So all that we did was go in there and put in the amount for the Canadian dollars, figure out how much they should owe for the year and discounted it, the difference. That's all that was done here. It's just silly. Which makes no sense at all. I say we're like, this is, you know, our thing is like if you're paying up front for the year for that many users, we don't go up and down on an annual. If you want to do that next time around, go monthly. Yeah. I mean, they haven't said anything about it. So I'm not super worried about like that portion of it. but this is like these invoices are messed up and it's like what should i have never seen any other canadian customer like this i'm sure you haven't either i mean you go in there sometimes too i mean we've got yeah no i haven't no i haven't seen anyone else like this either here is okay here Here is an example where it was a lot less. But this doesn't make sense. So they paid. They paid. So they should have paid if they're upset. So the one from last year, one from 2024. They're at 75 a user. We multiply that. 5 times 7 times 12. That should be 6,300. I feel like Kathy ended up handling this one because I was like, I don't know, we don't do this. I think she did. No, I think she did end up handling it because 95 times 7 times 12 So So were they just, there's no way that was right though because, okay, 7631, 40, oh, that's what it was. They were, oh, oh. they were getting billed in Canadian so whatever understand when I don't know when they did that conversion rate but whenever they signed 75 US dollars must have equaled that because it doesn't anymore because last year when they or Or no, is this 2024 or 2023? In 2024, they paid $56.92 for the year, which was, which I just put in the like conversion, whatever. And it's pretty close. So it probably just last year was whatever. But it probably was just a little bit different last year. So I got an email. I'm going through my emails on Friday, May 2nd. Good day, Peace Recruiter. Happy to renew again for 2025. Question, how has the courtesy exchange discount been calculated over the years? appears in 2024 was at a higher rate than 2025. And then which one am I on? And I was like forwarding it because I was like, I don't know. I've never seen one be like this. Okay. I did confirm that last year has been for just seven years, but now that there at six will be a difference in pricing. I've not noticed any other invoices set up this way, so I need to learn more about this and get back to her. Kathy, any ideas to help me explain? And then that was the one. Who asked about it? Was it the user or was it Kathy? Blair. Blair. And I can't find my other emails now. I might have deleted them. What did I say? Something Blair. Something Blair. This is pretty clearly I think it's pretty So do we even need to be doing that? Why are we billing higher and then lowering? Shouldn't we just bill at our rate? If you look at 2024 they did pay a different amount because they should have paid like six something and instead they only paid 56 because they were growing off of whatever the exchange rate was at that time, but against us, not for us, which is stupid. Now, Kathy did it. I didn't say anything about it. Kathy did it as if it was U.S. dollars. I don't know. We should probably just have them fucking re-sign, but that's annoying. I mean couldn't I don't really know much about this but doesn't that rate like can't that fluctuate at any time yes it can fluctuate anytime yeah so why your discount in there makes no sense because or whatever I mean we should just be billing us just like we do with what recruiting emotion is the in the u.s I mean is in Canada how it works for everyone like yeah whatever i don't know why we're doing that if you decide you want to make a card and your bank charges you more well then great you're paying on your credit card anyway so who cares yeah i mean unless it was just a mistake at one point where we build in canadian and then they wanted that back and we really should have been billing in u.s i think that's right um this was like a bell sales tactic or something at one point um yeah i'm pretty sure that that's what which is fun when we have to figure it out i think that's right you know and it's not in the contract it's not nothing that we can refer to nope oh sorry yeah because then this one let's see what nonsense they were doing in 2023 I bet it's the same. I wonder if we have to go back even further. Because if they were doing, like, recurring templates, who knows if they even noticed it and just kind of did it once, left it. I don't know. They've been doing it. It looks like they've been doing it. It's a different amount every single year. And it's always been like that. Okay. So, I don't know. I don't. I mean, this isn't going to be a thing until February anyway. Yeah. Or May or whatever. I say move on for now. No. I don't know. I think we should fix the fucking invoice or the recurring stuff. Because they paid it this year. Because this year, they paid our amount and not their amount. And they did not notice. And like you said, it's also not in the contract. It says $75. I could have sworn somebody said it's just the price of doing business. If you get an exchange rate, we don't reimburse that. Right. That's not how it works. just like if I went into if I cross the border and go to Canada and buy a pack of gum yeah and I give them my credit card guess what it's going to charge me whatever the exchange rate was that's how it works yeah then I'm just gonna I'm telling you some of these like oh yeah that's a unique one and it's like okay then document it somewhere i don't know like everybody should know i know i used to ask pasty like what's this oh yeah chinos are always a little off well no chinos can't be a little off because they're driving me crazy well then stop doing that like stop the like it's a little off thing that's not yeah that's like what i did is what we do in accounting yeah there was there was one of them I can't remember who it is off the top of my head they would generate three invoices and then go and avoid them and then generate one because they wanted quarterly but they needed to have the dates okay I'm like what so obviously with the new billing system that had been terrible because it would have processed one two three right for each month and then process accordingly it was for the same time frame so what I did is I'm like I'm not doing that They can figure out the year, but what I did is I went in and made four annual invoices. One is first quarter, one is second, one is third, one is fourth. In that invoice, it'll say January, February, March, or April, May, June, and they'll just have to figure out the year. If you're not intelligent to figure out the year by the invoice date, then maybe you just are not very smart. yeah like you'll you'll figure that out right no i agree i also think with this with the way that we have this yearly thing um and whatever i'll bring it up but i think we should do like if they're going to pay annually we need to confirm that they cannot remove like be adding and removing users like crazy um and so i think we should do like up to six users like you paid this much for the year you get up to six users if you have less users I don't care about that. That's a good way to do it. But if you pay more, or if you get more, then you tell us, and we can add on, like, a monthly whatever at your discounted rate. Oh, right. Oh, wait. Here's the one I did. La Vitrosa de Costa Rica. It's technically, if they paid $75 for 12, oh wait, what was that, 75 times, let's just 56 times 12. That's $5,400. And then we'll do a 10% discount. We should have only paid $4,860. And they would be getting a much better discount than doing this currency stupidity. Yeah. So I just sent you a screenshot of what I did. Don't pay any attention to the previous next date because I kind of did one, then made a template out of it. And like, you know, that part's right. Wait, did they need separate invoices for this or no? They need a quarterly invoice that lists the months, which is what their problem was. Oh, so they, but are they paying annually? No. They pay quarterly, but they need to have each month listed. So each, every year, you know, I'll get one that has first quarter dates. That makes sense. Yeah, that makes sense. Now that's very easy. Here, like I have it listed. But they're late anyway, so. But like each one will look something like this. Like this is just so much smarter to do. Like just do four quarterly ones. And then in each one, I do October, November, December. If you can't figure out the year, then they'll figure out the year based on the invoice date. Which, whatever. They'll be fine. I would assume it was fine. I would assume they didn't say anything. Well, they didn't pay the last one, so. Mm-hmm. The last one went in April. No, no. They had April. Then they had July. first. Yeah, but what they were doing is they were generating three, voiding them, and then replacing them. Or they would, like, let a couple generate, like, as, like, reminders. It's like, what? That's good. Yeah. No, not doing that. Not doing that. Yeah. I don't know. I kind of think we should, I want to fix this recurring because it doesn't make sense. And the discount thing is wrong. If it's automatically, if it's on auto pay and this is going to happen every single year, then we're not going to remember every year to go in and discount it for them. So they're going to continue to pay whatever that is, which is still going to be the same amount in US dollars, but it might be different in theirs. so like it's not gonna the exchange rate's not gonna be the same next year when this gets generated right yeah there i had a question like what is this you know what's three and i'm like never even seen one of these like i was stumped because nobody else has built like that yeah I don't know. I guess I'll ask Bill about it. I kind of want to just fix it, but I need to read over the, I need to just make sure that there's not a thing in the contract I don't see it. I didn't see anything. They had like a supplement thing that was more about like transmission and stuff. I didn't look at... I kind of peeked in there at the beginning of a collar. I didn't see anything. I didn't see anything like that. I mean, everything's listed as in U.S. dollars. So... Hmm. Yeah, I don't see anything in here. Whatever. I'm glad Mackenzie seems a little bit better today. I was a little worried the other day. You're glad what? I'm glad Mackenzie seems a little bit better today. Yeah, I talked to her yesterday. I'll be honest, if that was, what, four months ago? I don't know if anybody would put up with that. I was just shocked. Yeah, I mean, it was... It was a little too obvious. I don't know. I just would never... No, I wouldn't either. Never. Like, something to be quiet or something, but that was just, like... I don't know. It was very awkward. we'll just say i mean i don't necessarily not you i don't necessarily disagree with him do you think that the thing was dumb but that's up to me to decide if we have a meeting about nothing or not but that like came in with it you didn't really know what was being talked about He came in like that, and late. Yeah. He just told me he wasn't feeling well, and that he didn't want to come in. He was upset he was late to the meeting, and he had some personal stuff going on, too, that was separate from that. Wow. He didn't want to lose anybody else. No, I don't think he's going anywhere. I think he's good. Okay. I think it had more to do with, I don't know. It's also, he also doesn't, it's like, I'm not doing a good job. And it was like, I mean, everybody right now is doing the job that they can. I was like, you're in a new role. I think he's doing good. He comes in there pretty well. Sean was already overworked in that role before. And Sean had been doing it for 15 or whatever years. like right that's a long ass time to be doing something um so i actually put in a ticket that morning of our meeting it was friday morning i forget whose it was and i said oh you know let me know or something i said you're doing a great task i'm very impressed how he's jumped in yeah he um i think he's been doing fine that's what i told him i was like um I was like a little positive reinforcement maybe I don't know I think he I haven't determined whatever at first I was just trying to help him with stuff but I don't know exactly what he needs because oh here it is pricing overview I don't want to see this Oh, wait. Oh, is this what we gave them? So, Oh, please. Pricing is so stupid. This cost $500 for setting up Portal. Hmm? This is saying it costs $500 to set up portal. What? Where? On this pricing thing. Makes no sense at all. Oh, that. Now this looks wild. It's such a weird... Your agreements used to be so weird. This is the other, like, everything. It's like the order of meetings. Like, you know, make it clear. This is... Unless it's unintentionally. But I looked in all of this stuff. nowhere does it say that this stuff is going to be in um so I don't know I think probably what would be a good idea is for us to just reach out to them closer to whatever and try to get them to re-sign and be like hey give you a whatever I'm like they can get the general discount if they want it. That's fine. They can have it Or get more money, but yeah I don't even know. They don't even have anything do they? Aren't they like Who knows who knows what kind of description they have Yeah, this one's messed up. I'm just going to tell the user to tell them it's processed. And we'll go from there. Are they looking to lower it or is it already? They just wanted to remove the user and then it took me down this rabbit hole. Oh, yeah, they're not going to. I mean, they paid up front. So I would just say you're paid up front for up to six users and just keep it simple. And just say we only need to really be alerted if you go above that count. Right? Maybe? Keep it simple that way? Yeah. Yeah. Yeah, I kind of like that wording. You're paid, you know, up front for up to six users. Oh, my ankle hurts. I apparently can't go walking anywhere, so I'm going to have to be homebound for the next month or so until I find somewhere fun to go again. Why? Because in New York, it was my knee. Oh. Oh, my knee was bad in New York. And then I was fine actually in Columbus Sunday, like Saturday. Sunday when we went to go to breakfast I noticed my knee was hurting a little bit and my ankle was starting to hurt just a little bit but yesterday and today my ankle hurts a lot more it's like it's like a shoulder strain I don't know I'm just old it sucks Nick can I be young like you I am so jealous of Jason going to that concert. That would be awesome. I used to tell my mom, back when I was single, my dream date, I always wanted to go do this. I thought it would be cool. I always heard Toronto was kind of cool. They used to have a long running Phantom of the Opera. I have no idea why. I just thought that would be a really cool date, Phantom of the Opera. Maybe I watched Pretty Woman way too many times, and I wanted a handsome man to take me to the opera. But I would have liked Lady Gaga way more than an opera. Yeah, I'm sure that was a really good concert. I presume she's great live. Oh, I found it. They asked us last year, May, if we could bill them in Canadian dollars. They said, the invoice seems to start with Canadian dollars, then converted into US dollars. Is it possible to get the invoice in Canadian dollars instead? We're paying with a CAD credit card, so that would save us the exchange fees, the card charges. If not, no worries. Just thought it can't hurt to ask. As you said, no. Not exactly like that, but she said we can't do that. So I'm, I think we just hit save. dumb to have it the way that it is you know like whatever also if they're paying a currency exchange anyway who cares right so just get a credit card that doesn't charge foreign transaction fees like most credit cards although I don't know maybe Canada's different Yeah, I have no idea what the deal is with that. But that was it. That was the only one I had. So not the only thing. How's Davisha doing going in there? I haven't heard too much from her lately. From who? I talked to her at one point. Davisha. Oh, Davisha? Oh, she's good. She's at work right now. Is she like, there's the invoices. I don't know. What the hell, Nick? What is this? This is pretty easy, so she's not... Yeah. I don't care. She just hops on, does it, and then hops off. I've been trying to bother... I keep trying to bother Bill about getting her something that she can do. There's a ton of garbage cleanup work that can be done in these things, and I keep bothering her about it. It's like, oh, I'll have something for her next week. I'll have something for her next week. And I'm like, if I just give her a project, she'll just work on it and then it'll be done. Here's what I'm wondering. Do we pay all these on-hold collection customers? I started making a roll-up of people that are on-hold collections and it probably needs to be updated since I start. But just like, is their database still, is the database making sure it's active been you know things are deactivated is the recurring deleted if it's beyond you know that end of the contract or or is it i think when i first started just seeing if it's deleted or paused or things like that but i'm almost thinking we should be reaching out finding out whoever the contact is saying you never paid your bill nicely put it we've been incurring costs that have been accruing, we are going to delete your database. If you do not respond within 30 days to get any access to your data, your past balance will be due. You will also pay a data return. Otherwise, it's being trashed below any amount that remained open. Like something like that. And then there's 300 and some databases that were not housing just because people stopped paying. Right. So we're just, they're just like shut off, but they still are active? I would assume. When they go on hold collections, don't they just kind of do like a on hold type of thing? That's 300 some databases we could like free up on our servers, maybe make things run faster. I don't know the technical part of that, but maybe that's something like Coverstone. I don't know what any of that stuff is. But maybe that's worth a mating. and then on top of it, maybe after we do that, then we have a client status being more like a different status that we basically gave up on them and deleted their database. Do you know what I mean? Yeah. First of all, I don't even like the word on-hold collections or collections because it's not like we're sending it to a collections agency. it's more like overdue invoices yeah suspended for non-payment i was gonna say what it should just be it's suspended like and then collections i don't know we that whatever i don't like collections either but it should just be suspended for like instead of like the on hold collections thing doesn't make sense to me because you have on hold and on hold is twenty dollars a month or whatever so if that's twenty dollars a month then what is like well i guess the database is on hold because they're in collections or and just on hold is per customer request is basically the difference on hold is when the customer asks on hold collections is when we shut them off because oh yeah no no i know that but like if i didn't know that it's not like it's clear based on whatever I mean at least Drew got that thingy where mine turned like different colors we should have like we should have something like a suspended and deleted or you know what I mean meaning we deleted your database and they come oh I want to come back hey you didn't pay us for so long and you know like if it's more than a year that they've been on hold or haven't paid we just delete their data if they were on hold collections. If not cancellation, then that's another thing we probably should go through too. Cancelation? Yeah, if you canceled, anybody that canceled more than a year, just take the data off the servers. Yeah, no, I know that we don't need to leave it on there for forever. I don't know. Sean must have known how to do something with it. I think they are came off. somewhere, but why are we paying anything to house them or, you know? You're not a company. You're not paying us. Right. I do think we have to leave it for a couple years. I think there's something about that, but I don't remember what it is. So. I mean, sometimes they come back, but if they leave for more than a year and then come back, I mean, that's kind of odd anyway. If you thought you were going to recruit again or come back, you would either have gotten a data return and went somewhere else and then you're going to convert it back or, I don't know. But I'm sure there's people that were there in their years that are like that. I just thought it might be cool a decent way to maybe get some traction on possibly getting payment or some kind of response or just truly get rid of it because I think it seems like Kathy has been going through and doing more of like a like basically a account receivable clear or something like that and Are you still there? Yeah, I'm still here. Oh, sorry. Drew was asking me a question. Oh. I don't understand what he... So I think she's been doing a lot with this. Like, people have been invoiced, like, for a very, very long time. I think she's just kind of doing write-offs on them. Yeah. And making it kind of inactive. I mean, that's what we're supposed to be doing. I don't know why. I agree. I could just... Write-off or whatever is more cost-effective. I don't know what the difference is. But, like... Well, because I remember Gretchen saying, no, we have to do that because if they ever come back, they owe us the money. It's like, okay, come on, you know. You know they're not paying that. You're going to make a deal with them. You're going to do something. Yeah, you're just going to tell them, oh, no, it's fine, and then they're going to come back for no money. Lombardo just did that with somebody. And even when you do work with those people, they don't end up, like, doing anything with it. Like, did we ever... Whatever happened with, um... whatever her name is, the one that kept bothering you that was like needed her stuff back on, but her mom was in the hospital and then her mom died and then her mom fell. Yeah, exactly. Yeah, we cut them off. We shut them off. And now we haven't heard anything. I'm so surprised. I need it back on. And you told me that I offered you this if you pay at that time and then you didn't pay. Yeah. Like, you're right. I did offer that at one point. And now we're at 13. This is the second suspension that I've done. Well, and that's why I told you. I was like, I'm willing to let them to honor that if they sign that payment plan and follow it. And if they deviate from it, their database gets shut off and those charges go right back on the account. Yeah. I'm not taking it. I mean. you know bill like oh let's try to get you know get the 250 or the 300 no it's like 1500 right now it's 13 invoices and then she's asking for late fees to be removed no no we're not doing that i offered to do it one i did it then okay if you go and pay i'll take them off go and pay now it was like when it was kind of like newer getting the late fees you didn't pay it right and they're growing so you know but you know i'm flabbergasted i'm flabbergasted that you think you can go 13 months without paying and still have service that's what flabbergasted me if you want to use that word right i'm like i don't get it what what good does it do to shut off my service well you're like well I don't have to keep chasing you down for payments I just take it as a loss and move on or I'm just not you know being a charity and having walked over every customer just thinks they can just pay whenever they feel like oh Robin I'm so sorry I'm working I'm working on it I'm working on it like I'm sure you are yeah no I'm just like you know even bills worth like $100 a month or something. Well, I'm working on it. If you can't pay $100 business expense, what kind of business do you really run in there? I've got more than that in my checking account. Like that stupid Paula Manning. She's so freaking annoying. I shouldn't say stupid, but the annoying Paula Manning. Yeah, she's frustrating. So frustrating. She would drive my keys crazy doing a conversion. And I was doing training. She burned through so many hours because she would ramble about nonsense that had nothing to do with PC Recruiter. It would be about how her offshore people or people that she's hiring, what they're going to do. Like, that has nothing to do with what we're doing. And, you know, can we just stay on track? Yeah, like, let me take, you know, a whole hour to show you how to add a name because you kept talking about these other people. I don't really care about the other people and what they're going to do for you. like it was just like completely off she would just take the conversation off the rails i think i sent you a screenshot like what what does my invoice have to do with your tax day it has nothing to do with it your four invoices over and she got another one like oh i can't believe you know you're you know do i need to talk to bill or was it was it her that did that do i need to talk to bill I've been a long time customer you're a bit of pain in the ass with not paying your bills that's what you've been yeah a long time customer that doesn't pay so guess what well Triad's not paying and I'm trying to I'm taking care of this personally so that I can keep it going wait what happened what did they say she said in one of her things that Triad's not paying the invoices anymore she's doing it to keep it going yikes that's not good Well, I don't know. I thought she was triad. It's like two users. I mean, I don't know. Isn't it like her own private thing? Oh, wait. Is this who I... It's Paula Manning. Oh, I might be the answer. Oh, I think it's somebody else. Okay, okay. But I do... I didn't know she was mine. And also, yeah, you're only one user. So like, pay your invoice. Pay your invoice. Step four now. I sometimes wish I had like I wanted them to do like a billing email like with an actual email because I wanted to do it like incognito where it would all be separate like just like just go into email like I just log into that account I don't have to be showing my name in there I mean you can have an email alias that's the thing but it wouldn't go to i wanted billing at main sequence.net and i apparently when i asked for that i thought that's what we were getting but apparently they already had it like used for something before which nobody told me otherwise they asked for something else but yeah i wanted to be like an own account like you know what i mean like log into you know just go to gmail sign in with that thing and it'd be all the billing stuff in one place well i do think that that's a thing, but I think that that's an option for... Yeah, I have two. I have the feedback at mean sequence. Yeah, you just sign into that account. I'm going to go to the door outside. Oh, okay. All right. Have a good night. Yeah, you too. Bye, Robin. Okay. Thanks. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2088.496986,
    "salad_processing_time": 152.95881724357605,
    "overall_processing_time": 2088.496986,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " How's it going? Hi.  Hi.  How are you? Ooh, another fun day.",
    "job_id": "603832e3-1689-431a-92f1-36a41024cbe4",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " How's it going? Hi.  Hi.  How are you? Ooh, another fun day.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": false
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical",
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3090127165036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}