{
  "recording_id": "3091573233037",
  "version": "2.0",
  "timestamp": "2025-09-21T23:21:47.241334Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:21:47",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thank you for calling Main Sequence Technology. This is Garrett. How may I help you? Garrett, how are you doing? This is Nick. Yeah, man, I just wanted to call in. Pretty urgent project. I was emailing Robin, and I was even on the phone with Brian Kane, and Brian told me to reach out to you specifically. Okay. But our team is just really looking to unlock more of PCR. And it would probably take us maybe like an hour or so on a call, if not two hours, but looking to just get a full understanding of our PCR and really just try to unlock what we're trying to do. If I can quickly explain to you, we're trying to do a couple of things. Currently, our team is only using PCR for email marketing, right? Okay. I'm pretty sure, like, you've helped me and other people at PCR have helped me on the phone a couple times to get things going with analytics, email marketing. That's what our team's currently using. I don't think we're using, like, we're probably using 5% of PCR right now. We're looking, because our team's growing. It's no longer, like, a little staffing agency of three guys. like we're about to have um i think eight people in total running actively on pcr starting on monday and i'm trying to basically use it as like a crm tool like for our game like a full-blown crm tool and i have like the map of what we want it to look like if i can quickly explain to you we're trying to have it be to where like the first thing that you see when you log in is the overall team's metrics. The second thing that you see is everybody's individual profiles. The third thing that we see is their individual performance, which would be like individual metrics. The fourth thing that we see is under one of the metrics, you actually see like key metrics like calls, links and in-mails, bulks. And then the fifth thing that we see is things like clients, pipelines, hot jobs, which you guys would probably call positions, candidates, and then the very last thing that we are able to see is like templates. So if that makes sense, we're trying to use PCR as like a full-blown CRM tool. Does that make sense? Yeah. So those options are all throughout like the main menu of PCR. The customization on what you see when you first open the page isn't really that advanced where you can, you know, see certain things and not see other things. But you can navigate to each one of those pieces just in the main menu, like your profile, I mean, your pipelines. And you can see where candidates are in the hiring process. You can see your clients under the companies. And then there's an analytics area to see your metrics for each user, even KPIs. So all those pieces do exist. And you can get to all of them from the main menu, it sounds like. Gotcha. And one of my concerns is I think that when I uploaded pretty much every client into the database, I'm pretty sure I did a name upload and not a company upload. That's one of my biggest concerns. It's okay that it doesn't look exactly like I explained it. I was even, because I'm the COO here, the CEO, gave me the vision. I was trying to explain to him that, you know, hey, I don't think it's going to look exactly like that, but I'm pretty sure we can get it. It just won't look exactly like that. And so we're willing to pay, though, Garrett, for a couple hours if you have time today. You could send me an invoice if you want to send me an invoice. but I'm really trying to get this project at least started today. Do you have any availability at all today to get this project started? Not today. I'm actually off the clock in about five minutes, but we can schedule a time in the future for a training if you need training hours. I've got availability tomorrow and the next day, as well as a lot of availability next week. Gotcha. What availability do you have? Let's just say tomorrow. Tomorrow I have 10 a.m. Eastern, 11.30 a.m. Eastern and those same slots are available on Friday the 19th. Gotcha. Why don't we just book tomorrow out like both of those slots for tomorrow? If we can, I mean, is that a 10 to 11 or Yeah, it would be like an hour's fun. yeah i would say i need about two hours like roughly two hours okay um would it be possible to maybe break those up instead of just doing a two-hour marathon uh training i think it might be um a lot to to cover in terms of trying to do two hours at once we usually just do hour blocks of training yeah i mean we could cover two um whatever you think like works best um and then If we don't get it all done tomorrow, we'd probably have to just go into Friday. Okay. But, yeah, whatever works best, so just let me know. So, yeah. That sounds good. Yeah, let's do the 10 a.m. Eastern tomorrow. I will have billing send over the invoice, and then I'll get you an invite sent out. And then whatever we don't cover, we can just schedule there next time for maybe Friday for an additional hour. Do you want to for sure have the invoice charge you for two hours or do you want to just start by getting charged for the one hour? Sorry, I'm just looking at my schedule. So what would the time slot be again? 10 a.m. to 11 a.m., correct? Yeah. Yeah. For tomorrow. Yep. or we could do 1130 to 1230 that's last available as well 10 to 11 works tomorrow um okay i'm just trying to think i'm trying to think of like because really i'm just i'm trying to get this project done today so is there anybody else on the team that has availability today by chance who would be able to do something like this i could check real quick usually um And our support team kind of wraps up around 5 p.m. Eastern, and that's coming up soon here. So I don't think we'd be able to get anything on the books today. But, yeah, tomorrow. I looked at my schedule for tomorrow, and 11, 10 to, like, 1 o'clock I'm pretty much booked tomorrow. so that's why I'm thinking like if we like honestly like a I just want to see like a 9 to 11 tomorrow would literally be perfect if you were able to do an hour before I'm not sure if you have any availability an hour before that no yeah I'm booked up in the 9 a.m. to 10 a.m. range I already got a meeting there so yeah 10 a.m. is my earliest but there might be other people on the team who do have earlier tomorrow I could check for that if that would work better Do you know if Robin has any availability by chance? Let me see if I can pull up her calendar. So she has a meeting tomorrow morning at 930. That's only a half hour meeting. I'm not sure. She might be able to do something either before that is like a shorter, like half hour and then nine. Yeah. Nine to nine thirty. But besides that, she does have the same 10 a.m. slot open that I do. So, yeah, I'm not sure I could I could talk to her and see what what she thinks. and maybe get back to you on her availability for sure, set in stone? Yeah, I mean, it might even be helpful to have you guys both on the call if she's got availability tomorrow. It's just such a quick turnaround that we're trying to get here, and I want to make sure that I'm able to do all the pieces like myself. So as much availability as you guys have before the end of day Thursday, the only slot that I'm not available is literally 11, 10 to 12 o'clock. So I'm available any, anytime besides 11 to 12 tomorrow. But if you, I mean, it's probably, I talked to Brian about the project and he was like, honestly, he was like, you should probably get four hours. And that's why I don't. Yeah. That's, that's why I'm like, if, if, if, if it needs to be, cause how much, how much availability do you have? How much does Robin have tomorrow? So I'm booked up all afternoon, and I do have the 9 a.m. to 10 a.m. slot already booked for morning. So, yeah, my only slots are 10 a.m. to 11, and then 11.30 till 12.30. I have available slots, but Robin looks like she does have a few more slots than I do, especially in the afternoon, based on just what I'm seeing on her. I think what we should do is maybe you can help me start the project, Garrett, and then Robin can help me finish it. I would say let's literally put this on the calendar. So you and I tomorrow 10 to 11, and then Robin pretty much the afternoon. So whatever she has in the afternoon, I will gladly take. Okay, yeah, I could run that by her. And once again, you just want to see things like metrics and your pipelines and things like that. I mean, I could give you what I'll do is I'll just email you a link to a video about analytics so that you can maybe start messing around with it today. And you can actually see what it's capable of, what it looks like, so that we're kind of on the same page on what you're able to accomplish with the analytics and KPIs. if that would be helpful I could send you that video today and then I'll get the please do and I like I said it's it's a lot of metrics it's metrics heavy it's like custom metrics so it's stuff that I would have to like basically input for the operations manager would have to input you know daily and then I'm trying to see what else it's just pipeline positions candidates clients that stuff's very basic i think the one thing that seems like it's going to be a big task is metrics and then the second one is um looking at our looking at our companies because i don't know like is it possible to switch people from name to company within your roll-up that's already uploaded um there's yeah there's not really something that would transfer them over, you would have to re-import them as a name at that point from your initial CSV. Yeah, just doing it as separate import. Got it. As a separate import, okay. So in other words, we'd have to basically wipe out the entire system and then redo it. Yeah, possibly. So which one was it you created name records when you meant to create company records or was it the opposite? Yeah, we created name records and we meant to create company records. Oh, I see. Okay. Yeah, it might be best to clear those out and then just re-upload that CSV file as a name import. And then the names... I'm looking at it right now and the companies don't look too bad. It looks like it captured the companies. I don't know if it captured all of them though. like this is like florida we have 200 companies 527 names california we have 388 companies 778 names so like for a lot of these it looks like it captured the companies there's only like one list that that looks kind of weird and that is literally the texas list like the texas list looks like it's only eight companies which can't be true Oh, um, yeah. Yeah. Yeah. I was like, do you have like five minutes to look at this year? Cause I can, I can probably just pulled it up. Gotcha. Um, yeah, I just pulled up your, your roll ups. Are you talking about Texas roll up 2025? That's the only one that looks weird to me. Like that one. No, I don't understand. It's going to have, yeah. Uh, if you already have a company in your database, um, and you go to import, people again, it's not going to create the company again. So that number eight only represents eight companies that didn't exist in your database before the update. There might have been, you know, 400 companies on that CSV file, but only eight of them didn't exist before. So your roll-up is going to show you after an import, it's going to show you companies that didn't exist, if that makes sense. So you got 294 names added. So if you go to the names, like if under company name, when I drill into it, right, I'm under the Texas list. Under company names, there's like all these companies, right? Are these companies already created? Like are these companies created? Yeah, they're already created. Those are actual company records in your database. They probably were brought in on previous imports. The only ones that didn't exist before and were created during the import of the Texas roll-up list were those eight. Those are brand-new companies that didn't exist before. That's what that symbolizes. For the other roll-ups, it's almost like every company never existed before. Exactly. Yep. And so I don't think you'll need to wipe anything clean and do more imports. It looks like you got it all in there correctly based on a couple of roll-ups I'm opening up here. Okay. So just give me a moment here. It got every company in there correctly. So no need to worry about that. That was like my biggest concern because that was going to take me forever to do that. I got every company in there correctly. So that means at this point, Garrett, like, I don't know, we might be able to knock everything out in our meeting tomorrow. I would say if I can get one more hour with like Robin in the afternoon and then maybe that 12 o'clock at 1230. Oh, no, let's not do that. I don't think that's a good idea. Let's just do 10 to 11 tomorrow. and then if Robin or Nick, I don't know if Nick is still there, but either Robin or Nick, if they have any availability in the afternoon, maybe like one hour, I think that should be more than enough. So two hours in total. Okay, yeah, I'll run it by them and see what they're able to do. So it sounds like it's mostly going to be about the analytics portion that you're going to need help with. Yeah, and then just understanding the pipeline, customizing the pipeline, customizing the clients what else we got here hot jobs candidates it's possible to put documents on PCR like just straight up templates so like it you can upload a document to a specific record under their attachments so if you have like a signed agreement with somebody and you want that PDF saved on a specific record we have an attachments tab on each record that you can upload that to gotcha and then do you guys have like i don't even know like we we use like templates for like cold reach outs or stuff like that like do you guys have any way of yeah like email templates oh yeah um yeah those are called form letters in pcr so you can create those and have them locked and loaded, ready to go for emailing and email lists? Like where are documents stored? Because I think what we're trying to do is like we currently have a lot of templates under Google Drive and we're literally just trying to bring those over to PCR so that people don't have to log into Google Drive anymore. Like is it, when I say documents, I mean like a cold call script, a LinkedIn in-mail template, an email template, like stuff like that. Oh, so the email templates, you would probably have to copy and paste those and reformat them to match our formatting under our form letters feature. The other ones you can. Let's see. It's we don't really have like just general document storage. It's like you pick a record and and if there's a document you want to store on somebody's name record, we have a spot for that. um gotcha but it's yeah we're not usually used as like a storage service that makes sense so then what we probably end up doing is just creating like a name record of that person like one thing i want to make sure that we do is like not like habits where when people log on they're not seeing all these roll-ups like all they see is the texas guy he sees texas clients he sees Texas candidates. He sees maybe like a roll-up that literally just says his name. And then from there, he can click on his name and all of the documents are right there that he might need. And like just where everything is in one spot. Like that's the whole goal of this is to make it to where people don't have to bounce back and forth between PCR and Google Drive. So I mean, we As a PCR user, I still have Google Drive because that's where I store my documents. There isn't really, you know, we aren't a storage service, so I don't think we'll really be, you know, checking that off your list. You know, I still use Google Drive myself as a PCR user. If I have documents related to a specific person, I can save that to their record. but just a general pool of data and files, PCR probably isn't your best option for that, if that makes sense. Yeah, I'm just making a note. So basically, we can get everything done except for the documents. Right, yeah, it seems like you're still going to need a storage service to store files and documents. okay well that's good that's good news that um pretty much everything else is able to get done except for that one thing um if if we were to put all the documents under let's just say like one of our guys um let's just say carter he's the california guy right like if we created a roll-up that just had his name on it and we put templates under that couldn't he technically download those documents? I know it doesn't look pretty, but couldn't he just download those documents whenever he wanted to? Yeah. So the roll-up is just going to have a list of names in it. So once you open a roll-up list and click on a name, it opens up the name record, and you can store documents under the attachments tab of a record. So any name record, if you go to attachments there's a place to upload and even download any document that you've uploaded before um there is like a file size limit oh but it's under attachments yeah i'm trying to find it it's under attachment um yeah if you just open any name record you'll see um there's like a resume tab and an activities tab there's one called attachments on that same bar on the left underneath the name record. Okay, so it looks like Alan. Where's the attachments? I'm trying to find them. So if you opened up the name record and it's in the bottom frame there, you'll see it says Edit Company on the left as one of the tabs. It should say Resume as a tab, Notes. It'll also say Attachments. It's on the left, right under the name of the person. if you've opened up a name record. Oh, there it is. We have to pin it. That's why. Let me pin this. Oh, okay. Attachments. Yeah. Attachments. There you can upload files and then view your files or even download files on that name record. That's how we're going to do it. Got it. So that's how we're going to do it. And then I'll make a note. I think one of the things we'll talk about tomorrow too, Gary, is just customization, like customizing some of the looks of things to make it more user-friendly for us. Okay. And then allowing all of the customization to be copied across all of the profiles. And that should be enough. Cool. All right. So I will send you a couple Learning Center videos that can help if you want to just get started on something tonight and then I'll get the invoice sent over for a training hour or two. You want me to just put that for two hours on the invoice? Yeah, might as well do it for two. The second hour, honestly, we might even want to do something where you and I just get together on Friday. So I would put me on your schedule for Friday, but if you can get a hold of Robin, and that could replace that. So just let me know. But yeah, the whole goal is to get this done ideally by tomorrow afternoon because that was the original goal. Okay, cool. All right, I'll send those materials over. Those might give you a really good starting place and give you a head start. And then we could just go over things maybe you didn't understand from those videos and go a little deeper into it. And then I'll get the invoice written up. anything else I can help you with today? I think that's it Garrett thank you so much and I'm looking forward to our meeting tomorrow and yeah we'll get this all done it doesn't seem too hard it's just you're speaking to someone who never uses PCR more than email marketing gotcha alright that sounds good alright have a great rest of your day we'll talk to you soon see you soon man thank you so much bye bye Thank you.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2137.782182,
    "salad_processing_time": 151.90792059898376,
    "overall_processing_time": 2137.782182,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thank you for calling Main Sequence Technology.  This is Garrett.  How may I help you? Garrett, how are you doing? This is Nick.",
    "job_id": "21ff3ed8-2912-4b68-bed0-458d078ad419",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thank you for calling Main Sequence Technology.  This is Garrett.  How may I help you? Garrett, how are you doing? This is Nick.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical",
      "urgent",
      "billing"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "high_priority"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3091573233037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}