{
  "recording_id": "3091283104037",
  "version": "2.0",
  "timestamp": "2025-09-21T23:21:06.663017Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:21:06",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hello. Hi, Mark. This is Robin Mantoni. I think I closed my meeting window, so I don't know if you tried to join. Hi, Robin. How are you? Give me a second. Alexis from Music. How are you today? I'm good. I'm going to send you a new invite because I sent you one, and then I think I just accidentally closed it. I was trying to close out a bunch of windows, and I think I did that one by accident. All right. You've got a new one. Give me one second here. Let me just finish what I'm doing. Okay. So you just sent me... Yeah, it'd be just coming over now, though. Not the one from about five, ten minutes ago. Okay. 19 minutes ago and zero minutes ago. Okay. Join call. Yeah. Perfect. All right. So if it keeps filling in, I think it's that app data. So I'm going to have you clear that. Then we'll do an uninstall, reinstall again. Or actually, let's just try clearing the app data first. Let's see if that does anything. Do I need to use the, okay. Okay. So you're going to use the, yeah, you don't need camera. And you can turn off the microphone. otherwise you get my little interference there okay I think I need to turn off the since we're on the phone we don't need the microphone okay so where are we now so okay my screen yeah share your screen but make sure you go over to the right where it says entire screen Okay, share screen. Entire screen. And then let's do screen to share. Okay. Okay. So here's what I'm going to have you do. in your Windows search area, type the word app app data. All is one word. App data. Yeah, down in that Windows search. Okay. Did you do it on a different window? Like the Windows search area down at the very bottom? No, I'm in the Windows search. Down at the very bottom. Have to add a folder? No. Yeah, I'm not seeing where you're typing. Oh, I'm not sharing that screen. I can do that if you want. Yeah, there I can see it. Type. Oh, okay. Why is yours different? Okay, mine was allowing me to just jump right there. Okay. Let me think about this. Where is the? Mine came up under a best match option, and yours did not. OK, so let's see. Let's try. Okay, let's try this. Where is it then? Hold on one second. Data. All right. And the PC Recruiter, the inhaler, several times. And every time it reinstalls, it's got exactly the same data in it. Like, it's got my license. I want it so, like, it's a complete, you know, new installation. Yeah. Which is why I want to get to, let's see, how to find. So when I reinstalled it, it looks exactly like it did before. and I want to strip out all this stuff just to re-register and all. And I'm not sure why that is. Try doing this. press your Windows key on your keyboard and then also hold down your R key. Okay, there it is. NCP.cpl. Okay, replace that with, God, this is so different than I'm doing it. How I was able to find mine, so I'm just kind of local put percent local app data percent all is one word percent local app data percent okay go to main sequence technologies inhaler three and you know let's just get rid of um go up one level delete that folder and then we'll just delete the inhaler which i believe should just regenerate all this anyway okay now let's go down to um like your add or remove programs so i believe in your windows search you should just be able to type add yeah we're going to uninstall that program it actually doesn't this is very interesting it shows it not being there so oh you don't even see it listed so did you completely remove inhaler already no i haven't it's um give me a second here okay yeah go over here to apps let's go here to apps let's see what what we find there uh over at the left? If I can. Yeah, click apps over at the left there. Okay, you know it's already running here and so show application. Okay, so let's go out of here. Let's go to in this setting screen, let's go to apps over at the left. Go to install the apps And then go down to PC recruiter inhaler They should be alphabetical PC recruiter launcher Okay And then do uninstall so it has been uninstalled so let's go to a browser tab and do a search for I already downloaded it actually so it's oh is it in your downloads? downloads and then okay run that I'll show you what's... Okay. Okay. Go to I accept. Next. Typical. install finish okay all right and then go ahead and open up that inhaler yeah you have to do that portion in a second here I actually had saved the information with me just one second how many I'll probably just be dine-in and associates I tell you that number if you don't have it yeah give me a second here okay save it here it modified okay okay where did i here There was something funky about this. Ah, here it is. Sorry. I knew there was something weird about how it was spelled. Okay, then I need to do… Yeah, I got to do the connection settings. Okay, where are you, container? Connection settings. Clear the Cox2 database. Okay, clear all of that out. Perfect. Go. And that's the correct database, right? The merge database? It is, yeah. Okay. It is, yeah. Merge. Okay. action test successful okay and then where it says go back to actions and go to preferences give me a second here it's completely locked right now not sure what's going on here I'm sorry, this is completely locked up. Let's see. It's not. I think I need to restart the... Yeah, maybe go to right. See how you have that beige toolbar where it's kind of like dead space? Right-click there and select Task Manager. Yeah. Does it let you do that? Yeah. It's only this program. so inhaler and then ends task okay let's do this again actions you said connection settings? or preferences I'm sorry because that part we did okay connection settings preferences Okay. Take that bottom number. Make it like 50. Like something really low at the very top. Don't change anything else here for now. Minimum text size is 50? Yeah. Yeah. Go 50 there. And then add a zero at the right. Okay. And then hit okay. Allow message to move from inbox. Okay. Just leave everything else as is. Okay. Action, and then go to... Yeah, pick what folder you're going to do. And then just try to see if it works. Yeah, let's see what happens. Same thing. Shit. Ah. I need to see this bigger. Do you want me to email this to you? Yeah, take that whole thing if you can grab it all. Okay, email. Yeah, you can just send it to me directly. It's Robin, R-O-B-I-N, at main sequence on that. Let me see what that says there. And there's nothing odd with a folder name, right? No, I don't think so. Okay. One second. Sorry, I'm just waiting for the email to come in again. Because this is taking up way too much screen. Adjust view. Okay. Okay. Okay. What's this JIT debugging mean? I don't even know. Okay, let's scroll up on this. Scroll up on where? On the error message. Jeez, what is this? you are the only person that I've come across this so far. I'm a little stumped here. Huh? Yeah. I mean, my computer works pretty well. I mean, otherwise there's no like other issues with it. I guess. And you said that, you said that to Robin at main sequence.net. I didn't get anything yet. Yeah. Yeah. I just sent it to Robin at main sequence.net. one minute ago, 1155. Okay, didn't arrive yet. Hold on one second. Let's I'd like to see that error. If there's anything in there. Show me the O. Oh, now that's somebody else's email. I mean, I'm, you know, not technical myself on this. I presume that if it's happening to me, eventually it will happen to somebody else. So unless. I'm just trying to figure out why it's happening. Let's take a look at the folder that you had it set to monitor. Did we do this like changing folders and just putting one or two files in there? I think we did, right? Yeah, I think so. I thought we did that already. Can I close out this message or did you get it already? Well, I didn't get it yet. Let me do this. Let me. Let's make a new folder. Let's just call it resumes for PCR. Just something simple. New folder. Okay. Where's my new folder here? Where are they? Let me do this. You can go at the top too. Make a new folder. Resumes for PCR. There's your two other ones you were looking for. Let's just take three files and move them over. Actually, you know what? Let's not even do the first one. Let's do second, just in case it is that first one that it's trying to bring in. Let's copy those or cut. Let's move them into, paste them into that other folder. Okay. And then we can figure it out. Okay. Yeah. Switching that inhaler to look in this folder. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Action. Okay, that worked. Okay, let's try all of them. I would maybe do in small batches, because it could be when it hit a particular folder, I mean, a particular file, or was that something with that folder? I think it was the folder, but let's, you know... If you do it in small chunks, it helps to process of elimination, I guess, right? It's happened on other – it has happened on other – what's the word? You know, show application, action. I don't know. Hmm. Well, I think we've determined there's a problem with the folder. This seems to be working. Not sure what. I don't know if it's just a LinkedIn name merge or – but you tried with another folder too, right? Yeah, I tried with another folder and it just didn't work. But, I mean, I don't care why. Was this also under the document? Your other folder is also under the documents. Maybe there's some kind of security preventing any kind of access over there. I wonder if that is. I don't know, but this is fine with me. I mean, I don't need to, you know. As long as we have it working, right? As long as we have it working. Yeah, it's just kind of – well, thank you very much. I don't know what's actually happening here, but it's certainly frustrating. Now, what's this guy? Now, that one it doesn't seem to like. Probably – yeah, it doesn't like something with that file. Okay. Well, let's do the rest of them just as a – you know. Okay. And then. There's one in there. It's like an MD file. I don't know if you noticed that. No, I didn't. What's an MD file? I have no idea. Oh, my God. What did I just do? Oh, I moved the other folders over. That's not good. That's not what I intended. Go in your inhaler. Well, you didn't do the import, so that's okay. You don't have it set to automatically monitor. There is something with it. It's file type. There it is. So it says resume.md, and it says md file. Mm-hmm. So I think, okay, this should be all of the PDFs. Yeah, there is one organized by maybe order by file type for a moment. Don't change that. Don't change that folder name. I'm just going to move these guys back to the merge file. No, no, no, no, no, no, no, no. Please don't do that. Okay. Because those are needed. Yes. So try inhaling now. Let's see what happens. Where's the inhaler now? Okay, there's something about these that are not working. Yeah, you've got to keep those where they are because that's saying what it's already processed, I believe, right? Yeah, exactly. But what I need to do here now is Control-X and then go to Documents. I think you were just in Resumes for PCI, right? I need to have a new folder. Where's my new folder? Okay. New folder, right. And then let's do control V here. Okay. And then. I'll probably rename that folder before you try bringing it in. Okay. How do I rename it here? That's the question. You have to go up a little higher, I believe. Like if you click on documents and then right click and then rename. Okay, PCR2, we'll call this one. Now one thing I would do is in that folder there was a file. See the fifth one there? Sixth one? That's nothing we're going to support. you might as well take that one out it's only four kilobytes I don't really know what that is I don't know if mg is a valid file extension it's resume and Okay, let's do that. Yeah, that. Actions. Browse. Library documents. Wow. All right. Let's see. This is over there. So there's something really toxic about that. How many files do you have in here right now? This one is probably, you know. Okay. Let's make a new folder. Let's just take a portion of them. Like move them over to the PCR resumes for PCR. Just do a portion of it at a time. Okay, now point it to this folder. Well that's your original folder. This is PTR2. Yeah. this is a folder I just created. It's really interesting. So it might be something that one of these files in particular that it's not liking. Yeah Yeah, that's interesting. There is a Gmail file in there. It's either a file type that's causing some issue or a file name. Like one of them says screenshot, and it's a JPEG file. Mm-hmm. Yeah, that's garbage. Maybe sort by file type. That might help us. Okay, those are all the same. Let's scroll down. Can you widen the width of the file name? there's no files that maybe have like two spaces or things like that there's something like oh what is that is that two underscores right there could be yeah try renaming that one I wonder if that could be it. Something like that. Huh. That would be very interesting if it was. Every once in a while, like certain things that, you know, it can kind of break code as it's trying to grab it. All right. Let's move another set into your PCR2. Again, like don't do too many because I'm trying to narrow it down. Oh, there's an interesting one too. Which one? It was real quick. It said something like chili or something at the end, and it had looked like a series of dashes at the end. Okay, let's just go. We'll do these ones. Cut. Documents. PCR2. Show application. Oh, it's still working. Yeah, that one's still working. Let's go back to the other folder that we're grabbing from just to see if we see any other files that have, like, a weird name like that, especially that one that I kind of barely – I saw it just as a glance. So was it in your resumes for PCR folder, I think? Yep. There was something, I feel like I saw, it had like, yeah, things where I see here, like this founding architect with the double dashes. I would rename stuff like that just to make sure. I'm trying to just clean that up. Well, you know, I think maybe the – There it is. There is the one I was thinking, the chili one. That's the one I saw. Rename. Never had to do this, you know. But why don't I just play around and get through these and see what – it sounds like it's probably something in the folder, and it's not even with troubleshooting. there is, you know, create another folder, right? It's not, you know, it's not a big deal. So, but let me. Yeah, I would work in these smaller groups and then kind of just putting them into that folder. So that way you could see if it comes up, then is it something, a file that you just moved there and that can help you. If it is some of these file names, that'll help us get around that and figure out which one it could be causing it. I think there may be some issue with just the folder itself being corrupted. And I don't know, but it's not, I think you've pointed me in the right direction. I can play around with this. And if there's any issues I can, I don't know what to do. I mean, I think I did the clean and solve, but it's working. That's all I wanted. All righty. At least we got better than we were before we talked. It looks right. Yeah. Yeah. I think you can close this ticket out. I think I know what to do if it's, if I have an issue in the future, just play around with this. It's not the software. there was something. There's probably something corrupt in the folder. I mean, I've had that folder for years now, and it's probably got, you know, like the merge. If you look at the properties, it's just, you know, it's a huge file. Oh, well done. It's set to read only. I wonder if that is an issue. maybe it's not letting access to the folder because it's set to read only I don't know why that would have changed but apply So, I mean, it doesn't really matter at this point. attributes are for what do I have, PCR2? What are the properties here? It's also read-only. Fascinating. All righty. You never know. Windows is a mysterious thing. It just sort of does whatever. Let me do the what we're doing the resumes from pcr let's just do all of them and see if this works it's not it's actually not that many but um documents and then we're going to pcr2 and then actually written portfolio I wonder, Rohan. Okay. Which one was Rohan? Let's, you know, properties, cancel. Rename. Now crashed inhaler. Action. Import from folder now. Now this one just threw immediately. Immediately, you know. Okay. Let me play around with this, see what actually is happening. Okay. And then kind of go from there. But it doesn't make any sense why it would work. PCR. I would try to move it smaller batches because if it is a file, then that kind of narrows it down to which file. Let's just do PDF file. So that seems to be a lot less squirrely then. Okay, these are all just PDF files, right? And then let's go back to inhaler. Fascinating. So this could all be caused by just some bullshit file that's, you know. It could be. Yeah. wouldn't surprise me i mean not to be presumed malicious intent but there's definitely programmers who send me resumes that may have figured out how to screw up programs like this and they just want to mess with recruiters um well the other thing too is sometimes when you get like you know two spaces or you know things like that it actually causes like a disruption a connection because you're taking it from your desktop over to basically a cloud system. And so sometimes certain characters or spaces or things like that can cause an issue. I know we have problems like if you do like a CSV import, like, you know, importing data like to a roll up. If you had a column heading, let's say first name. If you had first space space name or first space name space, that can cause an issue. certain characters will as well, like apostrophes, things like that. Okay. So it looks like this is definitely caused by something here. Let's do this, you know. So by doing it in small batches, we might be able to narrow down which file is giving us this headache for you. Well, it's very weird that this would be, you know, what I do, PCR2, right? Yeah. Now I'm curious which file, if it is a file, which one it is. Mm-hmm. Okay, it might be one of these. What is this? Probably that one. That one or even the second to the last. The second to the last are a pretty long file name. Okay, let's give this a shot. See what comes up this time. Maybe it's the underscore here. Try that. that one's really tiny open up that file that's only like 10 kilobytes what's that one what is that Let's open up it. It seems like a terminator. Perfectly normal. Let's move that file out. Okay. Where are we now? And then we'll move only that one file back in. So that's called GGG. Okay. I can't do it because it's open in Word. And Word files just suck. Okay. Again. so maybe which one is that trying to call where's Benode Kumar there's not enough memory or disk space to on this one right so let me I'm trying to click on this one Thomas Hudson Stephen Thompson weird okay Okay, we'll play this again. Okay, those are getting resume file size too small. So let's go up to actions, preferences. Let's change it down to that small number. Let's go to 25. Hit okay. What's the last messages in that screen? That's just not working right now. Okay. Let's take these resumes out. Let's try another set. So let's move these back to resumes for PCR. Try the other ones? Yeah, let's just do like four or five of them at a time, though. I think there's probably something on those particular resumes that are terrible, not working. You know? Yeah, it feels like there's something in there. Where are the resumes for PCR? So let's do, yeah, you notice these are all very small folders. So let's do the ones that are big. you know like biggish and then try those on pcr2 Huh. Well. Preferences. Should I go down to 10? I don't know. I've actually looked at the file before really going that low. Because if you put something that's just like, it's meant to really kind of control that if you actually just threw like a text file, hit like five words that we don't even try to process it. Yeah. That's a good point. So these are all like normal, you know, That's an old way of writing, right? Yeah, sometimes it could be something like it was made in a text box or that it's really not text. There could be some things like that, like maybe in the formatting. That's not odd that it would be that small. What if you copy that text into a new file, I wonder? it's interesting when I open this one, there's not enough memory or text to print the picture. I wonder if these are like, just, Oh, he's got, so this guy has, he's being cute. Like this is a image or something. So, well, I mean, am I, what is, am I seeing like green stuff at the side? What is that? I don't know. I mean, it's fine if I, you know, can just process 99% of them. A few of these guys are not, it's not that important. But it's, you know, then I can deal with them as needed. Let's just try this guy right here, though. You know, cut and then go to PCR folders. See if this actually. such and Jane you know product manager or PCR now it's not working completely well I think it's because I gotta do this actions Okay, that guy did. Yeah, maybe it's not all of them. Maybe it's just, you know, some of these little ones. But, you know, I can leave it at that. I think I've got enough information. It's based on the folder. But, you know, kind of weird. Thank you for all your help. I really appreciate it. Oh, no problem. So I guess you probably find this interesting if it's something you haven't seen before. Yeah, I'm kind of, like, really stumped here. And I'm like, hmm. Well, we may never figure out why it's, you know, not doing this. But, okay, this is Stephen Thompson. I mean, which guy is this? XXX is Stephen Thompson, right? So let's go and I'll just do these one by one and see if there's any real Resumes from PCR. Let's see if I can find... Let's do this one, control V. I'll put files up in Word. I hate Word files, really. Just absolutely, you know, do not need... Thank you. Hmm. Let me do this one by one. I'll call you if I have anything else or send you an email. I think it's fixed right now. Thanks for your time. Thanks.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2117.021118,
    "salad_processing_time": 239.89696431159973,
    "overall_processing_time": 2117.021118,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hello.  Hi, Mark.  This is Robin Mantoni.",
    "job_id": "25766c43-b9c0-42be-a5c1-ee4bdfb35489",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hello.  Hi, Mark.  This is Robin Mantoni.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": true,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3091283104037.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}