{
  "recording_id": "3092688423036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:22:48.628409Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:22:48",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hello, this is Robert. Hi, Robert. This is Robin Mantoni with Main Sequence, PC Recruiter. Oh, hi. Hi, how are you? I'm good. How are you doing? Good. I have a – we have PCR, and I've noticed a glitch or some kind of problem where all of these – a lot of the names in our database have the same company name added. Oh, okay. It's added to the default company name. So if we try to add them on the LinkedIn parser, we have to deselect the default company. Oh, okay. So that's probably a setting in your capture. Yeah, that's what I was figuring. But just a few details on it. So when we made the transfer over, the initial transfer over, we had like 150,000 names. And all of those, or most of those, when the transfer happened, in the company name slot, it says candidate profile or something. I don't know, but so in the company name, where the person works, all of those records said candidate profile as the company that they were in. So that's how it was tagged, I think. And then recently, like I would say, we started working with a third company, you know, to help us move through, you know, like to help us. It's a third-party company in India that they help us organize our data and whatnot. And I noticed that – I started noticing that a lot of the records, when I tried to go to enter them in via the LinkedIn parser, that they're already set to a default company. and one of the default companies was BPO Wizard. Now, that's the company that BPO is the company that we contract with. And then a week later, I noticed that all of the default company entries were a company called RCB Bearings. and then I noticed that today that all of those companies in that field all of the records it says it's called Okay so let's there's too many questions going on so let's do one at a time here okay so your database is a CB Associates okay let me see what you have for your default company okay well right now there is you're in the database called default company? I mean, you're in the database. Oh, sorry. Let me rephrase that. You're in the database named CB Associates. Okay. So it looks like you probably had a default company, and then it looks like it's missing. So it could be that maybe somebody changed the name of that default, but then made it not be a default. So let me see. if I can you're in my database right now yeah I'm looking right now it looks like there's a company called Coherent Corp yes so let me take a look at that company yeah yeah okay let's start there what's nice is that there's what's called a change log okay good which one was it that I saw there's like three of them in here. I think someone just, okay, so it's one without the, okay, so this company, let me look at the change log of it. Okay, somebody changed the name of it from BC Bearings to, so this is probably your default originally called candidate poll at least at some point. And then, so on August 12th, the username admin changed the name of the company from candidate pool to BPO wizard. Then they changed it from BPO wizard to RBC bearings. So whoever's logging in as admin is the one that kind of messed up this record. Okay. Yeah, yeah, yeah, yeah. I know who did that. Okay. So here's what to do. if you go to company on your main toolbar type in the word coherent for the company name but it's the one that says coherent corp without the dot at the end without the dot yeah there's three when you just search for c-o-h-e-r-e-n-t three results come up. It's the middle one that just says Coherent Corp without the dot at the end. Okay. Got it. When you go into this record, I'm not sure what username are you in as? I may not have the same pinning as you. I go in as either Robert or Admin. Okay. What are you in right now? So that way I can tell you exactly. I'm as Robert. Okay, so let me go in this video so you see exactly what I'm... Okay, in case I have to talk about what's pinned or not pinned, I see exactly what you're seeing. Okay. Okay, so what happened is on this particular record, see how right after summary there's a three-lined icon? No way. So on that toolbar, when you have the company up or you have notes, associations, attachments, At the end of that toolbar, there's a three-line icon. Click on that, and it shows you a full toolbar. Then there's an option called Change Log. Click on that tile. Okay. So basically, this admin user went in and has been changing this one record. So we just got to change it back. So do you want it called Candidate Pool again or Candidates? What was your preferred wording for that default company? I want it for whatever the resume whatever's on the resume I want their original company well this is the the so the people are in this company it is I mean you've got a lot of people in this company this with the purpose of that with the purpose of the default company is is when you're not picking a company it's just a fake record that they go to it's a company record with a fake name, but we only want to have one default company in the database. So it's a company record that we set as the default and just give it a fake name. What is the purpose of that? Because every database, you can't have orphaned records. So when you're bringing somebody in, let's say parsing a resume or adding somebody where you don't know where they work or you don't have a company or things like that, they go into this company. so for this particular company well um let me let me tell you my process um yeah so i think so what's probably happening is they may have capture set to um maybe just kind of bring them into the default so that's going to be a capture setting that you change but these people are in this company now the problem is it's been renamed so the first thing that you'll need to do because right now you don't have any default company, which is going to cause other problems, like if you have PCR job board or things like that. You have to have at least, I'm sorry, you have to have one and you only want one default company. So first thing that we have to do is change this company record. So if I understand it correctly, because I had acknowledged this problem earlier that when we first made the initial transfer to PCR, most of the records, like I wanted them to be pulled from, you know, wherever the candidate was from, wherever the company they're working, that should go in that slot. And apparently that didn't happen. and so they just put, they had just put, I think it was candidate name or something. And the only way that I could, when I went into LinkedIn, and if I wanted to change that person, like, so let me give you an example. Right, so yeah, I get that. So there's two separate issues. One, we've got to fix this record, but then two, we've got to change an extension, setting in your extension. So for this – Can you talk about transferring from where? Was this a conversion, an imported list, or? Yeah, yeah. When I first started with PCR, we went from CAT, and then we transferred over about 150,000 records. And it's my understanding that if those records didn't have a slot in the company name, that they put candidate profile in there as the company name. So when I – Well, it could have been whatever – so the company name, you could really call it like whatever you want. So at one point it might have been company profile or whatever. So – and again, that's this company record. So first thing that we have to do is we have to fix this back to how it should be. Right, right, right. I'm just telling you what ideally what should have been in there is. Yeah, when they do a conversion like from CAPS, like I actually worked for BBDP many, many years ago. CAPS had what was called, they called it technically the zero ID company. So basically it was a company record that had the specific ID number and it just didn't show a label. Where the difference in PCR is you still would have like a default company like that, except we actually show it to you as a record. So any person that would not have had a company would have gone into that company if they did not have an actual company record. Right. But the big issue was that we put in our CATS database and in our PCR database, I'll just look at a record called Leanne Zunich. I'm just going to give you an example. Right. Okay, so what – So she's not – She works for Northrop Grumman. Okay, so in that case, what they had to do – I can tell by looking at this. It was probably not a company record. It was probably something just typed into a field. So it's not a record to be associated with. So that's why it had to go into your default. But then they put that value as a custom field. because when they do a conversion, if it wasn't a company record, if it was just something that was put into a field, that's not a record. So it's almost like saying. Right, right. The Leanne Zunich, the company name, like let's say when she transferred over, it says Northrop Grumman, right? And that's the correct current employer. in CAAT, it was supposed to be Northrop Grumman, the company name. So it should be Northrop Grumman, Northrop Grumman. So that – Yeah, but if it wasn't a company record, then it wouldn't have been something that they could map as a record, if it was just like a value in a field. Yeah, yeah. That's what I'm saying. What I'm saying is that in the transition from CATS to PCR, they would have seen Leanne Zunich. Leanne Zunich would have been transferred over, and the current employer would have gone as, and it did, Northrop Grumman. But then in the company name, which when we were in CATS, the company name was Northrop Grumman. The company name is also the current employer. Do you see what I'm saying? Like, but, and I had accepted this, that moving forward, it's going to be, you know, like when I go into LinkedIn and I hit that click to update or click. Right, which is probably. Like the only way I can change the company name, okay. The only way I can change the company name for 150,000 databases or names, I have to go into her LinkedIn profile, and then I have to upload it, and then I have to deselect the default company and then add it, and then that will change the company name. So what you – no. Okay, so I'd like to fix this, but we got two things we have to do. So one thing that you're going to have to do is open up that company called Coherent Corp. Okay. The one without the dot. Change the company name field back to candidates, defaults, whatever you want to call that default company. Okay. I guess I don't know what that company is called. You can call it whatever you want. You could, that's the thing. You could call it whatever you want. This is not coherent company. Somebody just went into this company and changed the name of it. This is your default company. So you could call it candidate, candidate pool, default, whatever you want to call it. And that will take the data back to how it was. But then there's another field called default company that the user admin. So basically what the admin user did is they went into this company and then changed it. Yep. I know. So we've got to change it back to how it should be. Okay. So can you look in the company log and see what it was originally? Looks like it changed a couple times. So it's really just what are you from? The original was, like I said, I can't remember, but it was like candidate profile or something. It's been candidates. it's been candidates poll. whatever word you want to use. Okay let's go back to if we're going to change it back to what it was before the August change so that we can have the same discussion let's do let's do that candidate pool. Okay and then the other thing that we have to do is that default company field that was also something else that they changed that should have been not changed to available it should stay as default. So you really never want to go into this record and touch anything on it, if that makes sense. Yeah, there's a complication though. Like I was okay with the fact that candidate pool was going to appear in a lot of the ones that of our database. Moving forward, anytime I add a candidate through LinkedIn Uploader, then I'm not going to have this problem moving forward. I'm only going to have this candidate pool. I might be able to fix the other problem too. I just got to figure out. Okay. Let's do the candidate pool first and then I can show you my process and where I'm... So what you'll want to do, okay, so the record's back to how it should be now. The other thing that you're going to need to do, though, is if you go, if you click directly on your extension up at the top right of your browser. Yes. Okay. That's going to pop up, you know, capture, match all the sites and everything. at the very bottom right where it says capture to default company. Is that blue or is it gray? Oh, okay. Let me do an example. Okay. So you want me to click the click to update thing? No, no, no, no. Just go to the extension at the very top right of your browser. Okay. And it says capture and match. Okay. And at the very bottom right of that pop-up window, it says capture the default company. Is that blue or is it gray? It's blue. Okay. That's the problem. So when that's enabled, that's why everyone's going to your default. So if you want to get the company and move them to companies, turn that slider to the off position so it's gray. So basic mode, dark mode, make sure all of those are gray. so now when you're capturing it's going to try based on their profile to bring them it's not going to be the default right exactly so it was just that setting so anybody else that's using capture and working in your database make sure they also have that setting turned off perfect okay so that's why they're going there that'll help me moving forward right like like I don't I don't have to unclick the default company button. Okay, perfect. And then, so essentially, there's nothing I can do about the $150,000 or whatever, however it is. But moving forward now, like if it finds a match, right, like if I find the same name and then I update it, it will replace the company name and the employer. You'll actually have different options. You'll actually have different options. What will happen is if you go to somebody's page and let's say – we'll use my name as an example. Let's say it says on my profile that my company record or my company name is PC Recruiter. If it does not find a company in your database already spelled as PC Recruiter, when you advance to that review screen, it's going to say new company and it'll say PC Recruiter. Which means it'll be creating that company but also moving, if you selected a potential duplicate where you're updating that person, it'll move them over to that company. now if it finds that their company name spelled exactly the same is already in your database what you can do is you'll get like a duplicate checking screen first so what you do is hover on that company card and hit the little check box so that way you're not updating the company like any details about it you're just picking it but then when you're moving the person or adding or updating the person, they'll get moved into that company that you selected. Right, right, right. So it sounds like just that one little slider was your issue. Yeah, yeah. That definitely fixes that. And then we changed everything back to candidate pool. Right. So that won't be confusing anymore. But when I'm at the – let's say I'm at someone's record. Let me see. I want to pull up a candidate pool person. So would I go to – would I look in company for candidate pool? There it is. Okay, yeah. Now, I've been under the impression that I'm going to pull up someone in there. I'm going to the end of the list, and I'm going to get it. I just wanted to go with you. So I'm going to pull up Allison Zuniga. Okay, so she's in the – I've got her thing coming up, and she's Candidate Pool, right, Allison Zuniga, and she works at Neutrogena Kelly Services. So if I – like right now, I couldn't change the company name. No, the capture can change it for you. So when you're on – Yeah, yeah, yeah. Yeah, that's the only way is what I'm saying is I can't change the database. Well, if the company is not in, so if the person is in the database, but they're in the wrong company, you have to go to their name record, not go to the link of the company because then you're renaming it, which is probably what happened before. If you're on somebody's name record, at the top right of the record, there's a change company option where you can pick a company to move them to, but the company has to exist in your database. Okay, okay. But see, as far as the way that we set up our records, it's the current employer is the same as the company. Yeah, that's just a field. So you don't have a company record. That's just like data that was stored. It wasn't a company record. Right, right. But so if I'm looking, let's say at Allison Zuniga, and she doesn't have a LinkedIn profile in the LinkedIn space. Usually they do. So if I were to, if I wanted to change this candidate, company name, candidate pool, I can't do it just by switching the name and saving it. What I have to do is, and the only thing, like apparently there's a way that I can do it where I change the company name, but I have to do that in a certain way. Or I can go to her LinkedIn page. I can update the record. It'll find that it's a duplicate record. And then when I update it, then it will remove her from candidate pool and just leave her in current employer. You see what I'm saying? Well, your current employer is just a custom field. That's nothing that we're going to automatically update at all. Yeah. So if you have Allison Zuniga, for example, she's in the company called Candidate Pool. If you did have a company record, not a value in a custom field, which is what your current employer is, if you actually had a company record for Neutrogena, at the top right of her record, there's an office building icon. and when you hover on it, it's called Change Company. And that would allow you to search for the company record to move her to, but it has to exist. Where the advantage of going to her LinkedIn profile is it could actually look for a company record that's in your database based on what's in her profile or create it at the time that you're capturing. Yeah, and so that's what I've been doing. I just want to make sure that I'm not doing something... Yeah, but with your capture – That I'm doing what I'm supposed to be doing. Yeah, with your capture, the way it was set, that's why everybody was going to the default. Yeah, yeah, yeah, yeah. I got that. But I'm saying moving forward, in the event that one of my 150,000 candidate pool people, it's going to show up as a duplicate. and then all I have to do is update it, and then the candidate, it will be removed from the candidate company name, and Neutrogena Kelly Services will appear in that. That's what I've been doing to date so far. So I just wanted to do it with you watching me. Allison Zuniga and let me see if I can get the same one I wanted to show that she's Allison Zuniga gosh I can't let me do a different name from the candidate pool an exact one names and okay trying to find one that already has a well the capture is going to read from their experience area of their profile Right, right. Okay, so I found one. Her name is Lynn Zweig, and she's got a LinkedIn profile. So it says in the company name, Candidate Pool, and in current employer, JCPenney. Okay, so if I go into her page, it's going to say, it says click to update, which is expected. And now since I changed the default, I don't have to worry about using the default company. There she is. She's retired, and so it does show her. So I'm going to select the duplicate, and then – And then you'll watch at the bottom. Did it alert you for a potential duplicate company or no? Yeah, yeah. Well, it says select duplicates to update merge. But there's two sections in your capture. The green section at the top is related to the person. Is there anything in the bottom section that's related to the company? Did it try to find a duplicate of company name based on what's in her profile? Okay. So what that means is whatever, if you look at the experience section on her page, it would be it would be looking for whatever company is there so when you advance forward it'll create a company based on what's in her profile yeah she says she's retired so so in that case i would probably keep her in the default yeah keep her in the default but um let's say um let's say like she wasn't retired, but she was at JCPenney, let's say. So if her experience area, so like her current employer is JCPenney, what it would do is as you get to that duplicate checking screen, if you already had JCPenney in your database, you would hover on that duplicate card and hit the checkbox. So that way you're just picking the existing record that she should go into. if you needed to create a company like it wasn't found then when you advance that green section at the bottom like your upper section of the top would say update name the bottom section would say new company and then it would create one and then move her into it and then it would replace the candidate pool well What it's really doing is it's going to move her from one company record to another company record. Got it. But as far as me who – That current employer field will not change at all because that's just a custom field with a value in it. That would not change. Right. But if I'm looking at her – if I were to go ahead and say she was JCPenney and then I hit update And then I went to her name. You're saying as far as what's really happening, she would be moved out of the candidate pool company name. But as far as what I would notice on that page, there would just be nothing in the company name field. and then she would have JCPenney in the current employer, and that's how it would update it. Is that what you're saying? No, no. It's not going to do anything with current employer. That's just a field with a value. It's not a record. So if you went to somebody's profile, so let's say in your database you had me, and I was in your default company. It doesn't really matter what's in current employer because that's just a custom field. Nothing's going to change with that. But if you went to my profile and on my work experience, it said I currently work at Main Sequence. What the Capture is going to do, is there a company record in your database spelled exactly the same, Main Sequence? And there is. if you were to hover on that company card and hit the checkbox when you advance forward you would be adding me to that existing company if you did not do that like let's say the company record was not found with the same name when you advance to that next screen where you see all the fields filled in and what it's grabbing hold on one second I'm going to what it would do is it would create a new company. So when you are in that final screen before you hit submit, you just got to kind of watch. Like on the heading, it'll say like update new name or, I'm sorry, update name or new name. Or would it be like selected company or new company? Right. And what's the default? Is it? Well, it's going to alert you to a duplicate if the company name is spelled exactly the same and found. So if you're not hovering on it and picking it, then it's going to create a new company. It's going to create a new company, and then it's going to create a new company. Once I update it, is it going to disappear from the candidate pool section? Because that's been my experience. Yeah, the person will move from candidate pool to the new company record that it's created or the existing company record created based on what's in their profile. Right. And then what will it show in the candidate company name field where it used to be candidate pool and now – Well, that's the name of the company. It's that other field, current employer, that nothing will change. Yeah, yeah, yeah. I don't want it to change either. Yeah, company name field is really just a read-only of what company record they're in. So you can't do anything about changing that. You can only – that's why I got to use change company. You see that. Right, right, right. Whatever you're seeing in company name is what actually you see right next to the name is a hyperlink because that's an actual – And the only way that I could change my existing – everybody that's in the candidate pool now, the only way I could go in and put their company that they work at in that field is to do it individually by each one individually. Yeah, basically what it has to do is it has to basically – it has to be a record because every record has an ID that makes the relationship. Got it. These records all just happen to have that one ID of the name of your default company. Okay. You can't have any orphaned records. It's a whole big database structure thing. You can't have orphans. Very related. Okay. So I think I've got it. I'm going to be able to address this because, like, from as far as all the users, as far as we're concerned, you know, all we care about is that company employer, current employer field that we created. And so when it goes into the database, like that's what all of our roll-ups are tied up. Like we don't have the company name field in our roll-ups. We've only got the current employer, which is the one that we – And the company, what do you call it, the extension, it's Calloway's Nursery. Like, it puts, like, when I, if I hit capture on the person right now, and then I were to go to the record again, I'm going to go to, yeah, Cali's Nursery, JCPenney. okay oh gosh now i'm now i'm a little confused just in that um i thought that the that the capture um the capture thing um uh was taking the current employer and it was putting it as i as i said before the current employer field will have that is just a custom field with a value in it He has no relationship to any company record, so that is not going to change. Okay. But you'll see them. But if you did it where you were making a new company, a person's getting moved over to it, then you're going to see that they're in that company record. I see. Okay. Now I see. so anything new anything new um that i add like it's not a duplicate um it is going to be in the company name right that's making a company record and moving it to that company okay so the current employer thing is what got me. Now, is it possible from a database standpoint to map all the candidate pool, everything that's in the candidate pool, can I have them forward whatever is in all the records that have a current employer field. No, again, it's not a record. And you wouldn't be able to create a record on it. Okay. It's just like having a thing like job function. It's just a field with a word. It's not a record. Okay. Okay. All right. Thank you for your patience in explaining it to me. I appreciate that. And we solved the big problem, which was the default thing. Yeah. Yeah. Make sure if you have any other, anybody else, like, you know, you said you had like some researchers doing work or whatever. Make sure if they're using it to help you out. Yeah. Don't touch the, yeah. Yeah. Make sure they double check that theirs is also turned off. Okay. Yeah. Yep. I'm going to, I'm going to send out an email now and say that exactly what you said. Yep. All right. Thank you so much. All three of those, other than all three of those settings down at the bottom right should I'll be gray unless you like dark mode. That's the only one possibly I tell people to change. So I'm going to go ahead and do it. Yeah. And it's, that's, that's per, that's per the browser, right? That's not via the, that's for the individual browser. So I can't, I can't go in there and yeah, changed for them. Okay. Perfect. All righty. Thank you very much. You are welcome. Talk to you later. Bye-bye. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2168.919629,
    "salad_processing_time": 294.5276358127594,
    "overall_processing_time": 2168.919629,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hello, this is Robert.  Hi, Robert.  This is Robin Mantoni with Main Sequence, PC Recruiter.",
    "job_id": "5eaccf43-d659-4447-b5ff-9887ec1732c4",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hello, this is Robert.  Hi, Robert.  This is Robin Mantoni with Main Sequence, PC Recruiter.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3092688423036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}