{
  "recording_id": "3092264201036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:22:10.907596Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:22:10",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Hello, it's Heidi. Hi, Heidi. It's Robin Mantoni with Main Sequence. Hello, Robin. How are you, the original wonderful person you are? Original, that's for sure. Try to be wonderful. Trying. You're the brain trust girl. Oh, I don't know about that one anymore, but I try. It's hard to keep up anymore. I hear you. So I wanted to see if we could do a screen share so you could show me what's going on. Sure. Okay. Do you have RingCentral or do you prefer Google Me? RingCentral, like, always starts up when I start up my computer, so I have it. Okay. Because sometimes if I have to take over screen, like, remote, or if I have to take over the mouse, then that one's better. Absolutely. If somebody has it. Okay. So let me make sure. Wait. Which? I'm just going to put my headset on. Hang on for a second. Yeah. Well, you won't need it since we're on the phone. Okay. There we go. Never mind. I just switched over to my headset so I can hear you better. Okay. Bear with me one second because I apparently closed my window I need to be in. I got your email address. I just had you up here. maybe I had your company up there it is okay and what email address should I send the invite to actually you know what I don't even need to if you open up your app sorry I'm having a I'm having a lack of a brain moment here okay so if you open up that break central all in one app. You go to video and then join. Okay, wait, wait, wait, wait, wait, wait. So what's the URL for that? Because I don't have it as a shortcut or anything. Oh, you don't have the app installed? You know, listen, you're the OG person and I don't have any apps. It fires up every time. So I know that if when I go to what ringcentral.com or whatever it is, is that what it is? So if you have the app, if you go to like, are you on Windows computer? Yeah. Okay. Type the word ring. And then under best match, do you see ring central app? Oh, yeah, there it is. Well, you know, okay. Here we go. This is where I always go into it. I don't know. Okay. So once that opens, go to video. Or join a meeting. Yeah, you can do that. and let me know when you're ready for the meeting ID. Enter meeting ID. 050-394-810. And I'm going to not use computer audio since you're already on the phone. Okay, yeah, that's better. And we don't need a camera. Yeah. Okay, so you're in. Okay, at the bottom of your meeting screen, click share. And then make sure you go over to entire screen. Okay, wait a minute. So I just joined without computer audio. Okay. And share your entire screen. Gotcha. And share. Okay. You are sharing. All right. I can see you. Let's go over and have you open up Chrome and go to either, you know, like show me what's going on first. Okay. Okay. So let me just. Oops, why is that? How do I get this to minimize a little bit? Because I have the folders open on the top, But it says you are sharing, and I'm like, I can't see my. Oh, is it the toolbar? Yeah, that toolbar is up there. Oh, I forgot now because I can't see it. Okay, let me see. Can you hover it in the, like, hide toolbar or, like, in the options at the very top? Does it show anything? Yeah, I'm just kind of clicking on it. Let me see. Or you usually should be able to, like, just slide it away. Yeah, that's a good idea. Let me try that. Oh, yeah. I can just move it. Okay. So here, like, let's say this guy, this is a list. I'm trying to go. We just had somebody turned out an offer. So I'm going back to the pipeline. Okay. So here I'm in the job pipeline. So I click on the guy here. and so and this is somebody that I put in then I go over here to LinkedIn and I click on him and then LinkedIn comes up but it doesn't go right to the person so it's giving me see how it's giving me the drop down list of these people that might mean that you don't have the URL saved here's my recommendation do you have the ability to customize your name layout I don't know it's always worked before when I've added them in you know using that little option on the right hand side you know when you when you put them in can you go back to um the main page okay um let's do this at the top right of your name layout go to that three line of your name record go to that three-lined icon i never use that toolbar to be honest go to options let's see if you have customized click on customize um yeah it's that gear icon right above where you are oh yeah there it is okay okay here's what i personally like to do um if you scroll down in your group okay see at the bottom there where it says click to set field click there start typing the word linkedin and you should see an option called social underscore linkedin i find this is much easier to use okay select that gotcha and it's not pinned but if you go to the three-lined icon at the very top you'll find save in that menu. Gotcha. The other thing that you can do is you can make groups if you want. So that way you're not having to scroll down so much and have so much wasted space at the right. It's another option for you too. Okay. Let's go. Let's exit this tab. okay okay let's reload his page yeah let's reload his page all right so i'm just going to pick him again here's richard because what that usually means is there is no url in there so let's see what's going on okay now click linkedin again no i would actually go to the field that you just had Let's see what's in there. Because when you clicked on LinkedIn, what it should do is either take you to his page or put it in a search. So if you scroll down a little bit on this page. Yeah. See, he doesn't have one. So that's why it's taking you to a search. I don't understand what you mean. So if the person had a LinkedIn URL stored, then that icon at the left would take you to his page. Since there's nothing stored in that field, that's why it's taking you to a search. Okay, so then now what should I click on that I just made that change for to go right to it? Well, again, he doesn't have anything stored in that field. So scroll down to that field that I just had you put in. Okay. Since this is empty, there's no page to go to. That's why the LinkedIn icon at the left is not taking you to his page. Okay. See what you mean. Okay. But then my question is, when you, let's just say I'm going to add him, right? Wasn't this updating the record over here on the right, the click to update? Unless you have another record for him or something. No, but see, there he is. He pops up again, Richard Bricker. So I'm on his link. Okay, so one thing it's not saying is it's not saying direct match. So let's go ahead and click on him. Okay. And then you can just say use Richard's company because you don't want to create a new one or click that because it's the same company. I just put them all in candidates. I don't, yeah. Oh, okay. I don't make a separate company. yeah so okay gotcha okay so hit review mm-hmm okay now hit submit okay now go back and that's how I that's how I put everybody in and so let me just okay let me go back let me just close this one close that one go back here when you go back he should have a URL saved. Like scroll down on that page, see how it now has a URL. So now there's something for that icon at the left to take you to or you can always just go to that field that you put in the layout and there's a LinkedIn icon to the right. But my question, okay so I see how that That is a fix. However, my question is, up until today, up until today, when we had put somebody in using that update link, it was automatically saving the URL when we were, A, putting the person in as a new person, or B, updating them. Maybe they changed jobs or something like that. That was always in there. This is a new thing that is just happening that when I am going to the person who was put in recently by me, suddenly it's not saving the URL anymore. Can you go to another person? Because it could be that it identified him as a potential match, but it just wasn't him. Yeah. So let me go to somebody else here. Okay, so let's look. First, is there something in that field? Let's scroll down on his page. There's nothing there. Nothing in the field. So what was this? Let me just see what this guy's. Can you do me a favor and go to the attachments area of his record? like um yeah let me just unclose this guy up 8 7 20 25 okay why did they not get can you go to somebody's linkedin page let's add somebody new like maybe we can do that sure absolutely let's i just want to see what's going on here yes so here we're gonna yeah but i want i want to go to somebody new yeah this is a new guy this is just somebody i just picked off that search yeah but he was already in because it's got an update and he already had an icon so maybe just go so this guy anybody yes this is a new this is a new guy i just picked him off the search. Right. He's already been brought in. So I want to have you find somebody new that you don't have in your database yet. Okay. Okay. So let's say this guy right here. All right. And I find two. He's probably in there as well. I would not have somebody in who is a New York Law School candidate. Okay. So he is definitely not in. So if I'm going to add him So we'll just add him as new. So if it prompts you about updating anybody, we're just not going to do that. Just hit review. Yeah. Hit submit. Okay. Now let's go over to PC Recruiter. Yep. So I'm just going to, this is the, this is what we just added in. Okay. So he's got a URL. Okay. So he's got a URL there. Unless there was, what day was that? When did we, we did have to do a little update because I think something had changed where maybe we weren't getting URLs, but then it was quickly. Were those all done pretty much like on the same day? Those other people? Do you think? You know, it is entirely possible. If it was an issue, I think it's an issue that's already corrected. Okay, let me just go get somebody, one other person, just to check. So let's see. This guy seems good. Okay. Why am I picking names of people that I already know? That's not good. Oh, that's why you know the name. Oh, my gosh. It's so difficult. type this name in type uh okay let's see go by nicholas or nick uh type the name braddock it's just somebody that works with me okay oh i'm sorry b-r-a-d-a-c-h i'm sorry i shouldn't clear it out okay no is it nick or nicholas uh what's his profile hold on one second i'll have it's just somebody I work with okay is it Nick or Nick or Braddock Nick or Nicholas I'm drawing a blank what is okay he's got his Nicholas type Nicholas Braddock B-R-A-D-A-C-H yep perfect okay okay first one there yeah oh open to work. I don't know, Robin. Okay. Click the add. Yep. Review. Submit. View in PCR. I have a feeling it's just going to be a couple possibly maybe those people that you did on August 7th. Yeah. yes yes okay well that makes sense then i get it okay so it won't either recapture them or the other thing that you could do if you don't need to recapture them if you at least copy that their url into that field that you added and then save the record then just save it yeah yeah and i personally i think it's easier even like now they have these colored icons and stuff like that i didn't even like before where it was like is it outlined or not outlined I almost always go by the field I just think it's easier to tell do I have it to go to right the other thing that might help you would you want to change your layout so you don't have all this extra space at the right yes okay let's do this let's go back into that three lined icon and go to customize at the top of the name record and then yeah go to customize okay see where it's actually first things first at the very top of this page it says one column layout let's go ahead and change that to two okay yeah the guidance pushes it in nope not yet now we're going to go to add group to what add group it's over at the left from where you are right now oh yeah okay um click uh contact details or something like where it says group name just give it a name like contact details or contact information or something like that whatever you want to call it and then click done and what that's going to do if you scroll at the very bottom of your page so it's saved did that other thing save not yet um scroll all the way down and see how to edit this group oh you actually had another one there see this group that you have in there because you've got your school degree type things like that okay um go down to the next group the one that we just created it's kind of empty take that little cross symbol that's how you drag we're going to drag that up up up and you're going to have to kind of scroll with your mouse a little bit too at the same time. Sometimes it's easier to just plop it to the right if you can and then we'll move it up from there. Okay, so you keep doing it. I think you got to kind of use your wheel on your mouse maybe to keep scrolling up and then you'll drop it over at the right of where we were. Oh, over here? Yeah. Okay. Somehow I dropped it. Let me see. Hang on. Okay. It's over there. Okay. Maybe we do it a little quick. So take that and then use your little wheel mouse. Okay, a little bit more. And sometimes it even helps drop them in between, and then we'll just pick and drop again. So drop it right above your private notes. Yeah, I'm trying to get it above there, but it's not helping me. Hold on. Let me move this thing over. Okay, drop right there. And I can move up again. Yeah. Okay, and then once you get it above that view notes, you should be able to drop it. okay okay now go up more now go up because i think you have it up there no i think you have it up still yeah go back up up up there you go oh there it is yeah okay so what you could do some of these fields at the left maybe like your phone number and things like that so if you scroll down just slightly so you can see at the end of what's in group one you can start like scrolling down in that group and then drag fields over to that other group like maybe take your home phone work phone cell phone things like that and move them just slide them over to that other group okay so and then scroll up and then just stick it like right there yep and then as you start moving things over that group one box will kind of shrink in height and then that way things are more balanced and you see your more information without having to scroll as much right right gotcha and then notice how you have like contact details and then how it says group one if you click directly on group one you can give it a name like like rename the group so it's almost like making a form with like sections gotcha okay if you move like your work phone your email address that social underscore linkedin field put all that stuff over at the right that way you just kind of have it separated a little bit and you don't have some white space at the right so i can do that I think it's still up I think it's because we have um I think you're kind of um big resolution or display going on yeah that's what it is I have a visual thing so I have it on larger. Come on, how come the email address doesn't go up there, that home email address when I pull that up there? It's just a dragging. What if you just move some of those fields up within that group a little bit, then they're easier to grab. Okay, there we go. Okay, so you got to be within the outline though. I think you're dragging just below the outline. Okay, now drop. Why is that not working? Can you do me a favor? At the top right of your browser, at least just temporarily, go to the three vertical dots. Yep. And for your Zoom, maybe let's go to 90% or something. That way we could just see more at once. Mm-hmm. Okay. So now when you go, now it'll be easier to see. So if you take like home phone, all of those, you got to drop it a little bit higher though. There you go. Like there? Yes. So it's got like a paint outline. You got to be within that outline. Oh, I see. I see. Okay. so and then that URL thing okay and then you get to move like email address and that way all your like phone number links emails that's all over there and then that way your left side is just like name and address mm-hmm good and then okay save for this but do you want to balance it more though like moving those phone numbers and all that other stuff over and then again that way you don't have so much wasted space i would take like the phone numbers and stuff over there too well the only phone number we use is a cell phone okay and where do you have that oh you're gonna get moved over that's a cell phone and then like uh like you can go ahead Yeah, so those would stay where they are, but like take like maybe email address, move that over. Yeah, I got that. I got the email address. No, you still have it at the left. But if you move it over to the right. Well, I have, that's the one I have, the custom email home. But you have the predefined email address. So that's like. Yeah, no, because we use that for work. for work. But if you move all those fields over to the right, then your screen will look more balanced. Okay. So should I put their name or? No, no. Leave the name stuff at the left. But just move your email and your phone number fields over to the right. Okay. Let's see. okay and then move the other one the work phone and if you don't use pager at all if you click directly on the name don't use that so if you click directly on it where it says pager other click delete and that way it's not in your layout at all if you don't use it. Oh, yeah. And then take email address and slide that over to the right. Oh, I see. Gotcha. And then now go to the top right and hit save. Okay. Let's close the custom tab. gotcha so now see over at the very far left click edit name okay so let's just see so now it just looks a little bit more balanced where you've got like your name oh okay and then like your context and you're not like i mean you could even do three column layouts if you wanted to right gotcha wasted space where like you know the whole the one field spanning the whole width of the window right right that looks good that looks very good i like it and what you'll probably want to do is go back to your three vertical dots and go back to your regular zoom percentage and let's see how you like that okay we went down to i think 90 i think you're at 125 before i was at 125 yeah so see how it's just like a lot less wasted space yeah it looks good and there's a lot less scrolling and that's nice i like it yeah that's a great idea robin That's why you're you. Oh, well, thank you. Oh, that's great. Okay, well, and I appreciate that. And it's just good knowing that that URL thing was a glitch. It's fixed. And I'll just go back and I'll just add those other people, re-add them in, and then that'll be in there and that'll be good. And a good way to tell is, is that field empty or not? And if you don't want to recapture them, just copy and paste their URL into that field and hit save. that's a great idea tip so you know I am just like a luddite so thank god thank god I appreciate your patience very much because it's got to be frustrating so I do it I've been doing this 19 years now oh my goodness that's see you started a year if you started a year after I started so I've been here 20 years so that's uh we pat ourselves on the back you know yeah I was pregnant with my daughter and now she's in her second year of college wow wow that's crazy my daughter in college are like wait a minute what I'm like I know isn't that great they're like I remember when you were pregnant with her I'm like yeah so awesome well Robin thank you so much for the quick call back I really appreciate it all your help this layout is amazing and I'm just happy, happy, happy. So have a wonderful rest of the week and have a terrific, terrific weekend. You too. Thank you so much. You're welcome. Take care. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2149.613724,
    "salad_processing_time": 180.42133903503418,
    "overall_processing_time": 2149.613724,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Hello, it's Heidi.  Hi, Heidi.  It's Robin Mantoni with Main Sequence.",
    "job_id": "ae54d541-7836-4193-b1fb-c68b069cece1",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Hello, it's Heidi.  Hi, Heidi.  It's Robin Mantoni with Main Sequence.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      }
    ],
    "entities": [],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "general",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3092264201036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}