{
  "recording_id": "3092390392036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:22:25.553591Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:22:25",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your participant ID followed by pound. You are in the meeting now. You are the first participant. Please stand by. Thank you. Thank you. I'm going to go ahead and start the recording. you Hello, Michelle? Yes, hi. Hi, how are you? Jim Lombardo here. Oh, hi, Jim. How are you? I am well. I am well. I will put on my camera here. I normally don't keep my camera on because I'm normally taking notes or looking at the screen as I go through the demo, but I'll pop it on here for a little bit there. It's good to meet you. Good to meet you. How are you doing today? I'm doing all right. I'm doing okay. And I think, wait, not Matthew. Is he joining as well? He is joining. I'm just going to shut these blinds here. I'm getting a big glare. We'll be right back. Excellent. Where are you located, Jim? Just outside of Cleveland, Ohio. Oh, okay. Yeah. What's the weather like? Is it probably a little bit cooler than it is here? sunny and a little bit i think it's like upper 60s today so it's not bad out here and where you all located we're warm you know it's in the 80s here so it's it's going to take a little while to get us cooler but uh you know we tend to look at it like okay are we getting through hurricane season type of thing right yeah for sure yeah it's actually i think they're calling for highs in the upper 70s this week, which is kind of unseasonal for us. Let me just text him and make sure we're... There he is. Hello, Matthew. How are you? Hey, Matthew. Can you hear us okay? You're on mute, Matthew. Yeah. Can you hear us? I'm going to hit ask to unmute, see if that prompts, because it's got, sometimes mine It's going to mute me when I first dial in by default. I don't know why it does that. Matthew, can you hear us? Oh, he can hear us. He just chatted that he can. Excellent. Okay. You there? Yes, I'm here. I'm just trying to get my microphone connected. I apologize. I'm sorry about that. You seem all good now. No worries. All right. Well, Jim, how would you like to get started today? For sure, for sure. I was going to say, let's run through these questions, and I'll kind of talk a little bit about them, touching on some of the points of the system there, and then we can certainly delve into a demo, screen share, look at all the different things, and do that, if that's okay with you all? Of course. Sounds great. Excellent. Well, if you have any questions, feel free to jump in, but I'm going to kind of run through here. So, PC Recruiter, we are a CRM and an APS, and we are built specifically for recruiting. So, we actually have kind of two portions of almost two software products that come as one package. A purpose-built CRM for the recruiting industry, so it actually contains all of our ATS functions, but also in a CRM. So you're going to have ATS functions like pipeline tracking, interview tracking, candidate searching, and also sales pipelines, forecasting, kind of tracking potential clients and customers there. So we do offer both ATS and CRM functionality, but we were built for recruiters. So that's kind of what PC Recruiter was mainly built for temp perm internal corporate no matter what kind so no problem there so the sales tracking piece is in the system but predominantly PC Recruiter really allows you to track your contacts your contact with them you have an activity history on each record that's going to show all of pretty much everything you've done emails interviews you can put in custom fields you can search the database so it's really tracking your relationships with the people be it that it's a contact a potential deal a candidate whomever so so the name records and tracking your contact with them it is I wouldn't say purpose built for executive search but we do have many executive search organizations using PC recruiter so we are going to give you ability to do a candidate presentation which is going to allow you to blind out the contact information of that candidate when you present you can control how long it's going to be up and available so you're going to be able to work with that and PC recruiter is going to give you ability to track your interviewees your positions custom interview pipelines and that could be whatever you need it to be it could be 18 steps it could be four so really it's up to you it's so configurable that you can really make it what you need it to be so that's going to give you a lot of flexibility there we are going to be able to track passive candidates. So within PC Recruiter, you can put name records into the system. You can even put a company record in that they're working for, attach them to that company, and you can just kind of keep them in there lukewarm. Maybe they're not a candidate. You can even give them a status of not candidate, employee, or hiring authority, or manager at a company, or whatever. But you're going to have a record there. You're going to be able to track your contacts. You can schedule periodic follow-ups. You can even put them on a roll-up list. That's what we call our lists in PCRecruiter so you can put a list of the system which might keep all of your passive candidates and maybe even have a sequence set up to check in with them once every quarter or something like that so you have excellent passive candidate tracking within the system so you're gonna be able to track like I said all sorts of individuals you can tag them to where they work as you get more information on them you can attach additional searchable attachments to their record and keeping them out of roll-up list that's going to let you give them different stages statuses and priorities as well so you're going to be able to track those very easily our interface is going to be pretty intuitive and the fact that we have two separate interfaces that share the same database that's an added bonus so it is very configurable so you can control what fields are going to show where you can use a combination of our predefined fields and custom fields that you've created you can move buttons choose what's hidden what's shown so a lot of configurability that I'll show you once we get in there and take a look at that so it is going to be very configurable and being that you designed it how you think it should look and work that's going to make it make more sense to you because you're able to kind of set it up how you think it should look so that's going to work pretty well search capabilities so we do have a nice search capability there boolean search So that's going to search any word or words you're looking for, ands, ors, pluses, minus, whatnot. You're going to be able to make your search as simple or as complex as you like. So you're going to be able to search job title, function, you can keyword tag people, and it's going to search, as we'll see in the demo, it's going to search resumes, notes, keyword tags, all attachments. There's even a summary screen where you can use AI to generate a kind of a custom candidate summary. That is searchable. And the keyword tags, even profiles. So if you happen to pull someone in from LinkedIn or ZoomInfo or Facebook, they are going to have a searchable copy of their LinkedIn summary. So that's going to be searchable. You can even build custom web forms that you could fill out when you interviewed someone online. Or you could email it to them. They could fill it out in their email. and as soon as they do that, as soon as they hit save, that too is a searchable attachment. So you have a lot of different searchable areas. You can toggle back and forth and add another word or maybe a zip code radius or a specific custom field, a skill, anything like that. Searching is going to be very easy to use in PC Recruiter. And within the system, you're going to be able to share lists. If you have a short list of individuals, you can put those on a roll-up list. The roll-up lists in PC Recruiter are merely a group of records with something in common. So it could be a pre pipeline. It could be a saved search. It could be. These are the 10 people that I'm trying to contact to see if they're looking for A position that might fit what I'm looking for. So you can share those roll up lists. You could if more than one person. We're working on a roll up list, you would be able to see each other's activities. You could see if you mark them a different stage or priority or anything like that. So that is going to allow you to really very easily track that you're also going to have the ability to pull various different reports. So you can pull like applicant tracking reports showing kind of within a certain date range, everyone who has gone through any interview. You can, of course, limit that by client or by interview type or only things that I've done, anything like that. There's also a small custom piece that we can work with to allow you to give the client an access point where they could go in and see only their jobs and they can see a list of everyone who's being considered for the job, essentially see your pipeline. So they're able to kind of see just some basic information about what you're doing. So that's going to be something that our web team would be able to customize for you if you wish. As far as integration, we have the closest Outlook integration in the industry. So you're going to be able to integrate PC Recruiter into Outlook. Any email exchange with Outlook, we actually have an overlay for Gmail too. So either of those, any email you exchange in Outlook or Gmail is going to be recorded in the activities within PC Recruiter. When you email out a PC Recruiter, it's coming from your Gmail or whatever you set it up to be. Even gives you the capability, if someone should happen to email you a resume in one of those Outlook or Gmail, you can right-click on the attachment, parse it right in. So a lot of simple integrations there. You can even right-click and attach it to a record in the system. So a lot of integration between those two to be able to track your emails and that's going to roll it right into the database. Okay. And as far as... What about personality assessments? So, personality assessments. So, we use an outside company criterion where we have candidates take assessments, the results come back in a PDF. So, is that something that you would just simply upload? Like, how does it do with interfacing with any assessments that are done for not just, I guess, uploading the document, but in terms of part of their either candidate summary from that standpoint, maybe reading that document as part of AI. Can you maybe speak to that a little bit? Yeah, well, any document you would have, the easiest thing to do would be to upload that as an attachment. So it's going to be uploaded as an attachment. It'll be accessible one click off of their main screen, and it could be indexed as long as it's something in it. It's not an image or anything. Usually it can be indexed for search ability to so you can kind of put that there it doesn't pull data out of that and place it into other fields but most of the time the data is going to be searchable in a keyword search okay okay and then reporting analytics you can set up your own KPIs your own metrics reports we'll take a look at the analytics piece in PC recruiter that's going to give you capabilities to build pretty much any report you want. Those reports can be emailed out to clients if you wish. There's also a standard reporting option which contains about 50-some reports that can be pushed out into Word, CSV, Excel, Google Sheets, so you can kind of build your own custom reports. Certainly time to fill, pipeline reports, team performance, and you can even put goals as to revenue in goals or first interview schedule, phone calls made, anything like that. You're going to have capability to do something like that. So you certainly can do that. Okay. As far as technical and security, data is stored on our servers. They're in a secure lab. We have physical security and electronic security there. We don't have any access to your database unless you give us the username and password. So we have no ownership interest. We have no access to it. It's all yours. You can take a copy with you when you go. So if you ever leave PC Recruiter, you can take a copy. It's made available in a SQL database, downloadable format. And that is, I have a whole document that I can email out after the call, if you'd like, that goes over all of our policies, procedures, kind of how we secure that, everything like that. Is that done in-house or do you use an outsourced company for protecting and storing your data? Well, we administer it, but the actual labs are in downtown Cleveland here at like the MCI lab, a couple of the main telco facilities we have rack space in their secured labs but we administer everything with our staff we do comply with with regulations such as some of the the spam regulations or the contact rate regulations in Europe. We do comply with those. We can track EEO if you need it to, OFCCP. So that is going to be, and while I'm trying to think of the one, Europe has the regulations about contacting people, and we do actually comply with that. The name is escaping me what it is right now, but we do comply with that. Data ownership, we talked about that. You own all the data. We have no ownership interest. We don't share it. We don't access it. We don't take it. It's not ours at all. You can request a data return, SQL database, or you can at any time export a roll-up list. You can push that out into a CSV very simply with appropriate permissions, of course. So if you had certain junior recruiters, maybe you want to give them no permission to do that. But if you wish, you can push out any data you wish in a CSV. So not a problem to do that anytime. Let me go back to the previous question just a minute. So, you know, we're located in Florida. So there's certain things that we governing roles here, although we are a national firm. So we don't typically work under the sunshine, right? So if you work with nonprofits under the sunshine, you can do things like level one or two background checks before an offer letter, right? But we don't typically do that like university searches, I would say, or school searches where they can, there's more latitude given where you do that up front. But one area is video. So we forward and do a lot of our interviews on Zoom for a couple reasons. Number one, right, using the AI to generate a summary and or clients can review those videos. Sometimes they listen to those videos as we prep for the final. So in the state of Florida, we can keep videos up to 60 days, right, for those purposes. So, you know, I guess number one, are we able to upload those videos? And then number two, from a compliance standpoint, you know, how long do those are usually kept in your database? So certainly you can upload videos. So if you have any videos from anywhere, you can upload that file. Certainly that will be an attachment there. We also work with a service called Quill, which does take the notes and creates the AI meeting. That will automatically push the data in the PC recruiter into the activities or an attachment. So that is something we interface with. That's an integration we offer. So, yes, you can keep them in there and they're in there till you take them out. We don't archive anything. We don't delete anything. So that is your domain. So you can keep them there as long as you need. Okay. Okay. In mobile access, we do have a mobile app. So we have a mobile app for PC Recruiter, both Android and iPhone. So you can access that. You can update profiles. It's not going to give you the entire screen. So you're not – if you have 50 fields shown on your screen, the mobile app only shows basic contact fields, activities, resume, roll-up list, positions. So it's only going to show the basic data, but it is going to let you have the ability to update data if need be or call or text people or anything like that. So you do have that functionality available as part of that mobile app. And as far as data, migrating existing data, do you have a database right now that you're looking to convert? No. No. You know, I wanted to be sort of clear. This is sort of – this is an except for us. Right. There's sort of, I think, a two pronged approach for us in terms of migration. So one is we're going back and we use Google as a platform for everything for client sharing files, etc. But right now, what Matthew's working on for us is we're going back and just at the very minimum entering into Excel first, last name, email. I don't want to spend the time, right, to enter the data from the resumes because they know we can upload that and this can be scanned with whatever we decide to use. Plus, they're probably getting more current. And our goal will be to reach out to them to opt in. Hopefully, when we partner with someone, we can create a link so that they can start to create or update their profile, as we would call it. And then I think secondarily, also working with our web designers, because right now, if you go on the site, if somebody wants to submit a resume that's not part of the search, for example, you know, they can do that. But our goal would then be to partner with, you know, whoever we're going to work with. And then rather than provide just an email link of send us your resume, provide them a link to the database so that we can start populating, kind of streamline that step. So for us, you know, that's going to be a migration. I don't think it's going to be huge, right, from that standpoint, probably below 500 records at this time. But we're trying to do that, number one, to prepare for this transition, to have them opt in for marketing purposes, but then also to then point them, right, so that the link will go into the database and we can start compiling at least the past versus how we're going to move forward in the present. So I just wanted to kind of be clear while we're asking that question. So, you know, it will be from a Microsoft Excel sheet, if that makes sense, for any previous records. It certainly does. And excellent news, PC Recruiter includes a standard Excel import tool. So we have a utility to do that. So if you have an Excel of data, you're going to be able to map that into the existing fields in PC Recruiter, as well as up to 20 custom fields. So if you have something in a field that you don't have in your PC Recruiter database, you can map that in. It'll create that field and populate that column of data into that field. So yes, you're going to be able to import any spreadsheets anytime you wish. Pull them right into the system. It's going to create a separate record for each person. It's also going to automatically put a roll-up list of all of those records that it created. So we import it in off of a roll-up list so you have all the records created, but also a list that you brought in that day. Also, if you happen to have resumes, we have the ability to use our resume inhaler, which is a bulk parse. So you could say, parse these 400 resumes out of my inbox or out of my folder on my hard drive. Parse those in and create a record for each one. Attach the resume. Parse the basic contact information. And as an added piece, you could even, maybe you parsed first, so you parsed in all those resumes, and you had a lot of those people in a CSV with a few other fields. When you map in that CSV, you can even choose to update duplicate records. So you could say, if they have the same last name and email address, update the existing duplicate so it'll update and kind of enrich the records you have off of the spreadsheet. So that's going to be a nice way to do that as well. So resumes can parse. So let me ask you a question. I know this is probably in the weeds, but let me just ask you a question. So let's say we're putting together this Excel spreadsheet. We've got their first name, last name, separate field, and their email. Because we're actively doing this. If we had a third column, because it is on Google, where we provided the link directly to the resume, is that going to be the easiest way as part of the migration? So if you say, you know, not that it might be you, whoever's working with math, you say, look, this is our Excel file. So we're giving you first name, last name, email, and then here's a link to the actual resume. Or do you need that actual downloaded? Because we have that. And we can give you access to that. Yeah. Yeah. We need the actual file. Okay. Yeah. Yeah, just having a link in a cell, it can't pull that in. It could probably map that link into a field, but you'd still have to click it. So it's easier to have the actual document. Word doc, PDF, doesn't matter there. Okay. Understood. All right, thank you. That's helpful. Sure thing. So you can pull this all in. But it's a PDF sign? Yeah. Oh, yeah. Okay. So you can parse all that information in. And then we also can interface with your website. So we have something called the PC Recruiter Job Board. That's going to be twofold. any position you enter into PC Recruiter can be placed and posted directly to your website so you have a custom application that you can design so that applicants could find a position see only the information you want them to see click a little link and apply online upload information fill out fields whatever you want you also have a little option at the top that's is a if you don't see anything that fits you specifically please click here to just generally submit your information to us for future consideration or something like that so they can actually achieve that same online data entry but not apply to a specific job so either way you're going to be able to collect applicants from the website there and it's going to be a customizable form that they would fill out and that's going to push the information directly into the database if they apply to a position that's also going to put them right into that pipeline automatically as they do so that's going to be a nice piece. And then our final section was the strategic support questions out at the bottom. Implementation usually about 30 days. So once you sign the agreement, pay the setup on the first month, within a day or two you have a link set up. A couple of days later you'll have a trainer assigned, then me and that trainer and you would have a call, we would go over kind of a list of questions, they would talk about where do you have data coming from, are you looking to hook this into your website, you want to hook it to Outlook or Gmail, all of that information, then they will go ahead and schedule out your first three to four sessions. Usually they'll do those in the first two weeks. And they'll try and get the bulk of the training done in the first 30 days-ish. If you want that to go a little quicker, they can accommodate usually. If you want to spread it out or withhold a couple hours, they last six months. So you can withhold a couple hours if you need it down the line. So really very configurable because you have a trainer that you'd work with and that's the main person you'd work with. Each time, same person so they would get to know your process your database your customizations and everything they would be your point person for support as well so if you needed support you'd have their direct dial you'd have their email you can reach out to them direct we also have a main support line you can call it over your entire team anyone who answers can help you there we have an online chat on our website that's monitored usually hours about eight to eight weekdays eight to eight Eastern Time is usually when they're monitoring but sometimes that is even monitored a little after hours because people have it on their mobile devices and stuff. So chat is going to be nice. We have a help desk system. You can put in a ticket. We have an LMS so you can train at your own pace. And we also have a learning center, which has step-by-step instructions, links to videos, and pretty much how to do anything in the system. So you have all of that over and above the initial 10 hours that you get as part of the purchase. So you have 10 hours of training that's included in the purchase with one trainer, usually hour-long sessions, and they're good for six months. So they'll usually, like I said, try and do the bulk of them the first 30 days, but if you want to hold on to a couple, no problem there. So that's a little bit about our training and everything like that. Software updates, those happen, oh, maybe once a month to once a quarter, depending on kind of what is being added. Sometimes they'll add a new feature, a new integration, they'll redesign the screen it really could be a little of everything they recently put the update they released with the sales pipeline in our PCRM product that was a big update and they're actually working on all of the forecasting reporting and analytics reporting for that that's going to be coming out a little while we released an AI suite a while back which had kind of some basic content generators then they also maybe two months later released a auto match feature so on any position you can click a little button it'll pull up the closest 50 matches or not the closest 20 matches you have in the database it writes a little pro and con of each one too so we kind of step things out like that we usually release a new feature and then the next update might be weeks to months later with a little more to that so so maybe once a month to once a quarter we release updates and they're included and they're uploaded automatically they'll put a little blurb at the sign-in page what what has been included in the update usually they'll throw a little video on there too And then pricing, it's a one-time setup and then per seat, so per user. So it's $750, that's your one-time setup, $750, and that includes all of the setup, help hooking it into your website, your Outlook, your Gmail, help designing everything. Also that includes the assistance importing the spreadsheet that will walk you through it on the first training. And then it's $115 per user per month, $115. And that is with a one-year commitment. You can add or drop users anytime. So if you started with a few, you can go up, you can go down, no problem. It doesn't reset the agreement. Just send me an email and you can go up or down users pretty regularly if you needed to. So that is flexible right there. And as far as case studies, references, anything like that, we generally don't usually really provide references. But a good tool might be checking out some of the review sites, I think, like Software advice or G, oh, I can't remember what they're called. I'll find out what they are. But there's a bunch of reviews out there on various different sites of customers who have looked at PC Recruiter pros and cons, how they're using it, everything like that. So I will send you some review sites. There. Matthew, do you have any questions for Jim? No, no. I was, again, my main focal point was the security, but it doesn't seem like PC Recruiter has any direct control. It kind of seems like it's on our end, so no, nothing on my end. And after the call, I will email you our security doc that kind of outlines what we do do. But really, you have ownership. We don't even have a logon unless you give it to us. But that's going to be within the database. You can secure your own usernames. So each username is going to have its own setup, its own level of permissions. You could have a couple of people maybe have admin permissions to everything. And maybe some users maybe only have read-only or add and read-only. And you can go down granular, like resumes, notes, activities, emails, exportability, and you can give a yes or a no or a high, medium, low-level permission for each one. So the trainer can walk you through that, but that is going to give you a lot of different options there. So the 750 includes conversion, setting up emails, website, making sure that we've got that in there, so that's all inclusive there. Are there any other fees like looking at to LinkedIn and what we do, or is that all part of the setup? Everything's included. So you have, if you wanted to set up a feed to LinkedIn or import from LinkedIn, we have our capture tool. It's going to be like a little add-on that any time you look at a LinkedIn page, there will be a little add to PC recruiter button there. So that's included. Setting up feeds to Indeed or Zip Recruiter. If you wanted to use the Quill integration or the RingCentral integration for click-to-dial or texting, as long as you have those products, we'll just turn it on for you in PC Recruiter. So there's no other thing to pay to unlock any of those, anything like that. Okay. Okay. I guess the only other thing, I just want to make sure, maybe it's just uploading the docs, but so we do level one, level two background checks. So those will come back as a PDF. We can add those in. I'm assuming into some type of attachment. And then for like reference checks, we typically do a recorded Zoom, right? And then transcribe that through AI. So if we're doing reference checks, for example, walk me through what that would look like on this end. So will we upload that Zoom video? And then is there a transcription built in from that standpoint? What does that look like when we get to reference checks or what's been the experience of that, of housing that information? Easiest way, upload the Zoom video. So if you have that recorded and it is somewhere you can upload it, make it part of that record, it's going to be in the attachments area. It doesn't auto-transcribe, but if you had some sort of a transcriber or you used Quill or something like that, you could then upload and attach that transcription into the attachment it as well. I think Quill will also feed it directly into the notes and or the activities. So Quill, it gives you some additional options there. because they're integrated with us. But any that don't, as you get the report, you get the email, or the recording, or the doc, just upload it as an attachment. That attachment series is very flexible. Okay. Well, this has been really helpful, Jim. Thanks for answering those questions. And then we'd love to see the project if you want to do the demo. But thank you for being so thorough. I appreciate that part, because those are questions important to us. Not a problem. Not a problem. Well, yeah, let me share my screen and show you a little bit. And I'm going to just pop my camera off just because you don't want to look at the top of my head as I'm moving around here or anything. But I'm going to share my screen, so I'm going to minimize our whole share here. And there we go. So I'm going to share my screen, and I'm going to show you the login to PC Recruiter, and I'm going to talk about and show you a lot of the things that we were looking at that we've been discussing there. Sue, do you see my screen okay? Yes. okay perfect perfect so this is my sign into PC recruiter and I'm going to go ahead and get myself logged in as admin so everybody would use everybody in your office would use the same link they would then just have their own unique passwords so you'd be like usernames passwords and everything that happens is connected back to that password so you're gonna see logons are tracked anything they've done as far as deleting data deleting lists failed logon attempts it shows the IP where they're logging on from so there's a whole logging options area that kind of tracks everything that's going on that you can access there. Also anything that happens in the system is tagged to their username. Once you are in the system it's going to look pretty much like this. So you have a main menu bar at the top that's going to be your primary navigation. The middle areas for searching, search results and lists, and the bottom portion is going to be for the records themselves. Okay so this is going to be the PCR 9. This is one of the access points. I'll show you the other one, the PCRM, which has almost all the same stuff. It adds the CRM functionality like the sales tracking, and it's a little bit different of a format, but it shares the same database. So you could use either or both versions because they're real-time updated. You'll see the PCR9. This one, it's a little older. It's been around a little longer. Very, very good with pipeline tracking and everything like that. It's got the menu at the top. If I go to name, it's going to Terry Stidham was my most recently viewed name record I can look at his name record like that or you might prefer the PCRM the menu is down the side so I can go like and look at names it's still going to show me the most recently record of you names there's Terry sit in the same guy since I'm in the same database here it's going to slide in from the side so you actually have two different interfaces if you wanted to use them and these are going to give you some different options this one it's a little bit larger here you You're going to be able to set it one, two, three, five columns across any fields you wish. You can put different things in here, like if you wanted like a drop down for foreign language spoken or certifications or anything you could possibly come up with. You can add that into there. Same thing is going to hold true in the PCRM. You have a customizable workspace. Here you can show a mini version of the resume. Maybe you show your activity history there too. And then details is going to be every single field you have on that person, including if If I wanted to find my language field, I just type in language. Or if I wanted to isolate all phone fields, I just go to phone. So like I said, you could use either version. It's just two interfaces. It kind of goes on what you prefer. Okay. But essentially, they're both going to have the ability to track companies' names and positions. So those are going to be our three main record types. So if I go to name, this is going to show me the last 50 name records I looked at. And I can look at, let's say, Terry. If I go into Terry's record, I have the ability to put him in the system. He's linked to a candidate's company record. But maybe I have Mark Rednick. I think he's also with candidates. Oh, no, he's worked at MRI Network SC Dallas. So maybe he's a passive candidate that I have. I have him linked to the company he's working for right now. But I can look at any attachments I might have on him. I happen to have his LinkedIn profile since I brought him in from my capture tool. I could view that. I could upload any other attachments. I can also look at activities. This is going to be where I'm going to be able to see if I had an interview with him or I updated his info or if I sent him an email or received an email. All of that activity is going to happen right here in this activity area. So it's very useful to be able to just look at a record here. You're going to be able to see all of the details, all of the fields. Just scroll down. That's going to be a journal of everything that's gone. I called to see if he's looking for a new position then maybe linked him to a different position there here we updated some information scheduled a follow-up call so anything I'm doing is going to happen in that activities area automatically recorded our emails interview activities anytime a record is updated or I could go in and add an activity and I can just say call on Monday and I can go ahead and throw a quick follow-up call on my calendar on Monday that'll sync with the Google or Outlook calendar too I could even go ahead and make it a specific activity type and it just might be a general screening or it might be a check-in or a cold call or marketing call to a client whatever it might be I'm going to be able to to kind of put that in so this is a recruiting call maybe so I'm adding that into my system there so this is going to give you the ability to track all sorts of people in the system they They could be active candidates, passive candidates, contacts at client companies, whatever. They're all going to be in the same database. So that kind of lends itself to our three main record types up at the top, names, companies, positions. They're all going to work the same. If I look at companies, it's going to hold the last 50 companies I was looking at there. I could of course go into Vandalay Industries, click that company, a configurable screen, and then it's going to also show me here's all the job openings I have there. And I also see all of my contacts I might have at that company. So I have subsets of data linked to the company record. So that's going to be really easy to track what's going on. And then same thing if I go to position, it's going to show me my last 50 positions I was working with. My radio electrical control tech is one I was very recently working with. That's going to give me the ability to put all the details of my job in here. Nice searchable description. There's an AI generator there if you wanted to generate a nice description. This is the piece where if the job is in here and it's available slash open with one opening or more, it can be posted to your website. And then candidates can go ahead and apply online to that. So that job board piece is going to be, it'll give you the ability to choose from these seven templates. So you can pick and choose how you want your jobs to be just shown, displayed in your site. So kind of this piece is embedded directly into your site no matter what it looks like. We have a web team on staff who helps with that, all part of the package. And then when your candidates see the information, they're going to be able to click one specific position if they wish. They see the description pulled directly out of the database as well as whatever fields you wanted to include. And they can go ahead and apply online directly. So you can go apply. You can choose to have this on or not. What this does is allows them to apply with LinkedIn or Facebook or Indeed or any of these. It'll solicit them for their LinkedIn username and password. and then it'll simply use the data found from LinkedIn to apply to the position in PC Recruiter. It's nice because if they're already in your database, it's going to notice that and it's simply going to update their existing record that they applied to this job today. It will not add a duplicate. So that kind of helps with duplicate management. And then you're able to put whatever fields you wish. They can upload a resume. The cool part about this too, you have the ability to just, if I wanted right up here, and you can make this language say whatever you want, but if you don't see a position of interest, just submit your resume. They can just go right to there, submit the resume and information in general, pop it right in. So a couple of different ways to get data in. And then either way, it's gonna create a record, just a standard name record, but if they apply to a job, they're gonna be inserted into the pipeline. So that pipeline is gonna give me the ability to look at everyone I'm considering for this job. So I can see I have up to 18 different steps. You can call them whatever you'd like. You can name them, pick your own colors, put them in whatever order you wish, and you're going to be able to just drag and drop everyone from one stage to the next. So maybe I contacted Mark and maybe we had a phone interview today. Just drag and drop him right there. That's going to create a searchable, trackable, reportable event that's going to show me very easily everything that I've done. Mark Merrill is going to be something that I did today. I had that phone screen. It's also going to go, and if I go to his name record, it's also going to show an activity here. There was the phone interview. It shows what company what job my username the time to date all that good stuff So that was automatically recorded in his activity. That's a good journal and everything you've done And then you can scroll down here and you can see he's also showing every job. He's ever linked to there's the phone interview I just set up but he was also linked to a different job here in the past. He only got linked He never even got any further than that So you're going to have an individual pipeline history for each and every one of your candidates and where they've been and everything like that that. So it's going to kind of let you look at either a pipeline showing everyone in consideration for a certain job, or you can go to a candidate and see every job for which they've been in consideration for. Now, if you wanted to report on that, easiest way to report on it, and this screen is cool because it looks the same in either version. So if I go back to my PC recruiter, my primary PCR 9 here, if I look at analytics, I'm going to be able to see there's my analytics. Here's my KPIs, so I can set up revenue, recruiting activity, names added, interviews scheduled, anything like that. But if I also go into my PCRM, same thing. If I look at analytics, that screen is going to look just the same, reason being because we designed this feature when PCRM was already in development. So we made it so that it kind of matched both versions, maybe matched PCRM more, but we pushed it into the PCR9 piece as well. But you can build your own custom metrics report showing, let's say, pipeline activity. I've chosen to show first interviews second interviews with phone screens but you could choose to show every one of your steps if you wish and from here you can go I can look at last year I can look at this week I can kind of do anything I wish it's also going to show me everything that's gone on so I click into that I can easily toggle maybe look at last quarter I could even go up here and split it up by job look at what jobs I worked with in that time frame or what client. I could even split it by employee, so I can look at what my recruiters are doing, or by team. You could give different teams, and you could kind of pull the reports on there. This is cool because in addition to your interview stages, you can also record any activities. So I have one called business development. This might include added names, added companies, added positions. If I use RingCentral, that records activities for calls, so I could use incoming, outgoing calls, emails, anything I wish and I can just break it up by employee by team anything like that so pretty much anything that I'm doing in here is going to be trackable I could even look at an email campaign report if I send a mass email to a whole roll-up list of people I'm going to be able to look at we do have a quote you mentioned it earlier we have a means by which you can send out an email with a little link that they can click to update their contact information live in your website or live in your database through the website I sent that here called update your contact info. If you send it, you can also see I had a 93% open rate. 74% of them clicked one or more of the links that I included in that email. I can even look down here and see what they clicked, how many times, when they last did. So he clicked my website and the profile to update his info. So I can tell he updated something. So I can see even just who opened it. So if we want to, let's just say annually, you know, send an update to people that are in there, we can do it through you, or do we need to do it through like constant contact? Like, is there a way to shoot out an email to the contact here to say update? So talk me through that. Sure. So yes, we would almost do what constant contact does. So within PC Recruiter, you would have the ability to build a list of individuals, and maybe you do a search by date entered or last activity date or everyone who is marked not a candidate, but a passive candidate or something like that however you get to the people you would be able to go to a roll-up list so if I go to a roll-up list remember those are my lists and let's say that I had a list of account management candidates 243 of them that's the people I wanted to communicate with I could go to that list at any time and once I'm at that list I can hit select all and I can go up to this little envelope here I think it's called letter and you can just go right there then you're able to pick maybe I just want to pick my campaign I'm going to use an existing one and I might even have update your contact information that includes the form letter which has the link I could adjust the subject line if I wish it's going to go to this selected set of names it's going to go to their primary email address here I can even choose whether I want to come from my Gmail or if I happen to have like a send grid or another alias I wanted to send it from I can do that too I could send it now which is the default or I could even send later, and I could go to advance, and I could say, I want to send it Friday morning at 5 a.m. So I could go Friday morning at 5 a.m. I could queue that up. We also give you the ability to say, start Friday morning at 5 a.m., but only send 50 a day. I like to do that when I send out a mass communication. That way I can control my responses better, I can get back to people quicker, and I'm not just flooded with everyone. So you can kind of dole those out 50 a day, 20 an hour, or something like that. So this functionality is part of the package, including there's a sequencing piece. So you could actually build a drip campaign. So you could say, I want to sequence apply to this list that's going to send one email today. It's going to wait four days. It's going to send another email. From there, if they open it, it adds them to my call list. It kind of gives me a little to-do list of people that opened my email and I'm going to call. Or if they don't look at that email in five days, send them this third different email. So you can go into your sequencing and build your own email sequences, drip campaigns, everything like that. So you can build a template here. I think a couple come with it that you can say, first, it's going to send this letter. If they reply to, they're done. If they don't reply to in three days, but you can make that five days or four, you would continue the next step that puts them on a call list. So if they have me on something manual, because this could be strictly email, then it runs itself. But if it was something on a call list, I could go and look, I have 14 people that have opened my email. Now I want to call them. So I could go into that first person. If you had RingCentral, you could even click to dial their phone number right from there. You can plant a script in there. So if you have more people working for you, you can kind of give them a script of what to say. So they click the dial, read the script, mark it, whatever happened, left message, no answer, not interested, whatever. as they select that result it's going to then redirect to the next thing so maybe not interested they're out of process but no answer maybe they're sent another email or maybe a text so you could really kind of build this to be more interactive than a simple drip campaign or it could be solely a drip campaign okay so it almost replaces constant contact or some of the other ones that do that but keeps it all inside of pc recruiters so anyone you look at in your database you're you're going to be able to look at their activities and you would see if they were sent a bulk email or if in this person they were part of a sequence. They were complete. When I called, I got no answer as part of that sequence. You can see when it happened. You could see the username. So you're going to be able to see everything that happened. A lot of these things are automatically recorded as well. Thank you. Sure. And then so we talked a little bit about the pipeline tracking interviews. same exact pipeline is going to be in the PCRM the one thing the PCRM has that the PCR 9 does not is going to be this deals workflow so this is going to give you the ability to track potential deals potential companies you're trying to market toward in a career would be selling anything so you're able to set up different steps qualified contact needs assessment contract sent contract signed we're working on one of our future updates coming out in the coming couple of months is going to be a DocuSign integration so you can send an integrated DocuSign Document. here. Once they sign it, upload it. Very slick. But you're going to be able to put each company in here. Like I've got Abacus. I could also go through and put specific things I want to do. I wanted to call them, then call a follow-up on the PowerPoint I sent, then email to follow up. So I can kind of put an individual little schedule of things I want to do here. I also have the ability to give it a temperature, a confidence level that I'm going to close this, a potential value, projected close date. So another update coming up is going to be some forecasting reports based off of this deals pipeline. So this kind of lets you just drag and drop a company through a sales process, much like you would go to a position. As I go back to the exact same position we were looking at in the nine, I can look at my pipeline there. So these are all my interviewees for a specific job. So whether it's closing a deal or hiring a person, you're going to have a pipeline sort of a view that's going to let you drag and drop them through very, very easily. Does this also integrate with your accounting software? So for example, if you have QuickBooks, is this an integration that keeps track because of payment, things like that? I'm just curious. It can. So we have an integration with QuickBooks, kind of twofold. You have the ability, if you make a placement, there's going to be a little button that will appear at the bottom of said placement screen, and it'll let you hit that. It'll push the information to QuickBooks to be able to send that invoice out. It'll include the company's name, the contact, the amount, the place fee, the name of the candidate, the date, all of that. So it'll push the data out and then you can from there send it from QuickBooks or if you happen to be doing contract temp There's an hours Excuse me like a timesheet collection piece There's even a mobile app that you can have people clock in and out on That data is then stored in PC recruiter and there's an option where you can push that out to QuickBooks for invoicing from there so a couple of different integrations with QuickBooks for either invoicing permanent placements or Invoicing hours worked so that is something that's available And I did, before I forget the one other big thing I was going to look at, and I'm going to take a couple questions, but I didn't go over the searching yet. So the searching is one of my favorite parts of PCRecruiter. If I go into name, I have the ability to, of course, I can search by first name, last name, I can search by any of my fields, but I like to go to advanced. And that's going to give me the ability here I have zip code radius. I can search for any predefined field like state, state, city, telephone area code, or a custom field like if I wanted someone who had Spanish in my language spoken field, I can search by that too. Or if I go to keywords, this is where I'm able to look at sales and marketing. So I can kind of do my Boolean search there so I can say, I want to look for people who have both the words sales and marketing. I always like to go all but here's where you could limit it on your keyword tags or only two resumes or only two Attachments or anything like that? But when I go ahead and I search all what I like about this is when I hit that search It's going to give me back instantly it searches my entire database Best person and by the best person I mean the person with the most Instances of the most words I search for in the most locations in their record So it's going to tell me Terry's the best match because he has the word in his resume his notes, his keyword tags, his summary, his profile, and some one or more attachments. And then I can delve down in here if I wish. I can even click the R. That's going to show the resume down below. It's going to highlight every word I look for in pink. So I can kind of go through, comb through, see how he used the word. I can look at notes. Notes is an area where I can type or push in little bits of information. He has a pilot license, parallel experience here. somebody pasted some skills from there or if I had keyword tags you can actually tag him out of specific lists those are searchable that candidate summary you can put something in there if you made one or you can use our AI summary generator that's all searchable highlights every instance of every word profiles could consist of his LinkedIn profile maybe I brought him in using our capture you can pull information in from all of these different versions of LinkedIn and other sites. So a lot of things there, but that LinkedIn profile is something I can view right in PC Recruiter. It doesn't highlight because it's an attachment. That's the one caveat here, but you're going to be able to see it. It said it found the words in there. Likewise, you can build a little web form. Maybe you build one for a phone interview. If I click that A1 phone call questions, I built this basic questionnaire, and then when I gave a phone interview, I open up the blank web form and I fill it out, check the boxes, whatever. As soon as I hit save, that is searchable data. And then any and every attachment. Many of these are archived Word resumes because I updated a resume there. So I'm going to be able to see it's found in all of these different documents. So I can go into them. I can view those. So I'm able to kind of look through his records there. And I can usually control F if I wanted to find the word I was looking for in there too. So a lot of different searchable areas within the system. And then when you get your searches, maybe I select all results. From here, I can do a lot of things. I could pull up a map, put the pin next to everybody's location. Maybe I'm looking for someone near my target market. I could send them a mass email, one of those email campaigns. I could link them into a pipeline, kind of start them down an interview process. I could put them on a roll-up list and I could say, oh, hey, hey, Joe, look at this roll-up list of people I found. Let's start calling them. So you could put them on that list and kind of share that. You could merge duplicates if you found them as well. So a lot of things that you can do with the data once you search it there. Now, I wanted to allow a couple minutes here for a question. I have another call, I think, coming up at 1 o'clock here, but I wanted to allow just a couple minutes if there was anything you wanted to revisit or any other questions we could take a look at. I don't have any. You've been so gracious in answering my questions. Matthew, do you have any? Nope. Nope. I thought that was very in-depth. I'm pretty clear on my end in terms of what the capabilities are. Fantastic. Fantastic. Well, what would a next step be or when should I circle back to follow up, see if there's any other questions, any further needs, anything like that? Jim, we're going to be meeting this afternoon. We are looking to make a decision by October 1st. So let us kind of talk through today and we'll be getting back with you. Fantastic. Yeah. Regardless of what we need or our decision, but we are looking to make a decision by October 1st, hopefully, to do migration, set up all of that, and be hopefully ready to rock by January. That's what we're getting ourselves internally, not that we're stopping any processes, but time to go through that transition. For sure. Well, anything you need to let me know, I'll put a follow-up down for maybe right after the 1st, like the end of that week. If I haven't heard from you, I'll touch base around the third or so to kind of see where things stand if we don't connect by then. Thanks so much, Jim. We thank you so much for your time today, and this is really thorough. Talk to you soon. Thank you both. All right. Have a great day. Bye-bye. Thank you. Bye-bye. Goodbye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2157.588404,
    "salad_processing_time": 352.45776319503784,
    "overall_processing_time": 2157.588404,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your participant ID followed by pound.  You are in the meeting now.",
    "job_id": "e816e3b2-b97c-48a0-b02c-4511ae23d7b6",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your participant ID followed by pound.  You are in the meeting now.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Billing",
        "confidence": 0.7
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 2
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": true,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [
      "technical"
    ],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3092390392036.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}