{
  "recording_id": "3092849305036",
  "version": "2.0",
  "timestamp": "2025-09-21T23:22:54.692196Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:22:54",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Enter your participant ID followed by pound. Otherwise, you are in the meeting now. You are the first participant. Please stand by. Thank you. Thank you. Thank you. Hey, Jay. Hey, Courtney, how are you? I am well. How are you? I am not too bad. You are living on the edge, my friend. Do you know why? Why? There was no reminder on this invite. Oh, no. Yeah. Luckily, I'm pretty type A, man. I knew about it, but I had reminded Heather as well. And she was like, oh, yeah, okay, no, I'll be up. Every time I see that, I'm like, how do we live? I don't know. It's okay. I'm glad that we got it. I was ready. I'm here. I said it like I always do. I don't know what happened. Yeah. Bear with me. I'm trying to quickly remove someone from our system. We had someone. This doesn't happen a lot, but evidently we just fired someone. and then he sent a uh company-wide email like a nasty gram company-wide email so i'm quickly removing him from oh no uh yikes yikes yikes um let me get out of here then excuse me hey henry i was just quickly removing someone from jaw batter and all the sort of things Yeah. Good. Smart. Nice. Nice, right? I feel bad for Kay. I don't know. I guess. I guess. So, Jim, are we going to be the only ones on camera? Do you want me to take myself off? I don't even have that up. Yeah, I don't go on camera usually. If you want to go on, go off, whichever. I'm not going to multitask, I promise. Someone said it was synchronous or something when like everybody's on or nobody's on or something else. We'll be in alignment here. That'll be good. I'm usually either taking notes or sharing my screen, so I don't usually keep it on. But yeah, so I want to show you the PC Recruiter a little bit. I wanted to first talk a couple minutes about what are you looking for? What are the main features, criteria, kind of what are the main things you need the software to do so I can make sure to kind of A, show you the right interface because we've got two now and B, kind of make sure to cover those as I show you around here. Amazing. Yes. Perfect. I've got a little spiel I will run through here. So we at Thinking Ahead, right, we did demo PFC Recruiter like a decade ago. We maybe almost went with it although at that time it was lacking some things i don't remember what they were right but um but it was uh so sorry uh let me text alani that yes uh yes uh cut off um sorry and so we we uh so we were a firm um we've been around gosh 35 40 years at the firm when I started here 20 years ago, by the way, we were using Outlook as our CRM. Then we had a proprietary system. And then we were on MaxTire for quite some time before MaxTire was purchased by Bullhorn. And then we went through a pretty thorough evaluation system 10, 11 years ago. And again, at that point, I connected with Brian and we looked seriously at we did go with jaw batter in 2015. And we've been on job at our sense for like a decade. Job batter is fine. Although what I will say is they have changed as a company, a decent amount in terms of they changed leadership a few times. Our point person has changed a number of times. And the last guy, quite frankly, I really, really liked. So it was just, it's just been a change. You know how, when you don't have a good point person, right? And so we've really started to wonder, is job adder really suiting our needs for what they are? What we feel like we're lacking with job adder, by the way, is the ability to do like sequencing campaigns, like email campaigns, automatic campaigns, or whatever you want to call it via the CRM. In addition to job adder, we do use Zoom Info as a company, a decent amount, a lot for data uh just data what am i looking for data lookup right like phone numbers emails but also so that's the way i use an info but many of our recruiters also use zoom info engage for those sequencing campaigns email campaigns it is a pretty big annoyance that those systems don't talk to each other the way we would like them to if that also makes sense um we have got 38 or 40 recruiters. We operate in 10 or 11 pretty different practice areas. Heather works on the nonprofit team. I work on the banking team, but we also kind of, we all, all of the recruiters operate in a standalone desk environment. We do often work together as a team on select assignments. As a company, we're headquartered in Nashville. The majority of our recruiters are remote. We do about a third to a half retainer engaged. The rest is contingent search work. We don't do any contract placements. I will say as a rule, the kind of CRMs that we gravitated toward last go around and the kind that we will gravitate toward are those that operate and work well with a, you know, we consider ourselves a boutique executive search agent, right? So like anything just like placement services or just email campaigns only, right? Those don't tend to align with our values incredibly well. And we do like and do like job better because of that. It does suit our needs fairly well. But, you know, what else? We do use LinkedIn Recruiter some. I would say maybe a third of our recruiters have LinkedIn Recruiter. The rest either use a free license or I use like the $69 paid license. So some integration with LinkedIn is of value. oh and here's where we are in our process by the way so i know everyone's like so we are at the very very beginning stage so i am a recruiter first and foremost by the right by the way but i have like this crazy title like called technology analyst or some crap it doesn't really mean anything except what it means is i'm our system administrator for our crm for our zoom info for our LinkedIn recruiter for our website. So like any of our recruiting firm specific technology, I'm kind of the admin user for and so and I was the one who really helmed our CRM transition before. I'm a control freak about it. I'm an organized org. I like databases. So I kind of get the working parts and the pieces and all that. But I'm also a user of all these things as well. And so that I didn't have to do this project entirely on my own. I brought in Heather. And so She's a recruiter. She's been here six years. And so she's got a keen eye for looking at some of the features that would be cool for us to have as well. Excellent. So we are not the decision makers. Last thing I'll say, I'm sorry. So we are not the decision makers. We will not, we don't do anything fast here at Thinking Ahead. And I mean, we are slow as molasses. we are just now starting this process looking at like a demo a week and we want to by the end of the year have a short list of two three things that we'll take a deeper dive on and then we'll bring in a committee and then we'll evaluate do we make a change and if we do our contract is up the middle of next year with the job so we're getting a high level demo is very appropriate at this stage if that makes sense with the opportunity to go deeper absolutely Absolutely. Absolutely. And do you do any kind of like CRM, like tracking deals, potential relationships, new clients, anything like that? So here's a thing. I don't know when people say ATS versus CRM, what they're really talking about. To be fair, I know business development, quote unquote, is really important to us. But I don't know. We like to track all of it. We track and track and track and track and track. I don't know, Heather, do you have a different perspective on that? Yeah, I guess I don't know. I like your question. I don't know the difference between ATS systems and, like, the CRM systems we're looking for. But, yeah, business development is a big thing for us. And maybe there's things we don't know or, you know, I don't know. So, yeah, I think you're good, Courtney. Well, yeah, I'd ask because PC Recruiter is an ATS and a CRM. So it's going to really do both. It's really all tracking at the end of the day. but one thing that we've actually come out with is we've come out with a separate interface to the same database. So something you could use for some users or if some people wanted to use it. And it has all the same stuff as PC Recruiter, but it's called PCRM. So it's PC Recruiter's PCRM, PCRM. And it adds like a deals pipeline. It's a big thing that we've added. So you're going to be able to put like a company in that deals pipeline. They kind of drag it through the steps of the process. you can have specific follow-ups to that specific relationship we are working on some forecasting for it perhaps in the coming months some integrations with I could DocuSign something like that so I'll show you kind of both interfaces so you could you kind of get both is how we've been running it because we just in April decided to launch it as kind of a separate product it was originally going to be a replacement simply an updated user interface but when we started adding so much CRM and tracking and stuff like that, similar email sequencing. We of course have full email sequencing too. We kind of just it was decided by ownership to spin it off as kind of a separate interface but since it shares the database you can use it in conjunction with the regular PC recruiter. So I'll start with the version you likely saw before, probably a little more up-to-date, but I'll show you kind of both, kind of give you a feel of some of the things you might might use each for, if that's okay? Okay, yeah. Perfect, Perfect. And I have been here with Main Sequence about 26 years. So I've been doing this quite a long time. From back when we were just a Windows product, we were one of the first to go cloud back in 2002 or so. So we've been doing this quite a while. All right. So let me share my screen. Do you see my screen okay? Yes. Yep. Okay, so I'm going to kind of walk you through some things. If you want to jump in with questions, you see anything you want to delve a little deeper into, just let me know. I'll feel for you. You won't ruin any kind of a flow or anything like that. So we're all cloud-based, as I'm sure you know. So it's going to be something you can use it, of course, remote users. Everybody's going to have their own unique username. This is going to run on a PC or a Mac. There's a mobile app. or a mobile app. So very flexible on how you can get in the system. So each user is basically going to have their own username and password. I'm going to log in as admin. And as I do get logged in, this is kind of basically how it's going to look. So I'm able to kind of work within my system here. You'll notice three distinct areas. Primary menu at the top, that's your main navigation. Those are kind of the main elements of PC Recruit. I'm going to touch on each of those. And as I go through, and if I were to click on those, as I will, this middle area is going to be for searching search results and lists bottom portion is going to be for the records themselves so that's kind of the general lay of the land up up in the main menu kind of the main three types of records that we work with in PC recruiter those are going to be names companies positions so those are going to be our three primary record types names are going to be candidates but also contacts references pretty much any name any person that you need to track in the system that screen is entirely configurable which we'll take a look at you're going to be able to check all that information. So names are going to be people, companies, companies you're marketing toward or companies you're working with, client companies of course, and then positions the jobs you're looking to fill. Okay and these are all interrelated so you can have names connected to the company they're working for, names of candidates connected to the position they're interviewing for, the positions are of course connected back to the company that they're with. So it's going to give you a very easy way if I were to go into company let's say it's going to hold on to the last 50 company records I was looking at if I hop into Vandelay industries bottom frames going to show that company record and then I have two subsets of data if I scroll down I'm going to see all my jobs I have there and all my contacts so kind of those three record types are going to work all interrelated cross-referenced throughout the database before we get into that some of these other elements up here of course you've got a daily schedule that's going to be scheduling meetings phone calls follow-ups that'll link seamlessly with Google Calendar or or an Outlook calendar, so you can kind of work and then share those calendars there. Can schedule follow-ups, of course, see other people's calendars as well. Roll-ups is our list creation tool. Roll-ups are going to be essentially lists, is what they are, and you can build a list here, title it whatever you'd like, put as many records on it as you wish. Big uses of roll-up lists, pre-pipeline, so before you're moving someone through an actual interview pipeline, kind of start with a roll-up list. That allows you to contact people, mark them different stages, statuses, priorities and pare down a list of people so you're ready to move them into that specific pipeline for a position we take a look at that another use is sending email campaigns or even sequences and drip campaigns those are also going to be heavily heavily reliant on the roll-up list and big role of listening can I ask real fast yeah the the email sequencing I know that wasn't there a decade ago which is I don't think anybody's got a decade ago but how How long have you had the campaigning or sequencing features? Well sequencing it's been there maybe a couple years, email campaigns a little bit longer. We've always had the ability to bulk email but maybe five six years ago we kind of refined that into an email campaigns piece. So if I happen to go to my roll-up list here and I wanted to send an email campaign I can hit all results. I'm able to send that campaign and what we did was we allowed you to kind of build a library of campaigns. could kind of categorize them you could say well maybe I want to do my update your contact info you can change the subject on the fly you could send it usually by default you go to primary email address but maybe you have secondary email addresses or home email addresses or something like that you might send it to this also gives you the ability to send from more than one alias If you use something like SendGrid or something, it also gives you the ability, whereas in the past it used to only allow you to send now. Now you can send later. You can actually go and queue up. Maybe I want to do it Saturday morning at 5 a.m. Maybe I even want to limit it to 50 a day. So you can say send this email starting on Saturday, only 50 a day until you're done. So you kind of do a lot more queuing up of the email campaigns within the system, and it's all going to run out of PC Recruiter. Okay. So that is big. And then what we ended up running into was when we redesigned the email campaigns, we also released our analytics reporting, and a big thing of that was going into email campaigns. You can go and see a detailed report of everyone who opened, everyone who clicked, kind of if they bounced, replied, whatnot. The biggest thing people were asking is when we would go show someone a demo, we're like, okay, so you can see you had 74% click rate. here's even what they clicked and how many times and when they open it people were saying oh I wanted if they clicked it to send another email or if they click this specific link I want to know as I want to call them so that led to our sequencing a few years ago so we actually built the sequencing piece so what that does sequencing first most of the time will start with an email campaign but then you're able to design a specific sequence as I go up there and I'm going to go into my templates area. So I can say that from here, maybe my first step is going to be this email. Then if they reply to it, in this case, maybe they're done. But if no interaction occurs in, let's say, three days, but you could make it four or five or two, you can say move to the next step. That could be a second email or maybe as in this case, it's a call. So you could actually have manual related steps in here. so anybody who didn't interact goes to your call list and you might have noticed on my Task list when I first logged on I have a list of calls here that I need to make these are people that haven't opened My email in three days. I know I want to call them But maybe it's people that click on a specific link or a specific posting or anything like that and I can see from there Oh, those are the people I want to call So the sequencing can be used as a straight traditional drip campaign where it sends one email pauses five days sends a second maybe if they open it they get one different email as their third if they don't open it they get another one so that's all up to you or you could include things like phone calls if you use ring central that could even send SMS texts out of the system it could even be something like a LinkedIn related item if you went to LinkedIn you might say these aren't automatic but you can go through I want to send a connection request to Mike if I go to Mike I can jump right to his LinkedIn profile send that and then go ahead and mark him whatever my result was that'll move them into the next bucket into the next step so this is basically a full like constant contact or mailchimp or anything like that but it's contained inside of pc recruiter which is nice because not only do you see everything that's going on all these people are in your database but you're also going to see if i happen to go to a roll-up list and you can tell which roll-up lists have sequences running they have the sequencing logo and if you hover it'll tell you what sequence happens to be running so if you add someone at that list they're going to start that sequence right from the beginning or you could add someone to a list and then trigger the sequence on that entire list at once so you could kind of do it either way but what I like is if I look at a name record I'm going to be able to see sequence related activities showing right there so he completed that step there that marked no answer so I can kind of see everything that's going on with each person because it's all self-contained. So people really like that feature that sequencing is big. You get a couple of basic templates too. So I think these candidate engagement business development those are included and then you can build as many as you wish or edit these. You can do a lot of different things from there. Okay everything making sense so far? Right there with you. yeah um so like the person you're seeing jed can i just see what it looks like to go over to like notes like if you're on a call with jed so i'm going to have a few different kind of primary headings for each record the the edit name is going to be all of your basic fields you can and i'm going to full screen this here just slip it up so i'm going to be able to put in any fields i want i can put in different like maybe he speaks french and maybe he is a cfa whatever so i can kind of build my record out. I'm also going to have some other buttons at the top, these tabs up here, they can also be chosen to show anywhere down below so you could scroll down or move across. If you go to resume that's going to be their resume that will show a fully formatted view of their resume that was uploaded or parsed or brought in. I am also going to see notes. I'm going to be able to hand enter notes. So let me go to a record actually that's got a little bit more information. So I'm going to actually go to Terry. So if I go to Terry, so I'm going to be able to see there I have a bunch of fields filled out for him. If I look at notes, he's got some handwritten notes. So I can paste in tidbits of searchable information. Once we locate Colorado, license in Virginia, management experience, pilot's license, anything that I might want to search on that I might want to just paste it in or add it in or something like that. Notes is going to going to be a free form area that I can add to my indexed library of information, such as his resume. Okay. Yeah. Maybe this is like a nonprofit thing. We, when we take notes, we take like, I mean, we're writing, typing a lot and a lot, a lot, a lot about the person is that there's no like limit, right? Like the notes can just be like full profile of the person. Yeah. Pages. Okay, cool. Yep. Good. No limit there. So you could do that in the notes. So you can go to notes and and enter it in the notes area. If you had something external that you wanted to upload, you could upload any number of attachments. These, by the way, are all searchable. So that's going to allow you to do that. Or activities is going to be an area where you can type in everything you spoke about. You can just put stuff in here. This is more a journal. It is searchable, but it's not part of our default search like resumes, notes, keywords, attachments, everything. But the activities is going to be what you've spoken about, what the follow-up is about, when the follow-up is scheduled, and all that information. So you get a lot of that type of stuff in activities. Can you say the difference in those again, Jim? Yeah, activities is more a journal of what you've done. Like I called to see if he was looking for a new position or had a phone interview and talked about this and such or he asked me to call next Sunday. It's also going to be emails exchanged with the person and interview activities that are automatically recorded as well. That's like your journal. Notes is actual data that you want to search on. So if I wanted to search on management or pilot or SQL or paralegal or anything like that, notes is going to be stuff that I'm going to keyword search on very often. Activities is going to be more what I'm doing with the person, emails, follow-ups, little notes about what we've spoken about, something like that. Can I ask sort of a follow-up question to that then? Yes. This is just like an example, but I feel like it's a pretty often example, at least for my team. we do a lot of, you know, we'll cold call and I get a hold of Bill and he answers and he's like, yeah, let's talk now. And so we spend 30 minutes talking about his job, what he's looking for, all those things. Is that an activity? I cold called him and we talked that you would then put in both the activities and the notes. I would probably say the activity would be, I cold called him and we had a conversation. I would record the conversation in the notes area, or you can build something we call profiles in PC Recruiter. So you could actually, from his name record, you could submit a profile. And what these are is basically web forms. So maybe I have one called A1 phone call questions. And it might be a few questions that I ask, and I jot down all my information here, check a few checkboxes, add some more information, whatever it might be. And as soon as I hit save, that is stored as an attachment, and it's all searchable data. so that profile that web form is going to be a good use for that and then I might just put head cold call filled out X profile follow-up next week so that would be the activity then the profile would be an attachment or you could throw it in notes really it's up to you and different organizations do it different ways but the nice thing about that is if I wanted to keyword search and I want to do an advanced search here and I wanted to look for I have a lot of sales and marketing people here so I'm going to do a search for sales and marketing I'm able to search my entire database all at once whether it's in the notes or one of those web forms or the resume you'll see I can see up there in that green column it's showing Terry had the words I searched for in his resume notes keywords summary profile maybe a LinkedIn profile or maybe one of those web form profiles and some attachment so all of those areas are searchable and if I click on the resume there it's going to show that resume highlighted in red every word I look at notes are going to highlight too so I can look at notes I can see that's highlighted in red summary can highlight we have an AI summary generator too so if you had a resume and a few fields filled out you could hit a generator it'll generate an AI summary right there in that summary field that searchable data and then profiles of course it found it in my a one phone call questions form and I can look at right that there and there it found sales and marketing it doesn't highlight because it's an attachment but it found it in this specific one it also found it in maybe this assessment which was just a couple of check boxes and maybe it even found it in this LinkedIn profile which I had when I brought him in using my capture tool so all of these different areas all attachments to and keywords so you can actually tag him out of specific lists that you might create and then all of those are searchable too so a lot of searchable areas within the system and it's really up to you whatever you think and the trainers would help you to kind of get a feel for it because they can give you some best practices kind of most of the time people do x stuff like that sure okay thank you can i ask you jim to not to derail us from this but like one of the things that stuck out in our list creating of crms to look at was i think zoom info said that your product is nicely integrated with Zoom Info. We're not necessarily opposed to continuing to have Zoom Info, by the way, but we have a number of licenses. And again, it doesn't connect with our CRM, which is kind of frustrating. So like, for example, if we just had TalentsOS and a number of seats there just for data, and then we could use our CRM for the sequencing and all that, that would be fine. And also, I'd be curious to kind of see a standard workflow from start to finish, including a little bit of data sourcing from the internal database, right? And then any integrations you have with like a ZoomInfo or LinkedIn. Sure. Well, certainly. So we have three different access points that integrate with ZoomInfo. So I want to start by kind of sourcing how we would find some individuals, import them into the database, then how maybe we might enrich the data, and then how we could kind of work with it from there. So our capture tool, this probably wasn't around 10 years ago. It's going to be a browser add-in that's going to let you import from any version of LinkedIn, Indeed, CareerBuilder, Facebook, several versions of Zoom Info, Zing, Monster, and a few others. So any of those sites, you're going to be able to import from. So if I happen to go into LinkedIn.com, and I wanted to find someone to get them into the system there, and I'm just going to go. So, dumb question too, because it's just like a generic-ish capture, not necessarily just for LinkedIn, does it work with free and premium and recruiter? Yep. Any version of LinkedIn. Any and every. Maybe so. I'm sorry. The nice part about it is if I go into Noelle here and I'm looking at her record and I want to get her into PC Recruiter, if I were on LinkedIn or any of those different sites, all I have to do is go to her record. And once it loads, it's going to pop up a little add to PC Recruiter over on the far right-hand side of the screen. I'm going to reload it again for some reason. I was taking it sweet time. But by clicking that little link, I'm going to be able to pull the information it finds, and it's going to create a record in PC Recruiter. So you see it says click to add over there on my far right. So if I click that, it kind of shivers a little bit, and then it's going to pull up the handler. and it'll of course find if she's a dupe, it'll give you the ability to update or kind of pick which version, which fields you want to update or anything like that. She's not in my database already so I can see it's going to import her photo, her name, her title. You're going to get email and cell phone if you're a first degree or if they make it public. If you're not and they don't, sometimes you don't get contact info but that's where ZoomInfo or higher easy comes in to enrich that data. So I've got her name, I've got her title, a lot of times you're going to pull in and information like location information as well here you could add a searchable note if you wish put her right onto a roll up which may trigger a sequence or I can link her right into a position pipeline if I were sourcing for a specific position so I could do some different things as I create that record all in one fell swoop I'm not going to do any of those right now I'm just going to hit submit and as I do I'm going to have created her record in my database so if I look at the my pcr there is a way you can get a little notification mine just is suppressed but you can jump right into the record you created. But I'm going to see there's Noelle's record in PC Recruiter. So I've got a record in here just for basic info. I've got her photo. I've got one-click access to her LinkedIn page. I've got my username, time, date, tag the source in there. And then of course under attachments, I have her LinkedIn profile that I can view and I can keyword search on. So all that info is ready to go and very well set up right there. Now if I wanted to find out a little bit more information, maybe I wanted to see if I could find her contact info her email her phone number right from her name record I can do two things so one way we integrate with zoom info is it's one of the sites you can go to and use that capture the second way it's going to be in their menu bar of any name record you can go update via hire resume info or I think a little bit further up on the top is update via hire easy so we have integrations with both of those services I don't have a a log on to them so I can't actually do it but what it does hire easy it's kind of like zoom info it's a it's a it's a tool that's going to go kind of help find more information finds additional emails stuff on stuff like that same basic idea they used to be called hire tool when they first came out and then they've rebranded the hire easy a couple of years ago but I think you're telling me if you had a zoom info license that the bottom one there it was like give you her contact information but what you do when you click it it would go find it so kind of similar to like hire easy if i go to it it'll pop up a little authentication i put in my api key it lets me select the company and i think review the data right there and it'll show me what i found and then i can pop it in and update it so that's going to give you i might even have a video on that i can send over i'll jot that down that's similar to what we do although again it's like two steps like again linkedin doesn't have it so like we use one thing for our linkedin integration we use zoom info um chrome add-in for that and it talks the job better a little bit right which is is fine and valuable i mean i don't we need some sort of data source obviously right to get like phone numbers and stuff from people so um we know we're gonna need that but you don't have any proprietary so the big thing now it feels like it's all these different crms are coming out with their own data stuff. You know what I mean? Our AI bot will look through 30 different data sources to find new information. I have found that Zoom Info is still the gold standard with regard to availability and accuracy of data, but you guys don't have that or aren't moving toward that, right? It's in the kind of, they're thinking about it. They're thinking about kind of doing some sourcing that would use some different sites to pull it all in. We don't do anything like that. We historically haven't. We also do have an integration. You might be able to zoom in from up here in the menu. So I could launch it right out of PC Recruiter. That's going to let me search in Zoom and I think mass download a group of records as I find them there. So we kind of offer that. that piece too. Another thing we do is once you've got your data in PC Recruiter, we've actually added an auto match. I'm going to look for it because I don't even know if it's in, it was released in PCRM first and then in this version later, but I don't even know if I have it in here. But what I can do might be a good time to show you the PCRM because I'll show you an auto match that we've included in there. So if I go into a position screen and I'll give you the 50 to her once I show you this. So if I go into PCRM, I'm going to be able to go and look at positions. I can go into any one of my positions here, and each one is going to have this little AI candidate match button. If I click that, what it's going to do, it's going to sit here. It's going to chug through a minute or two because it's searching the entire database. What it's doing is it's taking the job description it sees in this position, and it is searching your entire database, resumes, everything like that, and it's going to pull back a list of the top 20 candidates you have in your database that are matched to this position and it's right now writing up a little list of pros and cons for each one so it's going to help it it's only stuff that's in PC recruiter but it's anything maybe people have applied online resumes you've parsed in people you brought in from capture anything like that but it is going to pull a list of these results it's available in either version now but this was this one was out first but any Any second now it's going to pop up a little grid and it's going to show you these candidates. And then you kind of hover over and you can see pros, cons. And then at the bottom, it'll even give you the ability to link them to a position or put them on a roll-up list if you wanted to send a mass email first. So you'll see each person there I hover, it gives me positives and negatives. So it's going to say, well, here's some things we think would be good and here's some trouble you might have or some possible negatives or something like that. So that's kind of a nice thing that people have been asking for for a while that we recently added. Kind of a cool feature there. What's funny about that, too, is I'm not trying to be, like, naysayer about some of this stuff, but, like, it requires, and it says there at the bottom, A, you've got a resume for that person, and that resume is in the right spot. I would say 90-plus percent of our database, they don't have resumes, nor are they in the right spot. It's just data entry stuff, you know? Like, so it's good in theory, and I know a lot of people are doing it. It's just, I think the… It's only as good as your information is. Right? Yeah. So none of us even take the time, didn't even on our end to like put resumes in the right spots. It's maybe I'm speaking for myself, but it's cool. Cool thought. And I see what you're doing. So sorry. And I'm not trying to dismiss that per se. It's a nice tool to have in the shed. It's not going to change the world, but it's just sometimes a nice tool to have in the shed. But this version of PC recruiter, the PCRM here, you'll notice I'm in the same database. If I go, I even have the same people even like Terry Sitton. There's Noel that I just brought in. So I'm going to be able to look at all the same data, but this is our newer interface, just the PCR interface. It kind of puts everything, the menus, the same menu. It's just down the left side, and everything's going to slide in from the right. You have a little bit more configurable of a workspace here, so you can even show a little picture of the resume there if you want, and kind of pick and choose what elements you want where. I kind of like it because if you go to details, that's showing every field I have on the candidate, and I can isolate phone or email, anything like that. So a lot of people like this interface better. Like I said, it does all the same things as the PC Recruiter, but it also adds this deals pipeline. So if you wanted to kind of track a pipeline here, you can create different deal cards, and you can create different scheduled items you want to do. You can even give them different temperature, confidence level, potential value, projected close, stuff like that. So it's a little more of a sales funnel-y type angle embedded into this version here. But all the other stuff is going to be the same. Still going to company, still going to position, still have roll-up list, sequencing, everything else. And you can kind of choose. Can I ask you a dumb question? Yeah. Why would someone use regular PC Recruiter versus PCRM? Just a cost thing? And how many of your clients would you say, like how new is PCRM? do you know what I mean like what what percentage of your customers use one versus the other just out of curiosity well right now most probably still use PCR9 that's the the older version of PC Recruiter PCRM has only really been officially released since like May of this year so it's not yet it's been in development for a while it's not that old so it's pretty new it's still being actively developed until very recently it didn't really have the keyword searching quite as beefy as the old PC Recruiter did. They fixed that in a recent update, but that was one reason people weren't moving over to it. The other is the sheer volume of people that are so familiar with PC Recruiter. I mean, we've been around 27 years. So many people come back and they say, oh, I used you 10 years ago, and that's the version I know. That's the version I want. They don't want to look at a new interface. Or they were all trained up on it, and they want to get started quick. They liked it. They're comfortable. That's what they want. So some people just like that look and that feel, but others that maybe didn't ever use it they think this looks great and they really like this version here so this one's a little bit easier to add data to well it's yeah the cost the same so our cost is it's a flat kind of fee per user per month and right now you get both PCR and PCRM not because it's so new and that's not to say that maybe in a year or two they might spin it off totally separate and it might be more and but right now you get both for one price, you get both. So you could have some users on M, some users on 9, that's up to you. And you can kind of pick and choose, like when you go through training, you kind of pick which version you think you might want to cover, the trainer can train you on that. Like this lets you, if you're parsing data, you can add a name, and then you can actually add a specific separate company, and you can actually link the company to the name before you even add it. You can upload attachments so you can kind of do a lot more data adding all the while it's still going to work with the the capture tool you can still integrate it to your website if you wanted to post jobs to a website let candidates apply online both versions are going to work with that too because they feed off the same database so just kind of gives you a couple of different options there there okay I I kind of hopped over all kinds of different elements. I've gone over a lot of the main things I like to show. But anything you want to delve into, anything we haven't talked about, or anything you wanted to go back and revisit? Let me check my list. Yeah, so can you, on the new version, look at my list for what's important to us, right? Oh, so, yeah, so can you dive into, like, I know you briefly showed us a person record on here, but I'm kind of with Heather. One of the things that is, well, let me say this differently. In our different 10 or 11 business units, we do tend to operate pretty differently overall. So we try, try, try to appease everybody as best we can, right? Some of us are super, super relationship based. Others are a little bit more process based. Like for example, what I do like about job at her is I can in one visual mostly see every single time I've talked to this person what we've talked about like the longevity of that relationship and all that so I'm pretty keen to like a good visual right on any person that I'm talking to I've been here for a long time so so let's dig in on here so like there's those details right our workspace uh can you just click through the the tabs and give us a review please? Yeah so so as you're going through here your workspace can contain anything and everything so you can hit this little like pencil and then you can get that alarm out and you can pick and choose kind of which of these you want whether you want the pipeline, interview frame, sequencing tasks. So you could put notes on there for example. So you put notes on there I might even have. Yeah right there I've got them right there and maybe I wanted to meet them somewhere else. So I can do that. So I have the ability to kind of pick and choose what I want, drag it wherever. But if I want, I can go to notes just by clicking at the top. Cool thing about this interface is if you go to this drop down, maybe I want notes to be right next to resume. I just drag it right up here. Oh, where's resume? Right there. At least it's going to real time slide over. So now I've moved my notes to be a little more where I need them to be. So now I can go right there and I can just say, I want it to be up there. Now they're going to move. And then I could look at attachments, anything. The positions one there, that's like on the right. Those are like all the jobs that he might be in. Oh, and then what stage? Oh, nice. Yep. Yep. That's where he is. So that's going to be kind of his individual everywhere he's been. Like this was 2023. So he only got that far. Maybe some of them he was only linked. Maybe that phone screen never got farther. So I can see that, too. And then, of course, each and every position is going to have its own pipeline, too. That has been updated a little bit. So if I go to my pipeline in here, Radio Logical Control Tech, I can go to my pipeline. That's going to show me, I like to full screen it, it's going to show me everyone that I'm considering for this job in our new pipeline vision. So the pipeline is going to be up to 18 steps. Call them whatever you like. Make them whatever color you want. And then it's simply drag and drop. So you just kind of drag and drop from one step to the next. and that's going to create that searchable, trackable, reportable event and move them through this pipeline. You're also going to have an area where you can store out-of-process people, so you can see all the people who are out-of-process, how far they got, why they're out-of-process, when. You can even set up to automatically send a rejection letter. So that history is going to follow them, and your pipeline is going to be your design, and you can have more than one. If you wanted to have three different pipeline templates for maybe each different client has a slightly different interview process, you can do that. You can create different pipeline templates. So very, very flexible there. Oh, one question, too. I keep bringing to ask people this. Because we have these 10, 11 different business lines, we needed with JobAdder to create a custom field. We called it division. So like commercial banking, Heather's non-profit, we've got insurance, da-da-da-da. We do operate fairly independently by division. It doesn't need to be locked down, but we like that to be searchable and categorizable. is that something you'll have? Absolutely. You can create a custom field. You could even put it front and center on the record. You could make it a dropdown that might just contain your 10 business units and maybe even make it a required field. You can do that on a name or a company position. So you could do that for sure. And also, okay, so looking at Terry and his contact and all that, like if I appreciate that on a, what do we call it, a sequence or roll up that you can do like a task or like a reminder like we we call them tasks in job ad or like i'm a big task person like i'm i've got you know 40 people i've set up as a task to call today or whatever it is right so like is that like how does that how would someone plan their day using pcr right you could do a couple you could do it on a roll-up list so you could keep a roll-up list of everyone you're working with today and go through or what I like to do, and I can even show you mine, and I use the old version just because I've used it for 100 years. I use my calendar, and I simply put different things on different days, and I color code them. So like you're in yellow because you're on a time-sensitive call. Red is just an important follow-up. The black color is just a general follow-up that I could do any time of the day. You can put alarms on there. So I kind of use this like my calendar, like my to-do list. Oh, and you've got a list, too. Can you show me your list just for fun? Yeah, you could go with a list, and that's if you wanted to go that route, that's just a list view. So you've got everything on the list of everything you've got to do, and then you can go through and move them from day to day if you want, delete them off, add a fresh one. You can look at a month view, a week view, different things like that. Thank you. So that schedule is really going to be your to-do list, and that is, of course, in the new version. I just use the old PCR version, but it might even look very much the same because this screen isn't drastically different. Yeah, so you'll be able to look at that. I've just got nothing on there. But, yeah, so usually the calendar is going to be your to-do list, but you could even put a roll-up list of people to call as a calendared item if you wish. So people do that as well. Yep. So your roll-up is just a list. Like, here's my list. You can do a roll-up for business development calls. You can do a roll-up for people on a search. So you could probably do a roll-up for like categorizing, like actually it's the same kind of person over and over again, right? So like in job ad or folder, in PCR it's a roll-up list. Yep. Yep. Yeah. It's just like a folder. Yeah. So it's just a list of people. You can keep it there for good. You can make it public or private. So maybe it's a list that only you can see. You can do that too. And you can send your email campaigns, bulk email sequences, those all run off of a list as well. So the roll-ups are. Your tags are like, no, I'm so sorry. uh you're not very high on my volume on my engines i keep interrupting you so i don't screw you anymore i'm just sorry um it's my fault uh okay uh like how do you yeah so how um um not mansplaining but demo playing right am i doing that to you i'm sorry um uh the like tags like like these people have like you look like you used um what's the accounting thing? What's the accounting certifications people have? Oh, yeah, yeah, yeah, like CPA or something like that. Thank you. Yep. Yeah. Or like in Heather's world, like CFRE or something like that. Yeah. Or like here is everybody that's a CEO in this type of organization. So you could do it in a custom field. So you could actually build a custom field, and you could put it in there like a certifications field. So let's find mine. Certifications, CFA. So I could add my certifications in that field if I want. And I have a drop down. Actuary, FSA. So I could add different certifications into a field. What I like to do, though, is I like to tag. So you can actually use your tags in here under keywords. So if I go to keywords, I can go to keywords and I can build my list of various different keywords that I want. So under maybe user-defined codes, maybe I know she's a course developer and chemistry and engineering analyst. So I can put a few of these on her record. And maybe I can even put in client services director. So I can apply those. Now, what I can also do is I can say that she really, really is into chemistry and engineering. So I can actually click on that and I can hit tag right there. You'll notice it's going to go up in the top next to her name. I can put up to three of my tags right there in her header, kind of right above where I've highlighted. So I can add a couple of tags up there that I'm going to notice front and center. And then I'm also going to have all these other ones down here as many as I want. And I can search on those or that's going to help me to see exactly what's going on. So I have that there. Are those editable and editable by individual user? Is that what I just saw? Yeah. Or like an admin. You create the lists. So everyone could have the ability to create a list. So there's six lists. Or you could have only admin users can create them. So that's up to you. But then anyone can apply them or take them away or pin them to the menu or anything like that. Okay. I got you. Yeah. So you can, so it's the admin most likely who's creating them, but obviously everybody can use them. Yes. Yeah. That's usually how it's done. I don't have people all willy nilly in there. Admin creates them, but everybody can use them. And they're all searchable and you can pin a couple of important ones up there. All of that. Sure. Can you show like a basic search, like search then for engineering analysts or something? I don't know. Or just like pick something that's searchable easily. So if I wanted to, I can go through and I'm going to do a search. I think I go to more filters and then I'm going to go through, let's see. I can do keywords or I can search just in general. Boolean. And then let's see. Can they give me? Let's see. Boolean. Okay. Engineer analyst. So if I do that and hit add, I should be able to keyword search. And it's going to go through and it's going to find everyone that has that word. So I've got everyone that had that word. and it's going to show the query matches right there. It's found it right there. It's highlighting it right there. So I have all that data shown right there very easily. Or I could have searched my all content, which is going to be resumes, notes, everything there, and I can do it. Okay, yeah. Engineer, analyst. And then I can maybe pop that one out and add this one, and then I can search that. So that's going to search not only keywords but also resumes notes everything like that and it is going to show you where so you can see kind of where it was found and their keywords or was found in their notes or the resume or whatever. Okay so I can kind of see what was found how it was found so a couple of different ways you could find it there. So you guys have been around for a long time. How many customers or accounts do you have? I would say a hair over 2,000 companies using us. And we've signed them on. We have some turnover. So I would say we're about a hair over 2,000, maybe 2,200-ish using us. And that could be onesies, twosies to 50, 100 users plus. That varies. And they change. So people add users, drop users. So it's all fluid. I would say maybe 2,200, 2,300. right now. Copy that. What else do we need to see for the last couple minutes? I won't keep you over. I've got a meeting myself. But anything we're not asking about that we should definitely see? I think we've really taken a look at everything I show in a general first demo. And kind of definitely we've looked at all different portions. We've looked at both versions. And like I said, you get either, so you can kind of see which you like better. This probably looks a little bit more like what you saw before, but 10 years ago, it could have been PCR-8. It could have been the version before this. It was the same general layout, but much older looking. Yeah, well, I do like the newer interface, and you said it's still in development, though, right? Or is it like a fully, like, how complete would you say? Oh, I would say it's over 80% complete, but they're just adding new things. There's nothing glaringly missing from it, but they're adding more sales forecasting. They're adding better sales analytics. They're adding a DocuSign integration. They're working on different things with AI. So they just recently added that auto-match. So things are still being added, but there's nothing horribly, grossly missing, but it's still being developed. It's still being developed and updated pretty regularly. But what they're also doing is they're adding a lot of stuff into 9.2 because we're not discontinuing PCR 9. So a lot of the features are being added in both versions. Sure, I got you. Okay. Can you post a job on a website via a portal using the new interface? You can actually set up a feed to Indeed, ZipRecruiter, or LinkedIn, or you could interface it to be posted to your own website. And then you can share it on LinkedIn, Twitter, Facebook, stuff like that. There's even a direct link that you can share a direct link to the posting on your website if you want. I know we will for a handful of these really dig in on reporting and I'm going to ask you to look at that but it's because I think it depends on the workflow that we might set up um but like we are big on reporting in terms of like okay how many first interviews did Courtney have how many you know submittals did Heather have um there you go you can actually very easily build that so if I want to look at pipeline activity I can do that and I could put in first second phone screen or I could put in every interview or maybe I even want to take out second take out phone it just look at first I can go this quarter last month last year whatever so I can kind of pull that around and then what I can even do is split it up by job split it up by client split it up by employee or team so I can hit these tabs across the top kind of look at my data a little bit different way I can even go by job and I can see oh what were the what were the third three first interviews right there I can't even delve down and look at them right there so this interactive analytics reporting is going to let me let you build your own custom reports you could do straight up like interview stages or maybe you want to do something like business development that you might include names added companies added incoming calls outgoing calls that's through ring central it creates activities for calls. Email sent and received, or maybe you wanted to do something like recruiting. You pick what's going to show in there. So this is anything you might do in the system, and you're able to build these custom metrics reports in there. You could do goals and metrics and KPIs as well in here too. I heard you say RingCentral. Slight question. Is it integrating with teams? Not really, because there's not like anybody for us to integrate with teams, but what people do, like I use Zoom. I just build my meeting, and then I just put it into an email that I send out a PC recruiter, and then I send it that way. So you would work the same way with Teams. There's no further integration than that. But we do integrate with Zoom's phone as well as RingCentral and Google Voice. So a few phone systems we integrate with. Can you use, like, just your browser to put in a number to go through Teams? Like, JobAdder is not integrated with Teams, but we use a click-to-dial, right? It doesn't put anything back into our CRM, but it does let us hover over a phone number to click to dial, right? It's a browser extension. That might work. You might be able to do that there. Yeah. That's just a quick – the RingCentral writes the activities. But, yeah, that might be – I got you. Yep. Yeah, I got it. I know that's helpful. Yeah, it seems comparable to the kind of way we've got ours built up. So it sounds like your activities are the stats, right, your KPIs, your interviews you send out. that those are customizable and such as based on what those recruiters input. And then here's your report that, that does activities over whatever time frame they look at. That's a lot, Jim. Yeah. Well, yeah, I'm glad we could connect on such short notice. And what is going to be in the next one? I think you like how I was like, can you, can you do two o'clock? Thank you. We have a goal. We need to get a no one on this week. We really appreciate you. Thank you. Because I had a 12, a 1, and a 4 Eastern, so you fit right in my open spot. So that worked out just fine. But, yeah, I could – when should I circle back to kind of talk about next steps? I know you said it's a long process, so what would be best? Good question. I honestly don't know. That is not me putting you off. I swear I don't know. I would say a month-ish, but that is me coming up with something right off the top of my head. I'm keeping a really good file, actually. what would be super helpful actually is, I don't know if I've got your contact info in like a savable email. Do I? And if, I don't know if pricing is like a conversation or if there's something that you can just send me via email, if it is like, if you've got like a little one pager collateral thing, I'm keeping a really solid file. That's not a brush off. I promise. You know what I mean? But so if there's any information additional information you can share via email we'll save that and then come through all of these things here shortly and what we're doing what I can do I can email you kind of the list pricing for if you were looking at your number of users on the premium plus package with PCRM kind of show what it is I'll include what's included in the package and I'll also include that zoom integration video that we talked about too so you can take a look at that as well and that we have my info if there's anything that you need and I'll then put you down for about a month knowing that it could be a little less, could be a little more, and just to kind of touch base, see what's going on at that point. I appreciate that. We appreciate you being available again on short notice. And very nice to meet you. What I will say, I just texted Heather this privately, but I remember last time when we were looking at all these different things, I remember Brian just being like the nicest guy. And I was like, man, wouldn't it be nice to have, you know, the people that you want to work with, you've been very nice. Thank you. We appreciate that. Yeah, I've worked with Brian for 15 plus years. He's a great guy. Very good. Well, we appreciate it. Thank you. Well, we will look for your email and we'll, we'll talk to you soon. Sounds good. I'll get that over the next day or so. And we'll talk to you soon. Thanks, Jim. Have a great afternoon. You take care. Bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2172.51523,
    "salad_processing_time": 514.2355806827545,
    "overall_processing_time": 2172.51523,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "job_id": "110e790b-9426-487b-979b-26929bcfaf44",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID followed by pound.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "account",
    "resolution_status": "resolved",
    "first_call_resolution": true,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3092849305036.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}