{
  "recording_id": "3093738901037",
  "version": "2.0",
  "timestamp": "2025-09-21T23:23:12.115099Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:23:12",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Thanks for calling Main Sequence. This is Robin. Robin, hey, it's Scott at Ocean. How are you? I'm good. How are you doing? I'm doing good. I'm trying to set up the email thing, and I'll come back to that in a second, for Kayla, and I'm running into a roadblock. Do you think you can help me out with this? Yeah. Are you getting an error on the email alias list, or what are you running into? We're not even at that stage yet. Okay. So what I'm actually trying to do is to set it up so that when she's looking at a name record and clicks on the email tab, that she's able to see the emails that she sent out via Outlook. Okay. So what that means is she'll need PCR mail set up. I'm going to send you instructions, but I'll talk you through it as well. Let's see. Well, so I actually received the instructions from Garrett, and don't judge me, but I spent an hour and a half trying to figure it out on my own over the past couple of days. I'm the guy that doesn't need to ask for instructions, and I tried to follow the instructions. Man, I got deep into it, so if you can just maybe take over. Do you want to do a screen share? Okay. Yeah, that would be great. Is it Scott at Ocean Medical? Kayla, this is Robin. Robin, this is Kayla. What email address should I send the meeting invite to? at C-A-I-L-A-H Wait, hold on one second. C-A-I-L-A-H Okay. at OceanMedical.net Okay. I'm generating it now. Add others. Okay. Okay, she'll be getting an email from me in just a moment. And in that email, there'll be like a click to join Google Meet option. okay all right i'm going to admit you into the meeting okay and then what i'm going to have you do is at the bottom of your meeting screen there's a share screen option it's the rectangle with the arrow pointing up when you click on that, you're going to get another pop-up window. And make sure you go over to the right where it says entire screen. And that's where you're going to want to pick which screen to show. I just want to make sure you're using entire screen. Got it. Okay. All right. So let's – we don't need to use this window. We don't want to close this meeting window. If you can go over to, like, your browser, wherever you have PC Recruiter open. Okay, so what you're going to do is at the very top right of PC Recruiter, see where it has like a gray head and shoulders icon? Okay, click that little gear icon that's just on the edge of that. Perfect. And then select email. Okay, well, it looks like we have a couple here. Okay, let's hit configure. at the top left and then click mail servers. Okay are both of these the same account? Can you click action edit on each one of those? Okay Kayla at OSHA Medical okay and then do the same. Okay so on one of those rows go to action and select delete because you don't need the same account twice okay all right what I'm going to have you do next and this is like the part where it's maybe a little confusing is you're going to go to email folders up at the top okay so these are going to be all of your folders down below that's just a listing but what we actually have to do is if you follow that email folders heading in the lower half all the way over to the right the icons that we need are in the the menu they're just not pinned so if you go to that three lined icon over at the right okay first one we're going to want to choose is set sent folder and we are going to be ignoring every we're going to ignore everything under personal we need to make sure we're under this kayla ocean email you're going to scroll all the way down near the bottom and you're going going to look for sent items and you're going to go to action, mark as sent items. The reason we have to do this step is different mail servers have different labels but we need to know what is your sent and what is your trash folder. Okay let's close out of this window and then next thing we got to do is go back to that three-lined icon menu again and this time pick set trash folder. Now this time we won't have to scroll down as far. Actually you just went past it. Up a little higher, a little bit higher. Okay right below conversation history is deleted items. You're going to go to action, Marcus trash folder. Now at this time is when it'll start the process of the sync but this initial sync might take a while. Really kind of depends how many emails are on the server so you may not see them for a couple hours but after that it's pretty quick so let's get out of here and then the next area we're going to go to is preferences up at the top and there's only one setting to change in here in the bottom half of the screen in that sidebar at the left click activities Okay, where it says write incoming emails to the activities, change that from none to from subject body. And then in the menu at the top right, again not pinned, you'll have to go in that full menu at the right and then hit save. Okay, then the last part is your settings for sending an email. We're going to go to alias address list, which is up at the top. I'm looking at it. Oh, okay. And then on that card, we're going to click the pencil icon. Okay. Where it says description, you can call that whatever you want. Some people have more than one account, So it's just an internal way to say this is my Office 365 versus this is my Gmail. So you can just say my email. Yeah, whatever you want to do. Okay. Alias name, that is your display name. So you want to make sure it's probably your full name and spelled correctly. Sorry. Okay. Your from address, that also needs to be into reply address. So that needs probably changed, right? So what that means, Scott, is in her user account, you might have had that other email address. So we might need to have you change that too for her. Okay, where it says IMAP server, when you're sending emails from this account, we wanted to hook up into that sent folder of that mail server that we just set up. So go ahead and select Kayla Ocean email. Okay, the other thing that's super important when you're setting up Office 365 is see where it says delay between emails. If you're ever doing a bulk email, Office 365 is going to stop once you hit 30, unless you space them out because they have a restriction of 30 per minute. It also just helps with deliverability. If you space them out, because otherwise you might get your account marked as spam if it sees everything coming over at the same second. So I'm going to have you put the number 3,000. So, Robin, let me just make sure I understand what that means. What we've been doing is sending out batches of emails through Outlook, and we haven't run into any issues. Our batches range from 30 to 70, for example. Are you suggesting we throttle that back? Yeah, always, because even if, like, a recipient's mail server, let's say you have a bunch of people who are at Google, if they see the same email with the same sender, body, subject, all at the same second they might say hey this is spam or if you even send too many your own mail server may stop you from sending them there's office 365 is still pretty strict on how many you can send but definitely you want to space them out a little bit so if you enter the number 3000 here what that is equal to is three seconds so if you're doing a bulk email it sends the first one It waits three seconds and then sends the next one. So in summary, what's the max number we should send out per batch? It depends on your mail server. I would probably keep it small, like you're saying, like 50 to 70, but you still want to have that delay. Very good. Excellent. Thank you so much. Yeah, no problem. Just because the mail servers are getting stricter and stricter trying to prevent spam and stuff like that. And I'm going to take a look at mine. Can you verbally walk me through where you guys are at right there so I can look at my account as well? Okay. Let me finish up with hers, and then we'll take a look at yours. Okay. So the last part of it is sign in with Microsoft. Now, this is going pretty quickly only because you're already signed in. But what you'll have to do is click on consent on behalf of the organization. Hit accept. and that should be bringing your credentials. Okay what I'm going to have you do is hit test connection. Now she might get an error here which is this setting in your office. Yep okay that's exactly what it is. Okay let's go ahead and exit the test screen but then go ahead and hit save. Okay so Scott for your username. Yeah. One of the ways you can get to the alias, like you have to go into the full PCR mail like we just did with her to get to the mail servers and the other settings. But for you, what you can do is go to system. Okay. Click email setup. Setup. Okay. And then go over where it says email alias list. Okay. And then you'll see the card with your settings. So same thing that we have under PCR mail. Mine is set to delay between emails, milliseconds, 2,500. Okay. So that's two and a half seconds. So that's good, too. Okay. Yeah. I usually tell people to do, like, 2,500 or 3,000. Either one of those are fine. That's just making sure you're getting past the 30 per minute. We're spacing it out at least enough. If you wanted to bump it up a little bit, you could go 3,000, 4,000, something like that. Got it. All right, excellent. Thank you so much. The other thing, there's one more step that you're going to have to do for her, but it's done in the Office 365 admin portal. Do you have access to that? Did you set up her email account? I do. Okay. So what you're going to have to do for her, there's a setting in Office 365 that they have turned off by default. It's called SMTP authentication. Are you able to go into your Office 365 admin portal now? Yeah. Okay. Once you're in there, if you go to the admin section, and I believe you go to users, active users. Yeah, bear with me for a second. I'm trying to get logged in here just so I can follow along. Is it office.com, office365.com? I think it's admin.microsoft.com. I'm not really sure. Let me see. I think so, too. Yeah. Yeah, I'm not an administrator, so a little. Yeah. Blind, blind just with what I read on this. Hey, Siri, open Authenticator. I can do that. Hang on a second. Okay, I'm going to go over now. So I was just saying, once you change the setting, that error message that we had on the alias will go away. It might take like 15 seconds, 30 seconds, but it'll go away. Okay, so you're going to go to users over at the left and then go to active users. Yeah, I'm not seeing users for some reason. On that admin.exchange.microsoft, I see mailboxes. No, usually it's like where you go to like create your usernames, I believe. It'll be like. So what is it I'm looking for within there? I think I might be there. So do you see the list of users? I do. Okay. So if you click on her username. Okay. Yeah. And then there's like a mail tab over at the right. Okay. And then they'll say like apps or manage email apps. Manage email app settings? Yeah. Yeah? Yeah? And then there should be like a SMTP authentication checkbox. It'll be the last option. Well, I see, and they're all enabled. I see a half a dozen. Outlook Desktop MAPI, Exchange Web Services, Mobile Exchange ActiveSync, IMAP, POP3, Outlook on the Web. It should be the last option, SMTP authentication. Don't see it. All right. Are you able to share your screen? I might not be in the right spot then. Yeah. Send it to scott at oceanmedical.net. Okay. Okay. Where do I have to go here? Wait a minute. Here. People. Scott. Kayla, you can stop showing your screen now. Okay. So, once you're in the meeting, it'll alert me to admit you. Am I waiting on an email? Yeah. Yeah. All right. Thank you. It's coming from me directly. Noted. I'm checking my junk and stuff. Nothing personal. Amazing how much junk is in there. There's still nothing coming in. All right, let's see. Is there a backdoor to this? In other words, a website and then a code I can put in? Yeah, I'm in Google Meet, so I guess this would be the code. Let me know when you're ready for it. yeah one second go ahead they're not coming over to you though that's weird okay the weird string of characters A as in apple and it's all lowercase V as in Victor the letter K and then the next for another letter K W G as in George U as in universe T as in Tom U as in universe V as in Victor Okay Join? Yes Let me see if that gets in Okay. Okay, flooding in now. Okay. So what I'm going to have you do is click on share screen down at the bottom. And if you're getting any kind of echo, you can mute your audio. Okay. We'll do it. Since we're already on the phone. Okay, so you're going to go to share screen. Okay, show me, go over to your screen that had your Office 365 admin portal. That's okay. Yeah, just go over to another tab. Manage mailboxes, okay. Mailbox, let's see. Let's go down. Maybe they changed it. Nope, that's not it. Okay, let's go up to this waffle icon at the top left. Okay, let's click admin. Okay, now go to users. Active users. Okay, there we go. This is the way I know. Okay, go to the mail tab. which is up higher. Go to Manage Email Apps. Okay. So that looks like it's now checked. Hit Hide down at the very bottom for the Meet screen. Let's uncheck Authenticated SMTP and then reselect it. Because I think you might have to go in here once. actually hold on let's try unchecking it save and then let's check it again and save okay Kayla can you do me a favor on your my PCR can you go back to that alias screen and click test connection Error. Still saying it? Okay. Yeah, she said it's the same error. Okay. wait 15 seconds because sometimes it takes a moment to recognize that change that you made and is it still the SMTP authentication message thing SMTP is disabled for the tenant okay Usually it's pretty quick, but sometimes it takes a moment. I'm going to go take a peek at Kayla. What was Kayla's username? For what? For PC Recruiter. I want to take a peek and see what's going on. I think it's just Kayla. I'm pretty sure. C-I-L-A-H. Okay. That's a pretty name. Right? Very pretty name. You'd be surprised, though, how many variations she gets. Oh, I bet. Kalia, party of two. Kalia. Kalia. I bet. Okay. Okay. Let's wait. Okay. Let's have you go to the back arrow. on this manage email apps okay and let's go back to the manage email apps I just want to make sure it's stuck okay Now it just says authentication unsuccessful. Okay. Try this only because we had you change, like uncheck, recheck. That black sign in with Microsoft option, try that one more time. The what what? I got it. She's got it. She said. We might just need to have her reauthenticate. It goes to a different email address when I click sign in with Microsoft. I think in PCR, in the back office of PCR, we've got her under two primary email addresses, Kayla at OceanMedical.net and a new one, Kayla at MountainMedical.net. And so we're trying to set her up with her own thing. Okay. Oh, I think I know what's going on. Okay. So what's probably going on is she signed into her other account. Let's go watch Kayla's screen again. Let's have you stop sharing. I just realized that. Now, one of the issues that I want to – not an issue. What I'd like to have at the end of the day is, regardless of which is primary, what have you, that when she sends an email through Outlook through either the Caled Ocean or Caled Mountain, that they both populate in PCR. Is that possible? So those are two different mail servers. She'll need to do the same setup for her other account because they're not the same account, right? Correct. Okay, so she'll need two accounts set up. Two accounts meaning? Two PCR mail accounts. Mail accounts, got it. Okay, yeah, very good. I didn't want to have to set up all different accounts for her under PCR, so I see what you're saying. Okay, so on this one, okay, here's what I'm going to have you do. Right-click on Chrome at the bottom and go to New Incognito Window. because this will force you to sign in on that account. Go to your PCR icon at the very far left, your bookmark. OK, select your database name. Clicking your user, there you go. It's already saving that part, and hit Login. I should make sure the other one is the right one hold on one second let me just check something for you the mail server is okay that one's good Okay, let's go to PCR mail up at the very, very top right. There you go. Okay, we're going to have to change things with this. Let's go to configure and go to alias address list. Click the pencil icon. Okay. Okay, so here you have your reply to address, copy that back to the from address. No, no, no, leave it as it was. We're doing this one first. Leave that one as it was, but that has to be in from address. Okay. What I'm going to have you do then is sign in with Microsoft. Not this one? No, you have to use the sign-in option. Okay. And then this is going to ask you, because we're incognito, to put in your email address. So put in your Kayla. Hit next. don't um no hit no okay yeah that's why you're getting the credentials from the other i believe okay hit test connection okay now it's good okay exit save so that's your ocean one so now we're going to have to do the setup for the other account let's just stick with the incognito window let's go to mail servers up at the top go to the plus sign over at the far right and you've doing that full menu could yeah you have to go in the full menu because it's not pinned. Click Add. Now this time give it a different name to indicate the other account. Okay and then where it says save sent email to sent items folder hit no and this was also an Office 365 account too right? Yeah. Okay click sign in with Microsoft. Nope, that's not the one we want. Can you, no, can you sign out of your, can you go over to your Office 365 and actually just click sign out or log out? So over to my Microsoft 365. What does that mean? Yeah. So where you go to get your email, I need you to log out. Since you're logged in, that's why it's trying to pull in credentials from that account. You mean here? Log out of Outlook? I believe that'll be enough. um she's talking about are you talking about her logging into her own office 365 through her own admin for mountain medical i've lost track where you guys are yeah she signed into her office 365 account so she needs to be signed out of it you're talking about for mountain med or ocean medical um for either one because she's got it saved where it's recognizing it she's logged in. Where's your logout option? I would have thought it would have been further back and that's like on the top left or a top right. Top left, so it has some feedback, and the bottom left is. Maybe right here. Yeah, sign out, top right. There you go. Is that what you were talking about? Could be. Let's see. From the Browse and Get Portal. Okay, okay. Yeah, same thing from your profile picture, the top right. Okay, let's try sign in again. So when it's prompting about stay signing in, select no. So actually, no, yeah, that was perfect. Okay. So I think on the next screen, say no. Or whatever screen it asks you about staying signed in. and this is why I needed your support. Yeah. Especially when you have two accounts and one's signed in and it's signing into the other one. Yeah. After I started tipping the second hour, it's like, where's Robin? Okay, hit test. Close the test. That one's good. Save. And then close. Now we've got to do the folders, but for this account now. and again the reason we have to do this every mail server has different labels but things that go in sent we write as email things that come into like inbox or other folders we write those as email received the other thing too if you ever went in here and deleted an email, we need to make sure it's going to your deleted items folder on your Office 365. So let's go to email folders. And then go to the menu at the far right. And we're going to start with sent. Now this time we have to make sure we already did the ocean. We have to go under the section for, there it is, the Cala Mountain. Okay, so this is going to be the very, very bottom. Usually scent is really low. Okay, scent items. Go to Marcus scent folder. Okay, close this window. Three-lined icon again. Trash. And again, we want to make sure we're under the mountain section. But it won't be as far down. There it is. Marcus trash folder. okay we already did the preference so we're good there for the writing that you know the full detail so the next thing that we have to do is go to alias address list up at the top and go to the three-line icon at the right and click Add now this one you can give it a different name such Kayla Mountain and that way you know which one's which when you go to send. And then your full name, your full email address in both the from and reply. Where it says IMAP server, we want the emails that you're sending through this account going into the Kayla Mountain Mail server that you just added. Okay, delay between emails 3000. And then this time, hopefully we're not still signed in. Try sign in with Microsoft and hopefully we're going to get prompted which account. Oh, wait a minute. Okay. Hit Test Connection for me. At least it's that one. Okay. Do you have access to the Office 365 admin portal for this account. Okay click admin over at the left. Okay, go to users. Excuse me. Click on your name. Oh. Okay, let's exit out of here. Why is this different? Try users over at the very far left. Active users. Okay, go to your name. Go to the Mail tab. Manage email apps. Check all of these. Save changes. I don't know what that means. Let's go back to the PCR mail tab. Exit the test. Hit save for now. We're already syndicated. go back to the Kayla Mountain let's hit test again see what happens here Okay, hit X. Let's try the sign in again. Okay, hit test again. Let's go back to your admin portal. Why is that error happening in there? Okay, let's go back. Let's go back to mail and manage email apps. Okay, click authenticated SMTP. and then save okay back let's go back over to PCR mail hit test yay okay and then say just say they just make sure okay all right so I'm going to have you close the PCR mail tab and then have you go back to your main screen go back to PCR mail. So you're now going to see two sets of folders at the left. If you want you can expand those using the plus sign so when you if you ever go into PCR mail you see everything expanded and then if you hit the plus sign above I'm sorry not the plus sign the save icon uh cancel out that screen that was bad advice hit the save icon okay so that way when you come into PCR mail if you needed to you see those folders expanded go ahead and hit okay so we do have the scent and the trash folder defined for both the ocean and the mountain they're syncing now they probably just won't show up until much later today but you can at least go ahead and send emails now okay great okay I would just say anything that you're going to want to have write an activity don't delete it off your mail server just yet as long as it's in the deleted folder it should download and that'll be fine but if you permanently delete it we can't download it. Okay. Okay the other thing I'd probably make sure is make sure you're not a name record in the database with your own email address because what will happen is as it's downloading these emails if it finds a record in the database that has an email that's part of your from or to it's going to write an activity so you don't want it writing everything that you send and receive to record that has your email address you just want to make sure you don't have your own email address on a record okay okay yeah just want a candidate like you don't want to put like your attorney lawyer you know your accountant because anything that you send to that person writes but anything if you have your own email anything that you send writes to your own record you're a user or you don't need to be a name record. But that should do it. Okay, great. Thank you. What's your mailing address? We're going to send you a Christmas card, you know. Oh, I'm actually just working from home now. So I'd have to send you my home one. Right, no, that's fine. Robin, thank you so much. You know what? She's a new user. Did you put Java and Launcher on her computer yet? Yes. Okay. Otherwise, she'll have a problem with like resumes, attachments. Okay. All right. She should be all set. All righty. We'll have a great weekend. Thank you. You are welcome. All right. You too. All right. All right. Bye. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2180.894646,
    "salad_processing_time": 168.49346709251404,
    "overall_processing_time": 2180.894646,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Thanks for calling Main Sequence.  This is Robin.  Robin, hey, it's Scott at Ocean.",
    "job_id": "685ac8cf-66fa-46e0-8fa2-080b6fda796e",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Thanks for calling Main Sequence.  This is Robin.  Robin, hey, it's Scott at Ocean.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Technical Support",
        "confidence": 0.8
      },
      {
        "name": "Account Access",
        "confidence": 0.75
      }
    ],
    "entities": [],
    "action_items": [],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "technical",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": false,
    "follow_up_needed": false,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": true,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": []
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3093738901037.json",
    "backup_status": "pending",
    "retention_days": 90
  },
  "embeddings": {
    "text_embedding": null,
    "summary_embedding": null,
    "model": "text-embedding-ada-002"
  },
  "classifications": {
    "intent": null,
    "urgency": null,
    "category": null,
    "subcategory": null
  },
  "ml_metadata": {
    "suitable_for_training": true,
    "quality_score": 0.95,
    "has_ground_truth": false,
    "annotations": []
  }
}