{
  "recording_id": "3094092019037",
  "version": "2.0",
  "timestamp": "2025-09-21T23:23:49.832146Z",
  "call_metadata": {
    "date": "2025-09-21",
    "time": "23:23:49",
    "duration_seconds": 0,
    "direction": "unknown",
    "from": {
      "number": "unknown",
      "name": "",
      "extension": "",
      "department": ""
    },
    "to": {
      "number": "unknown",
      "name": "",
      "company": ""
    },
    "file_size_bytes": 0
  },
  "transcription": {
    "text": " Welcome to Zoom. Enter your meeting ID followed by pound. Enter your participant ID. You are in the meeting now. There is one other participant in the meeting. Good afternoon. This is Jim. Hi, Jim. How are you, Amanda Jones? I'm well, Amanda. How are you? Good, good. Thank you for taking the time to meet with me. For sure, for sure. I just wanted to see how I could help. It looks like you might have used us in the past. I'm not sure. My CEO, Jeremy Anderson, may have. I've been with him three and a half years or so. We used Big Miller when I started with him for about the first year, and then we transitioned to Creeley two years ago. We haven't found that it's very user-friendly. We really haven't used Creeley as much as we would have liked to. It's presented a lot of challenges for us. Okay. Yeah, it looks like he used to the past canceled in 19, so quite a while ago. Yeah, he said he's used it before because he's been in recruiting a long time. I've never seen what the interface looks like. If it's anything like BigBiller, we're looking for a simpler platform, kind of like BigBiller, not as intense as Creeley, and something that has really good recording, maybe has a planner to create, like, prompt the scheduled calls each day and follow-ups. And also a big thing for us is having a business development workflow for whether we're doing MPC outreach and calls or we have an SDR tracking open ads and hiring managers. I know Big Biller had a really good workflow for that, and Creeley doesn't seem to have a sales development representative workflow. Okay. We do have something like that for sure. For sure. We actually have a newer interface than the last time you used. So it is going to be a nice fresh new interface I can show you around if you'd like kind of show you some of those main points and kind of share my screen Yeah, that'd be great Fantastic excellent, so let me share my screen here. Let me know once you see it You should be looking at a screen for PC recruiter Okay, I can see it Perfect, perfect. So let me get logged in and kind of show you around, kind of the basics here. So as I get logged in, this is all cloud-based. It's going to be accessible PC or Mac. There's a mobile app, so a lot of different ways you can access it. But once we get logged in, we are going to have a number of different things that we can do. The left-hand side of the screen is going to kind of be your primary menu. So that's going to be where you'd get to your name records, companies, positions. Those are kind of our three primary record types. So those are going to give you the ability to track names, could be candidates, could be contacts, could be potential passive candidates, pretty much any person that you wish to track and store in PcRecruiter. The companies are going to be companies you're working with, also companies you're marketing toward. We do have a full sales pipeline that's called the deals workflow in here as well. And then positions, jobs you're looking to fill. So those are kind of our three main record types within PC Recruiter. They're all interrelated, all interconnected. We've also got some different things. For example, Rollups. Rollups is kind of a list creation tool. So you can build lists, save groups of people. I could have like account manager candidates, like this first list I'm looking at. Or maybe I have a list of companies I'm marketing toward. So I've got all sorts of different uses. I've got like companies here in Boston. So I can kind of create these different lists and I can always go into any of the lists. Open that list right up. Full mass communication. We have email sequences. We have drip campaigns. So you can kind of mass communicate these individuals or you can click on to each individual record. Open up a custom view of the record. Whatever fields you want to see. Maybe even the resume. So you have a lot of information there as well. You're also going to have a schedule. So your schedule is going to be kind of your daily to-do list. So you're going to be able to place various meetings, phone calls, whatnot on that calendar. There's a different view. I usually like the day view because it kind of lets me, I can see a little double-click, I can see what I'm going to talk about, I can color code these scheduled items, but some people like to look at it in a list view or a month view. So you could do some different things like that too. So this is going to be your schedule for creating phone calls and you could even put one of those roll-up lists on the schedule in like a two-hour block so that you know that that hours blocked you call everyone on that list or something like that okay okay and then you're also going to have a deals pipeline excuse me so the deals pipeline is going to give you the capacity to put in different company records as these cards and then you can move them through a process here so maybe you've contacted them, they need an assessment, you sent a contract, contract signed, whatever it might be. Those are going to be configurable. And then you could create a record like I have here for Abacus. And if I click into it, I can go ahead and I can put individual specific follow-up activities that I want to do along with the target date that I want them to happen. I can check them off as I do it. And on this screen, I'm also going to have the ability to give this specific deal or this potential customer kind of a temperature whether it's hot medium cold confidence level I can put a potential value if I wish protected projected close date if I wish as well and that's going to help with our upcoming reporting which will allow for almost like sales forecasting so that's going to be coming up in the next month or so okay so you're going to have a number of different ways to track things in here so so I can use my my deals pipeline that's going to allow me me to track let's say a specific company I'm targeting or maybe some people even will put a specific maybe I know that this Idaho National Lab has a VP of product development coming and I'm shooting to get that specific position maybe I put a position in here so can do it a couple of different ways you're also going to have a pipeline for tracking positions so if I go into my positions I'm going to be able to see all my open positions in the system I I can even edit them in line from here. I can do a bunch of actions right from here. I could add a name, add a note, add an activity, put them on a list. Or if I go into that actual position screen, I'm going to be able to actually see my custom screen here. So you're able to design this however you wish for it to look. Okay, so you can set it up so maybe some information, description, and I could even not have a pipeline of people. That pipeline of people is going to be everyone that I'm considering for this job. So I also have an interview pipeline that is all custom to you. So you can put in your own named stages. You have up to 18 slots you can use. Call them whatever you'd like. Make them whatever color you wish. And then it's merely a matter of dragging and dropping. So maybe Kyle had a second interview today, just drag and drop him right over there. And as you do that, that simple drag and drop is going to create a searchable, trackable, reportable event in the database here. So all of this information is very easily reported. Okay, so if I wanted to look at a quick report, I can go to my analytics over here on my menu bar over to the far left. So analytics lets me build in my own custom metrics reports. So as I look there, I'm going to be able to see that I have some different metrics reports here. Maybe I want to look at my pipeline activity. I've chosen to create this report showing just first interviews, second interviews, phone screens. But you could create all of your custom stages in there so you have the capacity to put in as many steps as you want. And you can also look at it for different time periods. This year, this quarter, last week, whatever it might be. The cool part about this is it's interactive. So maybe I want to drop phone screen off. Or if I go down and I want to look at what phone screen I had in January, I can look at all five of them right there. I can see who they were, who wrote it, what job it was for, what date it happened. I also have some options up top, and I can filter it by job. So I can now look at everything that has happened with every job that I touched within that specific time period. or I could separate it by client or I could separate it by employee. So if I had more than one user, I can look and see what each user is doing within that time period. I even can filter my report to show only a specific user or a team of users or a specific company. So I could even pull a report for only what I've done with one organization. So these analytics are going to let me build a lot of different things. I could even include, in addition to pipeline stages, I could also include a report here showing maybe things like added names, phone calls. We work with RingCentral, so you can track incoming, outgoing calls as well, even texts, emails. So you could really put on anything you wish as far as activities or pipeline categories into these reports, and you can easily pull them out anytime you wish. Okay. Okay, very good. because some of the, Jeremy seems to want to track a lot of stuff, and we've had a hard time with pre-lay on the reporting, and some of the things he's wanting to track are, you know, fee agreements, type and fee percentages, when they go out, if they come back. Of course, job orders, submittal, send outs, multiple interview stages, like you showed me, offer placements, time to fill, client breakdown, end of year. So, it seems like you have a lot of that in the activity, the daily activity. Does it integrate with HireEasy as well? Oh, yeah. Yes, it does. So, you're going to have integration with HireEasy. Let me look and see if it is in this interface right now. So, if I go into the record, let's see. I think it's in the other interface for now. So, we do have, so, we actually have a different interface the interface that he used before is going to be PC recruiter 9 you could actually get both of them they're included one price I just like to show this new version because it's a little more modern but I think the higher easy might not be in the new interface yet but you could toggle over into the exact same database and then what you have the ability to do is I can go to any record PC recruiter and there's a little there's a little option to enrich that candidate's data through hire easy so I could go through maybe Noel right here if I wanted to enrich her data I have an option right here that says update via hire easy and when I click that that's going to ask me for my hire easy API key it'll let me kind of find her and review the data it's found so it'll interface with hire easy here to update information right from this. I believe that's being written into the new interface soon, but it's already in this interface. If you needed it, you could log on to this interface here. And so you'll see this is a different interface looking at the exact same data. Some of the things are going to look almost exactly the same, like the analytics. You'll notice that's going to look identical to what we just looked at, because this was built kind of when PCRM was already in development, so PCRecruiter9 has it as well. Some of the things look a little bit different like a name record you have three columns you can sign it there whereas you're looking over here I've got the same exact record I'm just able to create a custom workspace and then details is going to be where all my fields are it's nice here because if I want to isolate all my phone fields I can just type in phone that's going to isolate those down I can also pin keywords to the top of the screen as well so this is a little bit more of a CRM based ATS. So it has everything the other version has, plus it adds that DLs pipeline and this new interface. But you could have access points to the PCRM, I mean the PCR9, if you needed to use that higher easy until it's there. Okay. And then do you know when they're going to interface or have the higher easy integration for the newer, the PCRM? I will check. I'm not exactly sure, but I'll check on that and see because we have a similar integration with Zoom Info, and that one is still in the works too. So I will check and see on those. So I have a question for you, Jim. We use HireEasy for email campaigns, but you're saying you can do your own drip campaigns from within PCR? Yes, absolutely. We have a drip campaigns piece called sequencing. So you can actually build a sequence in PCRecruiter. This is another screen that looks identical in both versions. So you're able to actually build a template here, And you might say, maybe this is, I think this one and the candidate engagement, those two come with the package. So you kind of have these. But you can go through and you can edit the different branches. And this could be a straight up drip campaign that is send an email, wait a day, send a second, wait four days, send a third. that said it forget it it'll just go ahead and do that or you could even take it one step further you could say that my first steps going to be send this form letter if they reply maybe they're done but if they don't interact in three days or five days that'll move to the next step that maybe I want to make it a call so I can actually integrate this into a call list so when I'm looking now at my dashboard that you might have noticed when we first logged in 13 of my people haven't interacted with my email so they're due for a call so I can actually go work through my to-do list here of the people that I sent an email to that didn't didn't look at it yet maybe I can call with the ring central integration you can click to dial that number right there and you can also pre-populate a script so the individual come in click to dial read the script mark them as whatever happened that'll then move them on to the next step maybe it's a text maybe it's a another email maybe it's another call whatever and then it'll it'll toggle right to the next person it'll just go to the next record let you do that from there so certainly drip campaigns are included in PC recruiter but we could also include things like calls LinkedIn related activities it'll give you a little to-do list here it doesn't do it automatically or maybe you have people you want to schedule a call with or something like that maybe you even want to add them to another specific list if they reply in a certain manner that might start them in a separate campaign or sequence and then you're also going to have any no campaigns piece oh good I had another question. If we decided to keep using HireEasy for emails, if we're sourcing in HireEasy, I know HireEasy will let you push those contacts into Crelay, for example. And when an email goes out, will it prompt that an email has been sent in PCR? Can you push the candidates to, like, sync the candidates to, from HireEasy to PCR? are? I don't think so, but I'll check. I don't believe so, but I will check there. Okay. I know we can import spreadsheets of data. So if you ever had a group of records from High Resilience, you can import a spreadsheet there, but I'll check and see if there's an automatic sync, but I don't think there is. Because most people, if they want to sequence, they just use the sequencing and or email campaigns in PC Recruiter. Within PC Recruiter. Email campaigns is more of a So you're just able to send one email campaign and you can see who opened it, who replied, who unsubscribed, whatever. You can see what they clicked, how many times they opened it, all of that. Okay. And then what exactly is the difference between the – there's a standard version and a premium version? The premium version actually adds the sequencing that you're looking at here, the analytics reporting, and the email campaigns. So that's what the premium package includes. The enterprise, which is the next level down, doesn't include any of that. So it's a little bit more basic. And then the premium package, I've also been including the PCRM with it. It even includes a I-suite, so you can actually do a little, like, content generation for emails. You can generate a candidate summary. There's even a cool auto-match where you can click a button, and it'll find the 20 best matching candidates in your database. It'll write a little pro and con synopsis of each one, why they might be good, why they might be bad, so it'll kind of give you some information there automatically. Okay, and then I missed one. The three things that are in premium, not standard, were the analytics reporting, the drip campaigns, and what was the third thing? The email campaigns and the sequencing campaigns, yeah. Okay. I like that auto-match idea. And that's kind of a problem we have is we're not living within Creeley and we're not utilizing, you know, the search is just too advanced for us as far as searching tactics go. So does it auto-generate or populate? Like with LinkedIn Recruiter, part of our problem is in our industry, people move every couple of years. And so our CRM database is kind of outdated. It's not live, always living. The record files are not automatically updating from LinkedIn Recruiter. We don't automatically update anything and we have since inception since we started this back in 98 We don't auto overwrite anything because just in that one chance Maybe you didn't want something auto written or it was the wrong information We try not to overwrite anything like that So we don't auto update with them But you can go to LinkedIn and even if you have a record in PC Recruiter You can click to their LinkedIn right from that record There will be a little option to click to update their information And then you can look at both pieces of data and figure out which one you want to save, which one you want to keep, whether it's what you have in PC Recruiter or what's on LinkedIn or a combination of the two. So you can do some different things with that. So that'll kind of let you do it that way as you come across a person. And here's my people here who kind of got scored. They're matched kind of against this position. it gives me and for some reason it's misbehaving usually if you click that little button it's going to put you in it's just flickering up for a second but it will give you a little pros and cons list I'll maybe have to hover and I was clicking on it so to give you positives and negatives as each candidate so it found the 20 best candidates that you have in your database and then you can add them to a roll-up list or link them right to the position into the pipeline using the buttons at the bottom so that auto matches is really a nice feature and you also have a searching capability so if you wanted to keyword search you can go through here we can do what we call an all content search and that's going to give you the ability to boolean search a lot of different areas of the records so if I look for sales and marketing and I add that in all I simply have to do is hit search and it's going to kick back everyone in the database who has the words sales and marketing it's going to put the best match up top the best match being kind of who has it in their record the most different places so I could see Terry had in his attachments, in his resume. I can even click and look at the resume. It's going to highlight every word, every instance that I found. I can go back and look at it and everything like that. And I can search LinkedIn summaries if I had them attached. This is a AI-generated summary of his skills off of his resume and his record. So I have a lot of different areas that I can search upon within my system here. So it makes that simple, too. Okay, very good. How much training do you offer if we were to switch over? Well, with the Premium Plus package with the PCRM and our top package, that's the one we've kind of been looking at, it includes 10 hours of training. So the way we price, there's a setup, a one-time setup of 750, database-wide, so no matter how many users and that includes 10 hours of training so you get 10 hours with one dedicated trainer and they cover whatever you want to see it's really very personalized toward your needs and they would be a point person for you they do it just like I'm on the phone with you now but they're training you in your database so showing you how to do it while helping you do it all at once so you have those 10 hours left you can also call us anytime we have live people who answer the phone so if you wanted that you could call them you can chat on our website there's an LMS we have a Learning Center with videos and tutorials and stuff a YouTube channel so a lot of different avenues that you can get support but yeah 750 one time and then our users are 115 per user per month with a one-year commitment you can add or drop users as often as you see fit with just an email to me so you can kind of go up or non-users has needed how many people you have okay so it right now two to three yeah so if that needed to go up or down you can do that so it's just 115 times however many users you need and is that the SRA discount the 115 a month oh actually SRA discount no the SRA discount is really good it's $50 per user per month the The only bummer about it, but some people think it's a three-year commitment to get that 50 per user per month, but it's less than half of what anyone else pays. So it's really good. So, yeah, your users would be $50 per user per month for that package. I think it might be $55 if you want the PCRM because that was negotiated before we had our PCRM. So this package with the AI and all that stuff, $55 would be, but it's so much better than the $115. so it'd be 55 with the ai and everything and a three-year commitment 55 per user per month okay your commitment that's everything and then were you looking to have convert your data through a formal data conversion from crelate yeah we have and all of our data is kind of a mess when we brought it over from big filler we had a lot of job orders that were never closed down. I think they're still like that. It was really hard to transition. They had to like custom build it all out with us. It took several months. We have probably close to close to 36,000 contacts right now in our database. Okay. So that, the good news is number, like size doesn't matter. So you're going to have the Okay. So we converted. The conversions cost $1,500, and they take about 90 days to get done, start to finish, because we have a standard Crelate map, essentially translates Crelate into PC Recruiter. But sometimes yours might be a little unique, or you might have some custom fields others didn't have. So each one is really a custom job. So you would work with our conversion team. They would look at your data, pull some sample records, look at what fields you have, show you the map, make sure everything is where you need it to be. They would also get a backup so they could run it once, show it to you. Maybe you have a couple changes, they'll go around, change those, run it again. So it's very hands-on and it's very much kind of to your needs. So they'll work with you very closely. And then once everything is exactly as you want it, they'll have you get a final backup from Crelate. Then they'll run it usually over like a Monday, Tuesday or or something like that to get that done. Okay, so just to clarify, to convert the database, that's $1,500. It takes about 90 days. They'll work with us on mapping and everything, and then once that's completed, we pay the $750 for setup and 10 hours of training, and then $55 a month with a three-year commitment per user. Those are all the right numbers. How you would actually pay it, you would pay the setup the first month and half of the conversion to get started. And then you would pay after that 90 days. You wouldn't pay anything during that 90 days. After that 90 days, when the conversion is done, you pay the second half of the conversion, and then the next month you start paying the monthly payment. So it's set up, first month, half the conversion up front, and then you don't pay anything again until the conversion is done. But you're still getting some of your training on the way, working with the conversion team to get everything converted in there. Okay. In 18 stages, is that the max amount of custom stages if we wanted to build out? Like Jeremy was asking me how many interview stages we could build out because we like to kind of have people sitting in a candidate pipeline of sourced outreach. I guess interested or replied or interested or not interested, interview, and then the interview, some clients we have can go up to, you know, 10 interviews, and some are very short processes, but we're wanting to look at reporting like that so we can kind of do client interview reporting on like the average interview time or number of interviews it takes to get a candidate to offer stage? Well, you only have up to 18 stages in the pipeline. You could have as many pipelines as you wish, so that's going to be a little custom there. Or some people will utilize a roll-up list to mark some stages ahead of when they're actually pushed into the pipeline. So many people don't start the pipeline until maybe it's actually an in-person interview or something like that. So the trainer can work with you on that, but you really have up to 18 stages, and that's all you have in a pipeline. If you need more than that, we would say use the roll-up list initially for your initial possible interest, initial call, phone interview, and then maybe wait to start them until they're formally interviewing. So that would be it. Okay. And that's another, that kind of leads into my next question. So with the open position calling for pure, you know, like a true SDR role, So say they pull 50 new job ads a week and they're sourcing hiring managers to call on these job ads. We would have them, instead of putting each card, because that's what we were doing in Creeley, we were putting each one block for every job posting and half of them wouldn't go anywhere, just so that we can have a planner for the SDRs to call. But we didn't think about putting them into a roll-up list. So they're calling that roll-up list until a conversation is or a meeting is booked, and then there should be a way to put them in a workflow once the meeting is booked and track, okay, we sent the agreement out, whether we got the agreement back, and then we transform it into a job order. I'm thinking it's how it would work with – yes. So that's how that would work in the deals pipeline. Okay, very good. I think that's all the questions I had. Do you mind sending me some information, like the breakdown on how payments work on everything we discussed with the premium, the conversion, the conversion pricing and the setup so that I can share it with Jeremy Anderson? Absolutely. I'll email that over to you later today. And then when are you kind of looking for a decision? Should I follow up in a week, a month? What's a good time for me to touch base? A week. A week. So, if we are, we're planning on trying to, you know, Creeley is just, we don't need everything that Creeley has. We need to kind of simplify the database. We would be looking to kind of want everything in place for January 1. So, that, because this year we were, we got off track in the first quarter because we didn't have things set up in time. and a year before that when we transition to pre-lay uh same thing so we're kind of hoping to get if we make this move to have it um with a conversion rate uh time period being 90 days we would definitely want to make a decision as soon as possible is there like um if i wanted to do another demo in the next week could i yeah absolutely i'm very open next week we could kind that even schedule stuff as soon as the next day if we want to get another demo set up, can certainly do that. And we are a pretty quick setup, so you do have three months until January 1st, so that would allow enough time if you made a decision relatively quick in a couple few weeks. But, yeah, let me know if you do want to set up another time to take a look next week. I can certainly do that. Okay, and is there any type of, like, demo that I could log into and kind of click around and kind of see how it works? Yeah, I could send you my demo database link to the PCRM and the PCR9 versions, so you can kind of look at each version, share it, log in, look on your own, because it's going to be a fully functional database, so I can certainly get that over with. Yeah, that would be great, Jim. And it's just it's harder for me to kind of grasp it all following a screen, but if I could get in there and kind of click around and experience it, I think that would be extremely helpful in executing a decision quickly. I can certainly do that. I'll get that over along with the pricing. It'll all be in the same email when I send it over to you today. Okay. Yeah, that sounds good. And then my CEO is going to be out Monday of next week and Thursday, Friday. So can you put it on your calendar to follow back up with me on Wednesday? Sure. I can follow up Wednesday of next week. That's the 24th. I will put it down and I'll circle back with you at that point. Okay, that sounds good. I really appreciate it, Jim. Thank you. Thank you. Thanks for fitting me in today. We'll talk to you soon. Okay. Take care. Bye-bye. Bye-bye.",
    "confidence": 0.95,
    "language": "en-US",
    "language_probability": 1.0,
    "word_count": 0,
    "duration_seconds": 0,
    "processing_time_seconds": 2201.157274,
    "salad_processing_time": 131.7290551662445,
    "overall_processing_time": 2201.157274,
    "segments": [],
    "word_segments": [],
    "speakers": [],
    "srt_content": "",
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID.",
    "job_id": "10aaef90-392d-4921-96d6-4e770a35d314",
    "timestamps": []
  },
  "ai_analysis": {
    "summary": " Welcome to Zoom.  Enter your meeting ID followed by pound.  Enter your participant ID.",
    "sentiment": {
      "overall": "neutral",
      "customer": "neutral",
      "agent": "professional",
      "score": 0.5
    },
    "topics": [
      {
        "name": "Billing",
        "confidence": 0.7
      }
    ],
    "entities": [
      {
        "type": "SOFTWARE",
        "value": "PCRecruiter",
        "mentions": 2
      }
    ],
    "action_items": [
      {
        "type": "follow_up",
        "description": "Follow up with customer",
        "priority": "high",
        "assigned_to": "agent"
      }
    ],
    "customer_satisfaction": {
      "predicted_score": 3,
      "indicators": [
        "neutral_interaction"
      ]
    },
    "key_moments": [],
    "conversation_flow": {
      "speaker_changes": 0,
      "total_segments": 0,
      "agent_speaking_percentage": 0,
      "customer_speaking_percentage": 0,
      "average_turn_duration": 0,
      "conversation_pace": "slow"
    }
  },
  "support_metrics": {
    "issue_type": "billing",
    "resolution_status": "pending",
    "first_call_resolution": false,
    "escalation_required": true,
    "follow_up_needed": true,
    "agent_performance": {
      "greeting": false,
      "empathy_shown": false,
      "solution_offered": true,
      "proper_closing": true
    }
  },
  "n8n_metadata": {
    "workflow_ready": true,
    "processing_queue": "support_calls",
    "tags": [],
    "webhook_url": "",
    "automation_triggers": [
      "follow_up_required"
    ]
  },
  "storage": {
    "google_drive_id": "",
    "google_drive_url": "",
    "local_path": "/data/transcriptions/json/2025/09/21/3094092019037.json",
    "backup_status": "pending",
    "retention_days": 90
  }
}